{"artist": "Grandmaster Flash & The Furious Five", "encodings": [{"song": "[Intro: Duke Bootee]\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\n\n[Verse 1: Melle Mel]\nBroken glass everywhere\nPeople pissing on the stairs, you know they just don't care\nI can't take the smell, can't take the noise\nGot no money to move out, I guess I got no choice\nRats in the front room, roaches in the back\nJunkies in the alley with a baseball bat\nI tried to get away, but I couldn't get far\n'Cause a man with a tow truck repossessed my car\n\n[Chorus: Melle Mel]\nDon't push me 'cause I'm close to the edge\nI'm trying not to lose my head\nAh-huh-huh-huh-huh\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\n\n[Verse 2: Melle Mel]\nStanding on the front stoop, hanging out the window\nWatching all the cars go by, roaring as the breezes blow\nA crazy lady livin' in a bag\nEating out of garbage pails, used to be a fag hag\nSaid she'll dance the tango, skip the light fandango\nA zircon princess, seemed to lost her senses\nDown at the peep show watching all the creeps\nSo she can tell her stories to the girls back home\nShe went to the city and got so, so saditty\nShe had to get a pimp, she couldn't make it on her own\n\n[Chorus: Melle Mel]\nDon't push me 'cause I'm close to the edge\nI'm trying not to lose my head\nAh-huh-huh-huh-huh\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under"}, {"song": "[Verse 3: Duke Bootee]\nMy brother's doing bad, stole my mother's TV\nSays she watches too much, it's just not healthy\nAll My Children in the daytime, Dallas at night\nCan't even see the game or the Sugar Ray fight\nThe bill collectors, they ring my phone\nAnd scare my wife when I'm not home\nGot a bum education, double-digit inflation\nCan't take the train to the job, there's a strike at the station\nNeon King Kong standing on my back\nCan't stop to turn around, broke my sacroiliac\nA mid-range migraine, cancered membrane\nSometimes I think I'm going insane, I swear I might hijack a plane\n\n[Chorus: Duke Bootee]\nDon't push me 'cause I'm close to the edge\nI'm trying not to lose my head\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\n\n[Verse 4: Duke Bootee]\nMy son said, \"Daddy, I don't wanna go to school\n'Cause the teacher's a jerk, he must think I'm a fool\nAnd all the kids smoke reefer, I think it'd be cheaper\nIf I just got a job, learned to be a street sweeper\nOr dance to the beat, shuffle my feet\nWear a shirt and tie and run with the creeps\n'Cause it's all about money, ain't a damn thing funny\nYou got to have a con in this land of milk and honey\nThey pushed that girl in front of the train\nTook her to the doctor, sewed her arm on again\nStabbed that man right in his heart\nGave him a transplant for a brand new start\nI can't walk through the park 'cause it's crazy after dark\nKeep my hand on my gun 'cause they got me on the run\nI feel like a outlaw, broke my last glass jaw\nHear them say, 'You want some more?' Livin' on a see-saw\""}, {"song": "[Chorus: Duke Bootee]\nDon't push me 'cause I'm close to the edge\nI'm trying not to lose my head (Say what?)\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\n\n[Verse 5: Melle Mel]\nA child is born with no state of mind\nBlind to the ways of mankind\nGod is smiling on you, but he's frowning too\nBecause only God knows what you'll go through\nYou'll grow in the ghetto living second-rate\nAnd your eyes will sing a song of deep hate\nThe places you play and where you stay\nLooks like one great big alleyway\nYou'll admire all the number-book takers\nThugs, pimps and pushers and the big money-makers\nDriving big cars, spending twenties and tens\nAnd you wanna grow up to be just like them, huh\nSmugglers, scramblers, burglars, gamblers\nPickpocket peddlers, even panhandlers\nYou say, \"I'm cool, huh, I'm no fool\"\nBut then you wind up droppin' out of high school\nNow you're unemployed, all null and void\nWalking 'round like you're Pretty Boy Floyd\nTurned stick-up kid, but look what you done did\nGot sent up for a eight-year bid\nNow your manhood is took and you're a maytag\nSpend the next two years as a undercover fag\nBeing used and abused to serve like hell\n'Til one day you was found hung dead in the cell\nIt was plain to see that your life was lost\nYou was cold and your body swung back and forth\nBut now your eyes sing the sad, sad song\nOf how you lived so fast and died so young, so\n\n[Chorus: Melle Mel]\nDon't push me cause I'm close to the edge\nI'm trying not to lose my head\nAh-huh-huh-huh-huh\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\nHuh, ah-huh-huh-huh-huh\nIt's like a jungle sometimes\nIt makes me wonder how I keep from going under\nHuh, ah-huh-huh-huh-huh\n\n[Outro Skit]\nYo, Mel, you see that girl there?\nYeah, man (Ooh-ooh)\nYo, that sound like Cowboy, man\nCool\nYo, what's up, Money?\nYo\nHey, where's Creole and Rahiem at, man?\nI think they upstairs cooling out\nSo what's up for tonight, y'all?\nYo, we could go down to Fever, man\nLet's go check out Junebug, man\nAyo, you know that girl Betty?\nYeah, man\nHer moms got robbed, man\nNot again, man (What?)\nShe got hurt bad\nWhen did this happen? When did it happen?\nWhat's goin' on?\nFreeze, don't nobody move nothin', y'all know what this is\nWhat's up?\nGet 'em up, get 'em up, man\nWe down with Grandmaster Flash and the Furious Five, man\nGrandmaster Five?\nWhat is that, a gang?\nNo, man\nJust shut—ayy, shut up, I don't wanna hear your mouth\nShut up\nExcuse me, officer, officer, what's the problem?\nAin't no—you the problem, you the problem\nYo, yo, you ain't gotta push me, man\nGet in the car, get in the car\nGet in the God—\nI said, \"Get in the car\"\nWhy is he doggin' us, man?"}, {"song": "[Intro]\nIt was a party night, everybody was breakin'\nThe highs were screamin' and the bass was shakin'\nAnd it won't be long 'til everybody knowin' that\nFlash was on the beat box goin' that\nFlash was on the beat box goin' that\nFlash was on the beat box goin'\nAnd, and, and, and\nSha-na-na\n\n[Verse 1]\nItalian, Caucasian, Japanese\nSpanish, Indian, Negro, Vietnamese\nMC's, disc jockeys\nTo all the fly kids and the young ladies\nIntroducing the crew ya got to see to believe\nWe're one, two, three, four, five MC's\nI'm Melle Mel and I rock it so well\nAnd I'm Mr. Ness because I rocks the best\nI'm Rahiem in all the ladies' dreams\nAnd I'm Cowboy to make ya jump for joy\nI'm Creole, solid gold\nThe Kidd Creole playing the role\nDig this, we're the Furious Five plus Grandmaster Flash\nGiving you a blast of sho'nuff class\nSo to prove to ya all, we're second to none\nWe're gonna make five MC's sound like one\nYa gotta dip dip dive, so-so-socialize\nClean out your ears and then open your eyes\nAnd then pay at the door as a donation\nTo hear the best sounds in creation\nHe's a disco dream of a mean machine\nAnd when it comes to size, ya see what we mean\nYa see his name is not found in the hall of fame\nBut he'll shock and amaze and make ya feel shame\nHe takes a lime from a lemon\nA-from a lemon to a lime\nHe cuts the beat in half the time\nAnd as sure is three times two is six\nYou'll say Flash is the king of the quick mix\nWe're five MC's and we're on our own\nAnd we're the most well known on the microphone\nAnd we throw down hard and we aim to please\nWith finesse to impress all the young ladies\nWe got rhymes galore and that's a fact\nAnd the satisfaction guaranteed to cause a heart attack\nWe are the best as you can see\nSo eliminate the possibility\nThat to be an E-M-C-E-E\nIs not a threat to society\nSay step by step, stride by stride\nI know the fly young lady would like to ride\nIn my Mercedes, young ladies\nMy Mercedes, young ladies\nIf my Mercedes break down and dog my grill\nI will-a drive up in a new Seville\nIf my Seville break down, I'll take it on back\nI will-a dog my grill in a new Cadillac\nMy Cadillac break down, I'm just too much\nI will-a shock your mind in a new Star Stutz\nAnd if a Stutz break down, I'll make another choice\nI will-a dog my grill in a new Rolls Royce\nAnd if my Royce break down, I'll be out in the rain\nAnd then forget it, forget it, forget it, forget it\nForget it, huh, take the train\nTake the train, take the train\n\n[Interlude]\nCan't, won't, don't stop, rockin' to the rhythm\n'Cause I, I get down, 'cause I, I get down, 'cause I, I get down\n\n[Verse 2: Kidd Creole]\nLadies who don't know my name\nAnd you fellas who don't know my game\nYes, I'm called the prince of soul\nBut others call me The Kidd Creole\nThe MC delight, young ladies bite\nWhen I'm on the mic, I rock the house right\nI'm the dedicated prince, heart of solid gold\nRockin' to the rhythm while I'm playing the role\nA cool calm customer, the master plan\nIt takes a sucker's man to try to jump my hand\nAnd the things I do and what I say\nAffect a lot of people in the strangest way\nMakes them clap their hands and say \"Alright\"\nIt's Creole to the broad daylight\nMr. Ness, my mellow, what it look like\nWhen ya on the mic?"}, {"song": "[Verse 3: Mr. Ness]\nLet's a rock y'all, a let's a rock the house\nBecause the Furious Five are gonna turn it out\nSo young ladies, if you think ya heard\nYou heard the best rap, you heard the best word\nYes, it's true that we got the fuss\nBecause it can't be the best unless it came from us\nThere's five of us and we take no stuff\nWe coming through the city, we coming through rough\nWe number one ain't nothin' you can do\nAnd if you wanna get down, we'll rock you too\nSo free-formin y'all, you don't stop\nCome on, come on and let me see-a rock rock\nCowboy, they say you're from the Bronx\nSo why don't you rock the beat and add a little spunk?\n\n[Verse 4: Cowboy]\nYes yes, y'all, ya don't stop\nA-come on fly girls, I wanna hit the top\nI am the C-O-W-B-O-Y\nWhy the man so bad that ya can't deny?\nYou better watch your woman 'cause I'll tell you why\n'Cause I'm Cowboy, I might give her a try\nThey call me Keith-Keith the young ladies' relief\nKnow as the man of romance and make you dance\nCan any of you ladies stand a chance?\nI'm Cowboy and I'm shockin' the house, you see?\nYa say one, two, one more is three\nA-Melle Mel, come on, now what ya got for me?\n\n[Verse 5: Melle Mel]\nTo the hip hop, a hip hop, a-don't stop\nA-don't stop that body rock\nA-just get up out your seat and get ready to clap\nBecause-a Melle Mel is starting to rap\nAnd ever since I talked at my very first party\nI felt I could make myself somebody\nIt was something in my heart from the very start\nI could see myself at the top of the chart\nRapping on the mic, making cold, cold cash\nWith a jockey spinnin' for me called DJ Flash\nSigning autographs for the the young and old\nWearing big time silver and solid gold\nMy name on the radio and in the magazine\nMy picture on the TV screen\nIt's ain't like that yet, but, huh, you'll see\nI got potential and you will agree\nI'm coming up and I got a step above the rest\n'Cause I'm using that ladder they call success\nYou say a-one, two, three, four, five, six, seven\nRap like hell and make it sound like heaven\nA seven, six, five, four, three, two, one\nA-come on, Rahiem, come and get some\n\n[Verse 6: Rahiem]\nYes yes y'all, ya don't stop, come on\nCome on, huh, I wanna hit the top\nI'm a one of a kind, the man supreme\nI know I'm in all of the ladies' dreams\nI'm the R-A-H to the I-E-M\nI'll put a wiggle in your butt if ya tell me when\nI'm the son of a gun with the hell of a fire\nFly girls that mess around, I'll take ya all higher\nMy clientele climbed a great big boost\nI'm to give it up and turn it loose, huh\nAll you fly girls that don't know my game\nCome up and talk to me and we'll tell you all the same\nWhen ya wake up in the night in a hell of a dream\nYou know ya been possessed by the voice of Rahiem\nIn all the ladies' dreams\n\n[Verse 7: Melle Mel]\nAnd makin' more currency than any MC\nAnd the dream will turn to reality\nAnd Melle Mel'll be makin' money\nMr. Ness, make-makin' money\nRahiem, makin' money\nCowboy, make-makin' money\nA-Creole, makin' money\nDJ Flash, make-makin' money\nHit it\n\n[Instrumental Interlude]"}, {"song": "[Verse 8]\nTake the time and you will agree\nThat Black Door got good security\nSo when you walk through the door, just do me a favor\nBe sure to be on your best behavior\nYoung man, what do you wanna do\nWhen the party is through\nAnd a young lady wanna go home with you?\nYou search your pocket, ya soon aware\nThat you don't have enough for cab fare\nThen you say to yourself what a mistake ya made\nYour heart start pumpin' that ol' Kool-Aid\nWhen she walks to you and she starts to say\n\"Call One-Double-O, he's down with O.J.\"\nAnd you pay the way\n\n[Verse 9: Kidd Creole]\nYoung ladies a-like, young ladies galore\nYoung ladies we do adore\nFrom the way they move and the way they smile\nIt makes me admire their grace and style\nThere is not room for disbelief\nThat's the only way that The Kidd Creole can relieve\n\n[Verse 10: Mr. Ness]\nOr rock the house\nI'm a Scorpio and I will not flow\nI need ten fly girls before I go\nNow when the night is done\nYou come and get some\nThen you meet Mr. Ness and you have some fun\n'Til you walk up real soon\nAnd you head for my place and when you get in my room\nYou touch my face and then you start to chase\nAnd then you grab em' by the waist\nAnd then I lay you right back, I'm on a steady pace\n\n[Verse 11: Cowboy]\nI'm the only go of the rodeo\nYa say I ride in the rain 'til it's time to go\nI'm the buckaroo of the boogaloo\nAll the young ladies roll when he pass through\nI got two jazzy ladies in deep, deep check\nBoth ladies in the discotheque\nI got one in the front and one behind\nI'm in the middle 'cause they're both mine\n\n[Verse 12: Melle Mel]\nA-yes, yes, y'all, you don't stop that body rock\nFrom the shores of California to the streets of New York\nAin't nothing sweeter than ya walk except the way you front\nYou got hair everywhere, skin so fair\nA dynamic personality, a lot of flair\nWith your flashy clothes and your photogenic pose\nYou're as sharp as a thorn on the stem of a rose\nSo petite and elite you're, huh, too sweet\nSo great I'm amazed that you can't be beat\nThe way you swerve your curves, it really wrecks my nerves\nYou're everything that a man deserves\nSo women of the world, amen to thee\nBecause women like you make men like me"}, {"song": "[Verse 13: Raheem]\nYes, yes, y'all, you don't stop\nCome on, come on, huh, I wanna hit the top\nYoung ladies out there I won't be surprised\nIf I catch you watchin' or starin' in my eyes\nCome a little closer and you're sure to find\nThat I'm a hell of a fella and I'm one of a kind\nIf you happen to stare for just about a hour\nYou sweet young thing, you'll be in my power\nDon't fight the feelin', it's nothin' you could do\nExcept watch your back (Huh), 'cause I'm gonna pursue\nIf you think that you can't contain yourself\nWell, put all the silly games right up on the shelf\nCome here, ya sexy figure, tell ya what I'm gonna do\nI got a hell of a proposition just for you\nGonna stick the lovin' to ya, baby, later for a kiss\nIf you pass the chance up, you know you just missed\nBeyond the shadow of a doubt, or anything you can believe\nIf you so deep in the forest that you can't see the trees\nCreole, my mellow\nIt's on you so what you gonna do?\n\n[Verse 14: Kidd Creole]\nYou say I rock the house, make other MC's run\nPlace a bet with this devil, cheat 'em for a hun'\nCon any con man with bat or bowl\nI go by the name of The Kidd Creole\nI'm the king of finesse, I'm here to rock the rest\nAll the young ladies I wanna impress\nWhen I rap on the mic, I guarantee\nA certain amount of consistency\nLike Flash we'll cut the record to the bone\nCreole will rock on the microphone\nMr. Ness, my mellow\nCome and get some 'cause we're number one\n\n[Verse 15: Mr. Ness]\nDon't stop y'all, a-let me see ya rock\nWe gonna rock to the sounds around the clock\nWe gonna move to the beat, but don't you dare stop\nCome on everybody, stop playin' around\nBecause you got to get up so we can get down\nUnless you too hot to trot and not ready to rock\nCome on-on and dance and give me what you got\nBecause you know by now you got to give me something\n'Cause after all, you sweeter than honey\nGet down on your behalf\nBecause you gotta do it do for your calfs\nA-Cowboy, they say you from the Bronx\nSo won't you rock and add a little spunk?"}, {"song": "[Verse 16: Cowboy]\nYes, yes, y'all, you don't stop\nA-come on girl, let's hit the top\nLike a .357 pointed towards your head\nCowboy just about ready for the bed\nSo pull back the covers and take down your pants\n'Cause Cowboy will make you Patty Duke dance\nA side to side and you pat ya foot\nGet up out ya seat, then you shake your butt\nYou say one, two, one more is three\nA-Melle Mel, come on, what you got for me\n\n[Verse 17: Melle Mel]\nYou don't stop that body rock\nThey say a child is born with no state of mind\nHe's blind to the ways of mankind\nGod is smilin' on you, but he's frownin', too\nBecause only God knows what you'll go through\nYou'll grow in the ghetto livin' second-rate\nYour eyes will sing a song of deep hate\nThe places you play and where you stay\nA-looks like one great big alleyway\nYou'll admire all the number-book takers\nThugs, pimps, and pushers, they're the big money makers\nDrivin' big cars, spendin' twenties and tens\nAnd you wanna grow up to be just like them, huh\nSmugglers, scramblers, burglars, gamblers\nPickpocket, peddlers, even panhandlers\nYou say, \"I'm cool,\" huh, \"I'm no fool\"\nBut you'll wind up droppin' outta high school\nNow you're unemployed, all non void\nWalkin' around like you're Pretty Boy Floyd\nTurned stick-up kid, and look what you done did\nGot sent up for an eight year bid\nNow your manhood is took, you're a Maytag\nSpend the next two years as a undercover fag\nBein' used and abused, served like hell\n'Til one day you was found hung dead in a cell\nIt was plain to see that your life was lost\nYou was cold and your body swung back and forth\nBut now your eyes sing the sad, sad, song\nOf how you lived so fast and died so young\nSayin', one, two, three, four, five, six, seven\nRap like hell and make it sound like heaven\nSeven, six, five, four, three, two, one\nNow come on Raheem, a-come and get some\n\n[Verse 18: Raheem]\nYes, yes, y'all, you don't stop\nC'mon, c'mon, c'mon and let me see you rock\nI'm only five-foot-nine, you think I care?\nI can pull a girl from anywhere\n'Cause I'm bubblin' 'round, just the talk of the town\nWhen they talk about me, they don't dare frown\n'Cause I'm too hot to trot, to cold to walk, uh\nTo all the fly girls, I'm aimin' to talk\nTo all the fly girls, you got to beware\n'Cause Raheim, huh, will be in yo' hair\nJust come on to the roast and listen to me\nBecause everybody knows Raheem is what it be\n\n[Outro]\nMelle Mel (Bang), rock the house (Pow)\nCome on, help me turn it out\nA-Mr. Ness (Bang), rock the house (House)\nCome on and help me turn it out\nRaheem, (Bang), rock the house (House)\nA-come on, help me turn it out\nA-Cowboy, (Bang), rock the house (Pow)\nCome on and help me turn it out\nKidd Creole, (Bang), rock the house (Pow)\nCome on, help me turn it out\nDJ Flash, (Bang), rock the house (Pow)\nCome on, help me turn it out\nDisco B, (Bang), rock the house (Pow)\nCome on and help me turn it out\nE-Z Mike, (Bang), rock the house (Pow)\nCome on, help me turn it out\nYoung ladies (Bang)"}, {"song": "[Hook:Melle Mel]\nAh New York New York big city of dreams\nAnd everything in New York ain't always what it seems\nYou might get fooled if you come from out of town\nBut I'm down by law and I know my way around, too much\nAh too many people, too much -- a ha hah\nToo much, too many people, too much, rrrrrrrah!\n\n[Verse 1: Melle Mel]\nA castle in the sky, one mile high\nBuilt to shelter the rich and greedy\nRows of eyes, disguised as windows\nLookin down on the poor and the needy\nMiles of people, marchin up the avenue\nDoin what they gotta do, just to get by\nI'm livin in the land of plenty and many\nBut I'm damn sure poor and I don't know why\n\n[Bridge: Melle Mel]\nToo much, ah too many people, too much\nToo much, too many people, too much!\n\n[Verse 2: Duke Bootee]\nA man's on a ledge, says he's gonna jump\nPeople gather round, said, \"He won't he's just a chump\"\nCause he lost his job, then he got robbed\nHis mortgage is due and his marriage is through\nHe says he ain't gonna pay no child support\nBecause the bitch left him without a second thought\nHe got nothin to eat, no shoes on his feet\nShe even left his clothes, out in the street\nHe keeps hearin noises when he's at home\nHe always hears voices when he's all alone\nHis wife took the kids, the car and the crib\nIn this man's world, so much for women's lib\n\n[Hook:Duke Bootee]\nNew York New York big city of dreams\nBut everything in New York ain't always what it seems\nYou might get fooled if you come from out of town\nBut I'm down by law, and I know my way around\n\n[Verse 3: Duke Bootee]\nDown in the Village, you might think I'm silly\nBut you can't tell the women from the men sometimes\nThey're sugar and spice and everything nice\nBut when you get em home ain't no tellin what you find\nRight next door is a little old man\nI seen him eatin dog food out of a can\nHe says, \"I got to eat, when I can't afford meat\nI barely can stand, on my own two feet\"\nI got a bad habit and I just can't break it\nSomethin's on my mind and I just can't shake it\nI need some time, and I want some space\nI gotta get away from the human race\n\n[Bridge: Melle Mel]\nToo much, ah too many people, too much... a-ha hah\nToo much, ah too many people, too much! Rrrrrrrah!\n\n[Verse 3: Melle Mel]\nStand at a skyscraper reachin into heaven\nWhen over in the ghetto I'm livin in hell\nJust play ball or be an entertainer\nCause niggas like me can't read too well\nNobody loves me, nobody cares\nI dreamed about a life but I'm livin in a nightmare\nParanoid schitzo, set back, snowbound\nBad news psycho, heart attack, breakdown!"}, {"song": "Hee, huh (16X) HUH!\n\n[Verse 4: Melle Mel]\nIf only I could sleep just ten more minutes\nI might find the strength to make another day\nIf I didn't have to get up, and do my thing\nI would probably sleep my whole life away\nI messed up a nice dream, somethin bout ice cream\nWhipped cream fruits and a cherry on top\nNow I gotta get up and face the world, huh\nThe pressure is on it ain't never gonna stop\nI sho' gotta learn to use my mind\nI don't wanna be kissin nobody's behind\nJust standin on line lookin like a jerk\nGotta get off my butt and do a full day's work\nI ran into a pothole, got into a car crash\nShoulda been thinkin and tried to fake whiplash\nA crowd gathered round, they're callin me fat\nWho you lookin at wit a face like that?\n\n[Hook:Melle Mel]\nNew York New York big city of dreams\nEverything in New York ain't always what it seems\nYou might get fooled if you come from out of town\nBut I'm down by law and I know my way around\n\n[Verse 5: Melle Mel]\nOn 42nd Street, lookin for some action\nWomen standin on the corner sellin satisfaction\nOne young punk just leanin on the fence\nTryin to make a dollar out of fifteen cents\nReally is a prankster, tried to be a gangster\nReal big wheel when a gun is in his hands\nJust did a stick-up, just got picked up\nOne dead punk, killed by the man\n\n[Hook:Melle Mel]\nNew York New York big city of dreams\nAnd everything in New York ain't always what it seem\nYou might get fooled if you come from out of town\nBut I'm down by law and I know my way around\nToo much, too many people, too much... ah ha hah hah\nToo much, too many people, too much! HUAHH!\n\n[Verse 6:Melle Mel]\nA baby cries and a mother dies\nAnd the tears fall from the doctor's eyes because\nIn this room, on this day\nThe Good Lord has giveth, and taketh away, huh\nThe gift of life really means a lot\nAnd in the ghetto your life is all you got\nSo you take to the streets, tryin to exist\nIn the trash and slime of a world like this\nWhat you watch, on TV\nA tells you what life is supposed to be\nBut when you look outside the only thing you see\nIs the poverty stricken, reality, heh\nAbandoned places, angry faces\nMuch hate and hunger throughout the races\nYou say, \"I'm grown and I'm on my own\nSo why don't everybody just leave me alone!\"\nNow you stay at home, talkin on the phone\nDoin ninety miles an hour in the fifty mile zone\nThey never took the time to tell you bout sex\nSo you had to learn about it in the discotheques\nNine months later, the baby is there\nAnd the nigga that did it said, \"I don't care!\"\nYou don't have enough money to help feed two\nSo you have to choose between the baby and you\nThe sky was cryin, rain and hail\nWhen you put yo' baby in the garbage pail\nThen you kissed the kid and put down the lid\nAnd you tried to forget what you just did, huh\nThe muffled screams of a dyin baby\nWas enough to drive the young mother crazy\nSo she ran in the rain tryin to ease the pain\nHuh huh, and she drove herself insane\n\n[Hook:Melle Mel]\nNew York New York big city of dreams\nBut everything in New York ain't always what it seem\nYou might get fooled if you come from out of town\nBut I'm down by law and I know my way around\n\n[Bridge: Melle Mel]\nAh too much, too many people, too much... ah ha hah hah\nToo much, too many people, too much! HUHHH!\n\n[Hook: Melle Mel]\nNew York New York big city of dreams\nBut everything in New York ain't always what it seems\nYou might get fooled if you come from out of town\nBut I'm down by law and I know my way around\nToo much, too many people, too much... ha hah hah hah\nToo much, too many people, too much"}, {"song": "You say\nYou say\nYou say\nYou say\nYou say\nYou say\n\nYou say\nOne for the treble\nTwo for the time\nCome on girls let rock that [whistle]\n\nFab Five Freddie told me everybody's fly\nDJ's spinnin' are savin' my mind\nFlash is fast\nFlash is fast\nFlash is fast\nFlash is cool\nFrancois sez fas, Flashe' no do\n\nYou say one for the trouble\nTwo for the time\nCome on girls let rock that\n\nGood times---\n\n[music interlude]\n\nGrandmaster, cut faster\nGrandmaster, cut faster\nGrandmaster, cut, cut, cut faster\nGrandmaster, Grandmaster, cut faster\n\nHey, hey, hey\nEverybody say one\nOne, Flash one time\nEverybody say two\nTwo, Flash two times\nSay three\nThree, Flash three times\nSay four\nFour, Flash four times\n\nMelle Mel\nTaurus the bull is my zodiac sign\n\nMr Ness\nScorpio, my name is Rahiem\nAquarius\nAnd King Creole\nPisces\nCowboy\nVirgo\nAnd Gra- gra- gra- gra- Grandmaster Flash cuts so on\nHis zodiac sign is Capricorn\n\nWhy don't you tell me a story?\nPlease tell me a story too\nYou know, I think I'll tell you the story of my life\nYou tell me!\nI wanna hear too\nI was born in North Dakota a long time ago, see\nAnd now I'm lucky enough to be here with you\nYeah, but what happened in between?\nYeah, what else happened?\nWell, it went pretty much like this\n\nOh yeah!\nWoo\n[Whistle]\nWoo\nHa, ha, ha\nCh-ka-bow\nOah, oah\nAha, ha, ha, ha\nHoo!\n\nThe official adventures of...Flash\n\nOhhh, ha, ha, ha\nHey, hey, everybody say ho (ho)\nSay ho, ho (ho, ho)\nSay disco (disco)\nSay party (party)\nAll the ladies\nAll the ladies in the house\nAll the ladies in the house say ow (ow)\nSay ow (ow)\n\nEverybody come on\nSay somebody, anybody, everybody scream! (Ooooo)\n\nHey bro I got somethin' that'll blow ya mind!\nHa, ha, ha, ha\n[Party noises]\nGet ya hands off that girl!\nCreole, Creole!\n\nFlash is\nFlash is\nFlash is\nFlash is\nFlash is\nFlash is\nOwww!\n\nHey, ha, ha, ha, ha!\nAlright, where's Vicious Lee?"}, {"song": "Somebody, a-somebody if you wanna party say party, say, \"Party\"\n(Party!)\nAay, \"Party\"\n(Party!)\nA-C'mon\nHeh heh, heh whoo!\nAh yeah\nIf you wanna party and that's a fact somebody say. \"And you know that\"\n(And you know that!)\n\n[All]\nWe don't care if you're 8 to 10\nOr if you're a senior citizen\nBecause we got a beat that just won't end\nSo you better get ready to rock my friend!\nYou see, we got some news\nThat you can use\nAn offer that you can't refuse\nWe're givin' up honey, and you got to come\nBecause you're the one!\nRed, yellow, black, white, or brown\nIn our own way we can all get down\nSo just take your time and enjoy yourself\nAnd you'll rock as good as anyone else\nA-come on go to it, put your body into it\nIf the feelin' is good then you might as well do it\nSee it makes no sense a-just standin' around\nJust boogie to the beat of the funky sound\nYou don't rock with us, you won't have a ball\nAnd we might as well didn't rock at all\nYou see we can't rock if you don't have fun\nBecause you're the one that's number one\nNow raise your hand up above your head\nIf you agree what I said\nThen writhe your hands all in the air\nSomebody say, \"Oh yeah\"\n(Oh yeah!)\nHa ha ha ha!\nFlash! One time!\n\n[Melle Mel]\nMelle Mel with the clientele\nI'm gonna rock your chime and ring your bell\nSee I'm so bad and I'm so light\nTo write a rhyme on a dime to make the world turn twice\n\n[Mr.Ness]\nAnd I'm Mr. Ness, that rock the best\nAnd I'm ready to rock at your request\nGo on, go on with your bad self\nRaheim is gonna do the rest\n\n[Raheim]\nSo my name is Raheim\nI'm a son of a queen\nI'm the king of my castle\nDon't give me no hassle\nYoung ladies in the place, put me on\nWhen I'm a part of your life, you can never go wrong\n\n[Kid Creole]\nYou say at first my name was Denny Den\nThe secret weapon, the master plan\nI'm slick, I'm cool, I'm solid gold\nThey call me the Kid Creole\n\n[Cowboy]\nI'm the C.O.W.B.O.Y. (why)\nThe man's so bad that you can't deny\nAnd when you ask the cowboy to play\nI'm Cowboy, I never ran away\n\n[All]\nGrandmaster, cut faster\nThan any known, stone to the bone\nFull-grown he's a one of a kind\nAnd Flash is gonna rock your mind, huh\n\nFlash, two times\nBeep beep, you in the crew, hold it\nWhy don't you find somebody and...party!"}, {"song": "I like this part\nGet down\nWhoo! Yeah, alright, alright\nQuickly now, quickly now\nThe bass was in your face\nThe highs that make your nature rise\nYoung ladies in the place\nFeel the highs, feel the bass\nIf you wanna rock till the break of dawn somebody say, \"Come on\"\n(Come on!)\n\n[All]\nMelle Mel, right on time\nTaurus the bull is my Zodiac sign\nAnd I'm Mr Ness and I'm ready to go\nAnd I go by the sign of Scorpio\nMy name is Raheim, I don't like to fuss\nMy Zodiac sign is Aquarius\nThe Kid Creole is the name of mine\nAnd Pisces is my Zodiac sign\nAnd I'm Cowboy and I'm runnin' this show\nMy Zodiac sign is uh, Virgo\nAnd Grandmaster Flash cuts so on\nHis Zodiac sign is Capricorn\nWe gon' try somethin new\n(Whatchu gon' do!?)\nWe gon' try somethin new\n(Whatchu gon' do!?)\nNow that you heard our names and signs\nPut your name into this rhyme\nWhat's your name?\n(All yell names)\nI say what's your name?\n(All yell names)\nAnd gon' try somethin' else\nGo for yourself\nAnd gon' try somethin' else\nGo for yourself\nGon' try this game, one more time\nNow this time use your Zodiac sign\nWhat's your sign!?\n(All yell signs)\nI say what's your sign!?\n(All yell signs)\n\nHa ha ha ha!\nFlash! Two times!\nBeep beep, you in the crew, hold it\nHey, why don't you find somebody and...party!\nOohwee oohwee\nHere come the kazoos, alright!\nNo doubt, get down, whoo! Heh\nYoung ladies in the place\nBass in your face\nHa ha ha ha, ugh\n\n[Melle Mel]\nThe ladies' action, the coming attraction\nThe man with the positive reaction\nThe man with the style on top of the pile\nMelle Mel gonna rock a long, long while\nI want a Rolls Royce, I got a golden voice\nGonna rock in the mic if you give me the choice\nAnd I rock to the beat and I got it like that\nAnd you couldn't beat that with a baseball bat\n\n[Mr. Ness]\nI could play a dumb game and I won't feel ashamed\nBecause I got more smarts than any slick git\nI'm not the butcher, the baker, or the candlestick maker\nBut I'm Mr. Ness the woman's taker\nWhen I talk to some girls, the girls think I'm dumb\nBut that's O.k. because they all get some\nI'mma tell it like this, you will never discover\nThat Ness is, is a lover"}, {"song": "[Raheim]\nI'm the force that keeps you on when you tend to stray\nI'm the jester of the joust so heed what I say\nThis advice I give to you is for you to keep\nAll I want you to do is just sow what I reap\nI'm 100% on all the time\nI'm like Earl the Pearl when I'm saying a rhyme\nI could get taped on like a magical wand\nI make all the ladies' dreams and my word is bond\n\n[Kid Creole]\nWe're sick, we're bad and powerful\nWe fill you with five hours full\nOf the music that's proclaimed the best\nIn town to the funky sound\nNow clap your hands, do the freak dance\nBecome a victim of circumstance\n'Cause everybody rocks with Flash and the Five\nGet down RRAH!\n\n[Mr. Ness]\nThe butter, the bread\nThe bread to the butter\nC'mon everybody let's rock one and another\nHey ashes to ashes, dust to dust\nNobody rocks the mic like the five of us\n\n[Melle Mel]\nYou say the bread to the butter and the butter to the bread\nDon't be misled by what I say\nYou say dust to dust and ashes to ashes\n'Cause no man cuts are faster than Flash's\n\nYou're the one\n\n[Cowboy]\nYou don't stop and everybody hiphop\nYou don't stop and then find your [?]\nJust clap your hands and get on the go\nThen you rock to the beat in stereo\nAnd if you wanna help us get on the go\nScream it out and say, \"Ho\"\n(Ho!)\n\"Ho\"\n(Ho!)\nYou don't stop\nAnd if you wanna rock into the broad daylight\nSomebody say, \"What it look like\"\n(What it look like!)\n\"What it look like\"\n(What it look like!)\nYou don't stop\nI'm gonna talk about the man that's the real McCoy\nNo other cool brother than Keith Cowboy\nI wear a eight and a half, a 29 waist\nA medium shirt take a look at my face\nYou check out my hair and then you look in my eyes\n'Cause all I'm here to do girl is make you hypnotized\nTill you hip hop the shoobop doobop take a look on your arm\nAnd check your clock\nLet's do it, let's do it\nYou know you got to do, do it\nTo the beat, y'all\nYou don't, you better not\nDon't stop that body rock\n{*fade*}"}, {"song": "Ladies and gentlemen\nIt's now the time\nFor the Grandmaster Flash and the Furious Five MC's!!\n\nWe're coming, we're coming, we're coming\nWE'RE HERE!\n\nOoooh! Haha, woooohh!\n\nAiyyy mami I wanna get nasty wit you baby, ahahahaha\nAiyyy, tu eta por llamaseta mi amor, Linda, ahahahaha!\n\nWe wanna rock YOU!\nWe're the kings of swing\nAnd we're chosen to rule\nThe deans of clean inside the cool school\nWe're the chiefs of relief\nContained by wild beasts\nThe finesse of the West, the masterpiece of the East\nHah, the boss of course\nAs the lord of our fort\nThe ones with the platinum vocal chords\nWe're the science of desire\nWith a magical mic\nThe monarch of the dark in the night alright\nWe advertise\nAnd specialize\nIn the exercise and we'll energize\nThe young ladies' thighs\nCause all the fly guys'\nNatures to rise right before their eyes\nWe're the Earl of the world\nAnd the heir of flair\nThe Duke of dare, the Mayor of debonaire\nGot fine, drink wine\nCan dance and dine\nGot a first class female oh so fine\n\n[Hook]\nHey baby, whatever you doin right girl\nI just want you to always be easy\nAnd keep on shaking that thing\nAnd I want you\nSwingin it swingin it swingin\nTell me how now\nLike dynamite before it blows\nWho needs a band when the beat just goes -- boom!\n\nHe's Grandmaster, he cuts faster\nWe're the Furious, serious, and ever so mysterious\nFive that's rockin the house\n\nAnd everybody say PLAY (PLAY)\nSay PLAY (PLAY) well OK!\n\nHo! Everybody c'mon!\nWoo! Now now! Uhh!\n\nPeople call me crazy, people call me sneak\nJust because I'm nasty, they call me a freak, hehe\nI am coming over to your house tonight\nI promise to you baby that I'll do you right, I'm nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha (shake your booty)\nI wantcha, I wantcha, I wantcha, I wantcha (we want to rock you)\nJust let us rock you!\n\n[Verse 2]\nWatch your girl and watch your wife\nI got the kiss of death, to touch your life\nCause I am the man they call Scorpio\nI like the fly girls that don't say no\n\nHey girl, grab my hand, hold on tight\nDon't you worry bout a thing, Rahiem'll do you right\nI'm a man that's fresh huh, a woman's pet\nThere ain't a thing in the world that I can't get\n\nIn the history books or the picture show\nIt's the golden voice on your radio\nI'm the rapper never printed, voice is solid gold\nI'm playin the role, they call me Kid Creole"}, {"song": "And I'm the, the Romeo of the nasty show\nAll the ladies in the place, to my house we go\nFreaking in the den just to make you move\nCause I'm Cowboy, and I got the groove\n\nAs DJ Flash cuts so mean\nThat he wanna know your favorite jean\nIs it Jordache? (NO!) Gloria Vanderbilt? (NO!)\nMaybe it's Sassoon? (NO!) How about Sergio? (I DON'T CARE!)\nCould it be Calvin Klein? (NO!) Then what is it?\n\nBack to the bridge y'all\n\n[Hook]\n\nEverybody, shake your body\nKeep moving and grooving and screaming and shouting\nAnd helping us turn it out\n\nIs everybody sayin play? (PLAY!)\nSay play! (PLAY!) Well OK!\n\nAlright, woo!\nEverybody get up!\nOooooeee, yeah!\n\nPeople say it's dirty, people say it's wrong\nThey talk about our music like it's a nasty song\nIt's nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha!\nJust let us rock, you!\n\n[Verse 3]\nGot waterbed seats in my limousine\nAnd everytime I'm seen I got to be clean\nI tour around the world to make the people dance\nAnd here's a little message for the ladies in France\nJe m'appelle, Melle Mel\nDonne moi la petit mademoiselle\nDonne moi cinq, donne moi six\nDonne moi huit, neuf, dix\n\nI'm seeing this girl that I just adore\nI'm seeing this girl that what I never saw before\nThe way she was swaying and doing the swing\nI had to let her know just about my thing\nI'm the M, R, N E-Double S\nCome on, ah fly girl, and put me to a test\nAnd I'll rock you, until you give me the rest\nI keep on it, until you start to fess\n\nRahiem in your life, what more can you ask\nI bet you can't think of a greater task\nI make my light shine on your cloudy days\nYou can surf if you want to on my waves\nI caress your soft body on those mellow nights\nA continuous thing, to the morning light\nIt's reality, it's not a dream\nIt's nothing less than the best when it's from Rahiem\n\nNow it's my turn so understand\nThat I'm the Kid Creole, and I'm a ladies man\nI don't, have a lot of women hangin on my sleeve\nOnly one fine lady, that you better believe\nI say Annette's her name, and that's the truth\nI give a lot of things up, before I turn her loose\nIt's just her, and that's simple and plain\nAnd that's the only way I run my game\n\nWell I'mma Cowboy and I'm the real McCoy\nI'm chocolate all over like an Almond Joy\nBowlegged cool brother and you will agree\nOn top of the world for the ladies to see\nGonna hip gonna hop gonna rock the spot\nGonna make everybody wanna rock rock rock\nGonna do it to the East, wanna do it to the West\nGonna make you relax right upon your chest\n\nGrandmaster Flash is willing and able\nHe's the king of the cuts on two turntables\nHe's the GRAND, GRAND, the master man\nHe's so nice with his hands he don't need no band\nRocks 45's and 33's\nRocks boys, men, women, and young ladies\nHe can slice so precise it's almost fun\nAnd he makes better love than a mint makes money\n\nSlick Rick, Slick Rick, Slick Rick, Slick Rick\nSlick Rick, Slick Rick (ha ha hah hah hah), hooooooo-ho!!\nOwwwwwwwwwwwwwwww!"}, {"song": "Beep beep, you and the crew, hold it\nYeah, that's us, we're bad. We're back\nAnd we want ya'll to know, we're all getting into a birthday thing\nNow I want everybody to put your hands up into the air if you got a birthday\nNow I don't care if it already came or if it already done passed\nEverybody say, Happy (Happy) birthday (Birthday)\nGoody, goody, oh my god, oh my god\nHappy birthday baby, party, party, party\n\nHey ya'll, we're having a ball\nI hope you're doing fine\nBecause any time is a happy time for a birthday party rhyme\nEverybody get up\nHey ya'll, I'm having a ball\nI hope you're doing fine\nBecause any time is a happy time for a birthday party rhyme\nHit it\n\n[Verse 1]\nYou don't need no invitation\nThere's a party going on throughout the nation\nDon't get excited but it's gonna be\nThe best birthday party in history\nWe're gonna celebrate the gift of birth\nThe living jewel of planet Earth\nSo come on, come all to the birthday ball\nEvery day this spring, summer, winter and fall\nFrom dusk 'till dawn, from dawn 'till dusk\nIf the crowd don't get you, the music must\n'Cause it's jam packed from back to back\nYou're in, you're out, 'cause you like it like that\nLet's rock, let's rock and rock\nDon't stop\nPat your foot and let your fingers pop\nI wanna hear you loud and clear\nSay, \"Hell yeah\" (Hell yeah)\n\nEverybody say, \"One\" (One), Flash, one time\nSay, \"Two\" (Two), Flash, two times\nSay, \"Three\" (Three), Flash, three times\nSay, \"Four\" (Four), Flash, five times\n\nAll the guys better find a girl\n'Cause if you stay apart\nWe're gonna move the groove until we prove\nThat we're gonna shake you, break your heart\n\nAll the girls better find a guy\nAll the guys better find a girl\n'Cause we're gonna hip and hop til we hit the top\n'Cause we gonna rock and shock the whole world\n\nMelle Mel gonna make you yell\nAnd I'm Mr. Ness, gon' make you shout the best\nRahiem gon' make you scream scream scream\nCreole gonna make you rock and roll\nCowboy gonna make you jump for joy\nAnd Flash gonna cut the cut so fast"}, {"song": "But those of you who remember the line\nHelp me finish the rhyme -- c'mon y'all\nWe gonna try something new\nWhat you gonna do?\nWe gonna try something new\nWhat you gonna do?\nIf you want to scream to the break of dawn\nAt the count of three, scream loud and long\nOne, two, three -- hit it, hit it\nOne, two, three -- hit it, hit it\n\nEverybody say, \"One\" (One), Flash, one time\nSay, \"Two\" (Two), Flash, two times\nSay, \"Three\" (Three), Flash, three times\nSay, \"Four\" (Four), Flash, five times\n\nAll the girls better find a guy\nAll the guys better find a girl\n'Cause we're gonna hip and hop til we hit the top\n'Cause we gonna rock and shock the whole world\n\nAll the guys better find a girl\n'Cause if you stay apart\nWe're gonna move the groove until we prove\nThat we're gonna shake you, break your heart\n\nMelle Mel and I'm here to say\nI was born on the 15th day of May\nAnd I'm Mr. Ness and I love myself\nAnd my date of birth is November the 12th\nI wanna tell you that my name is Rahiem\nMy date of birth is February 13th\nI'm Kid Creole and I'm on the scene\nI was born on February 19th\nI'm Cowboy and you must remember\nI was born on the 20th of September\nAnd Grandmaster Flash is here to stay\n'Cause he was born on new years day\nNow we got something else that we want you to say\nJust shout out your birthday\nBut to play this game, and to rock this rhyme\nShout the date and the month out one of a kind\nSay 2 4 6 8 everybody shout out your birthday\nSay what's that date? (Incomprehensible shouting)\nSay what's that date? (Incomprehensible shouting)\nNow to keep these things movin' right along\nShout out the month that you were born\nI say \"What's that month?\" (Incomprehensible shouting)\nI say \"what's that month?\" (Incomprehensible shouting)\n\nEverybody say, \"One\" (One), Flash, one time\nEverybody say, \"Two\" (Two), Flash, two times\nSay, \"Three\" (Three), Flash, three times\nEverybody say, \"Four\" (Four), Flash, five times\n\nHey ya'll, I'm having a ball\nI hope you're doing fine\nBecause any time is a happy time\nFor a birthday party rhyme\nHit it\n\nAll the guys better find a girl\n'Cause if you stay apart\nWe're gonna move the groove until we prove\nThat we're gonna shake you, break your heart\n\nAll the girls better find a guy\nAll the guys better find a girl\n'Cause we're gonna hip and hop til we hit the top\n'Cause we gonna rock and shock the whole world"}, {"song": "Ah, Scorpio\nShow no shame\nShake it baby\nHe is DJ Flash and he came here to give you a blast\nAnd we are the Furious Five and we're rocking, shocking all the way live\nShow no shame\nShake it\nShake it baby\nAh, show no shame\nDon't be shy girl\nShow no shame\nHigher baby\nHigher now\nHigher baby\nHigher now\nHigher baby\nBreak it down\nShow no shame now\nThrow your hands, way up high\nAnd everybody's gonna try to reach the sky\nBecause you can't stop, won't stop playing the game\nAnd I know that you can do it if you show no shame\nHey girl, don't be shy\nShake your body the way I, the way that I like it\nWith no shame girl\nThat's the way\nShake it baby\nTake me higher\nHigher\nHigher\nHigher\nHigher\nNow break it down\nDon't be shy girl\nNow switch\nMake a switch\nBiology power\nAh, make a switch\nHey Dune Bug, switch\n[?] Hey, trainee?, switch\nMake a switch\nMake a switch\nMake a switch\nMake a switch\nSwitch\nDon't be shy girl\nHigher\nHigher baby\nHigher now\nHigher\nHigher baby\nBreak it down\nAnd show no shame girl\n\nMister Ness who rocks the best\nAnd Rahiem in the Ladies' dreams\nAnd Cowboy is the real McCoy\nAnd Grandmaster, cuts much faster\nAnd me and Rob, doing the job\nAnd Jigsaw is giving me more\nAnd Steve Jerome is the king of the throne\nAnd Merob is the place to be\nAnd Kid Creole is solid Gold\nDon't be shy girl\nAh baby, break it down\nNow take me higher\n[?] Tricia?, and break it down\nAh take me higher now\nNow baby, break it down\nHigher\nHigher\nLower\nHigher\nLow baby\nHigher\nLower, higher, lower, higher, lower, higher\nThe name of this jam is Scorpio"}, {"song": "Ladies and gentlemen\nIt's now the time\nFor the Grandmaster Flash and the Furious Five MC's!!\n\n(said at first in almost a whisper, getting gradually louder)\nWe're coming, we're coming, we're coming (x3)\nWE'RE HERE!\n\nOoooh! Haha, woooohh!\n\nAiyyy mami I wanna get nasty wit you baby, ahahahaha\nAiyyy, tu eta por llamaseta mi amor, Linda, ahahahaha!\n\nWe wanna rock, YOU!\nWe're the kings of swing\nAnd we're chosen to rule\nThe deans of clean inside the cool school\nWe're the chiefs of relief\nContained by wild beasts\nThe finesse of the West, the masterpiece of the East\nHah, the boss of course\nAs the lord of our fort\nThe ones with the platinum vocal chords\nWe're the science of desire\nWith a magical mic\nThe monarch of the dark in the night alright\nWe advertise\nAnd specialize\nIn the exercise and we'll energize\nThe young ladies thighs\nCause all the fly guys\nNature's to rise right before their eyes\nWe're the Earl of the world\nAnd the Air of flair\nThe Duke of dare, the Mayor of debonaire\nGot fine, drink wine\nCan dance and dine\nGot a first class female oh so fine\n\n(Chorus)\nHey baby, whatever you doin right girl\nI just want you to always be easy, and keep on shakin that thing\nAnd I want you - swingin it swingin it swingin\nTell me how now\nLike dy-na-mite before it blows\nWho needs a band when the beat just goes - boom!\n\nHe's Grandmaster, he cuts faster\nWe're the Furious, serious, and ever so mysterious\nFive that's rockin the house\n\nAnd everybody say PLAY (PLAY)\nSay PLAY (PLAY) well OK!\n\nHo! Everybody c'mon!\nWoo! Now now! Uhh!\n\nPeople call me crazy, people call me sneak\nJust because I'm nasty, they call me a freak, hehe\nI am coming over, to your house tonight\nI promise to you baby, that I'll do you right, I'm nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha (shake your booty)\nI wantcha, I wantcha, I wantcha, I wantcha (we want to rock you)\nJust let us rock, you!\n\nWatch your girl and watch your wife\nI got the kiss of death, to touch your life\nCause I am the man they call Scorpio\nI like fly girls that don't say no\n\nHey girl, grab my hand, hold on tight\nDon't you worry bout a thing Raheem'll do you right\nI'm a mint that's fresh huh, a woman's pet\nThere ain't a thing in the world that I can't get\n\nIn the history books or the picture show\nIt's the golden voice on your radio\nI'm the rapper never printed voice is solid gold\nI'm playin the role, they call me Kid Creole"}, {"song": "And I'm the, the Romeo, of the nasty show\nAll the ladies in the place, to my house we go\nFreakin in the den just to make you move\nCause I'm Cowboy, and I got the groove\n\nAs DJ Flash, cuts so mean\nThat he wanna know your favorite jean\nIs it Jordache? (NO!) Gloria Vanderbilt? (NO!)\nMaybe it's Sassoon? (NO!) How about Sergio? (I DON'T CARE!)\nCould it be Calvin Klein? (NO!) Then what is it? (?????)\n\nBack to the bridge y'all\n\n(Chorus)\nEverybody, shake your body\nKeep movin and groovin and screamin and shoutin\nAnd helpin us turn it out\n\nIs everybody sayin play? (PLAY!)\nSay play! (PLAY!) Well OK!\n\nAlright, woo!\nEverybody get up!\nOooooeee, yeah!\n\nPeople say it's dirty, people say it's wrong\nThey talk about our music, like it's a nasty song\nIt's nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha!\nJust let us rock, you!\n\nGot waterbed seats in my limousine\nAnd everytime I'm seen I got to be clean\nI tour around the world, to make the people dance\nAnd here's a little message for the ladies in France\nHuh huh\nJe m'appelle, Melle Mel\nDonne moi la petit mademoiselle\nDonne moi cinq, donne moi six\nDonne moi huit, neuf, dix\n\nI'm seein this girl that I just adore\nI'm seein this girl that what I never saw before\nThe way she was swaying and doing the swing\nI had to let her know just about my thing\nI'm the M, R, N E-Double S\nCome on, ah fly girl, and put me to a test\nAnd I'll rock you, until you give me the rest\nI keep on it, until you start to fess\n\nRaheem, in your life, what more can you ask\nI bet you can't think of a greater task\nI make my light shine on your cloudy days\nYou can surf if you want to, on my waves\nI caress your soft body on those mellow nights\nA continuous thing, to the morning light\nIt's reality, it's not a dream\nIt's nothing less than the best when it's from Raheem\n\nNow it's my turn so understand\nThat I'm the Kid Creole, and I'm a ladies man\nI don't, have a lot of women hangin on my steez\nOnly one fine lady that you better believe\nI say Annette's her name, and that's the truth\nI give a lot of things up, before I turn her loose\nIt's just her, and that's simple and plain\nAnd that's the only way I run my game\n\nWell I'ma, Cowboy and I'm the real McCoy\nI'm chocolate all over like an Almond Joy\nBowlegged cool brother and you will agree\nOn top of the world for the ladies to see\nGonna hip gonna hop gonna rock the spot\nGonna make everybody wanna rock rock rock\nGonna do it to the East, wanna do it to the West\nGonna make you relax right upon your chest\n\nGrandmaster Flash, is willing and able\nHe's the king of the cuts on two turntables\nHe's the GRAND, GRAND, the master man\nHe's so nice with his hands he don't need no band\nRocks 45's, and 33's\nRocks boys men women and young ladies\nHe can slice so precise it's almost fun\nAnd he makes better love than a mick makes money\n\nSlick Rick, Slick Rick, Slick Rick, Slick Rick\nSlick Rick, Slick Rick (ha ha hah hah hah), hooooooo-ho!!\nOwwwwwwwwwwwwwwww!\n\n(lots of varied conversation to the end, at least one mention of Bob Marley)"}, {"song": "(Yeaaaaaaa) (yeeeehaahh!)\nYall see that girl? Man you like the way she walk\nI wish she was mine\n\nFresh!\nEvery night I see you on the dancefloor\nFresh!\nFlirting with the fellas, I be watching girl\nFresh!\nYour body smell like heaven baby!\nFresh!\nYour lips is like vanilla!\n\nYeaaa HO!\nLet me sock it to ya, sock-sock it, (sock it to yah)\n(42nd Street) Ho!\n(I'mma get that girl)(yea?)\n(gotta have it all)\n\nFresh!\nI saw you from a distance girl!\nFresh!\nAnd you got me really hopin' (I been hopin' baby)\nFresh!\nThe way you wear your jeans so tight\nFresh!\nYour blouse all loose and open!\nYeaaa Ho!\n\nBaby sock it to me, so I can sock it to yah (he's a maniac)\nHo!\n(Girl moaning)(Yea) uh!\n(You better stop) (hmm mm hmm!)\n\nFresh! Fresh! Fresh! Fresh!\n\nFresh x 9\n\nAwwwww Fresh!\n\nThat girl is fresh, shawty ride it\nThat girl is fresshhhh, you know it\nThat girl is fresh, woo ooo baby (shawty ride it)\nThat girl is fresh, you know it\nThat girl is fresh (shawty ride it)\nThat girl is fresh, you know it!\nThat girl is fresh, (shawty ride it)\nThat girl is fresh, you know it x 4\n\n(Walk so fresh, talk so fresh\nYour just so fresh) x 2 (say what)\n\nWe like it x 4\n\nThe boy caucus, the fifty walkas\nThe night stalkas! The native new yorker\nThe first and last, and all that jazz\nWe're the furious five and Grandmaster flash!\n\nI'm Melle Mel\nAnd I'm Mr. Ness\nHey here, I'm Raheim and you're just so fresh\nThe Kidd Creole\nAnd I'm Cowboy\nAnd Grandmaster Flash is yours to enjoy\n\nFresh! sock, sock it to yah baby to sock it to me, sock it, sock it to yah (x2)\n\nFresh!\nDon't you know I love you girl\nFresh!\nBaby my love is strong, its gettin stronger hah\nFresh!\nAnd I want you for my lady!\nFresh!\nDon't you really turn me on!\n\nYeaa ho!\n\nAh ahh\nDon't you see that girl\nYea, yea, yea\n(Gorilla Noises)\n\nCome on everybody, rock with me one time, everybody come on!\nJust throw your hands in the air, and wave them from right to left\nAnd if you want to do your fast grip, pass the test\nEverybody sayin get Fresh (Get fresh!)\nGet fresh! (Get Fresh!)\n\nAnd ya don't stop\nI say what's that word when you want the loot (Juice! Juice!) x 2\n\nEverybody if you love your mother! (If you love your mother)\nIf you really really really really love your mother!\n\nJump! x 4\nJump (jump)\nJump (jump)\nJump (jump)\nJump (jump)\n\nAyeee, say I love my mother! (I love my mother!)\n\nFresh!\nSock it to me, so I can sock it to yah\nBaby sock it to me, so I can sock it to yah\n\nFresh!\nSock it to me, so I can sock it to yah\nBaby sock it to me, so I can sock it to yah\n\nFresh!\nSock it to me, so I can sock it to yah\nBaby sock it to me, so I can sock it to yah\n\nFresh! Fresh!\nFresh! x 4\nFresh!\n\nSock it to me, so I can sock it to yah!\nGrandmaster Flash! (On the wheels of steel!)\nFresh!\nSock it to me, so I can sock it to yah!\nThe furious five got a lot of appeal!\nFresh!\nSock it to me, so I can sock it to yah!\nYoung ladies in the place, I know you want to get -\nFresh!\n\nFresh! Fresh!\nFresh! x 4\n\nHey don't you know that, she's fresh!"}, {"song": "Yo Flash! This time cut it mellow!\n\nHey teacher!\n-What?\n-Talk to me!\n-About what?\n-Peace!\n-There is no peace!\n-Why?\n-Who wants to know?\n-We do!\n-Cause men love money!\n-Why?\n-Greed!\n-Why not share?\n-Hell no!\n-Why?\n-Why not?\n-Cause to share shows that you care for ev'rybody !\n\n[Hook]\nIt's a shame that all people won't stick together\nDon't they know that deep inside we need each other?\nThere are places in our world, where kids are starving\nDon't you know they should not starve, cause they're the future!\n\n[Verse2]\n-Hey, preacher!\n-What?\n-Talk to me!\n-About what?\n-Hope!\n-There is no hope!\n-Why?\n-Who wants to know?\n-We do!\n-Cause men are greedy!\n-Why?\n-Money !\n-Why not share?\n-I know\n-Why?\n-Why not?\n-Cause to share shows that you care for evr'ybodey!\n\n[Hook]\nIt's a shame that men at war won't stop the fighting\nDon't you know they should not fight, cause they are dying!\nThere are places in our world, where bombs are dropping\nEven though they know it's wrong, they'll never stop it!\n\nIt's a shame. It's a shame\nIt's a shame. It's a shame\nIt's a dirty, dirty world!"}, {"song": "As I think of you I hear, precious moments crystal clear, lying in my mind\nI see birds in paradise, cherry blossoms and moonlight, you're the joy of all mankind\n\nThat's why (That's why). When we dream of you (Dreamin')\nWe believe anything that you see\n\nThat's why (That's why). It's because of you (Of you)\nWe would like your dreams (My dreams). Turn to reality (Reality)\n\nTaking walks in the park, getting closer to your heart, is all I want to do (All I want to do)\nSomeone sure likes you up above, because you're living the life we love, and you know it's true (You know it, you know it)\n\nWhoa Stevie, that's why (That's why). When we dream of you (Dreamin')\nWe believe anything that you see\n\nWhoa, whoa, whoa, that's why (That's why). It's because of you (Of you)\nWe would like your dreams (Our dreams). Turn to reality (Reality)\n\nDreamin' (Dreamin) is so mellow (Mellow), when I (Dreamin' about you) about you (Stevie), Dream about you\nDreamin' (Dreamin) is so mellow (Mellow), when I dream about you Stevie, (When we dream about you, yeah)\n\nHey Flash\nYo wassup, Ness?\nDo you think we'll ever meet Stevie?\nI hope so man. Don't worry fellas, sooner or later, sooner or later\n\nTaking walks in the park, getting closer to your heart, is all we want to do (All we want to do)\nSomeone sure likes you up above, because you're living the life we love, and you know it's true (You know it, you know it)\n\nStevie, Stevie, that's why (That's why). When we dream of you (Dreamin')\nWe believe anything that you see\n\nWhoa, whoa, whoa, that's why (That's why). It's because of you (Of you)\nWe would like your dreams (Our dreams). Turn to reality (Reality)\n\n(Stevie. You make me wonder. I dream about you Stevie. Dreamin' about you)\n(Stevie. You make me wonder. I dream about you Stevie. Dreamin' about you)\nWhen I dream about you\n(Stevie.) Awwhow, Stevie, Stevie, Stevie, man. (You make me wonder)\n(I dream about you Stevie. Dreamin' about you). When I dream about you\n\n(Stevie.) Ooooohoooo, ooh, whoa, whoa, whoa, no, oh.. (You make me wonder)\n(I dream about you Stevie. Dreamin' about you). When I dream about you, Stevie\n\n(Stevie. You make me wonder.)\nIt's all about you, it's all about you! You, you, ooh, whoa\n(I dream about you Stevie. Dreamin' about you)\nYooooooohh, ooooh, ooooh\n\n(Dreamin')\nBun din din din din din din din dun dun\n(Dreamin')\nBun din duga duga bun dun a doo doo doo doo\n(Dreamin')\n(Dreamin')\n(Dreamin')\n(Dreamin')\nWoahoa! Just dreamin' about you, just thinkin' about dreamin'\n(Dreamin')\n(Dreamin')\nThinkin' about you Steeeevayy"}, {"song": "Sha-na-na\n\nIntroducin’ the crew ya' got to see to believe\nWe’re one, two, three, four, five MC’s\nI’m Melle Mel and I rock it so well\nAnd I’m Mr.Ness because I rocks the best\nI'm Rahiem hah, in all the ladies’ dreams\nAnd I’m Cowboy to make ya jump for joy\nI’m Creole, solid gold\nThe Kid Creole, playin’ the role\n\nDig this\nWe’re The Furious Five plus Grandmaster Flash\nGivin’ you a blast and show ’nuff class\nSo to prove to ya all, we’re second to none\nWe’re gonna make five MCs sound like one\nYa gotta dip with the dive\nGet so socialize\nClean out your ears\nAnd open your eyes\nAnd then you pay at the door, as a donation\nTo hear the best sounds in creation\nHe’s a disco dream of a mean machine\nAnd when it comes to size, ya see what we mean\n\nYa see his name is not found in the hall of fame\nBut he’ll shock and amaze and make ya feel shame\nHe takes a lime from a lemon\nFrom a lemon to a lime\nHe cuts the beat in half the time\nAnd as sure as 3 times 2 is 6\nYou’ll say flash is the king of the quick mix\nWe’re five MC’s and we’re on our own\nAnd we’re the most well known on the microphone\nAnd we throw down hard and we aim to please\nWith finesse to impress all the young ladies\nWe got rhymes galore and that’s a fact\nAnd the satisfaction’s guaranteed to cause a heart attack\nWe are the best as you can see\nSo eliminate the possibility\nThat to be an E-M-C-E-E\nIs not a threat to society\nI say step by step\nStride by stride\nI know the fly young lady would like to ride\nIn my Mercedes, young lady\nIn my Mercedes, young lady\nIf my Mercedes break down and dog my grill\nI will ahh, drive up in a new Seville\nIf my Seville break down, I take it on back\nI will ahh, dog my grill in a new Cadillac\nMy Cadillac break down, i'm just too much\nI will ahh, shock your mind in a new star Stutz\nAnd if a Stutz break down, I make another choice\nI will ahh, dog my grill in a new Rolls Royce\nAnd if a Royce break down, I’ll be out in the rain\nAnd then forget it, forget it, forget it, forget it, forget it\nHuh, take the train\nTake the train, take the train\n\nCan’t, won’t, don’t stop rockin’ to the rhythm\nCause I get down, cause I get down, cause I get down"}, {"song": "Young ladies who don’t know my name\nAnd you fellas who don’t know my game, huh\nYes I’m called the Prince of Soul\nBut others call me the Kid Creole\nThe MC delight, young ladies bite\nWhen I’m on the mic I rock the house right\nI’m the dedicated prince, heart of solid gold\nRockin to the rhythm while I’m playin’ the roll\nA cool calm custom of the master plan\nIt takes a sucker’s man to try to jump my hand\nAnd the things I do, what I say\nAffect a lot of people in the strangest way\nMakes them clap their hands and say \"all right\"\nIt's Creole to the broad daylight\nMister Ness, my mellow\nCome and get some, cause we’re number 1\n\nSo go on, go on with your bad self\nAnd let Flash just do the rest\nFurious Five is gonna turn it out\nSo young ladies if you think ya heard\nYou heard the best rap, you heard the best word\nWell yes it’s true that we gotta fuss\nBecause it can’t be the best unless it came from us\nThere’s five of us and we take no stuff\nWe coming through the city, we coming too rough\nWe number one ain’t nothin’ you can do\nAnd if you wanna get down we’ll rock you too\nSo get down, get down, get down, get down\nCome on Cowboy get down\n\nYes yes, y’all, ya don’t stop\nC’mon fly girls, I wanna' hit the top\n‘Cause I’m the C-O-W-B-O-Y\nWhy the man so bad that ya can’t deny\nYou better watch your woman cause I’ll tell you why\nCause I’m Cowboy, I might give her a try\nThey call me Keith Keith\nThe young ladies’ relief\nKnow as the man of romance to make you dance\nCan any of you ladies stand a chance\nI’m cowboy and I’m shockin’ the house, ya see\nYa' say 1, 2, 1 more is 3\nAnd Melle Mel rock the mic so viciously"}, {"song": "Ah, to the, hip hop, the hip hop, and don’t stop\nDon’t stop that body rock\nJust get up out your seat, and get ready to clap\nBecause Melle Mel just about ready to rap\nAnd ever since I talked at my very first party\nI felt I could make myself somebody\nIt was something in my heart from the very start\nI could see myself at the top of the chart\nRappin’ on the mic, makin’ cold cold cash\nWith a jock spinnin’ for me called D.J. Flash\nSignin’ autographs for the the young and old\nWearin’ big time silver and solid gold\nMy name on the radio and in the magazine\nMy picture on the TV screen\nIt ain’t like that yet, but huh you’ll see\nI got potential and you will agree\nI’m comin’ up and I got a step above the rest\nCause I’m using that ladder they call success\nYou say  1-23-45-67\nRap it like hell and make it sound like heaven\n7-65-43-21 c’mon Rahiem come and get some\n\nI said my name is Rahiem\nI’m the son of a queen\nI’m the king of my castle, don’t gimme no hassle\nI’m a one of a kind, the man supreme\nI know I’m in all of the ladies’ dreams\nI’m the R-A-H and the I-E-M\nI put a wiggle in your butt if ya tell me when\nI’m the son of a gun with the hell of a fire\nNow gather mess around i'll take ya all higher\nMy clientele climb the great big boost\nI’m the give it up and turn it loose, huh\nAll you fly girls that don’t know my game\nCome up and talk to me and we’ll tell ya all the same\nWhen ya wake up in the night in a hell of a dream\nYou know ya been possessed by the voice of Rahiem\nIn all the ladies’ dreams\n\nAnd makin’ more currency than any MC\nThis dream will turn to reality\nAnd Melle Mel, bang, rock the house, pow\nC’mon, help me turn it out\nMr. Ness, bang, rock the house, pow\nC’mon, help me turn it out\nRahiem, bang, rock the house, pow\nC’mon, help me turn it out\nCowboy, bang, rock the house, pow\nC’mon, help me turn it out\nCreole, bang, rock the house, pow\nC’mon, help me turn it out\nD.J. Flash, bang, rock the house, pow\nC’mon, help me turn it out\nEverybody, bang\nHit it\n\nMelle Mel, bang, rock the house, pow\nC’mon, help me turn it out\nMr. Ness, bang, rock the house, pow\nC’mon, help me turn it out\nRahiem, bang, rock the house, pow\nC’mon, help me turn it out\nCowboy, bang, rock the house, pow\nC’mon, help me turn it out\nCreole, bang, rock the house, pow\nC’mon, help me turn it out\nD.J. Flash, bang…"}, {"song": "It's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\n\nBroken glass everywhere\nPeople pissing on the stairs, you know they just don't care\nI can't take the smell, can't take the noise\nGot no money to move out, I guess I got no choice\n\nRats in the front room, roaches in the back\nJunkies in the alley with a baseball bat\nI tried to get away, but I couldn't get far\n'Cause the man with the tow-truck repossessed my car\n\nDon't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\nHa-ha-ha-ha\n\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\n\nStanding on the front stoop, hangin out the window\nWatching all the cars go by, roaring as the breezes blow\nA crazy lady, livin in a bag\nEating out of garbage piles, used to be a fag-hag\n\nSaid, she danced the tango, skipped the light fandango\nWas circon princess, seemed to lost her senses\nDown at the peepshow, watching all the creeps\nSo she can tell the stories to the girls back home\n\nShe went to the city and got Social Security\nShe had to get a pimp, she couldn't make it on her own\n\nDon't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\nHa-ha-ha-ha\n\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\n\nMy brothers doin' bad, stole my mothers TV\nSays, she watches to much, is just not healthy\n\"All my children\" in the daytime, \"Dallas\" at night\nCan't even see the game or the Sugar Ray fight\n\nThe bill collectors, they ring my phone\nAnd scare my wife when I'm not home\nGot a bum education, double-digit inflation\nCan't take the train to the job, there's a strike at the station\n\nNeon king kong standin' on my back\nCan't stop to turn around, broke my sacroiliac\nA midrange migraine, cancered membrane\nSometimes I think I'm going insane, I swear I might hijack a plane\n\nDon't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\n\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under"}, {"song": "My son said, \"daddy, I don't wanna go to school\nCause the teacher's a jerk, he must think I'm a fool\nAnd all the kids smoke reefer, I think it'd be cheaper\nIf I just got a job, learned to be a street sweeper\n\nI dance to the beat, shuffle my feet\nWear a shirt and tie and run with the creeps\n'Cause it's all about money, ain't a damn thing funny\nYou got to have a con in this land of milk and honey\n\nThey pushed that girl in front of the train\nTook her to the doctor, sewed the arm on again\nStabbed that man right in his heart\nGave him a transplant for a brand new start\n\nI can't walk through the park, 'cause it's crazy after the dark\nKeep my hand on the gun, 'cause they got me on the run\nI feel like an outlaw, broke my last glass jaw\nHear them say you want some more, livin on a seesaw\n\nDon't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\n\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\n\nA child is born, with no state of mind\nBlind to the ways of mankind\nGod is smiling on you, but he's frowning too\nBecause only God knows what you go through\n\nYou grow in the ghetto, living second rate\nAnd your eyes will sing a song of deep hate\nThe place that you play and where you stay\nLooks like one great big alley way\n\nYou'll admire all the number book takers\nThugs, pimps and pushers and the big money makers\nDriving big cars, spending twenties and tens\nAnd you wanna grow up to be just like them, huh\n\nSmugglers, scramblers, burglars, gamblers\nPickpockets, peddlers and even panhandlers\nYou say I'm cool, I'm no fool\nBut then you wind up dropping out of high school\n\nNow you're unemployed, all null 'n void\nWalking 'round like you're Pretty Boy Floyd\nTurned stickup kid, look what you done did\nGot send up for a eight year bid\n\nNow your manhood is took and you're a may tag\nSpend the next two years as an undercover fag\nBeing used and abused and served like hell\nTill one day you was found hung dead in a cell\n\nIt was plain to see that your life was lost\nYou was cold and your body swung back and forth\nBut now your eyes sing the sad, sad song\nOf how you lived so fast and died so young\n\nSo, don't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\n\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nHuh-huh-huh-huh-huh-huh\nIt's like a jungle sometimes, it makes me wonder\nHow I keep from going under\nHuh-huh-huh-huh-huh-huh\n\nYo Mel, you see that girl there?\nYo, that sounded like Cowboy man\nCool\nYo, what's up tmoney?\nYo, where's Cooly and Raheim?\nThey is downstairs cooling out\nSo what's up for tonight y'all?\nWe could go down to Phoenix\nWe could go check out \"Junebug\" man\nHey yo, you know that girl Betty?\nYeah man\nCome on, come all man\nNot like it\nThat's what I heard man\nWhat's this happening, what's this?\nWhat's going on?\nFreeze\nDon't nobody move or nothing\nY'all know what this is (What's happened?)\nGet 'em up, get 'em up (What?)\nOh man, we're (Right in there) Grandmaster Flash and the Furious Five\nWhat is that, a gang?\nNo\nShut up\nI don't wanna hear your mouth\nShut up\nOfficer, officer, what is the problem?\nYou the problem\nHey, you ain't gotta push me man\nGet in the car, get in the car\nGet in the god...\nI said, \"Get in the car\""}, {"song": "* organized by Rhino comp. for convenience regardless of original\n\nFun, baby\n\nFreeze! Rock-Rock-Rock-Rock-Rock-Rock-Rock-Rock!\n\n(High... High... High... High...) Rrrrrrrrruh!\n\nBass!\n\n(Oooh White...White) 3X\n\nVerse One:\n(Ooooh...White Lines) Vision dreams of passion\n\n(Blowin through my mind) And all the while I think of you\n\n(Pipe cries) A very strange reaction\n\n(For us to unwind) The more I see the more I do\n\n(Something like a phenomenon) Baby\n\n(Tellin your body to come along, but white lines...blow away)\n\n(Blow! Rock it! Blow!)\n\nTicket to ride white line highway\n\nTell all your friends, they can go my way\n\nPay your toll, sell your soul\n\nPound for pound costs more than gold\n\nThe longer you stay the more you pay\n\nMy white lines go a long way\n\nEither up your nose or through your vein\n\nWith nothin to gain except killin your brain\n\n(Freeze! Rock!) 4X\n\n(Blow!)\n\n(High...) Higher, baby\n\n(High...) Get higher, baby!\n\n(High...) Get higher, baby!\n\nAnd don't ever come down! (Freebase!)\n\nVerse Two:\nOrang dang diggedy dang di-dang\n\nOrang dang diggedy dang di-dang\n\nOrang dang diggedy dang di-dang\n\nDiggedy dang di-dang diggedy dang di-dang\n\n(Pipe line...) Pure as the driven snow\n\n(Connected to my mind) And now I'm havin fun, baby!\n\n(Pipe cries) It's gettin kinda low\n\n(Cause it makes you feel so nice) I need some one-on-one, baby\n\n(Don't let it blow your mind away) Baby\n\n(And go into your little hideaway cause white lines...blow away)\n\n(Blow! Rock it! Blow!)\n\nA million magic crystals, painted pure and white\n\nA multi-million dollars almost over night\n\nTwice as sweet as sugar, twice as bitter as salt\n\nAnd if you get hooked, baby, it's nobody else's fault, so don't do it!"}, {"song": "(Freeze! Rock!) 4X\n\nRrrrah! (Blow!)\n\n(High...) Higher, baby\n\n(High...) Get higher, baby!\n\n(High...) Get higher, baby!\n\nAnd don't ever come down! (Freebase!)\n\nVerse Three:\n(Don't get too high) Don't you get too high, baby\n\n(Turns you on) You really turn me on and on!\n\n(Cause you gotta come down) My temperature is risin\n\n(When the thrill is gone) No, I don't want you to go!\n\nA street kid gets arrested, gonna do some time\n\nHe got out three years from now just to commit more crime\n\nA businessman is caught with 24 kilos\n\nHe's out on bail, and out of jail and that's the way it goes, rrrruh!\n\n(Cane!)\n\n(Sugar! Cane!) 2X\n\nAthletes reject it, governors correct it\n\nGangsters thugs and smugglers are thoroughly respected\n\nThe money gets divided, the women get excited\n\nNow I'm broke and it's no joke it's hard as hell to fight it, don't buy it!\n\n(Freeze!) Huh-huh huh huh! (Rock!)\n\n(Freeze! Rock!) x3\n\nRrrah! (Blow!)\n\n(High...) Get higher, baby\n\n(High...) Get higher, girl!\n\n(High...) Get higher, baby!\n\n(High...) C'mon! Rrrrrah!!\n\nVerse Four:\n(White Lines) Vision dreams of passion\n\n(Blowin through my mind) And all the while I think of you\n\n(Pipe cries) A very strange reaction\n\n(For us to unwind) The more I see the more I do\n\n(Something like a phenomenon) Baby\n\n(Tellin your body to come along, but white lines...blow away...)\n\nLittle Jack Horner sittin on the corner with no shoes and clothes\n\nThis ain't funny but he took his money and sniffed it up his nose!\n\nDealer:Hey, man. You wanna cop some blow?\n\nJunkie:Sure, watcha got? Dust, flakes or rocks?\n\nDealer:I got China White, Mother of Pearl...I reflect what you need\n\nJunkie:Well yeah, well let me check it out, man. Just let me get a freeze\n\nDealer:Go ahead, man. The stuff I got should kill ya...\n\nJunkie:Yeah, man. Th-That's...that's raw...huuuhhhh...\n\n[Don't do it, baby...]\n\n(Freeze!) A-huh huh huh! (Rock!)\n\nFreeze! Rock! (repeat to fade)"}, {"song": "Ladies and gentlemen\nIt's now the time\nFor the Grandmaster Flash and the Furious Five MC's!!\n\n(said at first in almost a whisper, getting gradually louder)\nWe're coming, we're coming, we're coming (x3)\nWE'RE HERE!\n\nOoooh! Haha, woooohh!\n\nAiyyy mami I wanna get nasty wit you baby, ahahahaha\nAiyyy, tu eta por llamaseta mi amor, Linda, ahahahaha!\n\nWe wanna rock, YOU!\nWe're the kings of swing\nAnd we're chosen to rule\nThe deans of clean inside the cool school\nWe're the chiefs of relief\nContained by wild beasts\nThe finesse of the West, the masterpiece of the East\nHah, the boss of course\nAs the lord of our fort\nThe ones with the platinum vocal chords\nWe're the science of desire\nWith a magical mic\nThe monarch of the dark in the night alright\nWe advertise\nAnd specialize\nIn the exercise and we'll energize\nThe young ladies thighs\nCause all the fly guys\nNature's to rise right before their eyes\nWe're the earl of the world\nAnd the air of flair\nThe duke of dare\nThe mayor of debonaire\nGot fine, drink wine\nCan dance and dine\nGot a first class female oh so fine\n\n(Chorus)\nHey baby, whatever you doin right girl\nI just want you to always be easy, and keep on shakin that thing\nAnd I want you - swingin it swingin it swingin\nTell me how now\nLike dy-na-mite before it blows\nWho needs a band when the beat just goes - boom!\n\nHe's Grandmaster, he cuts faster\nWe're the Furious, serious, and ever so mysterious\nFive that's rockin the house\n\nAnd everybody say PLAY (PLAY)\nSay PLAY (PLAY) well OK!\n\nHo! Everybody c'mon!\nWoo! Now now! Uhh!\n\nPeople call me crazy, people call me sneak\nJust because I'm nasty, they call me a freak, hehe\nI am coming over, to your house tonight\nI promise to you baby, that I'll do you right, I'm nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha (shake your booty)\nI wantcha, I wantcha, I wantcha, I wantcha (we want to rock you)\nJust let us rock, you!\n\nWatch your girl and watch your wife\nI got the kiss of death, to touch your life\nCause I am the man they call Scorpio\nI like fly girls that don't say no\n\nHey girl, grab my hand, hold on tight\nDon't you worry bout a thing Raheem'll do you right\nI'm a mint that's fresh huh, a woman's pet\nThere ain't a thing in the world that I can't get\n\nIn the history books or the picture show\nIt's the golden voice on your radio\nI'm the rapper never printed voice is solid gold\nI'm playin the role, they call me Kid Creole"}, {"song": "And I'm the, the Romeo, of the nasty show\nAll the ladies in the place, to my house we go\nFreakin in the den just to make you move\nCause I'm Cowboy, and I got the groove\n\nAs DJ Flash, cuts so mean\nThat he wanna know your favorite jean\nIs it Jordache? (NO!) Gloria Vanderbilt? (NO!)\nMaybe it's Sassoon? (NO!) How about Sergio? (I DON'T CARE!)\nCould it be Calvin Klein? (NO!) Then what is it? ([?])\n\nBack to the bridge y'all\n\n(Chorus)\nEverybody, shake your body\nKeep movin and groovin and screamin and shoutin\nAnd helpin us turn it out\n\nIs everybody sayin play? (PLAY!)\nSay play! (PLAY!) Well OK!\n\nAlright, woo!\nEverybody get up!\nOooooeee, yeah!\n\nPeople say it's dirty, people say it's wrong\nThey talk about our music, like it's a nasty song\nIt's nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha!\nJust let us rock, you!\n\nGot waterbed sets in my limousine\nAnd everytime I'm seen I got to be clean\nI tour around the world, to make the people dance\nAnd here's a little message for the ladies in France\nHuh huh, je m'appelle, Melle Mel\nAh donnez-moi la magique [?], mademoiselle\nDonnez-moi cinq, donnez-moi six\nDonnez moi huit, neuf, dix\n\nI'm seein this girl that I just adore\nI'm seein this girl that what I never saw before\nThe way she was swaying and doing the swing\nI had to let her know just about my thing\nI'm the M, R, N E-Double S\nCome on, ah fly girl, and put me to a test\nAnd I'll rock you, until you give me the rest\nI keep on it, until you start to fess\n\nRaheem, in your life, what more can you ask\nI bet you can't think of a greater task\nI make my light shine on your cloudy days\nYou can surf if you want to, on my waves\nI caress your soft body on those mellow nights\nA continuous thing, to the morning light\nIt's reality, it's not a dream\nIt's nothing less than the best when it's from Raheem\n\nNow it's my turn so understand\nThat I'm the Kid Creole, and I'm a ladies man\nI don't, have a lot of women hangin on my steez\nOnly one fine lady that you better believe\nI say Annette's her name, and that's the truth\nI give a lot of things up, before I turn her loose\nIt's just her, and that's simple and plain\nAnd that's the only way I run my game\n\nWell I'ma, Cowboy and I'm the real McCoy\nI'm chocolate all over like an Almond Joy\nBowlegged cool brother and you will agree\nOn top of the world for the ladies to see\nGonna hip gonna hop gonna rock the spot\nGonna make everybody wanna rock rock rock\nGonna do it to the East, wanna do it to the West\nGonna make you relax right upon your chest\n\nGrandmaster Flash, is willing and able\nHe's the king of the cuts on two turntables\nHe's the GRAND, GRAND, the master man\nHe's so nice with his hands he don't need no band\nRocks 45's, and 33's\nRocks boys men women and young ladies\nHe can slice so precise it's almost fun\nAnd he makes better love than a mick makes money\n\nSlick Rick, Slick Rick, Slick Rick, Slick Rick\nSlick Rick, Slick Rick (ha ha hah hah hah), hooooooo-ho!!\nOwwwwwwwwwwwwwwww!\n\n(lots of varied conversation to the end, at least one mention of Bob Marley)"}, {"song": "(Male) He Sal\n(Male) Yeah Mambo\n(Female) Hey everybody, we've got all the time\n[?]\n(Female) Disco fever\nSurrender, get off the mike, and stay outta sight\nWe rock the house right and remember, we are the lovers\nWe're under cover\nThere are no others\nSTOP\n(Female) Go on, do it baby, rock the house\n[?] (Male) You like my hand cuffs?\n(Male) Hey man, what's goin' on? (Hey)\n(Male) Yeah you know he's whipped to\n[?]\nWe're the lovers\n[?]\n(Female) Well you know me, cowboys ain't [?]\n(Hey)\n(Male) Shake that thing girl\nGrandmaster Flash, HEY you\nHey, what's wrong?\nYou alright baby?\nHello girlfriend (I just gotta have that girl for the next dance) isn't that??????????\nWe wanna see you dance\nWe wanna hear you shout\nWe wanna make you shake your pants and help us turn it out\nWe wanna see you dance\nWe wanna hear you shout\nWe wanna make you shake your pants and help us turn it out\nEverybody say, \"Yeah\" (Yeah)\nSay, \"Yeah, yeah\" (Yeah, yeah)\nYeah, yeah, yeah, yeah\nI wanna, I wanna, I wanna hear the beat box\nYeah, yeah, yeah, yeah\nBeat box, yeah\nBeat box, yeah\nA'ight, c'mon Flash (Ah yeah, c'mon Flash, bring us [?]), turn it up bro\nHey girl [?] (USA)\nListen, listen to this\nHey girl, come here\nListen [?], listen to this\nCome here girl\nListen to this (Listen to this)\nListen to this (Listen to this)\nListen, listen to this\nListen to this\nListen to this (Listen to this)\nListen to this (Listen to this)\nListen, listen to this\nListen to this\nFor all you MC's in a crew\nI said \"For all you MC's in a crew\"\nI said \"For all you MC's in a crew\"\nThis is what we want ya'll to do\nShoo, shoo, shoo, shoo, shoo\nSo you wanna be a MC?\nShoo, shoo, shoo, shoo, shoo\nWell we've got something for ya\nShoo, shoo, shoo, shoo, shoo\nStep back boy, you ain't down\nShoo, shoo, shoo, shoo, shoo\nYa'll standing on shaky ground\nShoo, shoo, shoo, shoo, shoo\nWe want you all to understand\nShoo, shoo, shoo, shoo, shoo\nWe're the furious lovers, my man\nWe came here tonight to kick off our station (You know that)\nWe're six stars shining bright (That's right)\nThe furious love sensation\nSo ladies move your feet\nCome on and boogie to the beat\nBecause the furious lovers are on the move and no one can compete\nSo what you better do is\nShoo, shoo, shoo, shoo, shoo\nShoo, shoo, shoo, shoo, shoo\nAnd that means you\nI guess there's a party going on\n(Can) Can keep from getting on the dance floor\nThe music sounds so sweet (So sweet)\nMake me wanna get up out my seat\nJust a bit tired but I'm (Still) still getting down (Getting down)\nWith ten shows to do, I said, \"The lovers on the microphone\"\nFunky sound\nCan't, won't, don't stop, rocking to the rhythm\n'Cause I get down even when I'm walking in the spot\nWatching the girl get high (Rock, rockin' the spot)\nWhen Flash is on the new beat box\nCould've, would've, should stop rocking to the rhythm\n'Cause I, get down, when Flash is on the beat box\n(Male) He Mel\n(Female) Shake that thing, that's it, right\n(Male) Oh, yeah, rock all night\n[?]\n(Male) Hey, hey girl, can you??? approve these lovers???\nSay, The place was really jumping to the, (Freaky) to the rhythm of the beat box\nThe girls were so divine (So Fine)\nBaby, you blew my mind\nI saw this lady and she really made my day\nEvery time I asked to sit and talk she would turn around and say\n\"If I should've, would've, should you know, I can't, won't, don't stop rocking to the rhythm\n'Cause I, get down, 'Cause I, get down, 'Cause I, get down\n'Cause I, get down, when Flash is on the beat box\"\nYes, I see you girl\nI'm telling you now, now"}, {"song": "We wanna see you dance\nWe wanna hear you shout\nWe wanna make you shake your pants and help us turn it out\nWe wanna see you dance\nWe wanna hear you shout\nWe wanna make you shake your pants and help us turn it out\nDo you wanna\nBreak\n\nFlash is on the beatbox\nGoing\nFlash is on the beatbox\nGoing\nFlash is on the beatbox\nGoing\nFlash is on the beatbox\nGoing\n\nThe bass is with the beatbox\nPlaying\nThe bass is with the beatbox\nPlaying\nThe bass is with the beatbox\nPlaying\nThe bass is with the beatbox\nPlaying"}, {"song": "When you're hot you're hot, when you're not, you're not\nWhen you're hot you're hot, when you're not, you can give it away\nWhen you're hot you're hot, when you're not, you're not\nWhen you're hot you're hot, when you're not, you can give it away\n\nThere was a time when i had everything\nFancy cars, mink clothes and diamond rings\nI had everything a man could want\nMoney, friends and women to flaunt\nBut now that all my money is spent\nI can't [?] all my friends and women away\n\nWhen you're hot you're hot, when you're not, you're not\nWhen you're hot you're hot, when you're not, you can give it away\n\nWhen you're hot you're hot, when you're not, you're not\nWhen you're hot you're hot, when you're not, you can give it away\n\nWhen you're hot you're hot, when you're not, you're not\nWhen you're hot you're hot, when you're not, you can give it away"}, {"song": "You have been so good to me\nAnd you're very very wonderful\nLovely and beautiful to me\nTo me\n\nThe start of life is what I'm after\nWhat does it take to capture\nAll the things\n\n'Cause you're very very wonderful, yes you are\nLovely and beautiful to me, to me yeah\nYes, you're very very wonderful, yes you are lord\nLovely and beautiful to me, to me\n\n[Spoken]\nYou know, a lot of people don't realize it, but\nOur lord, Jesus Christ, is the father\nAnd everyone might not do the right thing in the father's eyes\nBut our father's very forgiving, and he loves everyone\nAnd in this crazy mixed-up world of ours\nWhere things never seem to go right\nAs times goes on, we will have to surpass and overcome all these things\nWhich are negative and unjust\nAnd I know that we will, and so does the father\nGod bless you all\n\nLovely and beautiful, to me\nYes, you're very very wonderful\nLove, to me\nLove ya, love ya, love ya, love ya, love ya, love ya, love ya, love ya, love ya\n\n'Cause, very wonderful\nLovely and beautiful\nTo me, yes you are\nTo me, wooah yes, oh father"}, {"song": "Just get off the wall, let's have a ball\nThe 70's are gone, it's the 80's y'all\nGrab a fly girl by the hand and ask her to dance\nC'mon fellas don't be shy, just take a chance\nYou'll never know it might lead to romance\nCause the beat is cold stompin', it'll put you in a trance\nYou're so hypnotized that you stop and stare\nI'm steppin out of this cuase I'm not with that there!\nGet on the dancefloor c'mon take a stand\nAll the girlies in the place wanna dance with you my man\nGet on the floor and work it out if you can\nHere's my ulterior motive, I mean my game plan\nIt doesn't hurt to flirt, just go ahead and chase the skirt\nYou can't help it, it's your line of work\nTo get women on the floor\nIt's you they adore, you might as well\n\nChorus:\nYou know what time it is\nHang on party people cause here we go\nWe're gonna cold take the party to another plateau\nBut in order for us to achieve a new height\nWe wanna hear flash cut the beat up, ain't that right\nWhile flash is choppin the mix like an ax on wood\nYou gotta dance cuase the beat is finger lickin good\nThrow your hands above your head and reach for a cloud\nAnd if there's anything you want to say, say it loud\nI know the bass is pumpin' so hard the lights are dim\nAnd y'all are lettin me know we're cold blowin the rim\nThat's right , you're being served, served with a smile\nAnd homeboy you don't like it, we can step in the aisle\nJust show no shame, you know it's only right\nAnd if there's anything you want to get off, get it off tonight\n\nChorus\n\nA simple puch of the fade, a little flex of the wrist\nFlash whoopin the mix while I'm kickin the gift\nYo like a double edge razor, the boy is nice\nWhen he cuts, give him room, or you might get sliced\nHe's too cold to hold, to hot to be stopped\nThis jam that we got is good to the last drop\nWeather you like it or not, we rock\nYo since the day we emerged, have you heard\nThat it was all about a party and yo' this is word\nThis party's rated ns for no suckers allowed\nThat's the scoop, hear me troop\nSo don't you come here actin' wild\nBut as you know there's always one in the crowd\nYou wanna party, then act like you know, can you dig it\nAnd if you came to get ill, forget it, I ain't with it\n\nChorus"}, {"song": "* organized by Rhino comp. for convenience regardless of original\n\nFun, baby\n\nFreeze! Rock-Rock-Rock-Rock-Rock-Rock-Rock-Rock!\n\n(High... High... High... High...) Rrrrrrrrruh!\n\nBass!\n\n(Oooh White...White) 3X\n\nVerse One:\n(Ooooh...White Lines) Vision dreams of passion\n\n(Blowin through my mind) And all the while I think of you\n\n(Pipe cries) A very strange reaction\n\n(For us to unwind) The more I see the more I do\n\n(Something like a phenomenon) Baby\n\n(Tellin your body to come along, but white lines...blow away)\n\n(Blow! Rock it! Blow!)\n\nTicket to ride white line highway\n\nTell all your friends, they can go my way\n\nPay your toll, sell your soul\n\nPound for pound costs more than gold\n\nThe longer you stay the more you pay\n\nMy white lines go a long way\n\nEither up your nose or through your vein\n\nWith nothin to gain except killin your brain\n\n(Freeze! Rock!) 4X\n\n(Blow!)\n\n(High...) Higher, baby\n\n(High...) Get higher, baby!\n\n(High...) Get higher, baby!\n\nAnd don't ever come down! (Freebase!)\n\nVerse Two:\nOrang dang diggedy dang di-dang\n\nOrang dang diggedy dang di-dang\n\nOrang dang diggedy dang di-dang\n\nDiggedy dang di-dang diggedy dang di-dang\n\n(Pipe line...) Pure as the driven snow\n\n(Connected to my mind) And now I'm havin fun, baby!\n\n(Pipe cries) It's gettin kinda low\n\n(Cause it makes you feel so nice) I need some one-on-one, baby\n\n(Don't let it blow your mind away) Baby\n\n(And go into your little hideaway cause white lines...blow away)\n\n(Blow! Rock it! Blow!)\n\nA million magic crystals, painted pure and white\n\nA multi-million dollars almost over night\n\nTwice as sweet as sugar, twice as bitter as salt\n\nAnd if you get hooked, baby, it's nobody else's fault, so don't do it!"}, {"song": "(Freeze! Rock!) 4X\n\nRrrrah! (Blow!)\n\n(High...) Higher, baby\n\n(High...) Get higher, baby!\n\n(High...) Get higher, baby!\n\nAnd don't ever come down! (Freebase!)\n\nVerse Three:\n(Don't get too high) Don't you get too high, baby\n\n(Turns you on) You really turn me on and on!\n\n(Cause you gotta come down) My temperature is risin\n\n(When the thrill is gone) No, I don't want you to go!\n\nA street kid gets arrested, gonna do some time\n\nHe got out three years from now just to commit more crime\n\nA businessman is caught with 24 kilos\n\nHe's out on bail, and out of jail and that's the way it goes, rrrruh!\n\n(Cane!)\n\n(Sugar! Cane!) 2X\n\nAthletes reject it, governors correct it\n\nGangsters thugs and smugglers are thoroughly respected\n\nThe money gets divided, the women get excited\n\nNow I'm broke and it's no joke it's hard as hell to fight it, don't buy it!\n\n(Freeze!) Huh-huh huh huh! (Rock!)\n\n(Freeze! Rock!) x3\n\nRrrah! (Blow!)\n\n(High...) Get higher, baby\n\n(High...) Get higher, girl!\n\n(High...) Get higher, baby!\n\n(High...) C'mon! Rrrrrah!!\n\nVerse Four:\n(White Lines) Vision dreams of passion\n\n(Blowin through my mind) And all the while I think of you\n\n(Pipe cries) A very strange reaction\n\n(For us to unwind) The more I see the more I do\n\n(Something like a phenomenon) Baby\n\n(Tellin your body to come along, but white lines...blow away...)\n\nLittle Jack Horner sittin on the corner with no shoes and clothes\n\nThis ain't funny but he took his money and sniffed it up his nose!\n\nDealer:Hey, man. You wanna cop some blow?\n\nJunkie:Sure, watcha got? Dust, flakes or rocks?\n\nDealer:I got China White, Mother of Pearl...I reflect what you need\n\nJunkie:Well yeah, well let me check it out, man. Just let me get a freeze\n\nDealer:Go ahead, man. The stuff I got should kill ya...\n\nJunkie:Yeah, man. Th-That's...that's raw...huuuhhhh...\n\n[Don't do it, baby...]\n\n(Freeze!) A-huh huh huh! (Rock!)\n\nFreeze! Rock! (repeat to fade)"}, {"song": "(Hook)\nWe're Grandmaster Flash!\nWe're giving you a blast of class! Huh!\nAnd if you wanna know why we're on top of the pile\nCuz we got style!\n\n(Verse 1)\nYves Saint Laurent, Pierre Cardin\nThe Chandlers, the Colbys, and the Carringtons\nStyles not Gucci or Louis Vuitton\nImported straight from the Bronx and my name's LaVon\n\nCreole with a few words I'd like to voice\nAnd I ? particular choice\nGot style and finesse and I'm sure you'll agree\nNobody ever never ever rhymes quite like me\n\n(Hook)\n\n(Verse 2)\nWell my name is Broadway and games I don't play\nFor me the mystical, the magical but you're okay\nThe young man supreme I got savoir faire\nAnd you can come into my world if you dare\n\nRaheim the lady dream is my claim to fame\nStrictly emphasizing I posses true game\nGot style all around me like drapes on a wall\nResponding to my slightest whim when I'm takin' a call\n\n(Hook)\n\n(scratches)\n\n(Hook)\n\n(Verse 3)\nHe's Larry-Love and if you have any doubt\nCome try your luck and he'll take you right out\nHe's making the moves others never thought of\nGrindin' up the floors in all the nightclubs\nThat want the Grandmaster Flash that everybody knows\nHe leaves a trail of destruction wherever he goes\nGotta style like a young jock's never seen\nDon't deny you're full of envy, boy your face is turning green!\n\n(scratches)\n\n(Hook)"}, {"song": "Ah, Scorpio\nShow no shame\nShake it baby\nHe is DJ Flash and he came here to give you a blast\nAnd we are the Furious Five and we're rocking, shocking all the way live\nShow no shame\nShake it\nShake it baby\nAh, show no shame\nDon't be shy girl\nShow no shame\nHigher baby\nHigher now\nHigher baby\nHigher now\nHigher baby\nBreak it down\nShow no shame now\nThrow your hands, way up high\nAnd everybody's gonna try to reach the sky\nBecause you can't stop, won't stop playing the game\nAnd I know that you can do it if you show no shame\nHey girl, don't be shy\nShake your body the way I, the way that I like it\nWith no shame girl\nThat's the way\nShake it baby\nTake me higher\nHigher\nHigher\nHigher\nHigher\nNow break it down\nDon't be shy girl\nNow switch\nMake a switch\nBiology power\nAh, make a switch\nHey Dune Bug, switch\n[?] Hey, trainee?, switch\nMake a switch\nMake a switch\nMake a switch\nMake a switch\nSwitch\nDon't be shy girl\nHigher\nHigher baby\nHigher now\nHigher\nHigher baby\nBreak it down\nAnd show no shame girl\n\nMister Nash who rocks the fest\nAnd Rhaheim who beliefs things\nAnd Cowboy is the real McCoy\nAnd Dell and master, cuts much faster\nAnd me and Rob, doing the job\nAnd Jigsaw is giving me more\nAnd Steve Jerome is the king of the throne\nAnd Merob is the place to be\nAnd Kid Creole is selling? goso?\nDon't be shy girl\nAh baby, break it down\nNow take me higher\n[?] Tricia?, and break it down\nAh take me higher now\nNow baby, break it down\nHigher\nHigher\nLower\nHigher\nLow baby\nHigher\nLower, higher, lower, higher, lower, higher"}, {"song": "[Hook]\nThis is for my niggas on the block, yo spazz out\nEverybody in the spot, yo spazz out!\nYou feminist cause it's hot you wanna spazz out!\nJust wild out to this cause we don't give a fuck\nMy thugs doin' biz, yo spazz out\nThem young niggas on the strip just spazz out\nYou on ya own, you wanna live just spazz out\nThen just wild out to this cause we don't give a fuck\n\n[Verse 1]\nWe rappers, we chrome witty type\nThis to my niggas blaze a fifty light\nWhat and get cha' high on\nYa shit is on dubs nigga, shit get cha' ride on\nWe gon' spazz out, get drunk to this\nFrom the top y'all know y'all can't fuck with this\nThe R-E double S with the Grand Puba\nPicture us stackin' down, shit we came too far\nWe done paid our dues, still in the game\nWhy these niggas actin' like they can't feel the pain\nMy thoughts is deep, Suburban slang up with heat\nTalk is cheap, just show me money, them big faces\nBeen down since RUN-DMC with big laces\nTapes, diamond nigga we bout to hit that\nHit it at the club all y'all hoes gon' bizack\nBig exec checks, bitch nothin' less\nAnd I pull on the strip with Jets, Harley nigga\n\n[Hook]\n\n[Verse 2]\nI'm a street nigga, load up my heat with hollow tips\nAcknowledge this, go against the grain and feel stiff rain\nWe big stings, stackin' our safes to capacity\nForce tragedies, a thug mentality\nTest my heart pumps blood\nWe can throw slugs or shoot the fifth, call me\nI'm all for it, I don't care bounce ya fair or where ya from\nWe can act dumb and leave niggas backs numb\nI wanna eat on some legal and shit\nBut I was born on some evil shit\nRidin' ways, my childhood is far from forgotten days\nSee moms locked away, that's why I hate cops today\nSo I cop the yay, lock the block, pumpin' trays\nIf I reach and shoot, believe that niggas lay\nBut I went through my trigger phase\nNow I want a bigger case\nFuck dippin' jakes now we sittin' great\n\n[Hook]\n\n[Verse 3]\nYo, it's a shame how these bitches wanna know if I'm holdin' a knot\nHaters on the block, gassin' us from holdin' a Glock\nAnd I'm looney too, Big K big way\nMy mental states I been through breakdown airway\nBottles or rat, nigga straight sleep with the fishes\nMy team is vicious, holla at the baddest bitches\nKnow what I got, hit the crib hot cold to rock\nSteamin' off the top then my soldiers box\nFlip the score, plot ways to hustle on tours\nSee these hit the pipe, fuck up they jaw\nI'm livin' ya rap, hot weight I'm triplin' that\nPack 22s, come on y'all I'm fuckin' with macks\nLaid back, spazz like I did five flat\nI'm in the biz, stressed blowin' bogies back-to-back\nYa know the click, Harley ya know he spit\nKnow we sick, one of the connected click yeah\n\n[Hook]"}, {"song": "Ladies and gentlemen\nIt's now the time\nFor the Grandmaster Flash and the Furious Five MC's!!\n\n(said at first in almost a whisper, getting gradually louder)\nWe're coming, we're coming, we're coming (x3)\nWE'RE HERE!\n\nOoooh! Haha, woooohh!\n\nAiyyy mami I wanna get nasty wit you baby, ahahahaha\nAiyyy, tu eta por llamaseta mi amor, Linda, ahahahaha!\n\nWe wanna rock, YOU!\nWe're the kings of swing\nAnd we're chosen to rule\nThe deans of clean inside the cool school\nWe're the chiefs of relief\nContained by wild beasts\nThe finesse of the West, the masterpiece of the East\nHah, the boss of course\nAs the lord of our fort\nThe ones with the platinum vocal chords\nWe're the science of desire\nWith a magical mic\nThe monarch of the dark in the night alright\nWe advertise\nAnd specialize\nIn the exercise and we'll energize\nThe young ladies thighs\nCause all the fly guys\nNature's to rise right before their eyes\nWe're the Earl of the world\nAnd the Air of flair\nThe Duke of dare, the Mayor of debonaire\nGot fine, drink wine\nCan dance and dine\nGot a first class female oh so fine\n\n(Chorus)\nHey baby, whatever you doin right girl\nI just want you to always be easy, and keep on shakin that thing\nAnd I want you - swingin it swingin it swingin\nTell me how now\nLike dy-na-mite before it blows\nWho needs a band when the beat just goes - boom!\n\nHe's Grandmaster, he cuts faster\nWe're the Furious, serious, and ever so mysterious\nFive that's rockin the house\n\nAnd everybody say PLAY (PLAY)\nSay PLAY (PLAY) well OK!\n\nHo! Everybody c'mon!\nWoo! Now now! Uhh!\n\nPeople call me crazy, people call me sneak\nJust because I'm nasty, they call me a freak, hehe\nI am coming over, to your house tonight\nI promise to you baby, that I'll do you right, I'm nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha (shake your booty)\nI wantcha, I wantcha, I wantcha, I wantcha (we want to rock you)\nJust let us rock, you!\n\nWatch your girl and watch your wife\nI got the kiss of death, to touch your life\nCause I am the man they call Scorpio\nI like fly girls that don't say no\n\nHey girl, grab my hand, hold on tight\nDon't you worry bout a thing Raheem'll do you right\nI'm a mint that's fresh huh, a woman's pet\nThere ain't a thing in the world that I can't get\n\nIn the history books or the picture show\nIt's the golden voice on your radio\nI'm the rapper never printed voice is solid gold\nI'm playin the role, they call me Kid Creole"}, {"song": "And I'm the, the Romeo, of the nasty show\nAll the ladies in the place, to my house we go\nFreakin in the den just to make you move\nCause I'm Cowboy, and I got the groove\n\nAs DJ Flash, cuts so mean\nThat he wanna know your favorite jean\nIs it Jordache? (NO!) Gloria Vanderbilt? (NO!)\nMaybe it's Sassoon? (NO!) How about Sergio? (I DON'T CARE!)\nCould it be Calvin Klein? (NO!) Then what is it? (?????)\n\nBack to the bridge y'all\n\n(Chorus)\nEverybody, shake your body\nKeep movin and groovin and screamin and shoutin\nAnd helpin us turn it out\n\nIs everybody sayin play? (PLAY!)\nSay play! (PLAY!) Well OK!\n\nAlright, woo!\nEverybody get up!\nOooooeee, yeah!\n\nPeople say it's dirty, people say it's wrong\nThey talk about our music, like it's a nasty song\nIt's nasty!\n\nI wantcha, I wantcha, I wantcha, I wantcha!\nJust let us rock, you!\n\nGot waterbed sets in my limousine\nAnd everytime I'm seen I got to be clean\nI tour around the world, to make the people dance\nAnd here's a little message for the ladies in France\n?Huh huh, zmapel, Melle Mel? (I have no idea what Melle Mel says)\n?Ah dome mal lamate mademoiselle?\n?Done wa sing, done marseis?\n?Done wa rik no dees!?\n\nI'm seein this girl that I just adore\nI'm seein this girl that what I never saw before\nThe way she was swaying and doing the swing\nI had to let her know just about my thing\nI'm the M, R, N E-Double S\nCome on, ah fly girl, and put me to a test\nAnd I'll rock you, until you give me the rest\nI keep on it, until you start to fess\n\nRaheem, in your life, what more can you ask\nI bet you can't think of a greater task\nI make my light shine on your cloudy days\nYou can surf if you want to, on my waves\nI caress your soft body on those mellow nights\nA continuous thing, to the morning light\nIt's reality, it's not a dream\nIt's nothing less than the best when it's from Raheem\n\nNow it's my turn so understand\nThat I'm the Kid Creole, and I'm a ladies man\nI don't, have a lot of women hangin on my steez\nOnly one fine lady that you better believe\nI say Annette's her name, and that's the truth\nI give a lot of things up, before I turn her loose\nIt's just her, and that's simple and plain\nAnd that's the only way I run my game\n\nWell I'ma, Cowboy and I'm the real McCoy\nI'm chocolate all over like an Almond Joy\nBowlegged cool brother and you will agree\nOn top of the world for the ladies to see\nGonna hip gonna hop gonna rock the spot\nGonna make everybody wanna rock rock rock\nGonna do it to the East, wanna do it to the West\nGonna make you relax right upon your chest\n\nGrandmaster Flash, is willing and able\nHe's the king of the cuts on two turntables\nHe's the GRAND, GRAND, the master man\nHe's so nice with his hands he don't need no band\nRocks 45's, and 33's\nRocks boys men women and young ladies\nHe can slice so precise it's almost fun\nAnd he makes better love than a mick makes money\n\nSlick Rick, Slick Rick, Slick Rick, Slick Rick\nSlick Rick, Slick Rick (ha ha hah hah hah), hooooooo-ho!!\nOwwwwwwwwwwwwwwww!\n\n(lots of varied conversation to the end, at least one mention of Bob Marley)"}, {"song": "[Verse 1: Melle Mel]\nBroken glass everywhere\nPeople pissing on the stairs, you know they just don't care\nI can't take the smell, can't take the noise\nGot no money to move out, I guess I got no choice\nRats in the front room, roaches in the back\nJunkies in the alley with a baseball bat\nI tried to get away but I couldn't get far\n'Cause a man with a tow truck repossessed my car\n\n[Verse 2: Duke Bootee]\nMy brother's doing bad, stole my mother's TV\nSays she watches too much, it's just not healthy\nAll My Children in the daytime, Dallas at night\nCan't even see the game or the Sugar Ray fight\nThe bill collectors, they ring my phone\nAnd scare my wife when I'm not home\nGot a bum education, double-digit inflation\nCan't take the train to the job, there's a strike at the station\nNeon King Kong standing on my back\nCan't stop to turn around, broke my sacroiliac\nA mid-range migraine, cancered membrane\nSometimes I think I'm goin' insane\nI swear I might hijack a plane!\n\n[Chorus: Melle Mel & Duke Bootee]\nDon't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\nAh-huh-huh-huh-huh (Say what)\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\n\n[Verse 3: Duke Bootee]\nDown on the front stoop, hanging out the window\nWatching all the cars go by, roaring as the breezes blow\nA crazy lady, living in a bag\nEating out of garbage pails, used to be a fag hag\nSaid she'll dance the tango, skip the light fandango\nA Zircon princess seemed to lost her senses\nDown at the peep show watching all the creeps\nSo she can tell her stories to the girls back home\nShe went to the city and got so so saditty\nShe had to get a pimp, she couldn't make it on her own"}, {"song": "[Verse 4: Duke Bootee]\nMy son said, Daddy, I don't wanna go to school\n'Cause the teacher's a jerk, he must think I'm a fool\nAnd all the kids smoke reefer, I think it'd be cheaper\nIf I just got a job, learned to be a street sweeper\nOr dance to the beat, shuffle my feet\nWear a shirt and tie and run with the creeps\n'Cause it's all about money; ain't a damn thing funny\nYou got to have a con in this land of milk and honey\nThey pushed that girl in front of the train\nTook her to the doctor, sewed her arm on again\nStabbed that man right in his heart\nGave him a transplant for a brand new start\nI can't walk through the park, 'cause it's crazy after dark\nKeep my hand on my gun, 'cause they got me on the run\nI feel like a outlaw, broke my last glass jaw\nHear them say \"You want some more?\", living on a see-saw\n\n[Chorus: Melle Mel & Duke Bootee]\nDon't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\n(Say what)\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under"}, {"song": "[Verse 5: Melle Mel]\nA child is born with no state of mind\nBlind to the ways of mankind\nGod is smiling on you, but he's frowning too\nBecause only God knows what you'll go through\nYou'll grow in the ghetto living second-rate\nAnd your eyes will sing a song of deep hate\nThe places you play and where you stay\nLooks like one great big alleyway (Way, way)\nYou'll admire all the number-book takers\nThugs, pimps and pushers and the big money-makers\nDriving big cars, spending twenties and tens\nAnd you'll wanna grow up to be just like them, huh\nSmugglers, scramblers, burglars, gamblers\nPickpocket peddlers, even panhandlers\nYou say \"I'm cool, huh, I'm no fool.\"\nBut then you wind up droppin' outta high school\nNow you're unemployed, all null and void\nWalking 'round like you're Pretty Boy Floyd\nTurned stick-up kid, but look what you done did\nGot sent up for a eight-year bid\nNow your manhood is took and you're a Maytag\nSpend the next two years as a undercover fag\nBeing used and abused to serve like hell\n'Til one day you was found hung dead in the cell (Cell, cell)\nIt was plain to see that your life was lost\nYou was cold and your body swung back and forth\nBut now your eyes sing the sad, sad song\nOf how you lived so fast and died so young, so...\n\n[Chorus: Melle Mel & Duke Bootee]\nDon't push me, 'cause I'm close to the edge\nI'm trying not to lose my head\nAh-huh-huh-huh-huh (Say what)\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\n\n[Outro Skit: The Furious Five & The Cops]\nYo Mel, you see that girl there?\nYo, that sounded like Cowboy man\nCool\nYo, what's up Money?\nYo, where's Creole an Rahiem at man?\nI think they upstairs cooling out\nSo what's up for tonight y'all?\nYo we could go down to Fever, man\nLet's go check out \"Junebug\" man\nHey yo, you know that girl Betty?\nYeah man\nHer moms got robbed man\nWhat?\nNot again man\nShe got hurt bad\nWhen did this happen?\nWhat's goin' on?\nFreeze\nDon't nobody move nothin'\nY'all know what this is\nGet 'em up, get 'em up (What?)\nOh man, we're (Right in there) Grandmaster Flash and the Furious Five\nWhat is that, a gang?\nNo\nShut up\nI don't wanna hear your mouth\nShut up\nOfficer, officer, what is the problem?\nYou the problem\nYo, yo, you ain't gotta push me man\nGet in the car, get in the car\nGet in the God...\nI said, \"Get in the car\"\nWhy is he doggin' us man?"}, {"song": "[Verse 1]\nPut your clothes on, and get your feet off my couch\nI think it's time that you left my house\nI tried to let you know that you have a friend\nBut now you're actin' like you wanna move in\nYou have problems, nowhere to go\nBut now you're stayin' like you're runnin' the show\nAnd when I come in my house all I see\nIs your back in my fridge (Got the back in your fridge!)\nI don't like that eatin' up the food that I brought my girl\nYou just messin' up both our worlds\nShe can't even walk around, but you're always lookin'\nYou was horny, you stop [?]\n[?] that you just can't have, and I'm mad\nSo get the [?] back and take out the trash\nAnd on your way out\nAy yo, I think you better stay out\n\n[Chorus]\nSo you, get out of here (Leave here)\nGet out of here\n'Cause this is my house\nGet out of here (Leave here)\nGet out of here, right now\n\n[Verse 2]\nYou used to be my homeboy, I'll never forget you\nBut when you leave let the door knob hit you\nIn your back side, 'cause what's fair is fair\nBut please take those dirty underwear\nOut the bathroom, I wonder what you been drinkin'\n[?], the smell got your whole house stinkin'\nI shoulda never let you get in here\nLike Richard Pryor says, it smells like shit in here, word\nYour underarms had a bad day and\nLook like your Right Guard, all went the wrong way\nDon't [?], don't need no deodorant\nSo drop the soap, [?]\nYou talk all the time, say rhymes [?]\nThe sneakers piled up, lookin' like a pyramid\nYour girl stinks, she's just straight up jinx\nShe got missing teeth, like Leon Spinks\nShe might as well, go kiss Joe Frazier\nShe looks like a pitbull, but her in a cage\n\n[Chorus]\nSo you, get out of here (Leave here)\nGet out of here\n'Cause this is my house\nSo get out of here (Leave here)\nGet out of here\n\n[Verse 3]\nYou, you're in violation\nActin' like you're on vacation\nIn the White House, but his my house\nAnd you're [?]\nWatch out, homeboy, I said you got no [?]\nA buster in my kitchen, drinkin' my [?]\nWearing my clothes, for you they're too small\nAlways on the phone, you never paid for a call\nAnd those lies, that you can't see\nHomeboy, when you're gonna leave\nAll mistakes been made in a field that I made it\nYou can not [?], but I can't fake it\nOpportunity's knockin', you know I gotta state again\nGet out of my house 'cause I just can't take it\n\n[Chorus]\nAnd you, get out of here (Leave here)\nGet out of here\nThis is my house\nGet out of here (Leave here)\nGet out of here, right now\n\n[Verse 4]\nYou got bad feet, you don't get no sex\nCorns and bunions (Don't blame [?])\nFungus, bacteria, your exterior\nYour odour is superior, even my interior\nDecorator told me that you had to move out\nYou don't blend with the cushions, you clash with the couch\nYour girl came by, with extensions in her hair\nHuh, and when she left, fake hair was everywhere\n\n[Verse 5]\nMy bathroom, my kitchen, even my stash\nI sat down, got up, and my butt had a mustache\nThe day you moved in, you didn't give me a [?]\nTo top it all off, you broke my favorite lamp\nYou screwed up the stereo and blew the amp\nThe next thing you know, you was settin' up camp\nYou said you wasn't stay here long, you're just a liar\nI came in the living room, you made a camp fire\nRoastin' marshmallows, beans, and franks\nYou ate, you burped, and you didn't say \"thanks\"\n\n[Chorus]\nSo you, get out of here (Leave here)\nGet out of here\n'Cause this is my house\nGet out of here (Leave here)\nGet out of here, right now"}, {"song": "It's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nBroken glass everywhere\nPeople pissin' on the stairs, you know they just don't care\nI can't take the smell, can't take the noise\nGot no money to move out, I guess I got no choice\nRats in the front room, roaches in the back\nJunkies in the alley with a baseball bat\nI tried to get away but I couldn't get far\n'Cause a man with a tow truck repossessed my car\nDon't push me 'cause I'm close to the edge\nI'm trying not to lose my head\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nStandin' on the front stoop hangin' out the window\nWatchin' all the cars go by, roarin' as the breezes blow\nCrazy lady, livin' in a bag\nEatin' outta garbage pails, used to be a fag hag\nSaid she'll dance the tango, skip the light fandango\nA Zircon princess seemed to lost her senses\nDown at the peep show watchin' all the creeps\nSo she can tell her stories to the girls back home\nShe went to the city and got so so seditty\nShe had to get a pimp, she couldn't make it on her own\nDon't push me cause I'm close to the edge\nI'm trying not to lose my head\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nMy brother's doin' bad, stole my mother's TV\nSays she watches too much, it's just not healthy\nAll My Children in the daytime, Dallas at night\nCan't even see the game or the Sugar Ray fight\nThe bill collectors, they ring my phone\nAnd scare my wife when I'm not home\nGot a bum education, double-digit inflation\nCan't take the train to the job, there's a strike at the station\nNeon King Kong standin' on my back\nCan't stop to turn around, broke my sacroiliac\nA mid-range migraine, cancered membrane\nSometimes I think I'm goin' insane\nI swear I might hijack a plane!\nDon't push me 'cause I'm close to the edge\nI'm trying not to lose my head\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nA child is born with no state of mind\nBlind to the ways of mankind\nGod is smilin' on you but he's frownin' too\nBecause only God knows what you'll go through\nYou'll grow in the ghetto livin' second-rate\nAnd your eyes will sing a song called deep hate\nThe places you play and where you stay\nLooks like one great big alleyway\nYou'll admire all the number-book takers\nThugs, pimps and pushers and the big money-makers\nDrivin' big cars, spendin' twenties and tens\nAnd you'll wanna grow up to be just like them, huh\nSmugglers, scramblers, burglars, gamblers\nPickpocket peddlers, even panhandlers\nYou say I'm cool, huh, I'm no fool\nBut then you wind up droppin' outta high school\nNow you're unemployed, all non-void\nWalkin' round like you're Pretty Boy Floyd\nTurned stick-up kid, but look what you done did\nGot sent up for a eight-year bid\nNow your manhood is took and you're a Maytag\nSpend the next two years as a undercover fag\nBein' used and abused to serve like hell\nTil one day, you was found hung dead in the cell\nIt was plain to see that your life was lost\nYou was cold and your body swung back and forth\nBut now your eyes sing the sad, sad song\nOf how you lived so fast and died so young so\nDon't push me 'cause I'm close to the edge\nI'm trying not to lose my head\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under\nIt's like a jungle sometimes\nIt makes me wonder how I keep from goin' under"}, {"song": "Beep beep, you and the crew, hold it!\nYeah, that's us, we're bad. We're back\nAnd we want ya'll to know, we're all getting into a birthday thing\nNow I want everybody to put your hands up into the air if you got a birthday\nNow I don't care if it already came or if it already done passed\nEverybody say, Happy (Happy) birthday (Birthday)\nGoody, goody, oh my god, oh my god\nHappy birthday baby, party, party, party\n\n42nd Street\n\nHey ya'll, we're having a ball\nI hope you're doing fine\nBecause any time is a happy time for a birthday party rhyme\nEverybody get up\nHey ya'll, I'm having a ball\nI hope you're doing fine\nBecause any time is a happy time for a birthday party rhyme\nHit it\n\n[Verse 1]\nYou don't need no invitation\nThere's a party going on throughout the nation\nDon't get excited but it's gonna be\nThe best birthday party in history\nWe're gonna celebrate the gift of birth\nThe living jewel of planet Earth\nSo come on, come all to the birthday ball\nEvery day this spring, summer, winter and fall\nFrom dusk 'til dawn, from dawn 'til dusk\nIf the crowd don't get you, the music must\n'Cause it's jam packed from back to back\nYou're in, you're out, 'cause you like it like that\nLet's rock, let's rock and rock\nDon't stop\nPat your foot and let your fingers pop\nI wanna hear you loud and clear\nSay, \"Hell yeah\" (Hell yeah)\n\nEverybody say, \"One\" (One), Flash, one time\nSay, \"Two\" (Two), Flash, two times\nSay, \"Three\" (Three), Flash, three times\nSay, \"Four\" (Four), Flash, five times\n\nAll the guys better find a girl\n'Cause if you stay apart\nWe're gonna move the groove until we prove\nThat we're gonna shake you, break your heart\n\nAll the girls better find a guy\nAll the guys better find a girl\n'Cause we're gonna hip and hop 'til we hit the top\n'Cause we gonna rock and shock the whole world, huh!\n\nMelle Mel gonna make you yell\nAnd I'm Mr. Ness, gon' make you shout the best\nRahiem gon' make you scream scream scream\nCreole gonna make you rock and roll\nCowboy gonna make you jump for joy\nAnd Flash gonna cut the cut so fast"}, {"song": "But those of you who remember the line\nHelp me finish the rhyme -- c'mon y'all\nWe gonna try something new\nWhat you gonna do?\nWe gonna try something new\nWhat you gonna do?\nIf you want to scream to the break of dawn\nAt the count of three, scream loud and long\nOne, two, three -- hit it, hit it\nOne, two, three -- hit it, hit it\n\nEverybody say, \"One\" (One), Flash, one time\nSay, \"Two\" (Two), Flash, two times\nSay, \"Three\" (Three), Flash, three times\nSay, \"Four\" (Four), Flash, five times\n\nAll the girls better find a guy\nAll the guys better find a girl\n'Cause we're gonna hip and hop 'til we hit the top\n'Cause we gonna rock and shock the whole world\n\nAll the guys better find a girl\n'Cause if you stay apart\nWe're gonna move the groove until we prove\nThat we're gonna shake you, break your heart\n\nMelle Mel and I'm here to say\nI was born on the 15th day of May\nAnd I'm Mr. Ness and I love myself\nAnd my date of birth is November the 12th\nI wanna tell you that my name is Rahiem\nMy date of birth is February 13th\nI'm Kid Creole and I'm on the scene\nI was born on February 19th\nI'm Cowboy and you must remember\nI was born on the 20th of September\nAnd Grandmaster Flash is here to stay\n'Cause he was born on new years day\nNow we got something else that we want you to say\nJust shout out your birthday\nBut to play this game, and to rock this rhyme\nShout the date and the month out one of a kind\nSay 2 4 6 8 everybody shout out your birthday\nSay what's that date? (Incomprehensible shouting)\nSay what's that date? (Incomprehensible shouting)\nNow to keep these things movin' right along\nShout out the month that you were born\nI say \"What's that month?\" (Incomprehensible shouting)\nI say \"what's that month?\" (Incomprehensible shouting)\n\nEverybody say, \"One\" (One), Flash, one time\nEverybody say, \"Two\" (Two), Flash, two times\nSay, \"Three\" (Three), Flash, three times\nEverybody say, \"Four\" (Four), Flash, five times\n\nHey ya'll, I'm having a ball\nI hope you're doing fine\nBecause any time is a happy time\nFor a birthday party rhyme\nNow everybody get up\n\nHey ya'll, I'm having a ball\nI hope you're doing fine\nBecause any time is a happy time\nFor a birthday party rhyme\nHit it!\n\nAll the guys better find a girl\n'Cause if you stay apart\nWe're gonna move the groove until we prove\nThat we're gonna shake you, break your heart\n\nAll the girls better find a guy\nAll the guys better find a girl\n'Cause we're gonna hip and hop 'til we hit the top\n'Cause we gonna rock and shock the whole world, huh!"}]}