{"artist": "Megan Thee Stallion", "encodings": ["[Intro: Megan Thee Stallion]\nReal hot girl shit\nYeah, I'm in my bag, but I'm in his too\nAnd that's why every time you see me, I got some new shoes\nAh, mwah, ayy, look\nLil Ju made this beat\n\n[Verse 1: Megan Thee Stallion]\nBitch, I'm a star, got these niggas wishin'\nHe say he hungry, this pussy the kitchen\nYeah, that's my dawg, he gon' sit down and listen\nCall him a trick and he don't get off', hold up\nBitch, I'm a star, got these niggas wishin'\nHe say he hungry, this pussy the kitchen\nYeah, that's my dawg, he gon' sit down and listen\nCall him a trick and he don't get offended\nHe know he giving his money to Megan\nHe know it's very expensive to date me\nTold him go put my name on that account\nBecause when I need money, I ain't tryna, hold up\nHe know he giving his money to Megan\nHe know it's very expensive to date me\nTold him go put my name on that account\nBecause when I need money, I ain't tryna wait\n\n[Chorus: Megan Thee Stallion]\nI can't be fucked with, no\nHo, you can't touch this, ayy\nBitch, I do rich shit, huh\nMy money thick thick, ayy\nWalk with a limp, limp, huh\nI'm on some pimp shit, ayy\nHe say, \"You all about money,\" yeah\nI'm on that cash shit, huh\nI'm in my bag, bitch, huh\nI'm on your ass, bitch, huh\nI'm in that new new shit\nYou on that last year, huh\nBitch, I do pimp shit, huh\nHo, you on simp shit, ayy\nHe say, \"You all about money,\" yeah\nI'm on that cash shit, ah", "[Verse 2: DaBaby]\nYou know why these bitches love me? (Why?)\n'Cause Baby don't give a fuck (What you do?)\nI be fixin' her weave while she suckin' my dick\nPull it out, then I tittyfuck (Uh, uh)\nI fuck her from the back and she nasty, killin' her\nKnow how I give it up (Yeah, yeah)\nI be cool on 'em, bitch, ain't no pressure (Uh-uh)\n'Til I met this lil' freak, her name Megan (Ooh)\nThis lil' thing here a stallion, look how she walk\nLook how she talk, she sexy (Mwah)\nI like when they pretty and ghetto (Uh-huh)\nType of bitch that don't even say hello (Yeah, yeah)\nAnd whenever we fuck, she be fuckin' me back\nPut her in the headlock with my elbow (Mmh)\nNow she done reversed it\nGot up on the dick and ride the shit like a Camaro, uh\n\n[Chorus: Megan Thee Stallion]\nI can't be fucked with, no\nHo, you can't touch this, ayy\nBitch, I do rich shit, huh\nMy money thick thick, ayy\nWalk with a limp, limp, huh\nI'm on some pimp shit, ayy\nHe say, \"You all about money,\" yeah\nI'm on that cash shit, huh\nI'm in my bag, bitch, huh\nI'm on your ass, bitch, huh\nI'm in that new new shit\nYou on that last year, huh\nBitch, I do pimp shit, huh\nHo, you on simp shit, ayy\nHe say, \"You all about money,\" yeah\nI'm on that cash shit, ah (Hey, hey, look)\n\n[Verse 3: Megan Thee Stallion]\nI don't be stressin' 'bout none of these niggas\nWhen they be talkin', I don't even listen\nTellin' me secrets, I probably forget it\nBut I'ma tune in when he say he gon' lick it\nHe told 'em send me a pic 'cause he miss me\nI told him send me a stack if he really\nI don't be trusting these tricks 'cause they tricky\nSend him a pic of somebody else titties\nI'm a finesser and I'm a fly dresser\nMove to the top floor and flew in my dresser\nMy bitches hustle, make money together\nYour bitches birds and they flockin' together\nI can't decide if I want the new Louis\nDapper Dan yellow, I'm always in Gucci\nYour mama don't bring your dad to the mall\n'Cause when he be in there she know he be choosin'\n\n[Chorus: Megan Thee Stallion]\nI can't be fucked with, no\nHo, you can't touch this, ayy\nBitch, I do rich shit, huh\nMy money thick thick, ayy\nWalk with a limp, limp, huh\nI'm on some pimp shit, ayy\nHe say, \"You all about money,\" yeah\nI'm on that cash shit, huh\nI'm in my bag, bitch, huh\nI'm on your ass, bitch, huh\nI'm in that new new shit\nYou on that last year, huh\nBitch, I do pimp shit, huh\nHo, you on simp shit, ayy\nHe say, \"You all about money,\" yeah\nI'm on that cash shit, ah", "[Intro]\nI'm that bitch (Yeah)\nBeen that bitch, still that bitch (Ah)\nWill forever be that bitch (Forever be that bitch)\nYeah (Ayy, ah)\n\n[Verse 1]\nI'm the hood Mona Lisa, break a nigga into pieces\nHad to X some cheesy niggas out my circle like a pizza (Yeah)\nI'm way too exclusive, I don't shop on Insta' boutiques\nAll them lil' ass clothes only fit fake booties\nBad bitch, still talking cash shit\nPussy like water, I'm unbothered and relaxing\nI would never trip on a nigga if I had him\nBitch, that's my trash, you the maid, so you bagged him, ah\n\n[Chorus]\nI'm a savage (Yeah)\nClassy, bougie, ratchet (Yeah)\nSassy, moody, nasty (Hey, hey, yeah)\nActing stupid, what's happening? (Woah, woah)\nBitch, what's happening? (Woah, woah)\nBitch, I'm a savage, yeah\nClassy, bougie, ratchet, yeah\nSassy, moody, nasty, huh\nActing stupid, what's happening?\nBitch, what's happening? (Ayy, ah)\n\n[Verse 2]\nEat me and record it, but your edge-up all I'm showing (Ah)\nI keep my niggas private, so his AP all I'm showing (Baow)\nBeefing with you bitches really getting kinda boring\nIf it ain't about the money, then you know I'm gon' ignore it\nI'm the shit, ooh (Ayy)\nI need a mop to clean the floor, it's too much drip, ooh (Too much drip, ooh)\nI keep a knot, I keep a watch, I keep a whip, ooh (I keep a whip, baow)\nLet's play a game, Simon says I'm still that bitch, ayy (Still that bitch)\nI'm still that bitch, yeah (Ah)\n\n[Chorus]\nI'm a savage\nClassy, bougie, ratchet (Yeah)\nSassy, moody, nasty (Yeah)\nActing stupid, what's happening? (What's up?)\nBitch, what's happening? (What's up?)\nBitch, I'm a savage, yeah\nClassy, bougie, ratchet, yeah (Bitch)\nSassy, moody, nasty, huh\nActing stupid, what's happening? (What's up?)\nBitch, what's happening?\n\n[Verse 3]\nBitch, I'm lit like a match, ooh\nAnd any nigga I let hit is still attached, ooh\nThat body right, but you know this pussy fat, ooh\nI drop a picture, now these bitches feel attacked, ayy\nDon't let that nigga gas you up and get you whacked, ooh\nI make a call and get a pussy nigga smacked, uh\nThese bitches talkin' 'bout pulling up, well, where you at? Ooh\nI'm in a Lam', bitch, catch me if you can, ooh\nI'm kickin' bitches out they spot, Stalli' Chan, yeah (Ah, yeah)\n\n[Outro]\nNiggas say I taste like sugar, but ain't shit sweet (Ah)\nMwah\nAyy, ayy, ooh, ooh, ooh, ooh, mwah", "[Intro: Megan Thee Stallion, JT & Nicki Minaj]\n(Bone Collector the plug)\nReal hot girl shit\nReal, real ass bitch, give a fuck 'bout a nigga\nHot Barbie summer\nReal, real, real ass bitch, give a fuck 'bout a nigga\n(What Juicy say? He be like, \"Shut the fuck up\")\nDon't run from me, friend, haha\n\n[Chorus: Ty Dolla $ign & JT]\nReal ass nigga, give a fuck 'bout a bitch\nIt is what it is, this some five star dick\nShe a big ol' freak, it's a must that I hit\nIt's a Hot Girl Summer, so you know she got it lit\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah, yeah\n\n[Verse 1: Megan Thee Stallion]\nHandle me? (Huh) Who gon' handle me? (Who?)\nThinkin' he's a player, he's a member on the team\nHe put in all that work, he wanna be the MVP (Boy, bye)\nI told him ain't no taming me, I love my niggas equally\nFuckin' 9-to-5 niggas with that superstar D ('Star D)\nFucked a superstar nigga, now I got him ballin' (Ballin')\nI caught a jet to get that neck, I told him call, don't send no text (Mwah)\nAnd don't you tell 'em you with me when they be askin' where you at, ah\n\n[Pre-Chorus: Megan Thee Stallion]\nI can't read your mind, gotta say that shit (Say that shit)\nShould I take your love? Should I take that dick?\nGot a whole lot of options 'cause you know a bitch poppin' (Hey)\nI'm a hot girl, so you know ain't shit stoppin' (Hey)\n\n[Chorus: Ty Dolla $ign & JT]\nReal ass nigga, give a fuck 'bout a bitch\nIt is what it is, this some five star dick\nShe a big ol' freak, it's a must that I hit\nIt's a Hot Girl Summer, so you know she got it lit\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah, yeah (Ayy, yo)", "[Verse 2: Nicki Minaj]\nWho a hotter B? Who got a lot of D?\nWho poppin' like a P when he be hoppin' out the V? (Brr)\nAnd who gon' tell him that my bitch is getting her degree?\nAnd when we say it's Hot Girl Summer, we ain't talkin' 'bout degrees\nWho unfollowed me? Like who don't follow me?\n'Cause even in your new bitch, I can see a lot of me\nAnd honestly I'm honored 'cause that shit be comedy\nYou ain't put me in no brands, but I see you proud of me\nI'm just a real ass bitch, give a fuck about a trick\nOn some real ass shit, and we really with the shit\nPut this pussy on your lip, give a fuck about the dick\nI get that rrr and then I rrr, I grab my shit and then I dip, ooh\n\n[Chorus: Ty Dolla $ign & JT]\nReal ass nigga, give a fuck 'bout a bitch\nIt is what it is, this some five star dick\nShe a big ol' freak, it's a must that I hit\nIt's a Hot Girl Summer, so you know she got it lit\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah, yeah\n\n[Verse 3: Megan Thee Stallion]\nLook, college girl, but a freak on the weekend (On the weekend)\nEat that dick up even when I'm going vegan\nHe be trippin' on me and I know the reason (I know the reason)\nI gotta break up with my nigga every season\nReal hot girl shit, ayy, I got one or two baes (Woah, woah)\nIf you seen it last night, don't say shit the next day (Hey, hey, yeah)\nLet me drive the boat, ayy (Yeah), kiss me in a Rolls, ayy (Yeah, yeah)\nIt go down on that brown, now we goin' both ways, ah\n\n[Pre-Chorus: Megan Thee Stallion]\nI can't read your mind, gotta say that shit (Say that shit)\nShould I take your love? Should I take that dick?\nGot a whole lot of options 'cause you know a bitch poppin' (Hey)\nI'm a hot girl, so you know ain't shit stoppin' (Hey)\n\n[Chorus: Ty Dolla $ign & JT]\nReal ass nigga, give a fuck 'bout a bitch\nIt is what it is, this some five star dick\nShe a big ol' freak, it's a must that I hit\nIt's a Hot Girl Summer, so you know she got it lit\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah\nReal ass bitch, know she got it lit\nHot Girl Summer so you know she got it lit, yeah, yeah\n\n[Outro: Megan Thee Stallion & Nicki Minaj]\n(Yeah, yeah, yeah)\nGot a whole lot of options 'cause you know a bitch poppin'\nHey, hey\nWhole lot of options 'cause you know a bitch poppin'\n(Know we got it lit, yeah)\nHey, hey\nI'm a hot girl so you know ain't shit stoppin' (Yeah, yeah, yeah)\nHey, hey\nI'm a hot girl so you know ain't shit stoppin'\nKnow we got it lit, yeah (Ah)", "[Intro]\nReal hot girl shit\nAh\nAnd if the beat live, you know Lil Ju made it\n\n[Chorus]\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Mwah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody\nBody crazy, curvy, wavy, big titties, lil' waist (Yeah, yeah, yeah)\nBody crazy, curvy, wavy, big titties, lil' waist (Mwah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody\n\n[Verse 1]\nLook at how I bodied that, ate it up and gave it back (Ugh)\nYeah, you look good, but they still wanna know where Megan at (Where Megan at?)\nSaucy like a barbecue but you won't get your baby back\nSee me in that dress and he feel like he almost tasted that (Ah, ah, ah)\nNum, num, num, num, eat it up, foreplay, okay, three, two, one\nYou know I'm the hottest, you ain't ever gotta heat me up\nI'm present whеn I'm absent, speakin' when I'm not thеre\nAll them bitches scary cats, I call 'em Carole Baskins, ah\n\n[Chorus]\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Ah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Baow)\nBody crazy, curvy, wavy, big titties, lil' waist (Yeah, yeah)\nBody crazy, curvy, wavy, big titties, lil' waist (Yeah, yeah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody", "[Verse 2]\nI'm a hot ebony, they gon' click it if it's me (If it's me)\nAll my pictures been gettin' these niggas through the quarantine (Yeah)\nBitch, I'm very well, on my shit as you could tell\nAny ho got beef from years ago is beefing by herself, ah, ah\nIf we took a trip on the real creep tip (Yeah)\nBitch, rule number one is don't repeat that shit (Don't repeat that shit)\nRule number two, if they all came with you\nThey better know exactly what the fuck they came to do (Yeah, yeah, yeah, woah, woah)\n\n[Chorus]\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Yeah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Ah)\nBody crazy, curvy, wavy, big titties, lil' waist (Yeah, yeah)\nBody crazy, curvy, wavy, big titties, lil' waist (Yeah, yeah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Ah, ah, ah)\n\n[Verse 3]\nThe category is body, look at the way it's sittin' (Yeah)\nThat ratio so out of control, that waist, that ass, them titties (That waist, that ass, them titties)\nIf I wasn't me and I would've seen myself, I would have bought me a drink (Hey)\nTook me home, did me long, ate it with the panties on (Ugh, ugh, ugh)\nI could build a house with all the brick I got (Yeah)\nBitches spend a lifetime tryna get this hot (Tryna get this hot)\nAnd if her head too big, I could make that pop\nI'm not the one to play with like a touch-me-not, ah\n\n[Chorus]\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Ah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Ah)\nBody crazy, curvy, wavy, big titties, lil' waist (Yeah, yeah, woah)\nBody crazy, curvy, wavy, big titties, lil' waist (Woah, woah)\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody (Hey, hey, hey, ah)\n\n[Outro]\nOdy-ody-ody-ody\nMwah", "[Verse 1]\nFuck bein' good, I'm a bad bitch (Ah)\nI'm sick of motherfuckers tryna tell me how to live (Fuck y'all)\nWack hoes hate under my pictures on the 'Gram (Ugh)\nBitch, you better hope I never run across your man, uh\nIn the mall with him, I'ma have a ball with him (Yeah, yeah, woah)\nSomebody call Rihanna, I'ma buy some drawers with him\nHe fuckin' with Thee Stallion 'cause he into wild women (He love wild women)\nPut them legs on his head, now he love tall women (Yeah, yeah, ah)\nYou'll never catch me callin' these niggas daddy (Nope)\nI ain't lyin' 'bout my nut just to make a nigga happy (Nigga, please)\nLifestyle when a nigga can't fit a Magnum\nIt never happened if the dick wasn't snappin' (Ayy, woo)\n\n[Chorus]\nI'm a hot girl, I do hot shit (I do hot shit)\nSpend his income on my outfit (On my outfit)\nI don't text quick 'cause I ain't thirsty (I ain't thirsty)\nThese bitches mad, mad, they wanna hurt me (Ah, ah)\nI'm a hot girl, I do hot shit (I do hot shit)\nSpend his income on my outfit (On my outfit)\nI don't text quick 'cause I ain't thirsty (I ain't thirsty)\nThese bitches mad, mad, they wanna hurt me (Ah, ah)", "[Verse 2]\nAny rumor 'bout me, let me dead it (Let me dead it)\nI'm a open book and your man probably read it (Ah)\nLooked at my AP and these hoes still pathetic (Mmm)\nReal bitches back when I check my Patek, yeah (Yeah, yeah, woah)\nYeah, he call me Patty Cake 'cause the way that ass shake (Yeah, yeah, ass shake)\nI'ma make him eat me out while I'm watchin' anime (Wow, wow, anime)\nPussy like a Wild Fox, lookin' for a Sasuke (Yeah, yeah, ayy, yeah)\nOne night with him make him lose it like a prom date (Ooh, ooh, ooh, ah)\nTwo watches, yeah, call me two-timin' (Two-timin')\nSkin like gold and my teeth like diamonds (Yeah, yeah, like diamonds)\nHot Girl chain, Elliot got me shinin' (Yeah)\nThey tried to knock me off, but a bitch still grindin'\n\n[Chorus]\nI'm a hot girl, I do hot shit (I do hot shit)\nSpend his income on my outfit (On my outfit)\nI don't text quick 'cause I ain't thirsty (I ain't thirsty)\nThese bitches mad, mad, they wanna hurt me (Ah, ah)\nI'm a hot girl, I do hot shit (I do hot shit)\nSpend his income on my outfit (On my outfit)\nI don't text quick 'cause I ain't thirsty (I ain't thirsty)\nThese bitches mad, mad, they wanna hurt me (Ah, ah)\n\n[Verse 3]\nI'm a rich nigga magnet (Yeah), pretty with a fatty (With a fatty)\nThirty-inch weave with the long eyelashes (Blah, long eyelashes)\nYes, I got a man if I don't like who askin' (Boy, bye)\nI don't stand outside 'cause I'm too outstandin' (Ah)\n'Cause the girls in the hood are always hard\nEver since sixteen, I been havin' a job\nKnowin' nothin' in life, but I gotta get rich\nYou could check the throwback pics, I been that bitch (Uh)\n\n[Chorus]\nI'm a hot girl, I do hot shit (I do hot shit)\nSpend his income on my outfit (On my outfit)\nI don't text quick 'cause I ain't thirsty (I ain't thirsty)\nThese bitches mad, mad, they wanna hurt me (Ah, ah)\nI'm a hot girl, I do hot shit (I do hot shit)\nSpend his income on my outfit (On my outfit)\nI don't text quick 'cause I ain't thirsty (I ain't thirsty)\nThese bitches mad, mad, they wanna hurt me (Ah, ah)", "[Intro]\nReal Hot Girl shit, ah\n(And if the beat live, you know Lil Ju made it)\n\n[Verse 1]\nAyy, bitch, I'm a problem nobody solvin'\nYou can keep hating, I'm poppin' regardless\nHe want a bitch look like Megan Thee Stallion (Yeah)\nDon't want your nigga 'cause I want his daddy\nI like to switch up my style every week\nI gotta switch up my hair every day\nI ain't no ho, but I do be on go\nAnd I promise my nigga's gon' love me the same\nI'm a Hot Girl, don't try it at home\nI wear the shit that be showing my thong\nI like to drink and I like to have sex\nI fuck the niggas that's cutting the checks\nDance on the dick, now, you been served\nI like a dick with a little bit of curve\nHit this pussy with an uppercut\nCall that nigga Captain Hook\n\n[Chorus]\nAyy, I go shopping, mmh, want it, then I cop it, ayy, yeah\nBitches boppin', mmh, I do it, they copy, ayy, look\nHe's a sweetie, mmh, kiss it when he eat it, ayy, yeah\nKnow it's good when you chewin' and you singin'", "[Verse 2]\nI love niggas with conversation that find the clit with no navigation\nMandatory that I get the head, but no guarantees on the penetration (Huh)\nI be texting with a bi chick, we both freaky, just trying shit (Mwah)\nMain nigga getting super jealous, he don't even know about the other fellas\nI need a Mr. Clean, make that pussy beam (Ooh, ooh)\nOkay, I just might need a baker, make that pussy cream (Pussy cream)\nOkay, you woke up mad at me 'fore you even brush your teeth\nMm-mm-mm, that's just super sad, fuck it, carpe diem, ah\nI'm so indecisive, you can't cuff me, but I'm wifey (But I'm wifey)\nI just want a nigga who gon' slurp me like an Icee (Slurp me like an Icee)\nBitches bite me so hard, had to put them on a diet (Put them on a diet)\nBitch, this ain't no tryout, so lil' ho, you better not try me (Ho, you better not try me)\nI got a man, I got a bitch\nI'm a banana, they gotta split (Hey, hey, ah)\nOne in your top, one in your tip (Hey, hey)\nOne for the club, one for the crib (One for the crib)\nMy nigga fine, I wanna fuck\nIce in his mouth, eat me up\nRockin' his chain, wearin' his ring\nGettin' some brain, ah, ah, ah\n\n[Chorus]\nAyy, I go shopping, mmh, want it, then I cop it, ayy, yeah\nBitches boppin', mmh, I do it, they copy, ayy, look\nHe's a sweetie, mmh, kiss it when he eat it, ayy, yeah\nKnow it's good when you chewin' and you singin'\n\n[Verse 3]\nHot Girl Summer, I ain't fucking with no drama, huh (Fuckin' with no drama)\nHe was tripping, so I hung out with his partner, huh (Hey, with his partner)\nFuck him good, introduce me to his mama, huh (To his mama)\nThought he had me 'til I came out with the condom, huh (With the condom)\nDrinking D'USSÉ out the motherfuckin' bottle, hey (Out the motherfuckin' bottle)\nI'm a rapper, not no motherfuckin' model, huh (Not no motherfuckin' model)\nGot a nigga, but I think I'll have another, huh (Think I'll have another)\nI'm too sexy to be fucking under covers, huh\nI know you know me, I ain't gotta introduce shit, hmm (Introduce shit)\nSame crew, I ain't hanging with no new bitch, hmm (Hangin' with no new bitch)\nI'ma buy it when I land, I rock new shit, hmm (Bitch, I rock new shit)\nI ain't fucking with that nigga, I got new dick, hmm (Woah)\nPlease don't try me, lil' bitch, you know I'm with that, hmm (Bitch, you know I'm 'bout that)\nI'll break a ho in half like a Kit-Kat, hmm (Like a Kit-Kat)\nPlease don't ask me 'bout it if you know I did that, huh (Bitch, you know I did that)\nNot a stylist, but I'll push your fucking wig back, huh\n\n[Outro]\nReal Hot Girl shit, ah\nMwah", "[Intro]\nI'd rather keep it real with ya\nReal hot girl shit, ah\nIt ain't always about what you like, sometimes it's about what's right\nHelluva made this beat, baby\nHuh\n\n[Chorus]\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\n'Cause that's what you gon' call me when I'm trippin' anyway\nYou know you can't control me, baby, you need a real one in your life\nThem bitches ain't gon' give it to you right\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\n'Cause that's what you gon' call me when I'm trippin' anyway\nYou know you can't control me, baby, you need a real one in your life\nThem bitches ain't gon' give it to you right (Ayy)\n\n[Verse 1]\nWhy you wanna play with me? You know I'm undefeated\nA real hot girl know how to keep a nigga heated\nYou say you want respect, well, treat me how you wanna be treated\nYou told me keep it real, but you don't practice what you preachin'\nYou want me to blow your phone up and come a-lookin' for you 'til I find ya\nYou really want me to whoop the ho that you fuckin' with if I find her\nBitch, you ain't that busy, I don't give a fuck what you ain't got time for\nYou look me in my eyes and know you lying, man, that's fraud, bruh\nMan, you knew I was a player 'fore you met me, need to relax\nYou know that you gon' hate me if I get to playin' get-back\nI ain't turn into no bad bitch when you met me, boy, I been that\nYou tryna make me somethin' that I ain't, and I ain't with that (Nah)", "[Chorus]\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\n'Cause that's what you gon' call me when I'm trippin' anyway\nYou know you can't control me, baby, you need a real one in your life\nThem bitches ain't gon' give it to you right\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\n'Cause that's what you gon' call me when I'm trippin' anyway\nYou know you can't control me, baby, you need a real one in your life\nThem bitches ain't gon' give it to you right\n\n[Verse 2]\nI got my mind on gettin' paid, we ain't spoke in some days\nHe probably thinkin' I'm in pain, but I'm really on game\nAin't no nigga finna stop me, independent, I got me\nAll the shit that I be needin', can't depend on a \"probably\"\nAnd that's fucked up, 'cause you know that I don't fuck with nobody\nI be quiet, but you out here tellin' stories, one-sided\nI ain't perfect and I try to fix the shit that ain't workin'\nBut it's 2020, I ain't finna argue 'bout twerkin'\nSince you wanna test them waters, might as well jump in with both feet\nIf you leave me and you see me, better act like you don't know me\nIf you think this shit get better with another bitch, go get her (Go and get her)\nWhen you realize she ain't got you like I got you, I can't help ya\n\n[Chorus]\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\n'Cause that's what you gon' call me when I'm trippin' anyway\nYou know you can't control me, baby, you need a real one in your life\nThem bitches ain't gon' give it to you right\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\n'Cause that's what you gon' call me when I'm trippin' anyway\nYou know you can't control me, baby, you need a real one in your life\nThem bitches ain't gon' give it to you right\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\n'Cause that's what you gon' call me when I'm trippin' anyway\nYou know you can't control me, baby, you need a real one in your life\nThem bitches ain't gon' give it to you right\n\n[Outro]\nI'd rather be your B-I-T-C-H (I'd rather keep it real with ya)\nOh, oh, oh\nOh, oh, oh\nI'd rather keep it real with ya\nOh, oh, oh\nOh, oh, oh", "[Intro]\nTell me... (Lil Ju made this beat)\nTell me, is it love? Is it love again? Ooh-ooh\n\n[Verse 1]\nAyy, big ole freak, huh\nBig booty, big ole treat (Ah)\nI'ma make him wait for the pussy\nHit it 'til he big ole skeet, ayy (Baow, baow, baow)\nFeet on the bed (Ayy)\nI'll fuck him up in the head\nSuck it, then look in his eyes\nThen the next day, I might leave him on read, ayy (Mwah)\nPop it, pop it (Pop it)\nDaydreaming 'bout how I rock it, huh\nHe hit my phone with a horse\nSo I know that mean come over and ride it (Ride, ride, ride)\nShit, I'm on the way, huh (Ayy)\nRide on that dick, I'm like \"Yay,\" hey (Woo)\nUsually, I like to fuck (I like to fuck)\nBut tonight, we gon' make love cause you bae, huh\nNobody know (Nah)\nI fuck with him on the low (Of course)\nWe never show up together\nBut I text him when I'm ready to go, ayy\nI had a couple of shots at the bar (Yeah)\nI'm finna play with that dick in the car (Skrrt, skrrt)\nI got him swervin' and breakin' the law\nThese windows tinted so nobody saw\n\n[Pre-Chorus]\nAin't nobody freak like me, huh (Hell nah)\nGive ya what you need like me, huh\nAin't nobody got up on they tip-tip toes\nThen rode to the tip like me, huh (Ayy, ayy, baow, baow)\nI got him addicted, he fiendin' (Yeah)\nMy body a drug and he need it (Need it)\nHe beggin' me for the treatment (He beggin' me)\nHe throw a fit when I leave him\n\n[Chorus]\nHe like \"Baby, let me rub, let me rub on ya\nCan I get a lil' love, lil' love from ya?\"\nMy body addictive, it's drivin' him crazy\nI think I gotta run from him (Ayy, run, run, run)\nDon't know what to do without it\nHe fuckin' wit' you? I doubt it (I do)\nThey don't understand that I'm all in his head\nAnd it's nothin' to do with my body", "[Post-Chorus]\nYou been fiendin' for me lately\nGoin' brazy, brazy (Ooh, ooh, ooh-ooh)\nI got what you need, I'm gon' give it to you, baby\nGoin' brazy, brazy (Ooh, ooh)\nFiendin' for me lately\nI got what you need, I'ma give you what you craving\n\n[Verse 2]\nSee, I'm a big ole freak, I love to talk my shit (Talk my shit, uh)\nAnd you must be a pussy boy if you get offended\nBitch, it's Tina Snow (Uh)\nThey love me 'cause I'm cold ('Cause I'm cold)\nAnd you can't take no nigga from me\nI got mind control (Hell no), ayy, uh\nI wanna fuck in the mirror\nI like to look at your face when you in it (Uh)\nCome in the room and I'm givin' commands\nI am the captain and he the lieutenant (He the lieutenant)\nI need that neck like a muhfuckin' pendant\nNeed you to spit, make that muhfucker glisten (Ah)\nTell him \"Shut up,\" make that muhfucker listen\nI bet he gon' like it, he won't do no trippin' (Ah)\n\n[Pre-Chorus]\nAin't nobody freak like me (Hell nah), huh\nGive ya what you need like me (Hell nah), huh\nAin't nobody got up on they tip-tip toes\nThen rode to the tip like me, huh\nI got him addicted, he fiendin' (Yeah)\nMy body a drug and he need it (Need it)\nHe beggin' me for the treatment (He beggin' me)\nHe throw a fit when I leave him (Ah)\n\n[Chorus]\n\"Baby, let me rub, let me rub on ya\nCan I get a lil' love, lil' love from ya?\"\nMy body addictive, it's drivin' him crazy\nI think I gotta run from him (Ayy, run, run, run)\nDon't know what to do without it\nHe fuckin' wit' you? I doubt it (I do)\nThey don't understand that I'm all in his head\nAnd it's nothin' to do with my body\n\n[Post-Chorus]\nYou been fiendin' for me lately\nGoin' brazy, brazy (Mm, mm, mm-mm)\nI got what you need, I'm gon' give it to you, baby\nGoin' brazy, brazy (Ooh, ooh)\nFiendin' for me lately (Ooh, ooh, ooh-ooh)\nI got what you need, I'ma give you what you craving\n\n[Outro]\nTell me, is it love, is it love again? Ooh-ooh", "[Intro]\nLiljumadethisbeat\nFreak, freak, freak nasty (Ahh, ayy, ayy)\n\n[Verse 1]\nI’m running through your nigga house like a Tomb Raider\nYou got a pass around nigga, he a hot potato\nI told him, “Eat it or get out, that’s your ultimatum\nBut stop licking my pussy hard, that shit aggravating”\nUh, he ain’t mine, I just let him eat me out from time to time\nCall that pussy pootie tang, ‘cause I got the runny kind\nHe can’t compare me to none of these bitches\nI got that Beyoncé, that Dreamgirl, that Listen\n\n[Chorus]\nFreak, freak, freak nasty\nGo a couple rounds, leave that dick up in a casket\nI ain’t wanna take the nigga from you, it just happened\nYou know I ain’t cum boy if you had to ask me\nFreak, freak, freak nasty\nLick on my hand then I put it in his pants (Ahh, ahh, ahh)\nGet to playing with that cock and make that motherfucker bam\nAnd I walk and I talk like a pimp, ‘cause I am", "[Verse 2]\nParlez-vous français? Tell my pussy \"hey\" (Ooh la la)\nFancy top, give me head in a beret (Ooh la la)\nStormy Daniels, head from the head of state\nTwee lee lee, make it clap on his face, ayy\nFreak, freak, freak nasty\nAin’t gon' get no pussy but he hoping that he do (That he do)\nWalking all over the nigga, so he buy me all my shoes\nQuit calling him a trick if he only buy your food, ayy\nFreak, freak, freak nasty\nIce on my neck, let it drip down my chest\nLookin' at this motherfuckin' money make me wet\nRich bitch pussy, only cum for a check\n\n[Verse 3]\nAnd my contact list look like the yellow pages\nI do not save these niggas names, I remember faces\nAnd I ain’t fucked you in a minute, why you still claim me?\nBet if he ever hit this pussy, he gon' still stalk me\nAnd if you got a new bitch, why you still callin’?\nAnd I look better than that hoe, that’s why she made you block me\nI like to show out for them haters talkin' bad about me\nTryin' hard to find a flaw, but you still watchin' (Hey)\nFreak nasty motherfucker, kiss with the tongue\nI'on wanna fuck the nigga if he ain’t hung\nHe a lotta fun if he eat it night one\nIf he got a lotta funds, I'ma hit it like “Uh!”\nMoney make me cum, tryna get me some\nLookin' at these numbers on my checks like \"Uh!\"\nVersace hottie, uh, Creole mami, huh\nShe gon' fuckin' run but the Stalli giddy up (Ooh)\n\n[Chorus]\nFreak, freak, freak nasty\nGo a couple rounds, leave that dick up in a casket (In a casket)\nI ain’t wanna take the nigga from you, it just happened (Yes, I did)\nYou know I ain’t cum boy, if you had to ask me\nFreak, freak, freak nasty (Ayy)\nLick on my hand, then I put it in his pants\nGet to playing with that cock and make that motherfucker bam\nAnd I walk and I talk like a pimp, ‘cause I am\n\n[Verse 4]\nPussy wet, diamonds on my neck\nI’m a hot girl, so I make these niggas sweat\nIf you fuckin' wit' me, then you’re fuckin' with the best\nIf he say he a dog, I’ma treat him like a pet\nJimmy John neck, told him “Give it to me quick”\nWho can love you love you like me? Boy, nobody, Keith Sweat\nRich bitch pussy, I can take you outta debt (Outta debt)\nRich bitch pussy, only cum for a check, ahh\n\n[Outro]\nFreak, freak, freak nasty\nGo a couple rounds, leave that dick up in a casket (In a casket)\nAyy, ayy, ayy, freak, freak, freak, freak nasty (Ahh)\nFreak, freak, freak, freak nasty (Ahh)\nFreak, freak, freak nasty", "[Intro]\nBrrt, brrt, baow (Buddah Bless this beat)\n\n[Verse 1]\nImagine niggas lyin' 'bout shootin' a real bitch (Huh?)\nJust to save face for rapper niggas you chill with\nImagine me givin' a fuck it was your fuckin' birthday (Fuck you)\nYou in your feelings, I just thought it was another Thursday\nNow imagine me cockblockin' niggas on some dry shit (What?)\nI don't want you on the bench, believe you wouldn't've been invited (You wouldn't've been invited)\nAnd if it weren't for me, same week, you would have been indicted (Should've let them lock your ass up)\nYou offered M's not to talk, I guess that made my friend excited, hmm\nNow y'all in cahoots, huh (Okay), you a puss in boots\nYou shot a 5'10\" bitch with a .22\nTalkin' 'bout bones and tendons like them bullets wasn't pellets\nA pussy nigga with a pussy gun in his feelings\nOkay, he in the backseat and he keep callin' me a bitch (He a bitch)\nWe all know the shit I could've came back with (Lil'-ass nigga)\nHe talkin' 'bout his followers, dollars, and goofy shit\nI told him, \"You're not poppin', you just on the remix\" (What's poppin'?)\nNow here we are, 2020, eight months later\nAnd we still ain't got no fuckin' justice for Breonna Taylor (Breonna Taylor)\nAny nigga on that nigga's side is a clout chaser (Fuck y'all)\nA bitch who he fuckin' or a ho that he payin', uh\n\n[Interlude]\nImagine me, hahaha\nImagine me entertaining you fuckin' goofy-ass niggas and you fuckin' goofy-ass bitches\nBrrt, brrt, blaow (Buddah Bless this beat)\n\n[Verse 2]\nWho you takin' shots at, goofy-ass nigga?\nKeep your broke ass out a rich bitch business\nAnd that go for you bitches too that's tryna get picked\nTalkin' shit, I'll slide on you, thinkin' that you slick\nOoh shit, it's a lotta weak niggas in this bitch\nThey confused\nThey hate me, but watch my videos beatin' they dick\nWho a snitch? I ain't never went to the police with no names\nI thought a bitch that got her chain snatched, caught a loss had something to say, ayy\nI be speakin' facts, uh, they can't handle that, uh\nThey want me to be the bad guy, let me put my mask on\nI was chose, I ain't ask to be this motherfuckin' cold\nStill the brightest star and not just the ones that's up in this Rolls\nKeep it pimpin' always, actions do the talkin'\nI know you want the clout, so I ain't sayin' y'all names\nOh, you out here ballin', huh? Who you get that money from?\nTen toes down for whoever get the Patek, huh?\nI be so content 'cause I know I'm a real bitch\nAnd anything I say, I'm never scared to repeat it\nYou'd think I was a killer how these niggas scared as shit\nI pull up one deep, but niggas bring they whole clique, ayy\nWho you takin' shots at, goofy-ass bitch?\nWatchin' me succeed from your knees, suckin' dick\nI know you want attention from the niggas that I get\nI'm a steak, you a side plate, shrimp, stay in your place\nReal bitch, yeah, yeah, I ain't sellin' fairytales\nFaceTime my nigga while my other nigga layin' there\nBitch think she sabotagin' somethin', tryna run and tell\nBitch, I got a bond with my niggas and they all aware, yeah\nWho you takin' shots at? Shut up with your scary ass\nNo profile pic, bitch, your mama shouldn't've had\nKick me while I'm down bad, I remember all that\nNext nigga send a shot, I'ma sent it right back (Ah)\n\n[Outro]\nBrrt, brrt\nBrrt, haha\nAh\nShould've let them lock your ass up\nPussy", "[Intro: Megan Thee Stallion]\nReal hot girl shit\nAh, ayy (Buddah bless this beat)\n\n[Verse 1: Megan Thee Stallion]\nI got a stank ass walk and a reckless ass mouth (I don't give a fuck)\nAnd my shit so tight, when we fuck, my pussy talk (My pussy talk)\nI don't even say, \"What's up?\", I just tell him what I want (What I want)\n'Cause I got another nigga that's gon' do it if he don't, ah\nAttitude bad, pussy too good (Yeah)\nWhen he say, \"Fuck me,\" I tell him, \"Fuck me good\" (Good)\nChase these niggas? I wish I would\nBad bitch like me? Hoes wish they could (Could)\nShe a Casper to me, I need glasses to see\nIn the mall with her daddy, she a bastard to me (Yeah)\nYou ain't fuckin' him right, bitch, pass him to me\nReal niggas love me from the H to thе D\n\n[Chorus: Megan Thee Stallion]\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shakе that shit (Brr, brr, brr)\nHmm, hmm, work it, bitch", "[Verse 2: Young Thug]\nPatek just for the day (Sex)\nShe gotta go, roll the Ace of Spades\nShe catch a cold when she rock the chains (Catch a cold)\nBut let me see, Pinky and the Brain (Huh)\nOur baby mamas ain't the same (No)\nShe like, \"Baby daddy, ice my chain\" (Ice)\nShe 'bout to come and give me top like a crane (Woo)\nYou a bitch and a ho, but you gang, ayy (Ayo)\nShake what your doctor gave ya\nAnd I'ma ice your wrists like a player (Ayy)\nDoctor Miami add layers\nNow the ass is fat like an acre\nCome to the spot and we lay up\nAnd I'll cream that pussy like mayos\nEver since I got my cake up (Woo, woo)\nI been runnin' these bitches like the mayor (Whew)\nDon't stop, hatchback (Uh, uh)\nShakin' that ass on Snapchat (Yeah)\nOff the script and shakin' that ass (Uh)\nWhat you'll do for these rack, racks (Yeah, woo)\nWhere my thots at? (Mmm, mmm)\nI just freed this bitch like a bird, yeah (Yeah)\nWhere my thots at? (Mmm, mmm)\nLet me hit it from the back, say, \"Slatt, Slatt\"\n\n[Chorus: Megan Thee Stallion]\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shake that shit (Brr, brr, brr)\nHmm, hmm (Hey), work it, bitch\n\n[Verse 3: Megan Thee Stallion]\nI'm gon' blow him like AC (Mwah)\nGive me big head like IT (Ah)\nLick, lick, lick me 'til I scream\nTwist his tongue like I, I mean\nI mean my body so out of this world\nChange my at name to ASTROGIRL (ASTROGIRL)\nPeople say I'm way too full of myself\nYou're right, and I ain't even made it to dessert, ah\nBuffy, no Angel, star, no spangle\nForty-inch weave by Kellon don't tangle\nCall my drug dealer boyfriend on Tango\nUse the Tajín when I'm eatin' a mango\nYeah, I get jealous\nIf you ate it real good, I can't help it\nAny bitch you fuckin' with, you need to dead it\n'Fore I come through and shit get hectic, ah\n\n[Chorus: Megan Thee Stallion]\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shake that shit (Brr, brr, brr)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that\nMmm, mmm, shake that shit (Bow, bow, bow)\nHmm, hmm, work it, bitch\nDon't stop, pop that cat\nMmm, mmm, just like that (Bow, bow, bow)\nMmm, mmm, shake that shit (Brr, brr, brr)\nHmm, hmm, work it, bitch (Ah)", "[Chorus]\nHey, cocky as fuck, everything 'bout me poppin'\nGot face, I got body\nYou name it, I got it\nCocky as fuck, bitch you know I’m conceited\nYo' hoe wanna be me, yo' nigga wanna eat it\nCocky as fuck, everything 'bout me poppin'\nGot face, I got body\nYou name it, I got it\nCocky as fuck, nigga fuck your opinion\nI hustle to get it, I get it, I get it\n\n[Verse 1]\nI am not seeking approval\nI’m number one, I tell bitches what to do\nHe heard I’m Creole, he think I know voodoo\nBitch, I will twist yo' ass up like a noodle\nHoe you a copy of me, you a doodle\nBitches is flocking to me like I’m Kodak\nAll of my bitches is yellow, they bodak\nHop out the whip at the light and they throw that\nUh, cocky as fuck in the mall witcho daddy\nHe kissin' the ground that I walk on, uh\nCocky as fuck in a pic witcho nigga\nHe bought everything that I got on\nAye, aye, throw that uh, throw that\nBitch I look good and you know that\nThey say I got me some money and changed\nLil bitch you know I was poppin' before that\nAye, yeah, sexy as fuck\nLook in the mirror, I’m madly in love\nRubbing some dubs on a bitch in the tub\nYo' nigga suck it like a Capri sun\nTell 'em come pick up after school\nI’m tryna hammer that dick like a screw\nI’m tryna give you something you can chew\nI’m tryna give you that M and that ooh\nI got the moves like a damn kangaroo\nFoot in they ass cause these bitches my shoes\nI am the captain, they do what I do\nOn top of these bitches heads like a roof\nCocky as fuck and my friends cocky too\nI’m fine as fuck and they all sexy too\nIf I got beef witchu, they got it too\nBitch, I’m the truth and yo' nigga the proof, ahh", "[Chorus]\nHey, cocky as fuck, everything 'bout me poppin'\nGot face, I got body\nYou name it, I got it\nCocky as fuck, bitch you know I’m conceited\nYo' hoe wanna be me, yo' nigga wanna eat it\nCocky as fuck, everything 'bout me poppin'\nGot face, I got body\nYou name it, I got it\nCocky as fuck, nigga fuck your opinion\nI hustle to get it, I get it, I get it\n\n[Verse 2]\nBitch, do it look like I fight?\nHoe just be cool when I got on this ice\nThis shit is Gucci, this shit is too tight\nI only sweat when I go exercise\nYou cannot touch me so don’t even try\nBitch, I will pull up and pop you like pie\nKeep telling bitches this shit could get ratchet\nI’m wit' some niggas that’s gone make it happen\nI’m holding my pussy like it’s a weapon\nI cut a nigga off like a machete\nI’ll put a price on yo' head like you Kelly\nMegan from Texas, I’m naturally sexy, uh\nThis that flossy pussy\nI rock suits, that’s bossy pussy\nTell ’em use a lot of spit so I can keep a glossy pussy\nHe gimme neck like a yo-yo, uh\nTalk to my kitty like \"hello\", uh\nSlide on yo mouth like a cello, uh\nBoujee but fuck like I’m ghetto, uh\nYou don’t like me, get in line hoe\nI be on yo' mind though\nBitch you know I’m poppin', you just hatin' cause I’m fine hoe\nBitch eat a dick, uh\nDon’t like me then stay off my shit, uh\nYou need to hold your tongue, uh\nUnless you gonna lick on my clit, ah ah\n\n[Chorus]\nHey, cocky as fuck, everything 'bout me poppin'\nGot face, I got body\nYou name it, I got it\nCocky as fuck, bitch you know I’m conceited\nYo' hoe wanna be me, yo' nigga wanna eat it\nCocky as fuck, everything 'bout me poppin'\nGot face, I got body\nYou name it, I got it\nCocky as fuck, nigga fuck your opinion\nI hustle to get it, I get it, I get it (Get it, get it, get it, get it)", "[Intro]\nAyy, ayy\nBoy, you know you need to come give me that dick\nHe want to hit from the back 'cause I'm thick\nI like to fuck on 'em when I get lit\nYeah, tell me this pussy the shit\nAyy, ooh, he so thirsty\nRide that dick like a horsey\nHe said, \"Are you tired?\"\nI look back like, \"Boy, please\"\n\n[Chorus]\nAyy, let's have the sex talk (Huh)\nWanna see your body, take your clothes off (Huh)\nI'ma bust quick if ya lips soft (Huh)\nRock that ship 'til ya blast off\nAyy, yeah, let's have the sex talk (Huh)\nGot a big boy, then pull it out, hey\nCan you make it feel like the first time? (Huh)\nI don't get tired, let him wear it out\nAyy, yeah\n\n[Verse 1]\nPut my feet up on the bed, ride it to the tip-top (Tip-top)\nHe like it doggystyle 'cause I make that ass pop (Ass pop)\nHe never finna leave me 'cause I got that drip-drop (Drip-drop)\nSaid his last bitch still fuckin' like a robot\n\n[Chorus]\nAyy, let's have the sex talk (Huh)\nWanna see your body, take your clothes off (Huh)\nI'ma bust quick if ya lips soft (Huh)\nRock that ship 'til ya blast off, ayy, yeah\nLet's have the sex talk (Huh)\nGot a big boy, then pull it out, hey\nCan you make it feel like the first time? (Huh)\nI don't get tired, let him wear it out\nAyy, yeah\n\n[Verse 2]\nGot more milkshake than Kelis\nAin't met a nigga who can handle me (Handle me)\nI think I should be in museums\n'Cause this body a masterpiece (Yuh, yuh)\nCan I fuck you to a trap beat?\nHe said, \"Girl, you tryin' to trap me?\"\nAw, hell nah, nigga, no I ain't (What?)\nYou can hit that door, here, go 'head, leave\n\n[Chorus]\nAyy, let's have the sex talk (Huh)\nWanna see your body, take your clothes off (Huh)\nI'ma bust quick if ya lips soft (Hey)\nRock that ship 'til ya blast off, ayy, yeah\nLet's have the sex talk (Huh)\nGot a big boy, then pull it out, hey\nCan you make it feel like the first time? (Huh)\nI don't get tired, let him wear it out\nAyy, yeah\n\n[Verse 3]\nBad bitch, taste like cherry kiwi\nReal big titties, these double DDs\nIce on my neck be real, VVs\nPeanut butter inside, Reeses Pieces\nHe said it taste just like bubble gum\nHe eat it from the back to the front\nBitch I got green like I'm Buttercup\nHe say I got that lil' yummy-yum\n\n[Chorus]\nAyy, let's have the sex talk (Huh)\nWanna see your body, take your clothes off (Huh)\nI'ma bust quick if ya lips soft (Hey)\nRock that ship 'til ya blast off, ayy, yeah\nLet's have the sex talk (Huh)\nGot a big boy, then pull it out, hey\nCan you make it feel like the first time? (Huh)\nI don't get tired, let him wear it out\nAyy, yeah\n\n[Outro]\nAyy\nBad bitch taste like cherry kiwi\nReal big titties, these double DDs\nMwah", "[Intro]\n(Ahem)\nCheck, check, check\nLilJuMadeDisBeat\n\n[Verse 1]\nAy, say, nigga, I don't wanna talk\nMeet me at the bank, show me what you really ’bout\nNiggas ain't real when the shit really count\nThat's why I keep my lil’ cat in they mouth\nSay, bitch, I don't gotta cap\nEverything I talk, yeah, I really did that\nIf you want beef, then my bitch gon' scratch\nI'ma get the money, so I let her handle that (Woo)\nFree JT (Ayy)\nReal bitches fuck wit' me (Ayy)\nI don't do shit for the free, man\nY'all niggas gotta pay me (Ayy)\nPut some respect on my team (Huh)\nI'm the 1501 queen (Ayy)\nBitch, you better learn who run it\n’Cause all this money gotta come through me (Ayy)\n\n[Chorus]\nI keep it realer than real\nFuck all the critics and fuck how they feel\nI’m getting money, it is what it is\nThey wanna know how I did what I did\nDon't worry ’bout why I do what I do (Bitch)\n'Cause I ain't worried bout you (Bitch)\nNah, I don't wanna be cool (Bitch)\nStill hanging with the same crew (Ayy)\n\n[Verse 2]\nCut a nigga off and my checks got bigger\nRich bitch shit, got a broke ho bitter\nOutta any bitch, I’m the hardest in the litter\nIf you think she bad, put her in, let me get her\nY'all praisin' bitches that's doin' the minimum\nThey put that check in my hand, now I'm killin' 'em\nDon't wanna link with these bitches, ain't feelin' 'em\nI'll knock the shit out that bitch like a enema, ahh\n\n[Bridge: Spoken Word]\nYeah (Hmm)\nI know these bitches want the recipe for this hot shit\nI told them bitches I ain't gon' let one hater stop shit\n(I ain't gon' let no hater stop shit)\nGucci down, these niggas love the way I rock shit\nI'm a real rap bitch, this ain't no pop shit\n\n[Verse 3]\nAyy, ayy, ayy, yeah\nThese hoes know who to play with\nOn the internet, all with the gang shit (Ayy)\nThey love to talk hot shit with a lame bitch\nBut when they come around me they don't say shit (Okay)\nAyy, yo' shit ain't pop 'cause it ain't hot\nKeep talkin' trash, I'ma come take you out\nStraight to the top, you cannot reach me\nAin't fuckin' these niggas, I'm makin' 'em eat me\nGot that big budget with no major deal\nDon't wanna fly out to go eat a meal\nI am not signing for less than a mil\nIf you don't like it, then fuck how you feel\nDreams, fuck with Kel\nJ-bone, what's the deal?\nIn the section with the bands\nBring them girls over here\n\n[Chorus]\nI keep it realer than real\nFuck all them critics and fuck how they feel\nI'm getting money, it is what it is\nThey wanna know how I did what I did\nDon't worry 'bout why I do what I do (Bitch)\n'Cause I ain't worried bout you (Bitch)\nNah, I don't wanna be cool (Bitch)\nStill hanging' with the same crew (Ayy)", "[Intro: Megan Thee Stallion]\nReal hot girl shit\n(d.a. got that dope)\n\n[Chorus: DaBaby]\nThat ain't DaBaby, that's my baby\nHer friends and mom hate me (Go)\nLay down on the bed, do the crybaby (Mmm)\nShe ain't gave me none of that pussy in a while\nShe had the boy waitin', I don't mind waitin' (Come here)\nOh, you ain't gon' respond to my texts? (Oh, yeah?)\nWant me keep on my diamonds, we sex? (What's your name?)\n\n[Verse 1: DaBaby]\nKeisha? (Kei), Jasmine? (Jas), Kiera? Megan? (Go)\nLisa? Ashley? (Ashley), Sierra? Sarah?\nShe got her hands on her knees with her ass in the air, ooh, that lil' bitch a player\nIf her friends ain't around to record it, she bend over, shake that lil' ass in the mirror\nLike goddamn, what a nigga gotta do for your number?\nShawty came through with that head so good, I said fuck it, I ain't usin' no rubber\nWay she make that ass bounce, think I love her\nGot that ass and that mouth from her mother\nType to make your bae mad, you in trouble\nNBA playoffs that ass, it's a bubble\nUh-uh, uh-uh, come here, come here, uh-uh\nThrow that ass back, come here, come here\n\n[Chorus: DaBaby]\nThat ain't DaBaby, that's my baby\nHer friends and mom hate me (Go)\nLay down on the bed, do the crybaby (Go)\nShe ain't gave me none of that pussy in a while\nShe had the boy waitin', I don't mind waitin'\nOh, you ain't gon' respond to my texts? (Oh, yeah?)\nWant me keep on my diamonds, we sex? (What's your name?)\n\n[Verse 2: Megan Thee Stallion]\n(Wah, wah, wah, wah) Real hot girl shit (Ayy, ayy, ayy, ayy)\nLay on my stomach, toot it up, do the crybaby (Crybaby)\nLook back, hold it open, now he annihilated (Yeah)\nMoaning like a bitch when he hit this pussy\nDamn, he probably wanna wear my hoodie (Ah)\nChoke me, spank me, look at me, thank me (Thank me)\nIf I give it to another nigga, he'll hate me (He'll hate me)\nSpit, slurp, give him that work\nFell too fast for me, now the nigga hurt\nDeeper, deeper, I need a reaper\nThought I was in trouble how he tearin' them cheeks up\nKeep me a freak, who the flavor of the week?\nIf I make up the rules, then I don't think it's cheatin'\nJordan, Tommy, Timothy, Daniel (Which one?)\nMight let Jonathan bring in Sarah (Come here, Sarah)\nBitch tryna brag about taking my man (Huh?)\nHah, I needed me a nigga off my hands (Hahahaha)\nUh-uh, don't fuck me like that, fuck me like this, yeah, ayy\n\n[Chorus: Megan Thee Stallion]\nHis friends and his dad hate me (Yeah)\nI broke his lil' heart, he a crybaby (Wah-wah-wah)\nIf I ain't let him hit the pussy by now\nThen that nigga lame if he still waitin'  (Ah, ah, ah)\nI ain't even save your number (Nope)\nSo no, I can't reply to no text (No text)\nI make him cry 'bout the pussy, hmm\nProbably why my shit so wet (Ah, ah, ah, ah, wah, wah, wah)", "[Intro]\n(DJ Chose)\n(P Crisco)\nYeah, yeah, I put that 1501 chain around my neck and now it's lit\n\n[Chorus]\nAll the hot girls, make it pop, pop, pop (Pop, pop)\nBad bitches wit' the bag, say “I\", ya, ya\nIf he ain't talkin' 'bout no money, tell him “Bye, bye, bye” (Boy, bye)\nAnd if you see a mad hoe, tell her “Hi, hi, hi\" (Hey)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe, fuck a broke hoe (Ooh)\nDon't get mad, hoe (Get mad), get a bag, hoe (Ahh)\n\n[Verse 1]\nSpicy, pricey, neck and wrist icy\nBitch it's moneymaking Megan, hoe, get like me\nI rode it, a soldier, a hot girl, he want it (Uh)\nPull up in that Masera', gettin' top on lock (Skrrt)\nThey still tryna find a thing that I can't do\nI told her, “If you go against me, you a damn fool” (Bitch, you dumb)\nBut keep talkin' 'bout me, bitch, that's all you can do (Oh, okay)\nBut keep my cat up out ya mouth, 'cause that's ya man food\nOoh, ooh, ooh, ooh, ooh, ooh (She like \"What?\")\nI know you crunk but lil' bih, please watch my shoes (Goddamn)\nI'm not the DJ but I'll make ya body move (Goddamn)\nWatch ya' mouth before I leave here wit' your boo (Ahh)", "[Chorus]\nAll the hot girls make it pop, pop, pop (Pop, pop)\nBad bitches wit' the bag say “I\", ya, ya\nIf he ain't talkin' 'bout no money, tell him “Bye, bye, bye” (Boy, bye)\nAnd if you see a mad hoe, tell her “Hi, hi, hi\" (Hey)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe, fuck a broke hoe (Ooh)\nDon't get mad, hoe (Get mad), get a bag, hoe (Ahh)\n\n[Verse 2]\nLil' thundercat, throw it back, he can't handle that\nI'on want to talk unless a nigga finna throw a stack\nBad attitude but I'm cute so he call me bae\nI'ma need that head, give me neck like a vertebra\nCheck my body, oochie wally, where ya' wallet?\nIf I take yo' nigga, it's nothing you can do about it (Not at all)\nI'm the fucking hottie, I'm not yo' momma or your partner\nSo don't play with me, bitch, I'm from Texas, we get rowdy\nI got my hands up on my knees, I'm 'bout to work him out his jeans\nHe get behind me, I'ma QB, throw it back and wide receive\nYo' nigga wish he had me, boy, yo' BM ashy\nAnd I'm cocoa-buttered down, pretty brown, bad B\n\n[Chorus]\nAll the hot girls make it pop, pop, pop (Pop, pop)\nBad bitches wit' the bag say “I\", ya, ya\nIf he ain't talkin' 'bout no money, tell him “Bye, bye, bye” (Boy, bye)\nAnd if you see a mad hoe, tell her “Hi, hi, hi\" (Hey)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe, fuck a broke hoe (Ooh)\nDon't get mad, hoe (Get mad), get a bag, hoe (Ahh)\n\n[Verse 3]\nI can make ya' man do what I want him to do (Oh, yeah)\n'Cause when he seen me, he ain't want to fuck with you (Not at all)\nI point down at this candy, told him what he finna chew\nAnd tease you with the nigga, nah nee, nah nee, boo-boo\nAyy, I want some money, yeah, I want some money\nAnd he gon' bring it to Megan, do what I say like his Mommy\nI wrap that dick like a mummy, he do not run when I'm cumming\nHe open up and he catch it, he suck these titties, these leches\nI throw that booty, he fetch it, this pussy really a present\nI got the Michael, that Thriller, these bitches hiding they niggas\nI got that now and that later, he gon' eat through the paper\nHe tryna eat through these panties, he bob his head like he jammin' (Ahh)\n\n[Chorus]\nAll the hot girls make it pop, pop, pop (Pop, pop)\nBad bitches wit' the bag say “I\", ya, ya\nIf he ain't talkin' 'bout no money, tell him “Bye, bye, bye” (Boy, bye)\nAnd if you see a mad hoe, tell her “Hi, hi, hi\" (Hey)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe (Get mad), get a bag, hoe (Get a bag)\nDon't get mad, hoe (Huh), fuck a broke hoe (Ooh)\nDon't get mad, hoe (Get mad), get a bag, hoe (Ahh)", "[Intro]\n(DJ Chose)\n(PCrisco)\n\n[Verse]\nBoy\nYou know your bitch is not fuckin' with Megan\nYour nigga not even fuckin' you naked\nHe put the tip in and then you start complainin'\nIf I get on it, I own it and take it\nIf it ain't good then I ain't finna fake it\nYou fuck like a rabbit, grow up and stop playin'\nI need a nigga with stroke, hey\nI wanna bust it on your face\nHe wanna see my shit squirt like he squeezed it\nHe finna die by this pussy, he need it\nHe wanna keep it like lock it and key it\nI tell him to bring me my money then beat it\nGive a nigga back to the streets, ayy\nAsk your man not me, ayy\nOnly see him when it's time to eat, ayy\nYou ain't seen ya nigga, 'bout three days\nAsk your friend bout me I'm the bomb, bae\nRap bitch all on the runway\nPink lemonade with the Bombay\nMake the booty uh oh like Beyoncé\nI could make the dick dance, rock it like a blast\nAnd he want another chance, but I know he won't last\nAnd your last bitch mad 'cause I'm comin' up fast\nI'm passin' bitches up like they runnin' out of gas\nYour favorite rapper only use onomatopoeias\nYou don't wanna hear it 'cause you only wanna see her\nI'ma show you how a real rap bitch tee up\nGet up in the booth and beat the motherfuckin' beat up\nPissin' bitches off like a nigga left the seat up\nBitch big mad 'cause you can't beat me up\nI don't wanna talk shit with ya or meet ya\nJealous ass trick tryna fuck up my features\nI get my revenge when I drop all my pictures\nI'm pretty like art, bitch, I look like a fixture\nI'll get my revenge when I fuck on your nigga\nI take that shit back, I won't fuck on your nigga\nI'll fuck on his face, right in your place\nRun with with his money, I'm goin' to Chase\nMovin' these bitches right out of my way\nYo' favorite baddie be stalking my page\nYo' baby daddy be stalking my page\nYo' baby momma so minimum wage\nKeep that lil' bitch from the fuck out my face\n'Fore I beat the bitch up with a fucking briefcase\nFull of them bands, full of them M's\nBitch, I'm on top of this bread like a ant\nAll of my hotties know Megan the shit\nAll of these rappers know Megan that bitch\nWonderin' how I'm this hot with no deal\nBitches offended by my sex appeal\nI'm not a snack, nigga, I am a meal\nI'm from the H, nigga, I am so trill\n\n[Outro]\nAh", "[Intro: Megan Thee Stallion, JT & Yung Miami]\nReal hot girl shit\n(Do it on the dick, do it on the dick, do it, do it)\nAnd the motherfuckin' City Girls\n(Do it on the dick, do it on the dick, do it, do it)\n\n[Verse 1: Megan Thee Stallion]\nI would never trip about any old dick (Yeah)\nIf my heart broke, it's nothin' that my jeweler won't fix (That my jeweler won't fix)\nPut some ice on my chest just to cool my shit (Brr)\nAnd I keep me a fur, 'cause I'm a real cold bitch, ayy (Ah)\nI'm a cold bitch, yes, I'm a cold piece\nLookin' for a Mr. Freeze to get froze like me (Like me)\nGot a lot of cold stones, and I ain't talkin' ice cream (Ice cream)\nPut my arm to the sun, bet I melt your wholе team\nOkay, now can I take your order? I'ma sеrve 'em what they wanted (Yeah)\nBitches thinkin' they the shit when they really toilet water (When they really toilet water)\nThey don't go against me, they gon' go bar for bar? (Bar for bar?)\nI'ma get 'em in the end like Simba did Scar (Ayy)\nOh, shit, I think I'm pregnant, but I don't see no belly (I don't see it)\nThese bitches tryna come my way before they even ready (They premature)\nThey say I got the skills, they say I got the look (I got the look)\nI got so many bars, they puttin' money on my books, hey (On my books)\nBe mad at them niggas how you be mad at me (Bitch)\nHe got you lookin' stupid, but you wanna argue with me (Huh?)\nI got a couple of bitches mad 'cause I don't fuck with them no more (I don't fuck with them no more)\nBut since you say you so unbothered, what you speaking on me for? (Shh)\n\n[Chorus: Megan Thee Stallion]\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it", "[Verse 2: JT & Yung Miami]\nTop-notch bitch, I'm A-listed (Huh?)\nThis City Girl shit, can't flex like this\nOld country-ass bitch can't dress like this (Can't)\nBye, do it on the dick and a bitch (Period)\nClap this ass on that dick, I'ma spazz on that dick\nGo to sleep, take a nap, I'ma crash on that dick\nI won't beg for no dick, I won't cry for no dick\nIf your dick broke, nigga, put a cast on that dick\nRich with an attitude, R-W-A (You is)\nBitch, I got kids, I know how you hoes play (You do)\nIce cube, peanut pussy, eat it, soufflé (Ow)\nThese hoes my sons, I should call 'em O'Shea\nFuckboys, I ain't pressed for 'em (At all)\nI need a nigga with a Patek and a TEC on him (Ice, ice, ice)\nBig dick, Chrome Hearts, and baguettes on him\nIf he got the bread, I'ma do the rest for him, period\n\n[Chorus: Megan Thee Stallion]\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\n\n[Verse 3: Megan Thee Stallion]\nAyy, real bitch, but that body built like a doll (Like a doll)\nI ain't in no competition with these hoes at all (With these hoes at all)\nI should own a bakery way niggas bring the cake to me (Ah)\nAnd if that boy a baller, I bet I can make him play for me\nOkay, now, do it for a real bitch (Yeah), buy a bitch a real bag (Buy a bitch a real bag)\nBefore I pick the wrong nigga, make sure your friends tagged (Who is he?)\nDo it for them bitches and they friends who be big mad (Ah)\nI know my haters watchin', so I do it for they bitch-ass\n\n[Chorus: Megan Thee Stallion]\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\nDo it on the dick, do it on the dick, do it, do it\n\n[Outro: Megan Thee Stallion]\nBaow, baow\nBrr, brr\nBaow, baow-baow-baow\nBrr, brr, brr\nBaow, baow\nBrr, brr\nBaow, baow-baow-baow", "[Intro]\nLilJuMadeDaBeat!\nYeah, ah\nYoung Tina Snow goin' hard on hoe, ah\n\n[Verse 1]\nAin't none of these hoes got shit on me\nNone of these hoes flow sick like me (No)\nHeard how I rap, wanna spit like me\nNow all of these hoes wanna pimp like me (Ah)\nNone of these hoes, none of these hoes, none of these hoes\nNot not nan one of these hoes\nEven come close, 'cause they gross\nLike I brought it from my chest\nFrom the back of my throat, huh\nSayin' that you bout' it when you ain't, huh\nPut you in the field, you'll faint, ah\nDebbie Pie ass bitch, Easy-Bake, ah\nI bet you raw doggin' with a lame, huh\nFuck what you heard what you know (Bitch)\nI've never been scared of a hoe\nI'm lookin' for you bitch, lay low\nOh, hoes wanna go toe to toe?\nBitch puh-pretty please\nI want you to come say something to me\nI've really been itchin' to go the fuck off\nI put this Giuseppe heel in yo' mouth\nBitch, bitch, it's Tina Montana\nSnatch off your wig like you Hannah Montana\nBitch I will put you to sleep, no pajamas\nI will flip out in this bitch like a sandal\nHey, yuh\nWalk like this, talk like this, look like this, you could never (A-ah)\nBad red bone from the south ridin' round, hittin' licks with a yellow\nBitch so bad, when I walk past, niggas sing my name acapella\nH-town Hottie turnin' niggas into zombies, make em dance like Thriller\n\n[Interlude]\nYeah, look, bitch\nI know a sexy motherfucker like myself might offend some\nBitch, I'm the shit and then some\nThis ain't no motherfuckin' race, 'cause I been won\nAnd if you don't like it, tune the fuck out\nAnd you must like it, 'cause you tuned the fuck in\n\n[Verse 2]\nI got your boyfriend forehead on my tummy\nTurn your bitch into a thot like she Duckie\nIf I ever let him eat it he lucky\nDon't want yo nigga, but he wanna fuck me\nI'ma wake up and go get me some money\nHe gon' wake up and give me sucky sucky\nThese bitches scary, they chicken, Kentucky\nBitch, I'm from Texas, you know we be buckin'\nWords like a blade, every beat I be cuttin'\nDrawin' an M on these lips, he McLovin'\nBitch, I'm a ten like I landed and stuck it\nIf you don't like me, lil' bitch, you could suck it\nAll of my haters is crabs in a bucket\nNose in the air 'cause they fuckin' disgust me\nNone of these bitches is fuckin' with Megan\nBitch, I'm the hottest, the fuck is you sayin'?\nI had to hop off the porch and go get it\nI went to pick up the torch and then lit it\nThey try to tell me I can't, but I did it\nWhen I pull up bitches look like they shitted\nI had to start from the muhfuckin' bottom\nMy momma told me to get em, I got em\nMy granny told me you goin' to school\nGettin' that degree and making it cool\nI have not worked nine to five in a while\nI just be hustlin', watching it pile\nThey pullin' bitches from link in a bio\nYou wanna reach out to me, it's a process\nI got a middle man, he gotta connect\nBottom line is, I'm not easy to contact\nBitch I'm exclusive like where did you find that?\nPick me a beat and you know I'ma kill that, aah", "[Intro]\nYeah\nHey\nReal hot girl shit\nAh\n(Fuck that nigga)\nHey, hey\nBaow, baow\n\n[Chorus]\nLook, why you wanna do the bad bitch wrong? (Huh?)\n'Bout to make this every bad bitch song (Ayy)\nDon't you hate when you hold a nigga down\nThen he switch up on you, turn out to be a clown? (Ayy)\nLook (Hey), I ain't in my feelings with it (In my feelings)\nTurn around, poke it out, bitch, get it, get it (Get it, get it)\nTurn up on 'em, make 'em kill the noise\nWe ain't goin' back and forth with the lil' boys\n\n[Verse 1]\nShh, cut the noise\nI ain't goin' back and forth with these lil' boys (Lil' boys)\nI'm a February baby, I'm a big flirt (Big flirt)\nI gotta give a nigga space when his feelings hurt (Hey, hey)\nAyy, look, cut the shit\nI ain't goin' back and forth with a broke bitch (Broke bitch)\nJawbreaker, I ain't fuckin' with thе sucker shit (Yeah)\nIf I cut her off, thеn I mean it and it's fuck a bitch\nThe more I ignore you, the more you adore me (Yeah)\nCrazy-ass niggas need to come with a warnin' (Come with a warnin')\nIs he crazy 'bout me or he just crazy? You been trippin' lately (Yeah, yeah)\nNigga too attached, got him actin' like a titty baby (Yeah)\nBullet wounds, backstabs, mama died, still sad\nAt war with myself, in my head, bitch, it's Baghdad (Yeah)\nNew nigga tryna come around and play clean (Hmm)\nAnd my clothes fit tight, but my heart need a seamstress (Ah)", "[Chorus]\nLook, why you wanna do the bad bitch wrong? (What?)\n'Bout to make this every bad bitch song (Ayy)\nDon't you hate when you hold a nigga down\nThen he switch up on you, turn out to be a clown? (Ayy)\nLook, I ain't in my feelings with it (In my feelings)\nTurn around, poke it out, bitch, get it, get it (Get it, get it)\nTurn up on 'em, make 'em kill the noise\nWe ain't goin' back and forth with the lil' boys\n\n[Verse 2]\nOne, never let a nigga see you sweat (Never)\nTwo, never let these niggas come between a check (Yeah)\nThree, never let a nigga turn you 'gainst me (Hey)\n'Cause the dick come and go, but I'm ridin' past E (Ayy)\nKeep that shit player, I don't like gettin' personal\nTreat 'em like a job, when I get 'em, I'm workin' 'em (Workin')\nNiggas love usin' Instagram like a journal (Yeah)\nJust like my ass, niggas talkin' in a circle (Baow-baow-baow)\nWhy niggas love to talk down? I don't know (I don't know)\nLike I ain't keepin' all the facts in my phone\nLike I ain't got the pictures of you beggin' for forgiveness (Yeah)\nI ain't gotta do the most, I know what the real is (I know what the real is)\nAin't the jealous type, please don't believe the hype (Please)\nYou can't make me mad with some shit that I'ma like (That I'ma like)\nDon't mean to be intrusive, but you thinkin' you exclusive\nWhen a party ain't a party if my bitches ain't included (Ah, ah)\n\n[Chorus]\nLook, why you wanna do the bad bitch wrong? (What?)\n'Bout to make this every bad bitch song (Ayy)\nDon't you hate when you hold a nigga down\nThen he switch up on you, turn out to be a clown? (Ayy)\nLook, I ain't in my feelings with it (In my feelings)\nTurn around, poke it out, bitch, get it, get it (Get it, get it)\nTurn up on 'em, make 'em kill the noise\nWe ain't goin' back and forth with the lil' boys\n\n[Outro]\nWhy you wanna do the bad bitch wrong?\n'Bout to make this every bad bitch song, ayy\nDon't you hate when you hold a nigga down\nThen he switch up on you, turn out to be a clown? Ayy\nLook, I ain't in my feelings with it\nTurn around, poke it out, bitch, get it, get it\nTurn up on 'em, make 'em kill the noise\nWe ain't goin' back and forth with the lil' boys\nWe ain't goin' back and forth with the lil' boys", "[Intro: Juicy J & Megan Thee Stallion]\nWhat Juicy say? He be like, \"Shut the fuck up\"\nPlay me some pimpin', man\nWe got a thing going on\nNo, I’m not that nigga that be hugged up with your butt\nI'm the one walkin' away when your mouth is full of nut\nNo, I’m not that nigga that be hugged up with your butt\nI'm the one walkin' away when your mouth is full of nut\nYeah, hey, ayy (Mafia)\n\n[Chorus: Megan Thee Stallion]\nSimon says put your hands on your hips, huh\nSimon says put your hands on your knees, ayy\nSimon says put your hands on your feet, ayy\nSimon says bust it open like a freak, ayy\nSimon says put your hands on your hips, yeah\nSimon says put your hands on your knees, ayy\nSimon says put your hands on your feet, ayy\nSimon says bust it open like a freak, ah\n\n[Post-Chorus: Megan Thee Stallion]\nLeft, right, left, right, left\nLeft, right, left, right, left\nLeft, right, left, right, left\nHah, hah, left, right\n\n[Verse 1: Megan Thee Stallion]\nIf he fuckin' with me then he know he gonna wait\nPussy finger lickin' good like I mixed it with Old Bay\nNigga actin' like he player when he really just a play\nIt's some hoes in this house and they goin' through your safe, ah\nHands on your knees, bitch, bust it back, ayy\nThrough the tights, you can see this pussy fat, ayy\nThrough them pockets, I can see a nigga’s racks, ayy\nI’m a money making bitch, no cap, ayy\nHottest out but you already knew that\nEven if I brought him to you, still couldn't get your boo back\nI ain’t finna argue with you, this ain't how we do that\nYou was already mad, I'm just addin' somethin’ to that, ayy\n\n[Chorus: Megan Thee Stallion]\nSimon says put your hands on your hips, huh\nSimon says put your hands on your knees, ayy\nSimon says put your hands on your feet, ayy\nSimon says bust it open like a freak, ayy\nSimon says put your hands on your hips, yeah\nSimon says put your hands on your knees, ayy\nSimon says put your hands on your feet, ayy\nSimon says bust it open like a freak, ah\n\n[Post-Chorus: Megan Thee Stallion]\nLeft, right, left, right, left\nLeft, right, left, right, left\nLeft, right, left, right, left\nHah, hah, left, right\n\n[Verse 2: Juicy J]\nSimon says give me head 'til I'm sleep ('Til I'm sleep)\nShe a squirter, now it's all in the sheets (In the sheets)\nLove a freaky bitch, I put her ass to work\nAss bustin' out the skirt, pop that pussy like a Perc'\nShawty wanna take the pipe all day and night (Yeah, ho)\nShe might even swallow somethin' if your paper right (Yeah, ho)\nThe kids at her mama's house, she down to take a flight\nGot a purse full of magnum rubbers and some baby wipes (Yeah, ho)\nYeah, I gotta have it (Have it), ratchet pussy magnet (Magnet)\nIf she burp a baby out her mouth, I'm the pappy (Mhm)\nVIP full off half-naked bitches ass clappin'\nThrow a thousand ones in the air, now these hoes jacking\n\n[Chorus: Megan Thee Stallion]\nSimon says put your hands on your hips, huh\nSimon says put your hands on your knees, ayy\nSimon says put your hands on your feet, ayy\nSimon says bust it open like a freak, ayy\nSimon says put your hands on your hips, yeah\nSimon says put your hands on your knees, ayy\nSimon says put your hands on your feet, ayy\nSimon says bust it open like a freak, ah\n\n[Post-Chorus: Megan Thee Stallion]\nLeft, right, left, right, left\nLeft, right, left, right, left\nLeft, right, left, right, left\nHah, hah, left, right", "[Intro]\nHe's on fire\nHot girl, hot girl, hot girl\nIf they say I ain’t the baddest then the motherfuckers lied\nHow you riding on a nigga who be asking for a ride?\n\n[Verse]\nOkay, running up them bands, tryna ball 'til I fall\nRunning from his bitch, he gon' come when I call\nIf it ain’t 'bout money, then you know I ain't involved\nWorry 'bout these motherfucking haters, not at all\nNine times out of ten, I'm the realest bitch you know\nIf you ain't want a pimp, then what you fucking with me for?\nIf you balling and you know it, then let the money show\nIf he acting scared to spend it, I'ma show him to the door\nOkay, now shake with it, shake-da-shake with it\nAnd if the beat live, you know LilJu made it\nAnd when I pop it, he get stiffer than some fake titties\nAnd don't be worried ’bout who I’m fucking 'cause you can’t hit it\nYeah, running up them bands, tryna ball 'til I fall\nIf I'm with your daddy, then you know we at the mall\nIf I'm with a nigga, then you know I’m in them jaws\nYou let a broke nigga talk you out the drawers\nI don't even chase liquor, why would I chase a nigga?\nHe say I should be nicer, well your dick should be bigger\nHe said, \"You better be good by the way that you bragging?\"\nI hit him back and told him, \"Well, that just depend who you asking\"\nI got an ex that say he gon' leave his new bitch whenever I call him\nGot an ex that say that every time he see me it's gon' be problems\nGot an ex that's on his homeboy IG tryna stalk me out\nGot an ex that miss it so bad, probably praying for me now, ayy\nRunning up them bands, tryna ball 'til I fall\nIn the Gucci store, finna tear that bitch down\nMoney on my phone, yeah, like collect calls (Hello?)\nPussy like a drug, and he having withdrawals\nAyy, money, money, I need more\nGet it, get it, watch me go\nI be outdoing these bitches, I'm like Michael, they Tito\nNot the one to compete with\nYou don't want it with me, bitch\n​göt2b Glued can't save you\nWhen I come for your hairdo\nGot the moves like I'm Ryu\nYellow diamonds, Pikachu\nWhen I switch my hair to blonde\nI'm finna turn up like Goku\nI go crazy in this bitch\nI go crazy in the booth\nHe go crazy when he see me\nAnd his girl go crazy too\nAnd this pussy so wet, might have to eat it with a spoon\nAlways in bikini bottoms 'cause I got that goo lagoon\nI don't wanna fuck him if he telling me what he do not\nI will come over and spin it on your head like bantu knots, ah\nRunning up them bands, tryna ball 'til I fall\nI be off that Henn', so you know I'm off the wall\nBitch, I ain't the one so watch your motherfucking mouth\nHot Girl Meg from the motherfucking South, ah", "[Intro: Logic]\n(What Juicy say? He be like, \"Shut the fuck up\")\n(Love it, man)\n\n[Chorus: SZA]\nI'ma be your freak any time or place, any day of the week\nSaid I'ma let you hit it, I ain't scared, I ain't shy, it's cool with me\nI'm lookin' for a thug who ain't scared of the pussy with a gangster lean\nIf you pull up and a nigga talkin' tough, better freak like me, yeah\n\n[Verse 1: Megan Thee Stallion]\nFreaky bitch, I do this, suck it like I'm toothless\nYour old bitch can't fuck with me, you ain't teachin' me no new shit\nDo you know who you dealin' with? Ain't convicted, but killin' shit\nCaught a jet just to buy a car, I'm the flyest bitch on the dealership\nLong legs, he intimidated, Amazon, I'm elevated\nLil' people make lil' people, stallions breed prize babies\nEat it up for a while, baby, buck on it, I'm wild, baby\nI ain't scared, let's take it there, I knew you was a crybaby\nBust that pussy wide, let him adventure inside\nIf my pussy was a beach, he get swept up by the tide\nAny nigga I let hit it, they know Stalli is a vibe\nIf I wasn't such a player, probably be somebody's wife\n\n[Chorus: SZA]\nI'ma be your freak any time or place, any day of the week\nSaid I'ma let you hit it, I ain't scared, I ain't shy, it's cool with me\nI'm lookin' for a thug who ain't scared of the pussy with a gangster lean\nIf you pull up and a nigga talkin' tough, better freak like me, yeah\n\n[Verse 2: Megan Thee Stallion]\nI wouldn't call it mackin', I call it speakin' with passion\nI don't call it seducin', I move on it, then I have it\nGot sugar for the daddies who truly support my habits\nWho buy the double-C's when I'm makin' A's in my classes\nWhy would I lie and say I wanna be your only one?\nKnowin' that I'm young and gettin' to the money, havin' fun\nKnowin' who I'm talkin' to, but watchin' him across the room\nKnowin' when I'm on the 'yac no tellin' what I'm finna do\nA special kind of lady, I'm not easily persuaded\nDrive so many niggas crazy, I'm thinkin' Uber should pay me\nSo sophisticated, still writin' incarcerated\nNiggas I was fuckin', when he get out, he gon' bang it, huh\n\n[Chorus: SZA]\nI'ma be your freak any time or place, any day of the week\nSaid I'ma let you hit it, I ain't scared, I ain't shy, it's cool with me\nI'm lookin' for a thug who ain't scared of the pussy with a gangster lean\nIf you pull up and a nigga talkin' tough, better freak like me, yeah\n\n[Outro: SZA]\nFreak, freak, freak like me, me, me\nFreaky like, freaky like, on it like a freak, like me, yeah, uh\nA freak like\nMe, yeah\nGive me a freak, freaky, yeah, yeah\nOh, oh, mmm-mmm, freak, yeah (Love it, man)", "[Intro]\nWhat Juicy say? He be like, \"Shut the fuck up!\"\n\nStick 'em up, stick 'em up, raise 'em up, raise 'em up (Swipe)\nDrop it off in your fucking face, it's the sawed-off (Hey, yeah)\nGotta get my ass in, gotta get my ass in (Hey)\nShoot 'em up, shoot 'em up, I gotta get some fuckin' in (Hey, hey)\n\n[Verse 1]\nDamn, I want some head but I chose the dough instead\nI could never ever let a nigga fuck me out my bread (Ugh)\nAin't no dick alive that could make me lose my mind\nEvery nigga that done tried still be cryin' on my line (Hey)\nLick, lick, lick, lick, lick, this is not about your dick\nThese are simply just instructions on how you should treat my clit\nHey, gotta get my ass ate, gotta make that ass shake\nGotta swipe a nigga card so much they had to call the bank (Ahh)\n\n[Chorus]\nStick 'em up, stick 'em up, raise 'em up, raise 'em up\nDrop it off in his fucking face, it’s the sawed-off\nGotta get my ass ate, gotta make that ass shake\nGotta swipe this nigga card so much they had to call the bank\n\n[Verse 2]\nHe said he ain't trickin' (What?)\nAnd he said he ain't lickin' (Ugh!)\nNigga, why you over here with all that little kid shit? (Ayy)\nBitch, I'm not yo' BM or no bitch that beg to see him\nHe say he gon' knock my head off\nI'm like, \"Yeah, yeah, yeah, just eat it\" (Ayy)\nBoy, you need me, I don't need you, lil' nigga\nBitch, is you fucking yo' niggas? Then hit 'em\nYou ain't been up in no pussy this tight\nI want a nigga, I know how to get him\nBlowin' him off then he blowin' me up\nThinkin' he something, I treat him like nothin'\nThese niggas know they ain't nothin' to me\nGivin' me money or makin' me nut (Ahh)", "[Chorus]\nStick 'em up, stick 'em up, raise 'em up, raise 'em up\nDrop it off in his fucking face, it’s the sawed-off\nGotta get my ass ate, gotta make that ass shake\nGotta swipe this nigga card so much they had to call the bank\n\n[Verse 3]\nFlew to LA, hit Rodeo\nI been out here makin' queso\nI bought all my shit in cash\nThey treat me like I'm movin' yayo\nI go shopping by myself, so they know I don't need a nigga\nBut you know he breaking bread if you see me with the nigga\nI rock shows by myself\nAin't no backup, ain't no help\nAin't no nigga put me on\nHo, I earned all my respect\nWhen you hear my fucking name\nKnow they speaking on a champ\nEverything that I done been through made me who I am right now, ahh\n\n[Chorus]\nStick 'em up, stick 'em up, raise 'em up, raise 'em up\nDrop it off in his fucking face, it’s the sawed-off\nGotta get my ass ate, gotta make that ass shake\nGotta swipe this nigga card so much they had to call the bank\n\n[Verse 4]\nThirty inches, I'm gon' swing that shit\nCopy me, I peep that shit\nPopping on my own\nI ain't never tried to be a bitch (Ay, yeah)\nAin't no chick alive who can knock me off my grind\nEvery ho that came and tried\nOut here strugglin', looking tired (Ahh)\nGoing to school, breaking the rules\nPatti LaBelle, gotta a new attitude\nBought me a house, ice out my neck\nGo to the hood, get my granny the rest\nI see those haters, I don't complain\nI must be poppin' if they know my name\nBitch I'm a pimp, where is my cane\nHo get too close and get slapped with the ring\n\n[Chorus]\nStick 'em up, stick 'em up, raise 'em up, raise 'em up\nDrop it off in his fucking face, it’s the sawed-off\nGotta get my ass ate, gotta make that ass shake\nGotta swipe this nigga card so much they had to call the bank\nStick 'em up, stick 'em up, raise 'em up, raise 'em up\nDrop it off in his fucking face, it’s the sawed-off\nGotta get my ass ate, gotta make that ass shake\nGotta swipe this nigga card so much they had to call the bank\n\n[Outro]\nStick 'em up, stick 'em up, raise 'em up, raise 'em up\nDrop it off in your fucking face, it's the sawed-off\nGotta get my ass ate, gotta get my ass ate\nShoot 'em up, shoot 'em up, I gotta gets the fuck in there\nStick 'em up, stick 'em up, raise 'em up, raise 'em up\nDrop it off in your fucking face, it's the sawed-off\nGotta get my ass ate, gotta get my ass ate\nShoot 'em up, shoot 'em up, I gotta gets the fuck in there", "[Pre-Chorus]\nOh, he want a bad bitch?\nWell, I want a nigga with some money and a long dick\nBuy me everything in my cart if you my boyfriend (Helluva made this beat, baby)\nInvest in this pussy, boy, support Black business\n\n[Chorus]\nGet it for a bad bitch, spend it for a bad bitch\nIf you got some money, then trick on a bad bitch\nSpend it for a bad bitch, get it for a bad bitch\nIf you got some money, nigga, trick on a bad bitch\n\n[Verse 1]\nOh, you wanna see my nails when they done? Shit, pay for 'em\nYou can't have opinions on no shit that you ain't payin' for\nAll them high school mindgames only work on needy bitches\nCall yourself not talkin' to me, I'm already callin' my other nigga, ayy\nBoy, I eat like a bad bitch, kale on my salad (Salad)\nDesigner on my sheets, boy, I sleep like a bad bitch (Bad bitch)\nThinkin' that he Future, I'ma leave him in the past tense (Bye)\nAnd I'm in my book, so I think like a bad bitch (Woah, woah)\nHe said, \"Let's make a movie,\" and nutted so quick, we made a story (Ugh)\nHe tell people we not talkin', no, lil' nigga, you gettin' ignored (Ah, ah, ah)\nHe text askin' what we are, I'm like, \"LOL, I'm dead\" (LOL, I'm dead)\nI think all these niggas stupid, but I still want the head, ayy\n\n[Chorus]\nGet it for a bad bitch, spend it for a bad bitch\nIf you got some money, nigga, trick on a bad bitch\nGet it for a bad bitch, spend it for a bad bitch\nIf you got some money, nigga, trick on a bad bitch\n\n[Verse 2]\nI ain't playin nice for no fuckin' plane ticket (Uh-uh)\nAnd I ain't comin' over 'til I know how big your dick is (Let me see)\nHe can call me lame and he can get an attitude\nBut I still ain't doin' nothin' I don't wanna do (Ah)\nDon't FaceTime me in public, 'cause you don't know who I fuck with\nWhy you askin' why I'm playin' when you know you got a girlfriend? (Hah)\nI'm too bad to be mad (Yup), I'm too sexy to be jealous\nAnd I'm too fuckin' grown to be playin' with these niggas (Hey, hey, hey)\n'Cause these niggas act like bad bitches, in the club takin' pictures\nOther niggas' sections takin' seats from these bad bitches (Bad bitches)\nMoody like these bad bitches, messy like these bad bitches (Ah)\nDiscussions on who fuckin' like these niggas never had bitches\n\n[Pre-Chorus]\nOh, he want a bad bitch?\nWell, I want a nigga with some money and a long dick\nBuy me everything in my cart if you my boyfriend (Helluva made this beat, baby)\nInvest in this pussy, boy, support Black business\n\n[Chorus]\nGet it for a bad bitch, spend it for a bad bitch\nIf you got some money, then trick on a bad bitch\nSpend it for a bad bitch, get it for a bad bitch\nIf you got some money, nigga, trick on a bad bitch\n\n[Outro]\nAh\nReal hot girl shit\nYeah, I'm already rich, but I'm still tryna get richer, hahaha\nYeah, yeah, ah", "[Intro: Lil Durk & Megan Thee Stallion]\n(Tay Keith, fuck these niggas up)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\n\n[Verse 1: Megan Thee Stallion]\nTake a shot, then turn the phone and shit, give me that D'USSÉ dick\n'42, ho, Azul make me do some crazy shit\nFucked him good, now he shakin', call that nigga crazy legs\nMixin' blue with the green hundreds, that shit look like crazy bread\nThat ain't my man, but that's my man, though, so watch your hands, ho\nHe tryna holler when you ain't looking, just stop shakin' his hand, bro\nTold that nigga give me the money, don't know what you playin' for\nThis expеnsive, don't be touchin' on what you ain't payin' for\nEat my coochie, lеt's make a movie, nigga\nI'm talkin' ASMR, let me hear you chew it, nigga\nThe only L I hold got that V right there next to it\nMy pussy tight, but I might let him add some stretch to it, ah\n\n[Chorus: Lil Durk & Megan Thee Stallion]\nTell her shake it, drop her friends off, and take her pants off\nTell him spend it, you ain't got no money, keep your hands off\nChain one-eighty, it's expensive, bitch, just keep your hands off\nI'm a boss, I could buy the same thing my man bought\nShake that booty (Yeah, yeah)\nShake that booty, bitch (Shake that booty, bitch)\nShake that booty (Baow, baow)\nShake that booty, bitch (Baow, baow, baow-baow-baow)\nShake that booty (Yeah)\nShake that booty, bitch (Shake that booty, bitch)\nShake that booty, uh, uh (Shake that booty)\nShake that booty, bitch (Baow, baow, baow-baow-baow)\nShake that", "[Verse 2: Lil Durk]\nTold the bitch to shake her ass, told me put some ones on it\nTold the bitch to kiss my ring, just don't put your tongue on it\nTold the bitch bring a chair, I can put my guns on it\nTold this bitch this belt Chanel so she know she can't pull on it\nWhen the DJ play you back to back, this shit feel good, don't it?\nNever trip about no politics, I know the hood want it\nOrder bottles, I don't even drink, I know the hood want it\nGot my Glock inside the VIP, I wish you would want it\nBounce your booty, uh, uh, make a movie, bitch\nShake your boobies, uh, I'm like a groupie, bitch\nThat lil' bitch never turn down money, I don't give a fuck who she with\nThe strip club got the best chicken wings, give me six\n\n[Chorus: Lil Durk & Megan Thee Stallion]\nTell her shake it, drop her friends off, and take her pants off\nTell him spend it, you ain't got no money, keep your hands off\nChain one-eighty, it's expensive, bitch, just keep your hands off\nI'm a boss, I could buy the same thing my man bought (Ah)\nShake that booty (Yeah, yeah)\nShake that booty, bitch (Shake that booty, bitch)\nShake that booty (Shake that booty)\nShake that booty, bitch (Baow-baow-baow)\nShake that booty (Yeah)\nShake that booty, bitch (Shake that booty, bitch)\nShake that booty, uh, uh (Shake that booty)\nShake that booty, bitch (Ayy)\nShake that\n\n[Verse 3: Megan Thee Stallion]\nAll of that talking in circles, just save it (Yeah)\nI don't wanna flirt with you, nigga, just pay me (Huh?)\nHe gotta go if he ain't comin' with it\nMe and a broke nigga ain't getting entangled (Ah)\nI want a Birkin-'kin-'kin-'kin ('Kin-'kin)\nFinna find out that SSN\nDo a nigga how he think he finna do me\nGet what I want, then I go missing (Ah)\nHe send a text, say he mad at me, why? (Why?)\nHe tryna FaceTime and you know I decline\nI don't call you when you be with them hoes\nSo don't blow me up when you see I'm with mine (Baow)\nThinking you player, she gon' air you out when she mad, hmm (Spazz, nigga)\nAnd I don't kiss you 'cause I know you eating ass, yeah (Ah, ah, ah)\nYou getting beside yourself, find yourself 'fore I make you hide yourself\nWho the fuck pumpin' these bitches? Bitches is ass just like they hydrogel (Just like they hydrogel)\nI see how your mama felt, finna go find my belt\nTry pull my card and get dealt\nBad bitches get good gifts and that's word to the ride I'm in, ah\n\n[Chorus: Lil Durk & Megan Thee Stallion]\nTell her shake it, drop her friends off, and take her pants off\nTell him spend it, you ain't got no money, keep your hands off\nChain one-eighty, it's expensive, bitch, just keep your hands off\nI'm a boss, I could buy the same thing my man bought (Ah)\nShake that booty (Yeah, yeah)\nShake that booty, bitch (Shake that booty)\nShake that booty (Baow-baow-baow)\nShake that booty, bitch (Yeah)\nShake that booty (Shake that booty, bitch)\nShake that booty, bitch (Shake that booty)\nShake that booty, uh, uh (baow, baow, baow-baow-baow)\nShake that booty, bitch\nShake that booty\n\n[Outro: Lil Durk & Megan Thee Stallion]\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah\nShake that booty, bitch\nShake that booty", "[Intro]\nLilJuMadeDisBeat, ayy\n\n[Chorus]\nNever let a broke nigga sex me (Never)\nNever let no ho test me (Never)\nNever been scared of the money (Never)\nNever let em take nothin' from me (Uh-uh), ayy\nNever ever, never ever, ever\nA nigga get read like a letter, huh\nShe think she bad but I'm better, huh\nThese bitches tryna play catch up, ah\nNever let a broke nigga sex me (Never)\nNever let no ho test me (Never)\nNever been scared of the money (Never)\nNever let em take nothin' from me, ah\nNever ever, ever, ever, ever\nA nigga get read like a letter, huh\nShe think she bad but I'm better, huh\nThese bitches tryna play catch up, ah\n\n[Verse 1]\nShut the fuck up when I'm talkin', lil' bitch\nPut yo' head down when you talk to a pimp (Be quiet)\n'Scuse me, I got some big racks in my purse\nAnd right now, they just makin' me walk with a limp\nHuh, ballers be showing me love, ayy\nI bounce with these bitches, they cubs, huh\nI put her on in the club, ayy\nThen she come bring me my cut (Come here)\nShut the fuck up when I'm talkin', lil nigga (Be quiet)\nHuh, fuck is you goin' through?\nI can tell these bitches spoil you\nBut I'm a player so I see the toy in you\nHe tryna act like he tough, ha\nBoy, I'm callin' your bluff, ayy (Callin' your bluff)\nHe tellin' me what he not gon' do\nWait a minute, first of all, who is you talkin' to? (Ayy)\n\n[Chorus]\nNever let a broke nigga sex me (Never)\nNever let no ho test me (Never)\nNever been scared of the money (Never)\nNever let em take nothin' from me (Uh-uh), ayy\nNever ever, never ever, ever\nA nigga get read like a letter, huh\nShe think she bad but I'm better, huh\nThese bitches tryna play catch up, ah\n\n[Verse 2]\nYou ain't savin' hoes, I ain't savin' niggas either, huh\nDon't try to tell me you real\nBlow up my phone and you don't pay the bill (Uh-uh)\nAin't got no money and stay tryna chill\nHell nah, fuck that shit\nDo what I say or go get a new bitch\nYou know I mean what I say when I say it\nI hate a nigga that's always complaining\nHop off, the top off a bitch like a genie\nI'll turn her color to purple like Celie\nI'm turnin' into a monster, unleash me\nBitch, you know better be cool when you see me, huh\nThey want me outta my character (Uh-uh)\nLately, I been in my act\nI'll take your boo and I won't give him back\nI'll wrap my legs round his head like a track (Ah)\n\n[Chorus]\nNever let a broke nigga sex me (Never)\nNever let no ho test me (Never)\nNever been scared of the money (Never)\nNever let em take nothin' from me (Uh-uh), ayy\nNever ever, never ever, ever\nA nigga get read like a letter, huh\nShe think she bad but I'm better, huh\nThese bitches tryna play catch up, ah\nNever let a broke nigga sex me (Never)\nNever let no ho test me (Never)\nNever been scared of the money (Never)\nNever let em take nothin' from me, ah\nNever ever, ever, ever, ever\nA nigga get read like a letter, huh\nShe think she bad but I'm better, huh\nThese bitches tryna play catch up, ah", "[Intro]\nAyy, ayy, look\n\n[Verse 1]\nBadder than your favorite bad bitch (Ah)\nTurned the whole world into a savage (Yeah)\nMiddle finger in all of my pictures\nJust to remind y'all I ain't havin' it (Fuck y'all)\nI'm the baddest bitch, who wanna fight about it?\nPut 'em in the booth, I bet I'll take the title (Baow-baow-baow)\nAll of these hoes my sheep\nMary had a little lamb, they was talkin' 'bout me, ayy (Yeah)\nSwitched sides, so I switched back\nLotta I owe yous I ain't gettin' back (I ain't gettin' back)\nLotta shit I should've walked away from\nBut the hood bitch in me kept pullin' me back (Bitch, what?)\nWish I would let a ho in my business, ayy (Huh)\nQuit askin' 'bout these niggas, look (Bitch)\nYou don't wan' sip this tеa\nIf I give you the deets, you might get in your feelings, ah\n\n[Chorus]\nTеll a hater, \"Fuck you\" (Ah)\nThey keep comin', tellin' me these bitches mad, what's new?\nAll this ice around my neck got me feelin' too cool (Yeah)\nWe was bangin' and he beat that pussy red, SuWoo (Yeah, yeah)\nMiddle finger out the roof, tell a hater, \"Fuck you\"\nThey keep comin', tellin' me these bitches mad, what's new?\nAll this ice around my neck got me feelin' too cool (Burr)\nWe was bangin' and he beat that pussy red, SuWoo (Baow, baow)\nMiddle finger out the roof, ah", "[Verse 2]\nPull up Bentley\nDrop four-fifty to make my car match with my feelings (Car match with my feelings)\nY'all be hatin', I'm ridin' with Farris to make sure none of y'all hoes come near me (None of y'all hoes come near me)\nBitch, stop cappin', that shit ain't exclusive (Ah)\nY'all in the A buyin' shit from them boosters\nI heard y'all niggas ain't buyin' them chains\nJust takin' them pics, send it back to the jeweler, ah\nRoll one deep, rock two C's\nIn my purse, I keep some G's (I keep some G's)\nHo, quit talkin' 'bout me to your man\n'Cause that only make him more intrigued (Make him more intrigued)\nBitch, you a bum, don't get a crumb\nHow you got cake and ain't fuckin' for none?\nI better not ever catch you talkin' shit (Hey, hey)\nIf your bank account still attached to your mom's, ah\n\n[Chorus]\nTell a hater, \"Fuck you\"\nThey keep comin', tellin' me these bitches mad, what's new?\nAll this ice around my neck got me feelin' too cool (Hey)\nWe was bangin' and he beat that pussy red, SuWoo\nMiddle finger out the roof, tell a hater, \"Fuck you\"\nThey keep comin', tellin' me these bitches mad, what's new?\nAll this ice around my neck got me feelin' too cool (Too cool)\nWe was bangin' and he beat that pussy red, SuWoo (Hey)\nMiddle finger out the roof, ah\n\n[Verse 3]\nThese niggas love me 'cause I'm like that\nFreaky, nasty, bite me, I'll bite back, ayy (Bite back, ayy)\nIf I want a nigga gone, then he gone\nI'm a real street bitch, so you know I can't type that, ayy (Hey, yeah)\nThese hoes be thinkin' they me\n'Til them people wanna see and they really gotta show up, ayy\nHangin' 'round niggas say they made me\nYou gon' suck a whole lotta dick tryna blow up, ayy (Ah, ah)\nI'm finna get mean in this bitch, ayy (Yeah)\nThey think I'm weak in this bitch, ayy (They think I'm weak in this bitch)\nInstead of me teachin' these hoes\nI probably should've been readin' a bitch, ayy (Readin' a bitch)\nI'm a hundred, not fifty, ayy\nWeak niggas never get me, ayy (Nope)\nPussy niggas on the internet\nTalkin' 'bout some pussy they ain't gettin', yeah (Pussy)\n\n[Chorus]\nTell a hater, \"Fuck you\" (Fuck 'em)\nThey keep comin', tellin' me these bitches mad, what's new?\nAll this ice around my neck got me feelin' too cool (Burr, burr, burr)\nWe was bangin' and he beat that pussy red, SuWoo (Woo)\nMiddle finger out the roof, ah", "[Verse]\nA lot of these niggas wanna hit it with Megan\nHe heard I work it out, roll it like a Jamaican\nHe call my phone when I'm on the road, see if I'm alone\nThen I go up in the bathroom and give him what he want\nTaking pics, rubbing on my tits, he think im the shit\nPicture me in ya' bed, rubbin' all on ya' dick\nPut that arch in my back and let you attack it\nHe like it when I make it jiggle, so I let him smack it\nWhen you in it from behind\nI'm looking at yo' face in the mirror\nYou be lyin' if you tell me this ain't mine\nHow you lick it up and down, must be tryna make it shine\nLike a slip and slide ride, do it slow, then rewind\nName a bitch you know who fuckin' with my flow\nYa dick gettin' stiff, watchin' my videos\nRecord it on my phone then put it in slow mo'\nI'm the real deal, no faking, no porno\nBitch settle down, hoe, it's money in ya' presence\nHe gon' act a fool when he see me in Giuseppe\nGotta tell him calm down, we in public, don't sweat me\nWhisper in my ear, tell me how ya' gon' sex me\nPull up in that ooh, make a nigga say ahh\nIf he ask for my number, it's Chanel number 9\nOnly time I'm a freak is if I really got the time\nIf the nigga really mine, then he really won't mind\nIf I pull up late just to ride that face\nHe wanna be down, he respect my chase\nThat's why I gotta keep a special place for you\n'Cause when I'm done in the booth, I'm comin' home to you\nYou could neva' take a L off a real bitch\nI'm hotter then them hoes that you chill wit'\nUp against me, bitches never win\nIf he ever hit Thee Stallion, he'll be back again, aah", "Ay, ay\nOkay, runnin' up them bands, tryna ball till I fall\nRunnin' from his bitch, he gon' come when I call\nIf it ain’t 'bout money, then you know I ain’t involved\nWorried 'bout these motherfuckin' haters? Not at all\nNine times outta ten, I’m the realest bitch you know\nIf you ain’t wanna pimp, then whatchu fuckin' with me for?\nIf you ballin and you know it, then let the money show\nIf he actin' scared to spend it, I'ma show him to the door\nOk now shake wid it, shake the shake wid it\nAnd if the beat live, you know Lil Ju made it\nAnd when I pop it, he get stiffer than some fake titties\nAnd don’t be worried 'bout who I’m fuckin', cos you can’t hit it\nAy, runnin' up them bands, tryna ball till I fall\nIf I’m wit yo’ Daddy then you know we at the mall\nIf I’m wit a nigga then you know I’m in them jaws\nHow you let a broke nigga talk you out the drawers?\nI don’t even chase liquor, why would I chase a nigga?\nHe say I should be nicer, well your dick should be bigger\nHe said it better be good, by the way that you’re braggin'\nI hit him back and told him, well that just depend who you askin'\nI got a ex that say he gon' leave his new bitch whenever I call him\nGot a ex that say that every time he see me there’s gon' be problems\nGot a ex that’s on his homeboy IG, tryna stalk me now\nGot a ex that miss me so bad, probably praying for me now\nAy, runnin' up them bands, tryna ball till I fall\nIn the Gucci store, finna tear that bitch down\nMoney on my phone yeah like collect-calls\nPussy like a drug and he havin' withdrawals\nMoney, money, I need mo'\nGet it, get it, watch me go\nI be outdoing these bitches\nI’m like Michael, they Tito\nNot the one to compete with\nYou don’t want it with me bitch\n​göt2b Glued can't save you\nWhen I come for your hairdo\nGot the moves like I’m Ryu\nYellow diamonds, Pikachu\nWhen I switch my hair to blonde, finna turn up like Goku\nI go crazy in this bitch, I go crazy in the booth\nHe go crazy when he see me, and his girl go crazy too\nAnd this pussy so wet, might have to eat it with a spoon\nI was in bikini bottoms 'cause I got that goo lagoon\nI don’t wanna fuck him if he tellin' me what he do not\nI will come over and spin it on your head like bantu knots\nAy, runnin' up them bands, tryna ball till I fall\nBitch I’m off the Henn', so you know I’m off the wall\nBitch I’m not the one so watch your motherfuckin' mouth\nHot Girl Meg from the motherfuckin' south\nAhh", "[Beat Change]\n\nBitch I look good than a motherfucker\nI be with niggas that’s hood than a motherfucker\nWe will come right in this bitch and then tear it up\nI’m from a city where niggas ain’t sharin' none\nI had to figure shit out on my own\nMama at work, and my Daddy ain’t home\nDon’t listen to shit because bitch I been grown\nI got a temper so hoe watch your tone\nHe tryna dog me but I got the bone\nDon’t got the money? Don’t pick up the phone\nHe can talk down, he can say what he want\nHe was just mad he ain’t get what he want\nHoes love to try 'cause they think that I won’t\nBitch I will run through your shit like a cone\nBitch I’m mad, ain't get what I want\nI’m lookin' for somebody take it out on\nYou wanna talk or you wanna get to it?\nCos when it come down to who 'bout it, I’m fluent\nBitch you was hatin' on me and I knew it\nA hoe wanna give me some beef, I chew it\nGiving these rappers the business, I’m suited\nThese bitches look better than me when they muted\nTellin these niggas that you got that water\nBut you ain’t gon' tell 'em your shit is polluted, uhh", "[Intro]\n(Helluva made this beat, baby)\nAyy\n\n[Verse 1]\nI lost my mommy and my granny in the same month (What?)\nA bunch of bitches talking down 'cause I’m coming up\nI know some people in my own city hating on me (Damn)\nAnd if you hoping I fall off, you gon' be waiting on it, ayy\nI'm the only child, I never wanted to be in no clique\nYou a rat, I ain’t no mouse, I know we ain't finna click\nA born leader, I ain't never want to be like a bitch\nI been a freak, so I keep a nigga sucking my clit\nOkay, let's talk about it, no petty shit, let's keep that shit a bill (Okay)\nIt's a difference in the bitch who rap and the bitch who rap for real\nI'm dedicated, this my passion in me, can't nobody take it (Huh)\nBitch, you know your favorite rapper could never keep up with Megan\n\n[Chorus]\nBitch, we ain’t equal\nY’all fucking on the same niggas, pussy in the sequel\nDisrespect me and this shit gon' get lethal\nYeah, I look good, but, lil’ bitch, I get evil\nBooty club, who gon' show that pussy? This a free check\nThrow that ass on me and my nigga get a free check\nAnd I ain't hiding, but I can't let you know where I be at\n’Cause it's gon' be the gossip of the city if they peep that\nMy secrets, keep that\n\n[Verse 2]\nTrust me, you ain't scarin' me, bitch, I ain't intimidated (Hell nah)\nI ain't gon' argue with no ho who just a fan of me (A fan)\nYou taking shots at a bitch that'll never care (Bah-bah-bah)\nHow it's on sight and I don't never see you nowhere? (Bitch)\nNiggas coming too strong, wait a minute, hold on (Wait, wait)\nLet him eat me out and still put him in the friend zone (Ah, ah)\nBitches wanna hang when they know they really hate me\nI'm still winning even if you don't congratulate me\nNiggas gettin' mad they can't hit, boy, this my pussy\nStick the whole clip up in your throat and make you feel pussy\nBitch, I been popping, doing numbers, been lit\nAnd since the nigga think he made me, tell him do it again\n\n[Chorus]\nBitch, we ain't equal\nY'all fucking on the same niggas, pussy in the sequel\nDisrespect me and this shit gon' get lethal\nYeah, I look good, but, lil' bitch, I get evil\nBooty club, who gon' show that pussy? This a free check\nThrow that ass on me and my nigga get a free check\nAnd I ain't hiding, but I can't let you know where I be at\n'Cause it's gon' be the gossip of the city if they peep that\nMy secrets, keep that\n\n[Verse 3]\nAnother bitch shining ain't gon' dim my light (Uh-uh)\nAnother bitch beef ain't gon' make me fight (Yeah)\nI never been a fan of competitive shit\n'Cause I'm still a winner up against whoever it is (Ah)\nThey be talking, yeah, I see it, all that clout, I don't need it\nHoes showing fake love when they really hate to see it\nNiggas tryna get some fame off my name, that's a shame\nWhen I started making money, that's when everybody changed, huh\n\n[Outro]\nReal Hot Girl shit\nStill the same bitch\nAh", "[Intro]\nMCV, bitch, hahaha\nThank you, thank you, thank you, thank you, and fuck you!\n\n[Verse 1]\nAyy, ayy, posing, drinking all the bottles of Patron and\nDrive these niggas crazy 'cause they know they can't control me\nA hottie, a model body, suit by Armani, I'm shining\nIf you lookin', ain't that hard to find me\nYeah, Stalli is a player\nI make these niggas toes curl like my baby hair\nI get up on the drink and get to feeling on myself\nBad bitches singin' all my songs like a prayer\nI'ma super bad bitch (Bad bitch)\nAnd I only hang around wit' other bad chicks (Bad chicks)\nEverywhere I go, I gotta take a damn pic\nTurn around, look back, I get ratchet (Ayy, ayy, ayy)\nTaking selfies, really tryna fix my lipstick\nI love myself but niggas say I'm hard to deal with (Deal with)\nI'm still hotter than them hoes that you chill with (Chill with)\nAnd I could pull any nigga on some chill shit and that's some real shit\nI ain't choose being player, being player chose me\nAnd no, I ain't committed but I'm never lonely\nI gotta keep these motherfucking haters off me\nDon't be actin' fly when you know you goofy\n\n[Chorus]\nTell me where it's good at\nTell me where the fly niggas in the hood at\nAyy, fuck the club, where the kickback?\nAyy, is that the 'yac? Lemme get that\nAyy, somebody tell me where the boss be\nCan you keep these broke motherfuckers off me?\nAnd I only keep the baddest bitches 'round me\nChopper, yellow, redbone, and a bunny, where it's sunny\n\n[Verse 2]\nGucci on my coochie, glitter on my body, everybody wanna do me\nA hood Mona Lisa, figure like somebody drew it\nIf I introduce you to this pussy, nigga, you gon' chew it, rub your waves while I do it\nI know bitches I've influenced, I look different, they congruent\nPost a pic up on the 'gram, then my DMs get to boomin'\n\"Hey bighead\" and \"What you doin'?\", \"Can I fly you out to Europe?\"\n\"Do your pussy taste like gum 'cause I'm really tryna chew it?”\nHit 'em back like, “Who you bank with? Do you got a lady?\nAnd if you do, can you still deposit my money safely?”\nHe watchin' all my videos just to watch me shake it\nDamn I thought the nigga had a seizure, way he shakin'\nLet me wrap my legs around you keep you warmer than a blanket\nDrive around the world, city to city, let you spank it\nPosing for your pictures 'cause I know you wanna take it\nTell the world you mine, put it in them bitches faces", "[Refrain]\nTell the world you mine, put it in them bitches faces\nTell the world you mine, put it in them bitches faces\n\n[Chorus]\nTell me where it's good at\nTell me where the fly niggas in the hood at\nAyy, fuck the club, where the kickback?\nAyy, is that the 'yac? Lemme get that\nAyy, somebody tell me where the boss be\nCan you keep these broke motherfuckers off me?\nAnd I only keep the baddest bitches 'round me\nChopper, yellow, redbone, and a bunny, where it's sunny\n\n[Verse 3]\nVoguing, party with my bitches 'til the morning\nWorking every angle 'cause they love to catch me posing\nA slick ponytail with a tight outfit\nBut why cover up with a body this sick?\nAnd why you like to Facetime when I'm this lit? (Huh?)\nI think it turn you on when I'm talkin' my shit\nI ain't talkin' rapping when I say I like to hear you spit\nYou ain't talkin' sauce when you say you like to see it drip\nI will never bust it open for no broke dick\nI don't hang with bitches I ain't gettin' money with (Money with)\nMiddle finger out the window when they lane switch (Lane switch)\nI know I'm handling my business when they talk shit\nAnd my ex nigga always tryna take it there (Take it there)\nHe used to play me now he told me I ain't playin' fair (Playin' fair)\nOh, so you want me now that you know I don't want you here\nYou just be callin' me to say shit I don't wanna hear (Uh-huh)\n\n[Refrain]\nYou just be callin' me to say shit I don't wanna hear (Uh-huh)\nYou just be callin' me to say shit I don't wanna hear\n\n[Chorus]\nTell me where it's good at\nTell me where the fly niggas in the hood at\nAyy, fuck the club, where the kickback?\nAyy, is that the 'yac? Lemme get that\nAyy, somebody tell me where the boss be\nCan you keep these broke motherfuckers off me?\nAnd I only keep the baddest bitches 'round me\nChopper, yellow, redbone, and a bunny, where it's sunny (Uh-huh, uh-huh)\n\n[Outro]\nAyy, ayy, I ain't choose being player, being player chose me\nAyy, don't be actin' fly when you know you goofy (Uh-huh, uh-huh, uh-huh)", "[Pre-Chorus: Juicy J & Megan Thee Stallion]\n(Mario)\nWhen I say weak ass, you say bitch (Ayy)\nWeak ass, bitch (Ayy)\nWeak ass, bitch (Ayy, yeah)\nWhen I say weak ass, you say bitch (Huh)\nWeak ass, bitch\nWeak ass, bitch\nWhen I, when I say weak ass, you say bitch\n(I don't wanna hear no more shit talkin' out of none of you bitches)\nWeak ass, bitch\nWeak ass, bitch\nWhen I say weak ass, you say bitch\n(For the rest of the motherfuckin' year)\nWeak ass, bitch\nWeak ass, bitch\n(Now I addressed it, now let me see who gon' test me)\nYeah, uh\n\n[Chorus: Megan Thee Stallion]\nYou a weak ass, weak ass, weak ass, bitch (Yeah)\nOn that weak ass, weak ass, weak ass, shit (Hey, hey, hey)\nFuck you and your weak ass, weak ass friends (Huh)\nDon't nobody want your man, weak ass dick (Ayy, uh)\n\n[Verse 1: Megan Thee Stallion]\nYeen 'bout that shit, bitch, so don't play with me, ho (Yeah)\nIf I run up in your shit, you'll swear I'm dead wrong (Ayy, ayy, ayy)\nAll that internet shit, don't get fucked up by the posts (Yeah, by the posts)\nTough in the comments, but in person you a joke (Ayy, huh)\nPromise this ain't what you want\nRun through your shit like a comb\nAll that rah-rah, talkin' loud\nNeed to watch your fuckin' tone\nMan, you finna piss me off (Ayy, ayy)\nIf you 'bout it, bring 'em out (Bring 'em out)\nYou ain't never gon' address me\nDon't know who you talkin' 'bout (Ayy, yeah)\nI want all the smoke (Come here)\nDon't run when you see me (Come here)\nTalkin' 'bout what you would do\nAnd you ain't never really done it (Ayy, yeah)\nHo, you scary and you know it\nWatch your mouth before I ho ya\nDisrespectful, I'ma rub my pussy on ya nigga forehead", "[Pre-Chorus: Juicy J & Megan Thee Stallion]\nWhen I say weak ass, you say bitch (Ayy)\nWeak ass, bitch (Ayy)\nWeak ass, bitch (Ayy, yeah)\nWhen I say weak ass, you say bitch (Huh)\nWeak ass, bitch\nWeak ass, bitch\nWhen I, when I say weak ass, you say bitch\n(I don't wanna hear no more shit talkin' out of none of you bitches)\nWeak ass, bitch\nWeak ass, bitch\nWhen I say weak ass, you say bitch\n(For the rest of the motherfuckin' year)\nWeak ass, bitch\nWeak ass, bitch\n(Now I addressed it, now let me see who gon' test me)\nYeah, uh\n\n[Chorus: Megan Thee Stallion]\nYou a weak ass, weak ass, weak ass, bitch (Yeah)\nOn that weak ass, weak ass, weak ass, shit (Hey, hey, hey, yuh)\nFuck you and your weak ass, weak ass friends (Huh, and your weak ass clique)\nDon't nobody want your man, weak ass dick (Ayy, uh)\n\n[Verse 2: Megan Thee Stallion]\nEverything I say, I do that (Ayy)\nBitch I'm 'bout it, but you knew that (Ayy)\nI don't need the crowd\nPull up one deep right wherever you at (Ayy, ayy, yeah)\nBitches hate me 'cause I'm sexy\nBuyin' shit that I was blessed with\nI can't argue with no ho about a nigga I be dissin'\nYou need to relax, sis\n'Fore you get spanked like a bad kid\nI do not know who is gassin' you up (Ayy, ayy)\nBut I'll knock the key out your back, bitch (Back, bitch)\nI wanna see what you really about\nI wanna to see if you really get down (Yeah)\nKnow that you goofy the way that you talkin' (Ayy, ayy)\nBut I wanna see if you really a clown\nTalking shit about me, mhmm\nWhen you see me, ain't gon' do nothin'\nGot connections out in Texas\nMake my niggas come and shoot somethin' (Ayy, ayy, bow-bow-bow)\nKeep it cool but I'm dramatic (Hey, hey)\nRub me wrong and get this static\nBitches stackin' like they 'bow\nBut if they see me, they gon' panic\nHuh!\n\n[Outro: Juicy J & Megan Thee Stallion]\nWhen I say weak ass, you say bitch (Ol' weak ass hoes)\nWeak ass, bitch\nWeak ass, bitch (Huh)\nWhen I say weak ass, you say bitch (Yeah)\nWeak ass, bitch (Yeah, yeah)\nWeak ass, bitch (Yeah, ayy)\nWhen I say weak ass, you say bitch (Bow)\nWeak ass, bitch (Bow, bow)\nWeak ass, bitch (Ol' weak ass hoes)\nWhen I say weak ass, you say bitch\nWeak ass, bitch\nWeak ass, bitch (Yeah, huh)\nMario", "[Verse 1: Megan Thee Stallion]\nAyy\nPosted, toasted, hangin' at the back\nMade money all year, make a toast with the yak\nWindow to the wall, throw it back, throw it back\nAnd if I leave with him, he gon' eat it for a fact\nI seen a lot of fuck shit, but I'ma let it slide\nI got it in my system, now I'm really tryna ride\nI don't know if it's us Aquarius'\nThat just like to have fun and ain't scared to fuck (Ah)\n\n[Verse 2: Kehlani]\nI get nasty\nWhen the moon come out and the juice kick in\nLiquor in my system, system\nNo need to ask me\nWhen the party end 'cause I'm on my way\nTo give you what you're missin', missin'\n\n[Refrain: Kehlani]\nIt's 2:30 on the dot and still crackin' at the spot\nOh yeah-yeah, yeah-yeah\nWe ain't tryna make it home and I don't wanna be alone\nNo way, yeah, tonight\n\n[Chorus: Kehlani]\nSo hit my phone, woah-oh\nSippin' '42 and you know I'm bent\nToo far gone, oh-oh\nLiquor got me sendin' that risky text\n\n[Verse 3: Megan Thee Stallion]\nAyy, ayy\nI'm feelin' kinda tipsy, come and get me (Yeah)\nYou can hit it in the party if you're feelin' risky (Hey, hey, hey, yeah)\nI got all these niggas mad 'cause they where you wanna be\nOn the dance floor, rubbin' all on my body (Yeah)\nNow tell them hoes back-back, give you fifty feet\nBefore you look at him, you know I'm the one you see (Yeah bitch)\nHe told me I get crazy when I get up on the yak\nNah, I just never play with bitches like that\nI be drinkin' out the bottle and I need a mouthful\nAnd I know I'm from the south, but you need your goggles (Yeah, ha)\nParty like a vato, shots of the blanco\nGuaranteed to knock a nigga up out his zapatos\nI'm tryna make it home, but you lookin' so good\nI would pull it out your pants, right now if I could (Yeah)\nBut you know everything I do gon' make it to the net (Ah)\nSo I guess I can wait until I get you to the bed (Ah)\n\n[Chorus: Kehlani]\nSo hit my phone, woah-oh\nSippin' '42 and you know I'm bent\nToo far gone, oh-oh\nLiquor got me sendin' that risky text\n\n[Refrain: Kehlani]\nIt's 2:30 on the dot and still crackin' at the spot\nOh yeah-yeah, yeah-yeah\nWe ain't tryna make it home and I don't wanna be alone\nNo way, yeah, tonight", "[Intro]\nHey, ayy, ayy\nI ain't never need a nigga money ’cause I make it\nBut if that nigga wanna pay a bill, I'ma take it\n\n[Verse 1]\nI love a lot of zeros, but I don't fuck with no losers (Yeah)\nTwo type of people in this world and I’m a chooser (Yeah)\nI was in the club with my trick eating suya (Hey)\nBrought my freaky friend 'cause he know I ain't gon' do nothin' (Nah)\nHe be eating everybody pussy, I can't kiss him\nI'ma give him back when he broke, I can't fix him (Nah)\nShould’ve saw his face when I ran it up in Louis (Ha)\nI’ma treat the nigga how he look (Ayy, ayy), stupid\n\n[Chorus]\nI'm a rich bitch with some rich friends (Yeah, yeah, hey)\nIf he buy it for me, he gotta buy it for them (Buy, buy)\nI’m a boss bitch, I don't need help (Yeah, yeah)\nI'ma tell him to buy it, but I can get it myself, ah (Ooh, ooh)\nRich lil' bitch, don’t be speaking if you broke (Hey, hey)\nRich ass bitch gettin' money on my own (Money on my own)\nRich lil' bitch, don't be speaking if you broke (Hey, hey, hey, yeah)\nI'm a rich ass bitch gettin' money on my own, ah (Ayy, ayy)\n\n[Verse 2]\nI get real money, big rolls, no tummy (Huh)\nBuy it off the mannequin, I go real dummy (Yes)\nI'm the hot girl, I'm the it bitch (It bitch)\nProbably got your favorite nigga on my block list, uh (Ayy, hey, yeah)\nAin't no upgradin' when you goin' after me (Goin' after me)\nYour bitch ain't in my bracket, stop comparing her to me ('Paring her to me)\nYou in love with him, but he buyin' shit for me (Buyin' shit for free)\nWe be spendin' time, but he know it ain't for free (Yeah)\n\n[Chorus]\nI'm a rich bitch with some rich friends (Yeah, yeah, hey)\nIf he buy it for me, he gotta buy it for them (Buy, buy)\nI'm a boss bitch, I don't need help (Yeah, yeah)\nI'ma tell him to buy it, but I can get it myself, ah (Ooh, ooh)\nRich lil' bitch, don't be speaking if you broke (Hey, hey)\nRich ass bitch gettin' money on my own (Money on my own)\nRich lil' bitch, don't be speaking if you broke (Hey, hey, hey, yeah)\nI'm a rich ass bitch gettin' money on my own, ah (Ayy, ayy)\n\n[Outro]\nNiggas say I taste like sugar, but ain't shit sweet\nIf it ain't about no motherfuckin' money, don't be lookin' for me\nAh", "[Intro]\n(RamyOnTheBeat)\n(LilJuMadeDaBeat)\n\n[Chorus: Megan thee Stallion]\nAyy, yeah\nBitch, I'm exquisite, no cheap shit (Money)\nAhead of these bitches, I lead shit (Ahh)\nMakin' it pop on some freak shit\nYou bring it to me\nYou know I'ma make a bag\nAnd make it twerk, twerk, twerk\nMake that bitch jump\nYou know I'ma make a bag\nAnd make it twerk, twerk, twerk\nMake that bitch jump, ahh\n\n[Verse 1: Moneybagg Yo]\nI'm at Pappadeuax eating seafood (Seafood)\nRacks in my pocket and a big tool (Big tool)\nThe shit that I'm rockin' got red on the bottom\nHo, these ain't no cheap shoes (Shoes)\nI really be hustlin', I really be thuggin' (I really be thuggin')\nI ain't one of these rap dudes (I ain't one of these rap dudes)\nDiamonds jumpin' out the face of the Audemars\nDoin' the Michael Jackson kick move (Damn)\nI'ma  big dog, you a shih tzu\nShe gon' kick the nigga out 'fore I come through (Ah)\nYou ain't been through what I've been through\nNow I'm up, I'ma gon' ball like Caillou (Like Caillou)\nAchoo, bless me, please don't test me\nI won't hesitate to bust the Smith and Wesson\nDope boys and some killers in my section (Right on, right on)\nYou a lame, we ain't fuckin' with you peasants (No)\nI got big pointers sittin' inside the necklace\nReach for my chain, send yo' ass to heaven\nShoot first, we don't do the second guessin' (Hit it now)\nHit his nigga and I bet he get the message\nI'm in a Maserati truck (Skrrt, skrrt) fishbowl nigga\nI know they ass seein' me but I don't see a soul nigga\n\n[Verse 2: Megan thee Stallion]\nI'm at Grand Lux eatin' a Caesar salad with my sugar daddy (Yeah)\nPulled up on me in a big Benz, told me to drive\nI told him, \"Let me have it\"\nNo time to play with these niggas, huh\nAfter I break 'em, I kick 'em, huh\nTold him to put me some ice on my neck and my ears if he want me to listen, hey, huh\nHe wanna swim in my lap, huh\nHe tryna get in my snaps, huh\nI'm tellin' bitches I've been in my bag\nBut now I got the wallet to match, huh\nHe love how I fit in my clothes, huh\nHe love how I talk, I'ma poet, hey\nHe told me he think that he fallin' in love\nAnd I told him I'm already knowin', huh\nI might balance a bitch on these 'enciagas\nI can't see the haters through these fuckin' Prada's\nThey gon' book me 'cause I bring the pussy poppers\nAnd the niggas with money that's poppin' bottles\nI'ma make a bag and make it twerk\nI'm finna run up a bag in a skirt\nThey checkin' him but the gun in my purse\nI'm killin' these hoes and I know that it hurt, ahh\n\n[Chorus: Megan thee Stallion]\nYeah\nBitch, I'm exquisite, no cheap shit (Money)\nAhead of these bitches, I lead shit (Ahh)\nMakin' it pop on some freak shit\nYou bring it to me\nYou know I'ma make a bag\nAnd make it twerk, twerk, twerk\nMake that bitch jump\nYou know I'ma make a bag\nAnd make it twerk, twerk, twerk\nMake that bitch jump, ahh", "[Intro: Megan Thee Stallion]\nYeah\nAh\nReal hot girl shit\nMwah\n\n[Verse 1: Megan Thee Stallion]\nOkay, the hate turned me to a monster, so I guess I'm evil now (I’m evil now)\nWoke up and I blacked out everything so I can see it now (See it now)\nI'm on that demon time, it's only right I cop the Hellcat (Skrrt)\nThey always hit me where it hurt, but this time, I felt that (Ow)\nWhy I gotta prove myself to bitches that I’m better than? (Huh?)\nAs if I wasn't at radio stations goin' Super Saiyan (Super Saiyan)\nAs if this fuckin' body isn't everything they buyin' ('Thing they buyin')\nAnd as if a nigga didn’t shoot me and they pickin’ sides (Baow)\n\n[Chorus: Megan Thee Stallion]\nI'll be back, I’m 'bout to go crazy\nI ain't pullin' up ’less them hoes finna pay me ('Less them hoes finna pay me)\nBitch, I'm the shit, and I ain't gotta prove it (I ain't gotta prove it)\nFinna go dumb since these hoes think I'm stupid\nI'm 'bout to go crazy, crazy\nI'm 'bout to go crazy, crazy\nBitch, I'm 'bout to go\n\n[Verse 2: Big Sean]\nI hit once, I hit twice, now it's a habit, I go Cassius (Woah, woah)\nYour ex nigga made you crazy, this dick make you psychopathic (Straight up)\nIf the sextape leak and everyone see, know it's gon' be a classic (Classic)\nBut don't forget how quick I'll crop you out and change the caption (Quick)\nStrictly raised by pimpin', not by simpin', show no sympathy\nIf they hate you for being you, they not secure in they identity (Damn)\nMe, myself, and I, she treat me like the Holy Trinity (Woah)\nFuck a Birkin, give you a business, boss you up, now you can buy ten of these (What we doin'?)\nShit, whatever I say\nRun your city, now it's mine for however long I stay\nBitch play me, well, that's my bad for ever lettin' her play\nMy mama prayin' for me, she better pray for whoever in my way (Boy)\nNow how many besties done upped and left me? (Huh?)\nWho claimed they my dawg and just my pet peeves (Huh?)\nWho tried to double back and triple-text me\nFuck I look like stressin' over these hoes that stress me? Lil' bitch", "[Chorus: Megan Thee Stallion]\nI'll be back, I'm 'bout to go crazy\nI ain't pullin' up 'less them hoes finna pay me ('Less them hoes finna pay me)\nBitch, I'm the shit, and I ain't gotta prove it\nFinna go dumb since these hoes think I'm stupid\nI'm 'bout to go crazy, crazy\nI'm 'bout to go crazy, crazy\nBitch, I'm 'bout to go crazy\n\n[Verse 3: Megan Thee Stallion]\nA bitch can't me check me, can't disrespect me (Shh)\nA shot can't hit me if it's sent indirectly\nHoes can't see me with this rap and the fashion\nBitch, you know I'm fire, you can't drag a dragon (Ah)\nI used to be patient\nNow I'm on some ski mask shit, bitch, I'm anxious (Yeah)\nHoes talkin' cash shit, but can't make a payment (What?)\nCarnivore, I'ma eat up any bitch who play me\nForty-inch long black weave like Morticia (Yeah)\nApplyin' so much pressure to these hoes, they gettin' blisters (Gettin' blisters)\nI'ma buy it twice so my shoes got sisters (Got sisters)\nI only want a nigga on my birthdays and Christmas\nMean girl, I ain't lettin' bitches sit with us\n\n[Chorus: Megan Thee Stallion & 2 Chainz]\nI'll be back, I'm 'bout to go crazy\nI ain't pullin' up 'less them hoes finna pay me ('Less them hoes finna pay me)\nBitch, I'm the shit, and I ain't gotta prove it (I ain't gotta prove shit)\nFinna go dumb since these hoes think I'm stupid\nI'm 'bout to go crazy, crazy\nI'm 'bout to go crazy, crazy\nBitch, I'm 'bout to go crazy (2 Chainz, Toni)\n\n[Verse 4: 2 Chainz]\n'Bout to go ignorant, rich with the benefits\nCrook in my dick, shit lookin' like ten to six\nUsed to hit the dealership, now they makin' dropoffs\nStars in my roof, I don't have to take the top off (Gone)\nCounty going crazy (Crazy), have your ass knocked off\nCharm on my neck lookin' like a fuckin' softball (Woo)\nYour ho just left (Left), yeah, she a southpaw\nAss so fat, man, them folk gon' try to outlaw (Outlaw)\nMegan, what's poppin'? You already know the topic\nLet me see you scrub the ground, let me see you touch the carpet (Carpet)\nStill throwin' bands during a pandemic ('Demic)\nSmokin' on raw paper with my strand in it\n\n[Chorus: Megan Thee Stallion]\nI'll be back, I'm 'bout to go crazy\nI ain't pullin' up 'less them hoes finna pay me ('Less them hoes finna pay me)\nBitch, I'm the shit, and I ain't gotta prove it (I ain't gotta prove shit)\nFinna go dumb since these hoes think I'm stupid\nI'm 'bout to go crazy, crazy\nI'm 'bout to go crazy, crazy\nBitch, I'm 'bout to go crazy", "[Intro]\nAin't never been with a chick this bad\nI ain't worried 'bout that\nDJ Chose\n\n[Chorus]\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that\n\n[Verse 1]\nI be actin' up right before he come to see me\nHe be like, \"Why you always tripping for no reason?\"\nTold him, \"'Cause you put it on me better when you're mad\"\nHand around my neck, hit it hard from the back, yeah\nI'ma cook a meal for him and play the game with him\nWhen somebody ask, yeah, I'm with the same nigga\nPussy keep him knocked out like a painkiller\nAnd if a nigga bag me, you know he a winner, ah\n\n[Chorus]\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that\n\n[Verse 2]\nYeah, I know you like that, when I talk to you like a freak\nI wanna feel it deep so I rode it on my feet\nHe say he feel intimidated when he talk to me\nI got that hardcore but he want that R&B, ah\nBoy, we can make sweet love for hours\nOpen up for you like flowers\nThe deeper you go, I get louder\nMake it rain on you like showers\n\n[Chorus]\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that\n\n[Verse 3]\nI'ma hold it down for you, and put it down on you\nCan't nobody else ride how I ride for you\nAnd if a bitch get slick, knock her down for you\nAnd if you're lookin' for me, I'ma be around for you\nYou got a diamond, boy, you better act like it\nYou fuckin' with the baddest, you ain't gotta cap like it\nHe know I'm the baddest bitch he ever had\nPost me on the 'Gram, got his old hoes mad\n\n[Chorus]\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that\nYou ain't never been with a chick this bad\nI ain't worried 'bout them other girls that you had\nIf I catch 'em lookin' at my baby, I'ma laugh\nHe gon' keep it real, I ain't worried 'bout that (Mwah)", "[Intro]\nI want to do it 'cause it's fun\nIt's fun to do bad things\n(Hood rat shit)\nDrive into a car (Ahh)\nDid you know you could perhaps kill somebody? (Mwah)\nYes, but I wanted to do hood rat stuff with my friends\nAyy, ayy, yeah\n\n[Chorus]\nHood rat shit (Huh) with my hood rat friends (Ayy)\nEverywhere we go (Ayy) we be drinking Hen (Ayy)\nShake that ass, shake that ass, bitch, bounce that shit (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh, yeah) hood rat shit (Ayy)\nDoing hood rat shit (Yeah) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy)\nDoing hood rat shit (Huh) with my hood rat friends (Ahh)\n\n[Verse 1]\nI'm from South Park, I be in Dead End (Hey)\nI move to the 'burbs and put my friends on some licks\nThey wanna know 'bout me, they say, \"Tell me your story\"\nOnly thing you need to know is I'm in love with the money\nOut here and I'm getting it, ayy\nYoung rich bitch, I'm pretty, ayy\nLittle bitty waist, big titties\nWhole lotta hot shit, hot shit, hot shit\nFour 5-0 can't stop shit, ayy\nAll my niggas gon' pop shit, ayy\nBig ol', big ol', big ol' ass, all my bitches gonna pop shit", "[Chorus]\nHood rat shit (Huh) with my hood rat friends (Ayy)\nEverywhere we go (Ayy) we be drinking Hen (Ayy)\nShake that ass, shake that ass, bitch, bounce that shit (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh, yeah) hood rat shit (Ayy)\nDoing hood rat shit (Yeah) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy)\nDoing hood rat shit (Huh) with my hood rat friends (Ahh)\n\n[Verse 2]\nBitch, keep talking that shit from your Honda\nHoes love to act, but they ain't wit' the drama\nWant my spot? Gotta fight like Wakanda\nBitch, run up and get hit wit' the one-done\nHood rat shit, yeah, with my hood rat friends (Ayy)\nYou ain't from my hood (Huh)\nWhat you doing round here? (Hey)\nAsking all them questions (Huh)\nYou must be the Feds (Ayy)\nBetter get from round here\nBefore you wind up dead (Yeah)\n\n[Chorus]\nHood rat shit (Huh) with my hood rat friends (Ayy)\nEverywhere we go (Ayy) we be drinking Hen (Ayy)\nShake that ass, shake that ass, bitch, bounce that shit (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh, yeah) hood rat shit (Ayy)\nDoing hood rat shit (Yeah) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy)\nDoing hood rat shit (Huh) with my hood rat friends (Ahh)\n\n[Bridge]\nMoved out the hood but I still throw that bitch up (H-Town)\nCame in the club with a clique full of shooters\nNiggas get stiff, they call me Medusa (Mwah)\nI don't wanna fuck without the medulla (Ahh)\nHood rich, doing hood shit\nThat ain't no champagne in my glass, ho\nThis some Henny bitch\nAt the strip eating chicken wings with a thick bitch\nMake it clap\nShe be dancing just like the diamonds up in my necklace\n\n[Chorus]\nHood rat shit (Huh) with my hood rat friends (Ayy)\nEverywhere we go (Ayy) we be drinking Hen (Ayy)\nShake that ass, shake that ass, bitch, bounce that shit (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh, yeah) hood rat shit (Ayy)\nDoing hood rat shit (Yeah) with my hood rat friends (Ayy, yeah)\nHood rat shit (Huh) with my hood rat friends (Ayy)\nDoing hood rat shit (Huh) with my hood rat friends (Ahh)", "[Intro]\nMCV, bitch *laughter*\n\n[Hook]\nI'm in my act, I wanna dance\nI'm on that yac, I wanna dance\nCome get yo' man\nBefore I put him in a trance\nI'm in my act, I'm on that yac\nI wanna dance\nCome get ya man\nCome get ya man\n\n[Verse 1]\nI'm lookin' paid and pretty (Yeah)\nHair hangin' down to my back (Huh!)\nI put it on him last night (Woo!)\nHe calling me back to back (Hey, hey)\nBitch this is a new outfit (Yeah)\nTurn to the back for a pic (Huh!)\nCognac Queen, I'm lit (Woo!)\nHenn dawg, henn dawg, henn dawg, henn dawg\nShe pulling up with a forty (A forty)\nI'm pulling up with a shorty (A shorty)\nI'm fresh off the plane, I'm imported (Imported)\nI'm fuckin' a baller, we courted\nI'm makin' it clap, he record it (Damn)\nAnd he keep on making them noises (Yeah)\n\"Damn, fuck, shit… Ooh\" (Fuck, oh)\n\n[Bridge]\nDrop me a pin, where you at?\nI'm gonna come round like a lac (Like a lac)\nI get in my yac on that yac\nHe call me Megan the Mack\nIt's turning him on how I rap\nHe doggin' it out, make it fat\nHe tell me \"Girl, you the best\"\nBut I already know what I am\nYou know I only wanna\nCome over put it on him\nI got that woah-na-na\nHe drink that shit like water\nI got that supernova\nThat super grip, that choker\nI got that ditch yo' bitch\nTell her I'm coming over", "[Hook]\nI'm in my act, I wanna dance\nI'm on that yac, I wanna dance\nCome get yo' man\nBefore I put him in a trance\nI'm in my act, I'm on that yac\nI wanna dance\nCome get ya man\nCome get ya man\n\n[Chorus]\nAy, ay, yeah, Cognac Queen, huh, Cognac Queen, ay\nFuck is you saying? Fuck do you mean?\nI get on that yac and I lean, ay\nCognac Queen, uh, Cognac Queen, huh\nTogether, forever when we on that drink\nFuck it, I don't wanna think\n\n[Verse 2]\nTop down when I ride (Down when I ride)\nGetting high like a fire (High like a fire)\nBitch, I pull up on ya boo (Bitch, I pull up on ya boo)\nTell his ass \"get inside\"\nLet a real bitch slide (Let a real bitch slide)\nGot him drinking out the fire (Yeah)\nHe know I'm dropping that game\nBut I'm not gone tell him a lie\nDrank, drank, I been drankin'\nI hit you up when I’m faded\nI know you tired of me playin'\nCall you back to back, call you back\n'Til you call me, call me back baby\nI know it's late, you been waiting\nMy cognac kisses make you crazy\nThese other bitches can't fade me\nYou look good, you look good to me\nGive me hug, it feel good to me\nHold me up, you too good to me\nCut 'em off, I know you would for me\nHe like \"damn, goddamn girl\"\n\"You should let me gone be ya man girl\"\nHe know I only agree\nWhen I'm getting full of the drink\nWent Courvoisier crazy\nGot him thinking he my baby\nDon't care what he saying (No)\nI'm speaking all body language (Body)\nFall in love would be dangerous (Yeah)\nFuck you like I’ve been dranking (Uh)\nCognac on my blankets (Yeah)\nReal bitches don't fake it, ay, ay\n\n[Hook]\nI'm in my act, I wanna dance\nI'm on that yac, I wanna dance\nCome get yo' man\nBefore I put him in a trance\nI'm in my act, I'm on that yac\nI wanna dance\nCome get ya man\nCome get ya man\n\n[Chorus]\nAy, ay, yeah, Cognac Queen, huh, Cognac Queen, ay\nFuck is you saying? Fuck do you mean?\nI get on that yac and I lean, ay\nCognac Queen, uh, Cognac Queen, huh\nTogether, forever when we on that drink\nFuck it, I don't wanna think\n\n[Outro]\nDrank, drank, I been drankin'\nI hit you up when I’m faded\nI know you tired of me playin'\nCall you back to back, call you back\n'Til you call me, call me back baby\nI know it's late, you been waiting\nMy cognac kisses make you crazy\nThese other bitches can't fade me, fade me", "[Intro: Megan Thee Stallion & Logic]\n(What Juicy say? He be like, \"Shut the fuck up\")\nReal hot girl shit\nAh\nWe outside\nAyy\n\n[Verse 1]\nI got every purse, every color, shout out to my ex-nigga\nThinkin' 'bout what I want now from my next nigga\nSame background, now them bitches know I'm stayin' with you\nFlew me out to Turks just to flirt, we ain't takin' pictures\nWe can keep it low, nobody gotta know\nIf you ain't wanna pimp, then what you fuckin' with me for?\nI know them other bitches probably say they ain't like other bitches\nBut I guarantee it's something 'bout me that be breakin' niggas\n\n[Chorus]\nI ain't for the streets, 'cause bitch, I am the street\nAnd I ain't on these niggas, all these niggas be on me\nAnd I'ma be outside 'til I don't wanna be\nAnd I'ma show this ass 'cause it's what they wanna see, look\nI ain't for the streets, 'cause bitch, I am the street\nAnd I ain't on these niggas, all these niggas be on me\nAnd I'ma be outside 'til I don't wanna be\nAnd I'ma show this ass 'cause it's what they wanna see, ayy\n\n[Verse 2]\nPut the car in my name so I know it's real\nBuy me the same chain that you got when you say, \"Let's chill\"\nI know how much that cost, them diamonds in your mouth\nI told him buy the house, but don't be comin' in and out\nBaby, can you tell me have you ever heard of polygamy?\nIt's only me and you, but I got many personalities\nSometimes I like to shop, sometimes I like to bop\nSometimes I like it from the back, sometimes I be on top\nI keep tellin' niggas\n\n[Chorus]\nI ain't for the streets, 'cause bitch, I am the street\nAnd I ain't on these niggas, all these niggas be on me\nAnd I'ma be outside 'til I don't wanna be\nAnd I'ma show this ass 'cause it's what they wanna see, look\nI ain't for the streets, 'cause bitch, I am the street\nAnd I ain't on these niggas, all these niggas be on me\nAnd I'ma be outside 'til I don't wanna be\nAnd I'ma show this ass 'cause it's what they wanna see\n\n[Verse 3]\nI checked your bitch out and she basic, that's why she hatin'\nShe rock designer, but it's old, that shit is dated\nI'm rockin' new runway Gianni, Versace hottie\nAnd anything that come behind me is fuckin' sloppy (Ah, ah, ah)\nEvery day I switch it up, I give 'em looks (Looks)\nI switch my hair up just to fuck, we be havin' fun (Havin' fun)\nI ask him do he want a blonde? Do he want a redhead? (A redhead)\nI can switch my shit to blue or I can wear my real hair\nI keep tellin' niggas\n\n[Chorus]\nI ain't for the streets, 'cause bitch, I am the street\nAnd I ain't on these niggas, all these niggas be on me\nAnd I'ma be outside 'til I don't wanna be\nAnd I'ma show this ass 'cause it's what they wanna see, look\nI ain't for the streets, 'cause bitch, I am the street\nAnd I ain't on these niggas, all these niggas be on me\nAnd I'ma be outside 'til I don't wanna be\nAnd I'ma show this ass 'cause it's what they wanna see\nAh, ah\n\n[Outro]\nWe outside", "[Intro]\nReal motherfuckin' hot girl shit, ah\nStill runnin’ through the mall with your motherfuckin' daddy\n(And if the beat live, you know Lil Ju made it)\n\n[Verse]\nI'm a hot girl, I don’t do titles\nIf I do date, it'll be Michael\nKeep shit spicy, T.I.P and Tiny\nYellow bone chick look like Kehlani\nFreak in the sheets, freak on the beats\nNiggas been hooked since \"Big Ole Freak\"\nI realized that I was the shit when R&B niggas wanna start rap beef\nThese niggas ain't got no name on 'em\nWish these hoes stop tryna put claim on 'em\nHe come around me, get game on him\nIf hе on go then I already came on him\nThеse new hoes sound like my mixtape\nBitches love saying my name like it's clickbait\nI don't take shit if it come with conditions\nI don't rock shit if it come in his name\nI’m not your bed or your couch so don’t sleep on me\nLook like a lick then I'm puttin’ the freak on him\nAll of these niggas is beggin' to hang\n'Cause my bitch a Young Thug and I am the Rich Homie\nBoy, I ain't finna read all that text\nDon’t know what it said, but I sent, \"That's a bet\"\nLately, my patience been getting real low\nLately, I feel like I need more respect\nIt was the money for me, ayy, he gon' go dummy for me, ayy\nHe ain't that cute, but he could dress, it's the Patek for me, ayy\nIt was the knees for him, hmm, the way that it squeeze for him, ayy\nHe done fucked a whole lotta bitches, but it was the me for him, ayy\nY'all wanna take me out so bad, I make all of y'all hoes so mad\nHoes went and bought them big ass teeth, even y'all smiles still goin' out sad\nHoes got jokes, but don't ever wanna stand up\nHoes got balls, but you know I got handles\nDamn, I must be Olivia Pope 'cause y'all keep puttin' me in all of these scandals\nHe wanna hit one more time, I ain't Britney\nDon't need no closure, my diamonds got clarity\nTellin' his new bitch that he don't do Instagram\nReally, he hate when he scroll and see pics of me\nLike a new show, all these niggas is into me\nFunny how besties turn into my enemies\nI must be playin' peekaboo 'cause these hoes really can't see me, ah\n\n[Outro]\nReal motherfuckin' hot girl shit\nReal motherfuckin' Megan Monday shit\nThe motherfuckin' freestyle queen, the freestyle pro\nYoung Tina Snow for them hoes that ain't know, ah", "[Chorus]\nI'll cut you off and get mad when you leave (Yeah)\nTold you I ain't mean it, but you still mad at me (Yeah, yeah)\nBlowin' up ya phone 'cause you know what I need (Yeah, yeah)\nYou know what I need\nI'll cut you off and get mad when you leave (Yeah)\nTold you I ain't mean it but you still mad at me (Yeah, yeah)\nBlowin' up ya phone 'cause you know what I need (Yeah, yeah)\nYou know what I need (I'll cut you off and get mad when you leave)\nYou know what I need (Told you I ain't mean it, but you still mad at me)\nYou know what I need (Blowin' up ya phone 'cause you know what I need)\nYou know what I need (Yeah, yeah), you know what I need\n\n[Verse 1]\nI'm the only one that know ya best\nAnd I'm the only one that make you happy when you're stressed\nKnow I'm kinda crazy, I'm a big baby\nI was out here wildin', I'm just happy you was patient (Ooh-ooh-ooh)\nYou know this pussy like a drug to ya (Ooh-ooh-ooh)\nYou know I soften up the thug in ya (Ooh-ooh-ooh)\nI wanna come confess my love to ya (Ooh-ooh-ooh)\nI could never get enough of ya (Ooh-ooh-ooh)\n\n[Pre-Chorus]\nAnd I (And I) still got love for ya\nAnd I (And I) wanna leave the club with ya\nAnd I'd (And I'd) beat a bitch up for ya\nAnd I (And I) forever know what's up with ya", "[Chorus]\nI'll cut you off and get mad when you leave (Yeah)\nTold you I ain't mean it, but you still mad at me (Yeah, yeah)\nBlowin' up ya phone 'cause you know what I need (Yeah, yeah)\nYou know what I need\nI'll cut you off and get mad when you leave (Yeah)\nTold you I ain't mean it but you still mad at me (Yeah, yeah)\nBlowin' up ya phone 'cause you know what I need (Yeah, yeah)\nYou know what I need (I'll cut you off and get mad when you leave)\nYou know what I need (Told you I ain't mean it, but you still mad at me)\nYou know what I need (Blowin' up ya phone 'cause you know what I need)\nYou know what I need (Yeah, yeah), you know what I need (Ayy, ayy)\n\n[Verse 2]\nNow who the fuck you think you fucking with if it ain't me?\nBoy, if you don't see me in your future, you can't see\nMy body only work for you, I'm a love machine\nBaby, we a team and you match me like a theme\nI know I sent a couple crazy texts, but I ain't mean that\nSaid you was my nigga, so you gon' forever be that\nWhat you get is what you get, know that real is what you need\nI know it's hard to deal, I be trippin', but that's me (Ooh-ooh-ooh)\n\n[Pre-Chorus]\nAnd I (And I) still got love for ya (Ooh-ooh-ooh)\nAnd I (And I) wanna leave the club with ya (Ooh-ooh-ooh)\nAnd I'd (And I'd) beat a bitch up for ya (Ooh-ooh-ooh)\nAnd I (And I) forever know what's up with ya (Ooh-ooh-ooh)\n\n[Chorus]\nI'll cut you off and get mad when you leave (Yeah)\nTold you I ain't mean it, but you still mad at me (Yeah, yeah)\nBlowin' up ya phone 'cause you know what I need (Yeah, yeah)\nYou know what I need\nI'll cut you off and get mad when you leave (Yeah)\nTold you I ain't mean it but you still mad at me (Yeah, yeah)\nBlowin' up ya phone 'cause you know what I need (Yeah, yeah)\nYou know what I need (I'll cut you off and get mad when you leave)\nYou know what I need (Told you I ain't mean it, but you still mad at me)\nYou know what I need (Blowin' up ya phone 'cause you know what I need)\nYou know what I need (Yeah, yeah), you know what I need\n\n[Outro]\nYou know what I need\nYou know what I need, you know what I need\nYou know what I need, you know what I need\nYou know what I need, you know what I need", "[Intro: Megan Thee Stallion & Logic]\n(What Juicy say? He be like, \"Shut the fuck up\")\nReal hot girl shit (Keep it Z3N)\nAyy\n\n[Chorus]\nHe like it when I work that, twerk that, serve that\nAnd ride it like a rodeo\nHe like it when I lick that, sit down, look back\nWhen I ride him like a rodeo\nI got my tongue out like (Ah), poke it out like (Ah)\nHe lookin' like a snack, I'm tryna lick him like (Ah)\nI got my tongue out like (Ah), poke it out like (Ah)\nHe lookin' like a snack, I'm tryna lick him like (Ah, ah)\n\n[Verse 1]\nShake, shake that ass, make, make, make it nasty\nSince you show it in your pictures, I'm gon' take, take that cash\nThey know Megan puttin' on for all the ratchet bitches\nAnd if you pop your pussy, boy, call it ratchet business, ayy, look\nBitch, touch them toes, ayy, bitch, get that dough\nIf you in love with your body, bitch, take off your clothes\nI'ma ride him like a pro 'cause I ain't new to this shit\nAnd I ain't never been a clown, but I'ma fool on the dick, ah\n\n[Chorus]\nHe like it when I work that, twerk that, serve that\nAnd ride it like a rodeo\nHe like it when I lick that, sit down, look back\nWhen I ride him like a rodeo\nI got my tongue out like (Ah), poke it out like (Ah)\nHe lookin' like a snack, I'm tryna lick him like (Ah)\nI got my tongue out like (Ah), poke it out like (Ah)\nHe lookin' like a snack, I'm tryna lick him like (Ah, ah)\n\n[Verse 2]\nI told him, \"Brr, stick it, wah-wah-wah, stick it\"\nWhy you askin' if I like it when you know that you don't hear me?\nAll them big-mouth boys never last in it\nI scream the loudest when I'm fuckin' on a quiet nigga, ah, ah\nBounce it biggity, she not lit as me\nNo Nicole, but are you kidding me?\nLook up bad bitch, I'm the epitome\nBeen real thick, I don't no need no Apetamin\nDeadass be like are you shitting me?\nI'm undead, ain't no bitch killing me\nHold that stick like I'm in a symphony (Ayy)\nFor these simps, I have no sympathy\n\n[Chorus]\nHe like it when I work that, twerk that, serve that\nAnd ride it like a rodeo\nHe like it when I lick that, sit down, look back\nWhen I ride him like a rodeo\nI got my tongue out like (Ah), poke it out like (Ah)\nHe lookin' like a snack, I'm tryna lick him like (Ah)\nI got my tongue out like (Ah), poke it out like (Ah)\nHe lookin' like a snack, I'm tryna lick him like (Ah, ah)\n\n[Outro]\nReal hot girl shit\nAh, mwah\nBaow, baow, baow\nBrr, stick it, wah-wah-wah, stick it\nWah-wah-wah, stick it, ah", "[Intro: Popcaan & YG]\nGyal, yuh pussy good from birth\nWan' yuh bend it over, yeah, in them skirt\nGyal, yuh full ah energy like dancehall concert (Weh, haha)\nGood sex is all you get\nI love to see you get wet (Woii yoii)\nCho, weh (Mustard on the beat, ho)\nAyy\n\n[Verse 1: Popcaan]\nGyal, yuh tight pussy tie mi\nYuh vagina so tiny\nCall di iPhone anytime yuh horny\nPopskull ah fuck yuh grimy\nCock it up inna di back ah di Ferrari\nMi beat up yuh pussy, mi bruise e, scar e\nYou are a blessing to my life, baby (Mhm)\n\n[Pre-Chorus: Popcaan]\nBadman turn har on, squeeze her up\nLong cocky gon' full her up\nHandcuff, but mi nah hold har up\nHer best friend ah call, but she doh wan' go\nLove when mi feel har up\nFinger inna di pussy, dat ah pre-warmup\nGyal, mi sperm thick, mi feed pon walnut\nHaha (Ayy)\n\n[Chorus: Popcaan]\nSexual intеrcourse\nSexual, sexual\nSеxual intercourse\nSexual, sexual (Woii yoii)\n\n[Verse 2: Megan Thee Stallion]\nAyy, when it come to body, nobody bodyin' me\nMixin' weed with the liquor, creatin' the chemistry\nTakin' shots back to back of the white Hennessy\nI'm about what I say, so please do not tempt me, ayy\nI'm so for real, I came no panties when he asked me to chill\nI never gave a fuck 'bout what them other girls sayin'\nI just wanna know if the dick really hangin'\nYou ain't gotta sugarcoat shit 'less you're lickin' on me\nIf that's the case, you need to get the liquor and the honey\nBody right, pussy tight, come and put it on me\nSendin' pics to your phone so you're never lonely\nBaby, I can take the trip with or without ya\nBeen a fly bitch way before I found you\nStamps in my passport, can't even count them\nAll my bitches with me, so I can't leave without them\nBaby, why don't we go to Montego?\nLet you put your hook in my bumper like a repo\nI'm tryna do some real freaky shit, only we know\nTreat my body like some oxtails, lick your fingers\nPut that cocky on my body, give me spit to make it sloppy\nLook me in my eyes and tell me what you like about me\nI'm doin' what I got to do for you to make me wifey\nTake me where the temperature is hotter than a hottie\n\n[Pre-Chorus: Popcaan]\nTurn har on, squeeze her up\nLong cocky gon' full her up\nHandcuff, but mi nah hold har up\nHer best friend ah call, but she doh wan' go\nLove when mi feel har up\nFinger inna di pussy, dat ah pre-warmup\nGyal, mi sperm thick, mi feed pon walnut\nHaha (Ayy)\n\n[Chorus: Popcaan]\nSexual intercourse\nSexual, sexual\nSexual intercourse\nSexual, sexual (Woii yoii, weh)\nSexual intercourse\nSexual, sexual (Weh)\nSexual intercourse\nSexual, sexual (Weh)\nPsycho business", "[Intro]\nMoney good, I ain't gotta worry 'bout shit\nMoney good (Ahh)\nAyy, ayy\n\n[Chorus]\nMoney good\nThrow up where I'm from, let 'em know I'm still hood\nI ain't had to get nobody hit but I could\nBefore I post a pic, should I flex? Yeah, I should\nI ain't gotta worry 'bout shit, money good\nRide with some hitters and they wish a bitch would\nI don't wanna argue 'bout it, baby, I'm good\nIf she got a band let her in, yeah, she good\nI ain't gotta worry 'bout shit, money good\n\n[Verse 1]\nMan, I hate a ol' lame dick-riding ass bitch\nNever let a sack chaser hang in my clique\nFuck getting clout, bitch, I'm tryna get rich\nBetter hide your wallet when I fall in the mix\nCan't deny I'm a star, you can tell by my walk\nI ain't even gotta fuck him, he just love how I talk\nI'm embracing the fake, I'm accepting the hate\nIf I wasn't number one, they wouldn't come for my place", "[Chorus]\nMoney good\nThrow up where I'm from, let 'em know I'm still hood\nI ain't had to get nobody hit but I could\nBefore I post a pic, should I flex? Yeah, I should\nI ain't gotta worry 'bout shit, money good\nRide with some hitters and they wish a bitch would\nI don't wanna argue 'bout it, baby, I'm good\nIf she got a band let her in, yeah, she good\nI ain't gotta worry 'bout shit, money good\nThrow up where I'm from, let 'em know I'm still hood\nI ain't had to get nobody hit but I could\nBefore I post a picture should I flex? Yeah, I should\nI ain't gotta worry 'bout shit, money good\n\n[Verse 2]\nMan, I know some broke ass niggas who be hatin'\nPop a rubber band put that money in they face\nI be out here grindin' like a nigga who ain't ate\nYou ain't bringing nothing to the table but your plate\nBitch, I'm out here ballin' like a motherfuckin' fade\nI can't gossip with you when there's money to be made\nI'm tryna get my pockets 99 Ricki Lake\nWhen you bein' real you ain't worry 'bout who fake\n\n[Chorus]\nMoney good\nThrow up where I'm from, let 'em know I'm still hood\nI ain't had to get nobody hit but I could\nBefore I post a pic, should I flex? Yeah, I should\nI ain't gotta worry 'bout shit, money good\nRide with some hitters and they wish a bitch would\nI don't wanna argue 'bout it, baby, I'm good\nIf she got a band let her in, yeah, she good\nI ain't gotta worry 'bout shit, money good\nThrow up where I'm from, let 'em know I'm still hood\nI ain't had to get nobody hit but I could\nBefore I post a pic, should I flex? Yeah, I should\nI ain't gotta worry 'bout shit, money good\n\n[Verse 3]\nHair long, nail long, money long, too\nGet a bag, spend it, make it back time two\nI could never let nobody tell me what to do\nIf a nigga get to trippin' then I'ma throw that boy the deuce\nPull up in a Rolls Royce finna rock a show\nClique full of bad friends, we at Pappadeaux\nRent due, finna let your baby daddy know\nHe in love with me but he know to play his role\n\n[Chorus]\nMoney good\nThrow up where I'm from, let 'em know I'm still hood\nI ain't had to get nobody hit but I could\nBefore I post a pic, should I flex? Yeah, I should\nI ain't gotta worry 'bout shit, money good\nRide with some hitters and they wish a bitch would\nI don't wanna argue 'bout it, baby, I'm good\nIf she got a band let her in, yeah, she good\nI ain't gotta worry 'bout shit, money good\nThrow up where I'm from, let 'em know I'm still hood\nI ain't had to get nobody hit but I could\nBefore I post a pic, should I flex? Yeah, I should\nI ain't gotta worry 'bout shit, money good", "[Intro]\nJust come get all your stuff, I guess my love ain't good enough\n\n[Verse 1]\nJust come get all your stuff, I guess my love ain't good enough\nYou act so hard with me, but I just saw you in a picture lookin' soft with her\nBe calm if you wanna get along with me\nWay you talk, really think it's something wrong with me\nWhy I feel like I gotta share you with the city?\nYou don't even make a bitch feel like she pretty\nMake a bitch feel like she pretty\nKiss me in the middle of the party when it's litty\nRemember who you belong to when they friendly\nI shouldn't have to teach you somethin' you should be feelin'\n\n[Pre-Chorus]\nDon't rock me to sleep\nSkip to the part that you really mean, yeah\nDon't rock me to sleep\nBaby, just say what you really mean\n\n[Chorus]\nBlah, blah, blah, la-la-la\nIf you wanna leave, then bye, bye, bye\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\nBlah, blah, blah, la-la-la\nIf you wanna leave, then bye, bye, bye\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\nBlah, blah, blah, la-la-la\nIf you wanna leave, then bye, bye, bye\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\nBlah, blah, blah, la-la-la\nIf you wanna leave, then bye, bye, bye\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\n\n[Post-Chorus]\nDon't rock me to sleep\nSkip to the part that you really mean, yeah\nDon't rock me to sleep\nBaby, just say what you really mean\n\n[Verse 2]\nIt's been about six months\nSince I threw out all your stuff\nYou never stood a chance with me\nNow it's looking like you're way better off with her\nHair grown, money long, now I'm in the city\nAll my friends like, \"Girl, what you doin' different?\"\nGuess that fuckboy-free glow hittin'\nWaist snatched, ass fat, feelin' real pretty\nYeah, feelin' real pretty\nAnd my new boo got me feelin' real pretty\nHold my hand everywhere so they know he with me\nHe don't wan' fight, he just wan' fix it\n\n[Pre-Chorus]\nDon't rock me to sleep\nSkip to the part that you really mean, yeah\nDon't rock me to sleep\nBaby, just say what you really mean\n\n[Chorus]\nBlah, blah, blah, la-la-la\nIf you wanna leave, then bye, bye, bye\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\nBlah, blah, blah, la-la-la\nIf you wanna leave, then bye, bye, bye\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\nBlah, blah, blah, la-la-la\nIf you wanna leave, then bye, bye, bye\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\n\n[Post-Chorus]\nDon't rock me to sleep\nSkip to the part that you really mean, yeah\nDon't rock me to sleep\nBaby, just say what you really mean\n\n[Outro]\nBlah, blah, blah, la-la-la\nLa, la-la-la\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by-by\nBlah, blah, blah, la-la-la\nLa, la-la-la\nI'm a big girl, so I won't cry\nDon't sing me a lullaby-by", "[Intro]\nLilJu made this beat\nReal fuckin' hot girl shit, bitch\nReal fuckin' ratchet shit, bitch\nCome in the club and get it clapping and shit, bitch\nYeah, ah\nAyy, ayy, yeah\n\n[Pre-Chorus]\nWork, work, work, work\nWork, work, work, ayy\nWork, work, work, work\nWork, work, work, ayy\n\n[Chorus]\nBend it over, touch them toes, huh\nMake that booty go, uh\nThrow that shit back, uh\nLike the tootsie roll, ayy\nBitch, you drunk as fuck, huh\nThrow that ass up, ayy\nWhen he get behind it, uh\nFuck his ass up, yeah, ah\n\n[Verse 1]\nWho shake that ass the best? Me\nHe wanna know how I move on the D\nI want a nigga that eat like a Q\nWhy you with her and she built like a P?\nRide on that dick on my tiptoes\nPussy so good that he hittin' the woah\nI'm tryna come put that ass in your face\nI got him makin' a mess in his clothes\nI got him fallin' in love with me\nI got him all in the mall spending\nI said, \"If I come and give you this ass\nIs you gon' know what to do with it?\"\nI got him fallin' in love with me\nI got him all in the mall spending\nI said, \"If I come and give you this ass\nIs you gon' know what to do with it?\" Ah\n\n[Pre-Chorus]\nWork, work, work, work\nWork, work, work, ayy\nWork, work, work, work\nWork, work, work, ayy\n\n[Chorus]\nBend it over, touch them toes, huh\nMake that booty go, uh\nThrow that shit back, uh\nLike the tootsie roll, ayy\nBitch, you drunk as fuck, huh\nThrow that ass up, ayy\nWhen he get behind it, uh\nFuck his ass up, yeah, ah\n\n[Verse 2]\nBitch, break your back, huh\nMake that ass clap, uh\nMake him eat it up, hmm\nShake them sugar smacks, ayy\nSo good, it make him cry, uh\nSweet like patty pie, hmm\nYou ain't got no money, ugh\nBoy don't even try, ayy\nBounce that ass like Tigger, huh\nThrow that ass on a rich nigga, mmh\nMake him hit it hard, ayy\nAnd make your booty bigger, ayy\nBitch, break your back, huh\nMake that ass clap, uh\nMake him eat it up, yeah\nShake them sugar smacks, ah\n\n[Pre-Chorus]\nWork, work, work, work\nWork, work, work, ayy\nWork, work, work, work\nWork, work, work, ayy\n\n[Chorus]\nBend it over, touch them toes, huh\nMake that booty go, uh\nThrow that shit back, uh\nLike the tootsie roll, ayy\nBitch, you drunk as fuck, huh\nThrow that ass up, ayy\nWhen he get behind it, uh\nFuck his ass up, yeah, ah", "[Intro]\nBikini bottoms and bikini tops\nYou can catch Thee Stallion drinking out a Henny bottle, lookin' hot (Ayy, yeah)\nHot girl, hot girl, hot girl, hot girl\n\n[Verse 1]\nShades on in the party, am I lit? Bitch, of course (Duh)\nH-Town hottie, I'm the black Regina George (I'm the black Regina George)\nEx tried to play me like a ho (What?)\nI put him on the block 'cause that just make him want me more (Ahh)\nAnd I don't wanna talk, I put my phone on DND (Yeah)\nI'm with my other nigga, tryna creep like TLC (What?)\nAnd when he tryna start, I push that button, E-N-D (Uh-uh)\nAnd only time I see him, when I'm tryna get some D (Ayy, ayy, ayy, ayy, yeah)\nI don't wanna call, I don't wanna text\nTryna set me up, put me on the net (I ain't goin')\nI don't do no pics, I don't shoot no vids (Hell nah)\nAnd you ain't gon' see my name in no GM (Nope)\n\n[Pre-Chorus]\nI be doing me, hanging lowkey (In the back)\nThey gon' do the most, I'ma keep it G (Keep it player)\nI don't say a word but I'm gettin' seen\nEverything I do, I do it naturally, ayy, yeah\n\n[Chorus]\nNaturally (I'm a star)\nNaturally (I'm that bitch)\nNaturally (Check my fit)\nNaturally (Do what I want)\nNaturally (Stalli)\nNaturally (I'm the shit)\nEverything I do, I do it naturally", "[Verse 2]\nI was never meant to live life like a simp\nFuck getting skimped, I'd rather be a pimp (I'd rather be a pimp)\nAnd every enemy I had started as a friend\nThey wanna see me shine but not harder than them\nSo I stepped out, body like pow (Voila)\nIf he runnin' with that money, you know Megan in route (Yeah)\nGot your daddy drinking out the bottle, he wanna be down\nHe be actin' like a kid, running from your mama house\nI'm sexy and we know that ain't a secret (Nope)\nSlicked back ponytail like I'm Puerto Rican (Yes ma'am)\nBaby hairs on, yes ma'am, bitch, kill it (Girl, kill it)\nI'm so bad, I look like a super villain\n\n[Pre-Chorus]\nI be doing me, hanging lowkey (In the back)\nThey gon' do the most, I'ma keep it G (Keep it player)\nI don't say a word but I'm gettin' seen\nEverything I do, I do it naturally, ayy, yeah\n\n[Chorus]\nNaturally (I'm a star)\nNaturally (I'm that bitch)\nNaturally (Check my fit)\nNaturally (Do what I want)\nNaturally (Stalli)\nNaturally (I'm the shit)\nEverything I do, I do it naturally\n\n[Verse 3]\nHot girl, big bucks\nPull up in that what the fuck\nBad bitch, super model\nMake your nigga suck my pussy like a baby bottle (Mwah)\nThey be tryna block my blessings, I'm like AND1 (Woo)\nAnd I bet your nigga is a fan, huh (Ahh)\nHe wanna ride 'cause I'm cooler than a fan huh\nI'm so hot, he wanna kiss on my tan lines\nFine and I'm slim (Slim), I be in the gym (Yeah)\nI know some mad hoes built like M&M's (Built like M&M's)\nAnd a couple of these dudes with these damn slim jims\nBuying big magnums, tryna fuck you backwards\nBut I like it with the lights on (Lights on)\nI need to see if that thang really hang long (Hang long)\nAnd he say I'm a dog, I'ma need a big bone (Big bone)\nAnd if you fall short, I'm a send yo' ass home\nNigga, take yo' ass on\n\n[Pre-Chorus]\nI be doing me, hanging lowkey (In the back)\nThey gon' do the most, I'ma keep it G (Keep it player)\nI don't say a word but I'm gettin' seen\nEverything I do, I do it naturally, ayy, yeah\n\n[Chorus]\nNaturally (I'm a star)\nNaturally (I'm that bitch)\nNaturally (Check my fit)\nNaturally (Do what I want)\nNaturally (Stalli)\nNaturally (I'm the shit)\nEverything I do, I do it naturally (Ahh)", "[Intro]\nDJ Chose\n\n[Verse 1]\nAyy, first of all, I'm from Houston\nPicky bitch, I'm choosy\nFeel like it, I'ma do it (Uh)\nNew-new with the new shit (Mwah)\nI do what the fuck I want, when the fuck I want (Uh)\nBitch, don't like me all you want, run up, bet you won't (Uh)\n(Houston, we have a problem) (Hey, yeah)\nBitch, don't like me all you want, run up, bet you don't (Uh)\n(Five, four, three, two, one) Ayy, ayy, yeah\nI do what I want and you do what you can, that's why I'm breaking your man (Huh)\n\n[Verse 2]\nToday I woke up in my act (Huh) look at these bitches they whack (Ugh)\nNow look at Megan, she bad (Ayy) niggas in love with this ass (Ayy)\nRide you, ride you like a beat, want me next to you like I'm B (Huh)\nCollege girl like Moesha (Uh), with titties like Mia Khalifa (Woo)\nI need to run up a bag quick, I need to hit me a new lick\nI told these hoes, \"Quit fucking these tricks\" (Ugh)\nI get that money, not giving up shit\nGettin' my muhfuckin' money on (Yeah)\nAnd I ain't comin' if the money wrong (Nope)\nBitches hate me like I done 'em wrong (What?)\nTalkin' shit, but they ain't coming wrong\nDo we have a problem bitch? (Do we?)\nWit' yo' nigga, prolly, bitch\nYou soft and I'm solid, bitch, uh (Rocky)\nWalk in (Uh), look like money (Uh), bitch\n\n[Bridge]\nI do what the fuck I want, when the fuck I want (Ayy)\nBitch, don't like me all you want, run up, bet you won't\n(Bet you won't)\nMan, I'm on these bitches necks like a fucking charm (Fucking charm)\nMake a nigga come quick like I fucking owe him (Ah)\n\n[Verse 3]\nI look like I belong in a pageant, most of these bitches look like they done had it\nI know I'm pretty but shit could get ratchet, pull up with niggas that's full of that action (Huh)\nHe think my hustle attractive (Uh)\nThumbin' through money romantic (Ayy)\nRide on the dick how I dance (Uh)\nYour bitch only fuck on her back (Ew)\nI be talking to him reckless when I'm super faded\nI told that nigga, \"Eat this pussy like your mama made it\" (Uh)\nSitting on your bae face, I'm the babysitter (Uh)\nIf you knew the bitch was lame, why you fucking with her? (Uh)\nI want that face like a book (Uh)\nGet in your mouth like I cook (Uh)\nButt naked serving him looks (Uh)\nI got the girls and they shook (Uh)\nReally go harder than hoes (Uh)\nHarder than some of your bro's (Uh)\nShe wanna be me, I know it (Uh)\nHe let this pussy control him (Uh)\n\n[Outro]\nAyy, ayy, yeah\nYoung Tina Snow goin' hard on a hoe (Ahh)\nAyy, ayy, and I'm still running through the mall wit' yo' motherfucking Daddy (Ahh, ahh, ahh)", "[Verse 1]\nMoney to make and we all gon' spend it\nTakin' care of my team, they wit' me\nCan't complain, can't do no trippin'\nSayin' a prayer and I know he hear me\nPeople keep sayin' I should be the bigger person\nWho's gonna worry 'bout me when I'm hurtin'?\nGot one more time, keep talkin' that shit\nAnd I'ma wild out and go hard on a bitch\nI been stayin' up all night\nMy niggas in the street, I'm makin' sure they're alright\nAnd if I tell 'em it's a issue, then it's on sight\nI'm on point, let me show you what that aim like\n\n[Pre-Chorus]\nShit ain't the same and you say I'm changin'\nBut I really think it's you\nMad at me 'cause I'm elevatin'\nBut what you wanted me to do?\n\n[Chorus]\nPlease don't give up on me, Lord, Lord\nPromise to keep goin' hard, hard\nAll of them nights that I cried in the car\nAll them tears turned into ice on my arms\nPlease don't give up on me, Lord, Lord\nPromise to keep goin' hard, hard\nAll of them nights that I cried in the car\nAll them tears turned into ice on my arms\n\n[Post-Chorus]\nAnd that's why I keep goin' harder\nAnd harder (Ayy)\nAnd that's why I keep goin' harder\nAnd harder (Ayy)\n\n[Verse 2]\nNigga, why you wanna play with me?\nAnd why your girl look like she got somethin' to say to me?\nHe a snake and you layin' in the snake pit\n'Cause he the type of nigga fuck a bitch I'm cool with\nI don't want to talk and I barely wanna listen\nNiggas playin' tag and they all tryna get me\nGotta stay focused, gotta stay winnin'\nYoung bitch just tryna make these millions\nYou know ya really motivatin' me\nI'm really happy that you mothafuckas hate me\nAll them hoes get quiet when I walk in\nThey don't bother me, I know them bitches ain't shit\n\n[Pre-Chorus]\nShit ain't the same and you say I'm changin'\nBut I really think it's you\nMad at me 'cause I'm elevatin'\nBut what you wanted me to do?\n\n[Chorus]\nPlease don't give up on me, Lord, Lord\nPromise to keep goin' hard, hard\nAll of them nights that I cried in the car\nAll them tears turned into ice on my arms\nPlease don't give up on me, Lord, Lord\nPromise to keep goin' hard, hard\nAll of them nights that I cried in the car\nAll them tears turned into ice on my arms\n\n[Post-Chorus]\nAnd that's why I keep goin' harder\nAnd harder (Ayy)\nAnd that's why I keep goin' harder\nAnd harder (Ayy)\n\n[Outro]\nAnd that's why I keep goin' harder\nAnd harder (Ayy)\nAnd that's why I keep goin' harder\nAnd harder (Ayy)", "[Intro: Megan Thee Stallion]\nPlease stop playin' with me, bitch\nPlease stop playin' with me\nPlease stop playin' with me, bitch\nPlease stop playin' with me\n\n[Chorus: Megan Thee Stallion]\nAyy, you bitches is weird, I don't wanna hang\nWay that he talkin', I'm knowin' he lame\nLook at my watch, look at my ring\nYou know how I'm comin', bitch, stop playin'\nYou bitches is weird, I don't wanna hang\nWay that he talkin', I'm knowin' he lame\nLook at my watch, look at my ring\nYou know how I'm comin', bitch, stop playin'\n\n[Verse 1: Megan Thee Stallion]\nWay too lit, watch my drip\nWhen I take that sip, niggas know I ain't playin'\nI'm from the H, excuse my slang\nI'm comin' down, know what I'm sayin'?\nI really be workin', bought me a Birkin\nI bet if I post it, them bitches gon' hate\nSayin' you happy and knowin' you hatin'\nDon't congratulate me, you bitches is fake (Yeah)\nJust got a bag, went to the lot\nLooked at the dealer and told him, \"I'll take it\"\nBefore I was rich, I was poppin' my shit\nNow that I'm lit, ain't shit changed\nWatchin' me blow up, watchin' me glow up\nAyy, I know you can't take it, ayy\nTalkin' that shit from way over there\nHuh, bitch, stop playin'\n\n[Chorus: Megan Thee Stallion & Gunna]\nAyy, you bitches is weird, I don't wanna hang\nWay that he talkin', I'm knowin' he lame\nLook at my watch, look at my ring\nYou know how I'm comin', bitch, stop playin'\nYou bitches is weird, I don't wanna hang\nWay that he talkin', I'm knowin' he lame\nLook at my watch (Watch), look at my ring (Ring)\nYou know how I'm comin', bitch, stop playin'\n\n[Verse 2: Gunna]\nSay it again\nYou know how I'm comin', bitch, stop playin' (Stop playin')\nYour Rolex is flooded, look at your hand (Your hand)\nMy house came with acres, I own some land (Yeah)\nBig booty bitch 'bout to bust out her pants (Woo)\nDamn, look how she walk (Walk), she got a stance (Stance)\nThese hoes throwin' salt (Salt), you might get a chance\nYoung Wunna big boss, my M's in advance (Yeah)\nFeel like a prince (Prince), money gon' print\nI'm kickin' shit, young Jackie Chan (Wah)\nI'm the new voice, ridin' 'round with that bread (That bread)\nMy crew done got rich, ain't no way be depressed (Depressed)\nI'm so elite (Elite), I'm the rap MVP (Uh-huh)\nAin't no way to compete, you get way too much rest (Much rest)\nKeep that shit on, every day I be dressed (Be dressed)\nI'm rockin' Margiela, this t-shirt is mesh\n\n[Bridge: Megan Thee Stallion]\nPlease stop playin' with me, bitch\nPlease stop playin' with me\nPlease stop playin' with me, bitch\nPlease stop playin' with me\n\n[Chorus: Megan Thee Stallion]\nAyy, you bitches is weird, I don't wanna hang\nWay that he talkin', I'm knowin' he lame\nLook at my watch, look at my ring\nYou know how I'm comin', bitch, stop playin'\nYou bitches is weird, I don't wanna hang\nWay that he talkin', I'm knowin' he lame\nLook at my watch, look at my ring\nYou know how I'm comin', bitch, stop playin'\nAh", "[Intro]\n(MCV bitch)\nAyy, yeah, Stalli, summer '17\nAyy, yeah, yeah, ayy, look\n\n[Verse 1]\nOkay, last week we was eatin' peanut butter jelly (Damn)\nThen I hit a lick, now we countin' Benja-mellys (Okay)\nMet him in the telly, doin' whatever he let me\nI got love for my nigga like I'm Tionne off of Belly (Mwah)\nEverybody thinkin' bad bitches got it easy\nWell not the young ones on the grind gettin' greazy\nLast week, I had to make a hunnid dollars stretch\nEvery motherfuckin' night, I was eatin' cheese eggs (Okay)\nBitches tell stories 'cause these whores don't know me (Don't know me)\nSee me by myself and got to trippin wit' your homie\nI bet if you touch me, you go missin' like you Dory (Like you Dory)\nBitch, that's why your nigga wanna kick it wit' the horsey\nUh-oh, I ain't never ran from a ho (Ran from a ho)\nBut I never let a bitch get a stain on my clothes (No-oh)\nRidin' with my hands in the air\nGot your nigga on the side with his fingers in my ooh, yeah, yeah\nJust bought a fifth of the Henn' (Fifth of the Henn')\nPocket full of white man, named Benjamin (Named Benjamin)\nLookin' for a hot boy with some fine friends (With some fine friends)\nAnd your baby daddy wanna be my boyfriend", "[Chorus]\nBitch, I'm from Texas, rock all the best shit\nAnd I walk slow for them eyes tryna catch this (For them eyes)\nBad red head, make your whole clique lose it\nBoy, I know you wanna come kick it out in Houston\nBitch, I'm from Texas (Ayy, ayy)\n(H-Town, H-Town, H-Town, yeah)\nBitch, I'm from Texas\n(Ayy, ayy, 7-1-3, 2-8-1, 8-3-2)\n\n[Verse 2]\nOkay, last week shit was kinda bad (Bad)\nI be goin' missin' when I'm tryna get a bag (Yeah)\nI ain't got no time for no nigga tryna nag\n'Cause I'm in love with my money like my name Mr. Krabs (Like my name Mr. Krabs)\nAnd I got the winnin' ticket, middle finger to them niggas and them bitches\nYou was wishin' that I'd stay slippin', throwin' all them peelings\nYou was dissin', you ain't see the vision, like your eyes was Christian\nTryna curse me, I just pray to God they keep the devil off me\nStalli don't bend or fold for no ho\nDon't give convo to those I don't know\nNiggas try to play me close to get my info\nOnly time I disclose is when I disrobe\nNever gave a fuck (Fuck), never gave a damn (Damn)\nAnd I'ma keep on grindin' till these hoes know who I am\nAnd I will come and take you for a hold of my hand\nAnd bitch, I best not catch you lookin' at my fuckin' man (What?)\nAnd when I'm with my crew (Crew), just be cool (Cool)\nUnless you wanna see some real bitches act a fool (Real bitches act a fool)\nAnd when I walk by (By), niggas just sty\nThey only make 'em like this on the Southside\n\n[Chorus]\nBitch, I'm from Texas, rock all the best shit\nAnd I walk slow for them eyes tryna catch this (For them eyes)\nBad red head, make your whole clique lose it\nBoy, I know you wanna come kick it out in Houston\nBitch, I'm from Texas (Ayy, ayy)\n(H-Town, H-Town, H-Town, yeah)\nBitch, I'm from Texas\n(Ayy, ayy, 7-1-3, 2-8-1, 8-3-2)\n\n[Verse 3]\nSippin' on mimosa, while he lick on my panocha (Ahh)\nCollar round his neck that say \"Thee Stallion\" 'cause I own him\nHaters never see me, I ain't hangin' where it's local (Hangin' where it's local)\nDrink my Henny outta China, black and boujie like I'm Oprah\nStallion for president, snatchin' all the brethren (All the brethren)\nFoot up in a rap bitch ass without no lubricant\nShe boring, I ain't hearing it (Nope), who the fuck is hyping this? (Who?)\nThere's something off about her like she missin' some ingredients (Ugh)\nI'm sexual, no deviant, I like my man obedient (I like my man obedient)\nDon't want it missionary 'cause that's boring, I need freaky shit\nWalk up in the house and bust a pipe, get it leakin' shit\nAll up on my booty while you do me on some pinky shit\nYes, I got big breasts, so I like to say shit wit' my chest\nAnd I'm not sayin' I'm not humble, I just feel like I'm the best\nWho's my competition? It's like all y'all the same bitch\nAnd y'all be beefin', I'm a vegan, stupid bitches make me itch\nAnd I keep me a full set, I keep something nice around my neck\nI keep a box around your nigga 'cause I keep his ass in check\nNow I'm done with being broke so don't get mad if I ain't spoke\nBitch, I'm chillin' out in Houston, come and see me if you want (Ahh)", "[Intro]\nReal hot girl shit, ah!\n\n[Verse 1]\nAy, let's be clear\nI quit fuckin' on my old niggas last year\nThis pussy ain't even in your bracket\nRich bitch problems, I'm a LV addict\nWalk in and I take your nigga, automatic\nFuck him in a mansion but I give it to him ratchet\nAll this drip make a broke hoe panic\nI'm tryna get your nigga out his hat like a rabbit\nAye, hot girl shit\nShut the fuck up lil' bitch, you be lyin'\nSay that you breakin' these niggas, you cryin'\nHe wanna go on a date and you buyin'\nHe got to be out his muhfuckin' mind\nIf he thinkin' I'm finna cum off the ass\nAnd he thinkin' he ain't gon' come off no cash\nNo I'm not sayin' that I prostitute\nBut you wanna see me, so pay for the view\nI'm lettin' him know that I know my worth\nIf he ain't big enough, finna get curved\nHow you so comfortable talkin' that shit?\nWalkin' around with that lil bitty dick\nYou got to be out your muhfuckin' mind\nThinkin' you hotter than me, hoe you tried it\nGet on that mic and you know I get live\nYou want that smoke and you know where to find it\nAah\n\n[Hook]\nLook, you got to be out your muhfuckin' mind\nThinkin' you hotter than me, hoe you tried it (you tried it)\nAh, aye, ah, aye\nLook, how you so comfortable talkin' that shit? (How? How?)\n\n[Verse 2]\nLook, boy I'm too player, you know you can't play me\nI turn a stiff nigga into a baby\nFuck like a freak but I act like a lady\nStill in love with me if we ever dated\nThese bitches biting my swag and I peep it\nHop off my pussy or go 'head and eat it\nCocky as fuck, bitch you know I'm conceited\nI'm the hot girl and i got these hoes heated\nMegan Thee Stallion they know I'm a animal\nMy flow is sick and they can't find an antidote\nI met your man, now he cannot remember you\nCome to the crib, make him suck like a tentacle\nOpen her mouth then I pour in a shot\nEverywhere i go, I'm making it pop\nBarely wear clothes, 'cause bitch I be hot\nName a bitch badder than me, you cannot\n\n[Hook 2]\nAh, ah, aye, yeah, look!\nName a bitch badder than me, you can not\nName a bitch badder than me, you can not\nAh, ah, ah, ah!\nYou want that smoke and you know where to find it\nThinkin' you hotter than me, hoe you tried it\nAh, ah, ah!", "[Intro]\nBig drank, big drank\nBig drank, big drank, ah\nBig drank, big drank\nBig drank, big drank, ayy, ooh\nLilJu made this beat\n\n[Chorus]\nAyy, ooh\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank\nAyy, ooh\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank\nYou can get a bizzer\nAnd be sippin' on that sizzurp\nAyy, big drank, big drank\nBig drank, big drank\nBig drank, big drank\n\n[Verse 1]\nIf you got a sixteen, my nigga got a bizzer\nI hate when you be trippin' and be sippin' on that sizzurp\nYou be actin' berzerk, nigga, what's the wizzord?\nTold him, \"Give me brain,\" and he do it like a nizzerd\nI hate when you get on that drink, you don't wanna listen to me\nYou act like I get on your nerves, you don't pay attention to me, ayy\nBaby tell me what's up, why you acting so stub'?\nTell me what's important, is it me or what's in your cup?\nTake it all off, bend over, let you see it\nNeed a real bitch, then, baby, let me be it\nTell me what's important, is it me or what's in your cup?\n(Choking on that doja sweet and sippin' on that sizzurp)\n\n[Chorus]\nAyy, ooh\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank\nAyy, ooh\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank\nYou can get a bizzer\nAnd be sippin' on that sizzurp\nAyy, big drank, big drank\nBig drank, big drank\nBig drank, big drank\n\n[Verse 2]\nYou fell in love with the soda, baby, just hold up\nI don't be smokin' no weed but he taught me how to roll up\nPour the drank on my body, yeah, drink it all off me\nDo it, do it, do it, sloppy, yeah, you know what I need\nBack that ass up, oh yeah\nDo I like that? Oh yeah\nBend it over to my toes, yeah\nOn the drank, fuck me slow, yeah\nI told him stop sippin' but I love them codeine kisses\nPosting all our pictures, putting bitches in our business\nGot a sixteen, my nigga got a bizzer\nHate when he be tripping and be sippin' on that sizzurp\nHate when you be stupid, and you be actin' sti-nuck\n(Choking on that doja sweet and sippin' on that sizzurp)\n\n[Chorus]\nAyy, ooh\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank\nAyy, ooh\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank\nYou can get a bizzer\nAnd be sippin' on that sizzurp\nAyy, big drank, big drank\nBig drank, big drank\nBig drank, big drank\n\n[Outro]\nAh\nMwah\nDrank\nBig drank, big drank\nBig drank, big drank\nLilJu made this beat\nI hate when you get on that drink, you don't wanna listen to me\nYou act like I get on your nerves, you don't pay attention to me, ayy\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank\nBig drank, big drank", "[Intro]\nProlific Beats\nMwah, ayy\nLilJu made this beat\n\n[Chorus]\nDrinking Henny out the bottle, let's get ratchet\nShake that ass for a shot, get it clapping\nPop that pussy for my nigga, don't be acting\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\nLet's get ratchet, let's get ratchet\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\nLet's get ratchet, let's get ratchet\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\n\n[Verse 1]\nBig old booty, big old booty, get it clapping\nFinesse these niggas out them dollars, that's a talent\nI want some money, want some money, boy, what's happening?\nDon't want no nigga who be acting, who be capping\nI'm on some real ratchet shit, pull up to your crib\nScope out everything, tell my niggas where it is\nPut a straw in the fifth, hot girl shit\nIf the bitch ain't 'bout it, then she can't be in the clique, ah\n\n[Chorus]\nDrinking Henny out the bottle, let's get ratchet\nShake that ass for a shot, get it clapping\nPop that pussy for my nigga, don't be acting\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\nLet's get ratchet, let's get ratchet\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\nLet's get ratchet, let's get ratchet\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\n\n[Verse 2]\nRatchet ass shit, a ratchet ass bitch\nHit a lick on a nigga in a ratchet ass whip\nRiding with a street nigga with the ratchet on his hip\nDon't be coming to the stage if you know you don't tip\nYour bitches is poor, my bitches on go\nMy bitches ain't scared to get it on the floor\nShout to DJ Eric, shout out to Big Dough\nShout out to them girls who go where the money go\n\n[Chorus]\nDrinking Henny out the bottle, let's get ratchet\nShake that ass for a shot, get it clapping\nPop that pussy for my nigga, don't be acting\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\nLet's get ratchet, let's get ratchet\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy\nLet's get ratchet, let's get ratchet\nLet's get ratchet, let's get ratchet, let's get ratchet, ayy, ah\n\n[Outro]\nAyy, ayy, ayy\nFinessing niggas out them dollars, that's a talent, ayy\nYeah, ah, ah, ah\nDrinking Henny out the bottle, let's get ratchet, yeah, ah\nYeah, real hot girl shit\nTake a nigga quick\nShit on any bitch\nMwah, ah", "[Intro]\nUh, bring that motherfucking beat back\nWhat Juicy say? He be like, \"Shut the fuck up\"\n\n[Chorus]\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\n\n[Verse 1]\nDance, make him blow them bands\nHands, do it with no hands\nDamn, bitch, you been a fan\nDamn, damn, damn, damn\nHopped out the fucking Rover\nWith your baby like a stroller\nCall your bitch and say it's over\nYeah, yeah, yeah, yeah\nBitches acting shitty\nSo I had to potty train ’em\nI ain't never met the ho, but her nigga probably ate it\nI been moving with the bag, just in case I wanna buy shit\nI been moving with a shooter, just in case you wanna try shit\n\n[Pre-Chorus]\nDance, do the money dance\nBoy, this ain't no baby Benz\nAMG got big old bands\nYeah, yeah, yeah, yeah\nI don’t want your petty cash\nBoy, I want what's in your stash\nCome over and get this ass\nYeah, yeah, yeah, yeah\n\n[Chorus]\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\n\n[Verse 2]\nThey hit me to come through, they did good, so I do\nHe was nervous 'cause I'm gangster, tried to fuck me in his shoes\nBoy, you safe, it's okay, ain't no set up, you can stay\nIf I really want you hit, you wouldn't've made it all this way, hey\nPop it like some bubble gum, show me how you work your tongue\nNigga, don’t be acting shy, go ’round back and use your thumb\nYeah, I'm a freak, he be scared I’ma cheat\nTryna keep me in the house, pussy under lock and key, ah\n\n[Pre-Chorus]\nDance, do the money dance\nBoy, this ain't no baby Benz\nAMG got big old bands\nYeah, yeah, yeah, yeah\nI don't want your petty cash\nBoy, I want what's in your stash\nCome over and get this ass\nYeah, yeah, yeah, yeah\n\n[Chorus]\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\nDance, make him blow them bands\nDance, make him blow them bands\nDance, make him blow them bands\nDance, dance, dance, dance\n\n[Outro]\nHey, hey, yeah\nDance, make him blow them bands\nDance, make him blow them bands, hah\nHey, hey, hey, hey, ayy\nI’ma need that money, ooh\nPut up with my attitude\nCall me when you coming through\nYeah, yeah, yeah, yeah\nI'ma need that money, ooh\nCall me when you coming through\nPut up with my attitude\nAh, ah, ah, ah\nYeah, yeah, yeah, yeah", "[Intro]\n(MCV, bitch)\n\n[Chorus]\nGon' fuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round\n\n[Verse 1]\nIt's gon' fuck 'round drive you crazy (Yeah)\nTryna soak this game up\nFuck 'round, piss yourself off, tryna make me jealous (What?)\nYou know you a good guy (Good guy), we know I'm the hot girl (Hot girl)\nFuck 'round get your heart broke, acting outta character\nAyy, you know I'm addicted to hustling (Yeah)\nYou know I'ma get it by any means (Woo)\nYou fell in love with the lifestyle (Yeah, yeah)\nNow you gotta keep up with me\nAyy, he know I do what I want (Yeah)\nI know that drive him so crazy (Drive him so crazy)\nGet caught in the moment and ask if it's his\nThen I look back and say, \"Maybe\" (Ah)\nYou know he fell in love with the lingo\nKeep my name-o in his mouth like bingo (Like bingo)\nTold him he can get it, then he took it like a repo\nGot the nigga under controller, I got the cheat code\nAyy, he so addicted to me\nFell in my trap, now that dick stick to me (Now that dick stick to me)\nI had it first, they could get after me\nBut who the fuck else get it right after me? (Ayy, ayy, ayy, yeah)\n\n[Pre-Chorus]\nI knew right when we start talking, might not talk again\nYou got way too many problems, way too many friends\nYou got way too many issues, way too many moves\nI got way too much experience with these type of dudes\n\n[Chorus]\nI'm gon' fuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round", "[Post-Chorus]\nAyy, he so addicted to me (Me)\nFell in my trap, now that dick stick to me (Yeah)\nI had it first, they can get after me\nBut who the fuck else get it right after me? (Who?)\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round\n\n[Verse 2]\nI sip champagne, get membrane\nGo slow, yeah, that make me go insane\nAnd I can tell what he thinking like a twin thing\nAnd they can never understand it 'cause it's our thing\nI got moves like a tarantula (Yeah)\nGet up in my web I'm a snatch you up\nLong ass legs, I can wrap you up\nAnd now I got you in ya bag like a sack of lunch\nYou know I want you, don't need you\nReally I just came to feed you (Ayy)\nI hop on that face and stampede you (Ride)\nAnd then I start over like re-do (Ah)\nWe need, a we need a re-do (Yeah)\nI give you some time to redeem you\nYou know I ain't scared, I'm a freak too (Ooh)\nAnd really, I really, could teach you\nHe like the way I smell\nHe like the way I slick my bun down with the gel\nHe like it when I get up in that suit and dress well (Dress well)\nHe like it when I throw it to the side, give him hell (Ah)\nHe like it when I'm out here getting money, I can tell\nHe wanna be down so bad, I can tell\nAnd he don't want nobody else to get it, I can tell\nAnd he know anybody after Megan is an L\n\n[Pre-Chorus]\nI knew right when we start talking might not talk again\nYou got way too many problems, way too many friends\nYou got way too many issues, way too many moves\nI got way too much experience with these type of dudes\n\n[Chorus]\nI'm gon' fuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round\n\n[Post-Chorus]\nAyy, he so addicted to me (Me)\nFell in my trap, now that dick stick to me (Yeah)\nI had it first, they can get after me\nBut who the fuck else get it right after me? (Who?)\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, drive you crazy\nFuck 'round, fuck 'round, fuck 'round, fuck 'round\n\n[Outro]\nThis one's for my player ass women\nWho gettin' money and ain't gettin' in they feelings\nWho making profit, digging in these niggas wallets\nMy pretty women hanging with their pretty partners", "[Verse]\nAyy\nYou niggas is blockin' your blessings\nIf you so worried 'bout me, get invested\nBitch, I'm a business, you wanna get in it\nGo put down your phone and pick up a pen\nI understand, you thought you was smart\nBlind lead the blind, y'all all in the dark\nI know you used to seeing mediocre\nI know the bar getting lower and lower\nNigga wanna constrict me like a Boa\nSnake in the grass but I got the mower\nI went and put the city on my shoulders\nThey got my name at the top of the totem\nThey know about me 'cause somebody told 'em\nBitches is soft, you know I'ma fold 'em\nHe say I'm heavy, I told him \"I'm bloated\"\nYou need to put this pussy on a podium\nYou need to shut up, let the pussy speak\nA lot of you real niggas acting weak\nI think you really mad at your daddy but get on the internet aiming at me\nI think you motherfuckers need a hug\nI think you motherfuckers need a shot\nI think you motherfuckers need to buy a ticket to the show and come open your mouth\nI make a nigga hit the hurt face\nThis that stub your toe kinda pain\nThis that real bitch from the southside of that H-Town, switching lanes\nThis that shit real niggas ride to\nI make music real bitches vibe to\nYeah, I'm sexy, but, I'm gangsta\nI make real killers come find you\nBitches ain't built like Megan\nGod took his time when he made it\nGet too much shine and get shaded\nI don't follow niggas I dated\nIf I fucked your boo, don't worry\nThese niggas seasonal like McFlurries\nBut my outfits be so summertime\nMake a nigga crash 'cause I'm curvy\nHey, yeah\nBitch, I'm up now, ain't no question (Hmm)\nGiving these rappers a lesson (Hmm)\nI should go work at the church (Hmm)\n'Cause they know Megan a blessing (Hmm)\nThey don't like me 'cause I'm cocky\nWell, I cannot help that my sexy sell\nAnd I'm in love with my sexy self\nI need a boo that's gon' sex me well\nShould we shag now or shag later? (Huh)\nI'm tryna put your rock on some paper (Huh)\nBae wanna eat and I cater (Huh)\nStalli too wild can't tame her (Ayy)\nThey say that Megan too rowdy (Huh)\nAnd she be showing her body (Ayy)\nI bet if they got the chance (Huh)\nThey would come do it just like me, ahh\n\n[Outro]\nReal hot girl shit, ahh", "[Intro]\nSouthside, Southside on the, Southside on the, hey\nMetro Boomin want some more, nigga\n\n[Verse]\nI don't stick to niggas, I get lip from niggas\nMake him dine, then I dash, I don't tip for niggas\nHe gotta come off top like I'm holdin' clippers\nLemme bust it on your mouth, I can grow you whiskers\nIf he got a big dick, FaceTime me that\nIf I like what I see, I'ma handle that\nDrop a pin where your ho know where to find me at\nPulled up actin' wild with some hood rats, yeah\nShit's about to get real (Real)\nI'm from H-town trill (Trill)\nYou's a ugly bitch, ew (Ugh)\nAnd I'm hot without a deal (Yeah)\nBitch I'm screaming \"Who want it?\" (Want it)\nPlease show me my opponent\nHoes sick 'cause I'm on it (Ugh)\nFlow killer, hoes chokin'\nOoh that ass fat, turn around, she a bad bitch (Bad bitch)\nLay a nigga down then I give it to him nasty (Yeah)\nLookin' for a savage, a big dick bandit\nMy name on that Woody like my first name Andy\nOkay, get that face on the first date (Yeah)\nNose in my pussy like yay (Yeah)\nMakin' it spray like a AK\nFuckin' on beat like he Dre, yeah\nSmellin' like Dolce Gabbana (Yeah), all of my panties designer\nDress up, my love like Madonna (Madonna)\nFuckin' with me is an honour\nStallion made it drip drop on ya man tongue\nGet a lotta brain then I leave like the bell rung\nEyes so low like I'm Sue, call me ching chong\nPussy so good make a thug nigga sing songs\nEverything I drop is a bad bitch theme song\nFuck his brains out, then I tell him \"Put a beat on\"\nPretty ass bitch niggas wanna put a ring on\nTook a bitch spot like her motherfuckin' seat gone\nYeah, look back while I throw it (Throw it)\nHit the pussy like Dodie (Dodie)\nSmack my ass then choke it (Choke it)\nLift it up, then hold it (Yeah)\nGo crazy when I'm on it (Yeah)\nHe love it, I'm knowin' (Knowin')\nTryna hide that moanin' (Ooh)\nWhose is it? I own it\nSouth side make you bounce with that real shit you want (Real shit you want)\nAnd lil' Megan make you feel how them other bitches don't (Other bitches don't)\nHe was lookin' for some wet and he found that super soak (Ahh)\nPussy keep a nigga warm like a motherfuckin' coat\nAyy, yeah, ride on that dick like a frog (Frog)\nMake it drop down on your balls (Yeah)\nYou need to give me a call (Yeah)\nI'm tryna lock up your jaws (Uh)\nBoy, I look good than a bitch (Bitch)\nAnd I stay schoolin' your chick (Okay)\nHow is you fuckin' a lick? (How?)\nYour baby daddy a trick\nYeah, ayy, and he bought all of this shit\nThe shoes, the bag, the nails, the hair\nHe makin' it rain on my bitch at the strip (At the strip)\nMy nigga I saw with that thing on his hip (Thing on his hip)\n'Cause niggas was plotting on catching me slip\nDon't try to put me up next to your bitch\nI'm the new hype and I'm killing this shit\n\n[Outro]\n(Bitch) Yeah, yeah", "[Intro]\nYeah, Young Tina Snow going hard on a hoe (Ahh)\n\n[Verse 1]\nPussy so good got him talking like Yoda\nI need a bae with a mouth like a motor (Rrr)\nHer pussy nasty, she drink too much soda (Ugh)\nI got that Alkaline chocha, that water (That water)\nWalkin’ ‘round with all that hate, let it go (Let it go)\nI cannot stay out the damn Gucci store (Yeah)\nI like to drink but I don’t do no dope (Yeah)\nMy body banging, he want all the smoke\nUgh, boo, bitch (Ooh)\nDon’t do me, do you bitch, huh (Do you)\nI’ll send a chick in the bank right now\nOpen up shit like she you bitch, huh\nI’m riding ‘round with my African, huh\nMy nigga stiff like a mannequin, ay\nOut in the U.K., they jamming me, yeah\nThese niggas love me like family, ay, uh\nI’m on they head like I jacked in they face (Yeah)\nAll these hoes look alike like they traced (Yeah)\nBitch I’m the pencil, the paper, the case\nHoe, it is nothing to get you erased\nI knock the breath out these bitches, they wheezy\nI fell in love with the cash, it complete me\nYo’ bitch is slutty, mcnutty, she easy\nGive up that cat to a nigga no reason\n\n[Chorus]\nI’m a raw ass bitch, ya feel me?\nAy, tss, I'm hot, ya feel me? (Ooh)\nWatch how you coming, ya feel me? (Huh)\nAin’t gotta touch you to feel me\nBitches ain’t hotter than me, ya feel me?\nI’m who they tryna be, ya feel me?\nYou know you got that from me, ya feel me?\nI make ‘em follow my lead, ya feel me? (Tss)", "[Verse 2]\nBye, nigga (Bye)\nHot girl pussy, too  fire nigga (Too fire)\nI run game like five niggas, huh\nMagazine mami, got style nigga, huh\nClick on a bitch like a camera, ugh\nReal big ol’ titties like Pamela, ugh\nBitch, I’m a pro, you a amateur, ugh\nHoe you a egg I’ma scramble you, ugh (Ugh, ugh, ugh, ugh)\nThese niggas fuck and go tattle tale\nThese niggas and bitches is parallel\nI’m tryna get M's and you takin’ L's\nBut I got some game for you that I can sell\nWake up and get you some money (Some money)\nHow you a hoe and you hungry? (How?)\nBitch you ain’t playa, you funny\nYou just a regular dummy\n\n[Chorus]\nI’m a raw ass bitch, ya feel me?\nAy, tss, I'm hot, ya feel me? (Ooh)\nWatch how you coming, ya feel me? (Huh)\nAin’t gotta touch you to feel me\nBitches ain’t hotter than me, ya feel me?\nI’m who they tryna be, ya feel me?\nYou know you got that from me, ya feel me?\nI make ‘em follow my lead, ya feel me?\n\n[Verse 3]\nHe fell in love with these verses\nI told him lick on this pussy in cursive\nIf she ain’t Thee Stallion, he finna curve her\nFuck with my mink on, he like it furry\nI got that lil mermaid, that fresh outta water\nBoy I’m the plug and the muhfuckin charger\nBitch I got the sauce, I ain’t talkin’ no tartare\nThese bitches study lil Megan, I taught 'em\nGiving you rap and I'm giving you sex\nI’m writing bars while he giving me neck (Yeah)\nHe puttin’ money on me like a bet\nBitch I’m one hunnid, so hoe, come correct, ay, yeah\n\n[Chorus]\nI’m a raw ass bitch, ya feel me?\nAy, tss, I'm hot, ya feel me? (Ooh)\nWatch how you coming, ya feel me? (Huh)\nAin’t gotta touch you to feel me\nAy, yeah (Ahh)", "[Intro]\n(MCV, bitch)\nAlright, alright, alright, alright, alright\nAlright, alright, alright, alright, alright\nAlright, alright, alright, alright, alright\nAlright, alright, alright, alright, alright\n\n[Chorus]\nPull up late just to ride that face\nHe wanna be down, he respect my chase\nThat's why I gotta keep a special place for you\n'Cause when I'm done in the booth, I'm comin' home to you\nYou can pull up in that ooh, make a nigga say aah\nPull up in that ooh, make a nigga say aah\nPull up in that ooh, make a nigga say aah\nPull up in that ooh, make a nigga say aah\n\n[Verse 1]\nLook, its five o'clock, just touched down in the city\nTell your people, hit my people if you're tryna link up with me\nNiggas like to play me soft because they think I'm acting pretty (What?)\nOne phone call and your whole block feel it (Baow, baow, baow)\nLong legs, big titties, I'm the hood Tyra Banks (I'm the hood Tyra Banks)\nHow bitches 'xpect to catch me when I pull up where you can't? (Uh-uh)\nThis some shit you can't pronounce but I know what you're tryna say (I know what you're tryna say)\nI'm finna switch this bitch to sport to come and put it in your face (Mwah)\nPull up in that ooh, make a nigga say aah\nAsk for my number, it's Chanel No. 9\nOnly time I'm a freak is if I really got the time\nIf the nigga really mine, then he really won't mind if I...", "[Chorus]\nPull up late just to ride that face (Pull up)\nHe wanna be down, he respect my chase (Pull up)\nThat's why I gotta keep a special place for you (Pull up)\n'Cause when I'm done in the booth, I'm comin' home to you\nYou can pull up in that ooh, make a nigga say aah (Aah)\nPull up in that ooh, make a nigga say aah (Aah)\nPull up in that ooh, make a nigga say aah (Ahhh)\nPull up in that ooh, make a nigga say aah\n\n[Verse 2]\nLook at it Daddy (Yeah), you know that I'm outta your league\nAll of the shit I got on me expensive, I look like a money machine\nHe say it look like I came from Belize and he wanna know it was weave\nIf you're not talkin' 'bout feedin' my pockets then you are not talkin' to me (Nope)\nI'm the H-town hottie, I know you heard about me\nBitch, I came in the game and I'm serving natural body\nI might pull up with a papi in a blacked out Maserati (Mwah)\nGo commando in a Lambo just in case he wanna slop me\nI get to buckin' on the Henny, he keep pullin' on this Remy\nThey can't see it when you lick it cause I got that limo tinted\nAnd I'm from the south side, so this real life pimpin' (Real life)\nBaby, play your part if you wanna ride with me (Mwah)\n\n[Chorus]\nPull up late just to ride that face (Pull up)\nHe wanna be down, he respect my chase (Pull up)\nThat's why I gotta keep a special place for you (Pull up)\n'Cause when I'm done in the booth, I'm comin' home to you\nYou can pull up in that ooh, make a nigga say aah (Aah)\nPull up in that ooh, make a nigga say aah (Aah)\nPull up in that ooh, make a nigga say aah (Ahhh)\nPull up in that ooh, make a nigga say aah\n\n[Verse 3]\nGame over, threw it over my shoulder (Yeah)\nPulled up actin' rowdy, hangin' out a Range Rover (Hangin' out a Range Rover)\nYou don't wanna go to war with a street soldier (Uh-uh)\nSpeedin' in the foreign, with that ho like a Toyota\nBitch, it's young Tina Snow, the young bachelorette\nI told him he can keep the roses, nigga, ice out my neck (Yeah)\nGot me some 'Retha on me now 'cause I'ma get my respect (Baow, baow)\nAnd if my bitch ain't work tonight then we gon' fuck up a check\nUh, take it off bitch, lean back, pop that pussy (Let's see it)\nPull them panties to the side 'cause you know them ballers lookin' (Know them ballers lookin')\nYou a money makin' pro, ain't no motherfuckin' rookie (Ain't no motherfuckin' rookie)\nIf a nigga want some nookie, let him know he gotta book it (Uh)\n\n[Outro]\nPull up late just to ride that face\nHe wanna be down, he respect my chase (Pull up)\nThat's why I gotta keep a special place for you (Pull up)\n'Cause when I'm done in the booth, I'm comin' home to you (Pull up)\nYou can pull up in that ooh, make a nigga say aah\nPull up in that ooh, make a nigga say aah (Aah)\nPull up in that ooh, make a nigga say aah (Ahhh)\nPull up in that ooh, make a nigga say aah\nBitch it's money-making Megan better known as Thee Stallion, ahh", "[Verse 1]\nAyy, yeah, make it hot (Woo)\nCome up in this bitch, make it rock (Rock)\nPut it in your face, make it pop (Ahh)\nAll these niggas know Megan need top (Mwah)\nThese bitches ain't really 'bout action (Uh-uh)\nA lot of these hoes just acting (Ew)\nI'll rough a bitch up, that's traction (Yeah)\nThen put her trash ass back in the trashcan\nAnd I'm a bad motherfucker with the backhand (Backhand)\nAnd if you come too close, I'ma crack in (What's up?)\nSee, I already peep where you lacking\nYou ain't even hear me when I came in the back end (Bitch)\nOh, there I go, Stallion ho, something like yo' daddy though\nSee me out in person now you know what niggas trippin' on\nI had to cut the steak, no red meat on my lobster plate\nI'on go back and forth, I'on play them games\nI let the bitch play herself, that's masturbate\nI'm new in the game, that's rookie (Yeah)\nAin't nobody had these cookies (Nah)\nIf you wanna meet a pimp then book me (Book me)\nI ain't met a bitch yet that shook me (Never)\nI'm a real big dog, you a copy cat (Rrr)\nYou a talent show ho, I'ma platinum plaque\nBitch, I'm real in the field, you a practice mat\nAnd I'm comin' for your neck, better watch your back\nHello? Who is this? (Who is this?)\nAnother corporation talking business (Who?)\nGot a fit, need to get me out to Italy\nAnother head doctor tryna come lick me (Ahh)\n\n[Chorus]\nWatch out (Watch out), back up (Back up)\nI'ma need a lil' room so I can act up (Act up)\nWatch out, get down bitch\nMegan is your master, now sit down bitch\n\n[Verse 2]\nI take meetings with designers\nI don't tongue wrestle with rhymers (Yeah)\nMy purse made out of piranhas (Yeah)\nMeaning my money private (Yeah)\nMeaning my name is heavy (Heavy)\nMeaning lil' bitch don't test me (Don't test me)\nMeaning no bitch gon' check me (Check me)\nMeaning, bitch, come correctly\nI wreck all hoes, no challenge (No challenge)\nStalli come through, do damage (Do damage)\nI handle these hoes, that's manage (Yeah)\nThese bitches ain't wrecking, lemme handle it", "[Refrain]\nAyy, ha, make it hot (Make it hot)\nCome up in this bitch, make it rock (Make it rock)\nPut it in your face, make it pop (Yeah) (Pop, pop, pop)\nThese niggas know Megan need top\n\n[Chorus]\nAyy, watch out (Watch out), back up (Back up)\nI'ma need a lil' room so I can act up (Act up)\nWatch out (Watch out), back up (Back up)\nThrow it in the air and watch it mack up (Watch it mack up)\nWatch out (Watch out), back up (Back up)\nOn the move, tryna run a damn sack up (Sack up)\nWatch out (watch out), back up (Back up)\nI'ma need a lil' room so I can act up\n\n[Verse 3]\nI'm realer than ever (Yeah)\nBitches ain't on my level (No)\nMoney like I embezzle\nI'm bassing without no treble\nMeaning bitches in trouble (Trouble)\nStunting without a double (Double)\nThese bitches built like McDoubles (Ew)\nI'm fancy like blouse with ruffles (Yeah)\nThese bitches is out of place (Place)\nMeaning they in my way (Watch out)\nMeaning they got to pay (Back)\nMeaning I'm going ape (Ayy)\n\n[Outro]\nGet down on them knees trick, you belong to me, bitch\nYou gon' bust these plays while I sip this Hennessy, bitch (While I sip this Hennessy, bitch)\nWatch out (Watch out), back up (Back up)\nIf you get too close, I'ma act up (Act up)\nWatch out (Watch out), back up (Back up)\nMake one wrong move, I'ma act up (Act up)\nGet down on them knees, bitch, now you work for me trick\nNeed a couple M's so I stay in double C's, bitch (Yeah)\nWatch out (Watch out), back up (Back up)\nHo get out of line, get clapped up (Get clapped up)\nWatch out (Watch out), back up (Back up)\nStalli in this bitch, finna act up (Ahh)", "[Chorus]\nOoh, I'm a hot girl but these niggas think I'm cool\nPartied all night then woke up and went to school\nA real bad bitch, I look good in a suit\nA lil' model booty but that motherfucker move\n\n[Verse 1]\nAin't a thing you can name that I want and ain't get (Not shit)\nGot some head from your nigga then I check that off the list (Lil' bitch)\nMake him feel like he my man when he know he just a trick (Ah-ah)\nHe be paying this tuition and I never let him hit (Ayy, yeah, yeah, yeah)\nI'm giving niggas the chills (Chills), sexy like Pamela Grier\nConceited, I stay in the mirror (Goddamn), I'm wiping hoes out like it's smears (Ah)\nI pull up with Kel in a Benz (Skrrt), your baby daddy get in (Mwah)\nHe wanna lick it again (Ah), he spoil me like I'm a lil' kid\nPanties and the fur, pull up with a chauffeur\nPeanut butter insides like I ride a dessert (Ride a dessert)\nI prefer head over sex, cash over checks\nIf a bitch get me wrong, got the autocorrect\nDon't slip but my flow wet, hit a boy vest\nIf he put me to bed, now he under arrest\nLock you down now that mouth mine, turn him to a mime\nHe ain't talked in a minute 'cause his tongue doin' time (Ah)\n\n[Verse 2]\nLooked at my phone and the money just text me (Ayy, woah)\nDinner with the plug, I ain't hungry, I'm finessing (Hungry, I'm finessing)\nBarely speaking English but I know he understand me (Know he understand me)\nHand over that money 'cause he know it make me happy (Yeah, yeah, yeah)\nI'm a dream girl but I don't do no singing (Uh-uh)\nHeard he got that work so I put him in a meeting (Ayy, what's up?)\nSay he only eat his girlfriends, tryna tease me (What?)\nBut i peeped him out so i know he finna drink me (Yeah)\n\n[Chorus]\nOoh, I'm a hot girl but these niggas think I'm cool\nPartied all night then woke up and went to school\nA real bad bitch, I look good in a suit\nA lil' model booty but that motherfucker move\n\n[Verse 3]\nI got more business in your mouth than a dentist\nI'm the baddest bitch walkin' 'round on campus\nSome tired niggas on my line, \"Let the call through\"\nGot a condo but like to kick it in my dorm room\nHair pulled back, no bra, in a blazer (Yeah)\nLet a nigga know a lil' money don't phase you (Yeah)\nIf you ain't talking numbers, I'ma holla at you later\n'Cause I'm into gettin' money, baby, I don't wanna lay up (Uh-uh)\n\n[Verse 4]\nBitch, you a L, I'm a win (Woah)\nHere, you can have back your man (Yeah)\nHe know Thee Stallion a ten (Ah), I get more neck than a chin\nYeah, I be actin' a ass (Yeah), I be hungover in class (Ugh)\nMy professor think I'm bad (What?), so he gon' give me a pass (Ooh)\nI heard you was a freak, I'm tryna see if that shit true\nYou heard I was a player, what that got to do wit' you?\nI'm tryna see what's up with that, baby, if it's cool (Let me know)\nStop actin' like a rookie, I know you know what to do\n\n[Chorus]\nOoh, I'm a hot girl but these niggas think I'm cool (Ayy)\nPartied all night then woke up and went to school\nA real bad bitch, I look good in a suit\nA lil' model booty but that motherfucker move", "[Intro: Megan Thee Stallion]\nYeah, yo' last girl was cool, but she ain't doing it like a stallion (She ain't doing it like a stallion)\nThem other girls look good, but can they work it like a stallion?\n\n[Verse 1: Megan Thee Stallion]\nBitch, it's money-making Megan better known as \"Thee Stallion\"\nHanging round your daddy neck just like a damn medallion\nBody so on point so I be dressin' like I'm swimming\nBitches get offended, can't handle all this pimpin'\nYoung Tina Snow, hard on a ho\nWe can get down with this money or get down on the floor (Ayy)\nHe thought I was singer, I told him I'ma swagger\nI ain't no R&B bitch, nigga, come and lick the rapper\n\n[Chorus: Angelo Dorsey & Megan Thee Stallion]\nBaby, I love the way you ride and push back on it\nIt lets me know you want it\nGirl, lets get into it, I'm horny so lets do it\nBaby, you a stallion, love the way you move it\nYeah, yo' last girl was cool, but she ain't doing it like a stallion\nShe ain't doing it like a stallion\nThem other girls look good, but can they work it like a stallion?\nCan they-can they work it like a stallion?\nWork it like a stallion, work it like a stallion\nShawty may look good but it don't mean shit if she can't\nWork it like a stallion, work it like a stallion\nI love it when she work it like a stallion\n\n[Verse 2: Megan Thee Stallion]\nIn heels, workin' the wheel, whippin' the foreign like a cutlass\nReal big titties, big butt, bitch, young and seductive\nPicture me drippin' in sweat, my body so hot and so wet\nYou runnin' yo hands thru my hair, I'm pokin' it out in the air\nAyy, I got all these niggas asking \"Who the fuck Thee Stallion is?\"\nSeen my instagram pics, now he tryna give me the dick\nSexy red lips, sexy outfit\nI'm giving it to him so hard\nI'm giving it to him so good, he lovin' this shit\n\n[Chorus: Angelo Dorsey & Megan Thee Stallion]\nBaby, I love the way you ride and push back on it\nIt lets me know you want it\nGirl, lets get into it, I'm horny so lets do it\nBaby, you a stallion, love the way you move it\nYeah, yo' last girl was cool, but she ain't doing it like a stallion\nShe ain't doing it like a stallion\nThem other girls look good, but can they work it like a stallion?\nCan they-can they work it like a stallion?\nWork it like a stallion, work it like a stallion\nShawty may look good but it don't mean shit if she can't\nWork it like a stallion, work it like a stallion\nI love it when she work it like a stallion\n\n[Verse 3: Megan Thee Stallion]\nHe say he ain't hittin' my line no mo' 'cause I'on never text back\nI told that nigga \"Shut up\" 'cause it's a hunnit times he done said that\nNigga acting like he gone but I bet you he back\nWho else be workin' it, workin' it, workin' it workin' it? Throwin' it back like that, aah\n\n[Chorus: Angelo Dorsey & Megan Thee Stallion]\nBaby, I love the way you ride and push back on it\nIt lets me know you want it\nGirl, lets get into it, I'm horny so lets do it\nBaby, you a stallion, love the way you move it\nYeah, yo' last girl was cool, but she ain't doing it like a stallion\nShe ain't doing it like a stallion\nThem other girls look good, but can they work it like a stallion?\nCan they-can they work it like a stallion?\nWork it like a stallion, work it like a stallion\nShawty may look good but it don't mean shit if she can't\nWork it like a stallion, work it like a stallion\nI love it when she work it like a stallion", "They done fucked up and let Houston, Texas get up in here\nThey sayin' I'm a freshman but I spit like I been here\nI had to wipe a couple of bitches out to make it clear\nBitch, I'm the teacher, not your mothafuckin' peer\nDon't compare me to no ho or try to tell me who I am\nIf you was so fuckin' smart, you'd be standin' where I stand\nSo I don't never give a fuck when they be talkin' 'bout the dumb shit\nEven in your best Nikes, bitch, you know I run shit\nGoin' show to show, niggas thought I was on tour\nMama really raised a hustler, ain't no option to be poor\nI got bitches linkin' up, make 'em all drive the boat\nSent that boy a tongue emoji, that mean let me drive the throat\nNiggas wanna knock my head off knowin' they can't handle Megan\nI am not one of these little bitty bitches that you play with\nI got stamina, legs for days, hella cash in the safe\nAnd still won't let you eat it if I put the pussy in your face, ah", "[Intro]\nHear me now, hear me now massive crew\nCall MCV to put the flame in your speakers\nYeah, man\nGeekin' for the week, you can call me Screech (Call me Screech)\nI can't hear my phone when I'm gone, ho quit callin' me (Callin' me)\nI don't ever trip, guess that make these niggas fall for me\nBitch, I mind my business, I ain't in it, ho don't come for me (Yeah, yeah)\n\n[Verse 1]\nI'm going hard all week, yeah, fucked up I can't see, damn\nDon't be scared for me, no, this shit what I need, ayy\nBig ole, big ole, big ole butt (Big, big butt)\nThis is sexy, sloppy drunk (Sloppy drunk)\nDowned a bottle in the club (Ayy, ayy), now I'm in here goin' nuts\nI don't get hungover (Over), drink Henn' like it's soda\nAnd my man move that, work that, knock the head right off your shoulder\nShake that ass on your friend, and let her friend join in (Come here)\nAnd if they really 'bout it, bring 'em both home to your man (Ah)\nDon't fuck with me if you're scary (Yeah) 'cause this shit get hectic\nTryna get my booty rubbed after the club, who gon' text me?\n\n[Chorus]\nGeekin' for the week (Geekin')\nGeekin' for the week (Geekin')\nGeekin', geekin', geekin' for the week\nGeekin' for the week, geekin' geekin'\n\n[Verse 2]\nMy best friend a stripper, big ole booty, walk, it jiggle\nAnd when we ride together, ho, you better grab your nigga (Get him)\nHer boyfriend a dealer (Yeah), he always on duty (Always on duty)\nWe geekin' in the traphouse, pourin' 40's on her booty\nHenny on them titties, and Patron on that pussy (Yeah)\nYou can stay your ass at home if you gon' party like a rookie\n\n[Chorus]\nBitch I'm geekin' for the week (Geekin')\nGeekin' for the week (Geekin')\nGeekin', geekin', geekin' for the week\nGeekin' for the week, geekin' geekin'", "[Verse 3]\nBuck on that dick like a bull (Like a bull)\nI'm goin' to work on your tool (Baow, baow)\nI hang round your neck like a bib (Like a bib)\nI'm catchin' all of your drool (Ah)\nMy sex appeal on a mil (On a mil)\nHe call me \"Megan the meal\" (Megan the meal)\nHe tellin' you what he won't (What?)\nBut he get with me and he will\nWindin', grindin' all on your lap\nWhen I look back, know I control that\nGoin' left to right, while he holdin' on that\nIf I move it slow, I bet he won't last\n\n[Chorus]\nGeekin' for the week (Geekin')\nGeekin' for the week (Geekin')\nGeekin', geekin', geekin' for the week\nGeekin' for the week, geekin' geekin'\n\n[Verse 4]\nOverdo it, watch a real bitch come kill shit\nRock lil' ass shirts 'cause my tits big (Yeah)\nTurn a grown ass man to a big kid\nPop that, pop that (Yeah)\nGive him eye contact when I look back\nMake his ass lock up like a contract\nTalk to him like Mike, nigga, who bad? (Who?)\nWork some (Work some), twerk some (Twerk some)\nSee you lookin' at me nigga, like you want some (Like you want some)\nGot the big boy bottle, let me pour some (Let me pour some)\nBad bitches, line up if you want some\n\n[Chorus]\nGeekin' for the week (Geekin')\nGeekin' for the week (Geekin')\nGeekin', geekin', geekin' for the week\nGeekin' for the week, geekin' geekin'\n\n[Verse 5]\nMe and my bitch ain't sweatin' no list\nCome through the back because they insist\nThat I, the hottest out now\nCome to the stash, turn it to my boudoir\nNiggas ooh-ah when they see me\nYoung Tina Snow, H-Town hottie (H-Town Hottie)\nLong ass legs like I'm Naomi\nHe reachin' for my pussy, tryna Donald Trump me\nI hang on your chin like a damn goatee (Like a damn goatee)\nI make him go to sleep like I'm Lei Ali (Like I'm Lei Ali)\nYour whole damn clique couldn't make one of me (No)\nAnd none of y'all hoes can't hang where I be, bitch\n\n[Chorus]\nGeekin' for the week (Geekin')\nGeekin' for the week (Geekin')\nGeekin', geekin', geekin' for the week\nGeekin' for the week, geekin' geekin'\n\n[Outro]\nGeekin' for the week, you can call me Screech (Call me Screech)\nI can't hear my phone when I'm gone, ho quit callin' me (Callin' me)\nI don't ever trip, guess that make these niggas fall for me\nBitch, I mind my business, I ain't in it, ho don't come for me\nYeah, yeah (Yeah, yeah)\nYeah, yeah (Yeah, yeah)\nYeah (Yeah)", "[Verse]\nFrom head-to-toe, I'm a bad motherfucker\nI'm 'bout that so watch what you sayin' motherfucker\nIf he wanna talk, do it dirty undercover\nI dress up like a cop but he know I'd never cuff him\nIn and in and out lemme rub it on your mouth\nPut my legs on your head, flip over and stretch it out\nThey like \"Megan, you so nasty\", girl, I could teach you\nI'm just writin' verses 'bout how your nigga should eat you\nBust it on the counter right after a shower\nMake him lick that pussy till it's runnin' like a fountain\nFlip it on a nigga, 69, break it even\nHe like that, moanin' in my ear, deep breathin'\nNo introduction needed, ask your nigga, bet he know\nAnd just like a punt, your daddy wanna kick it ho\nI need a 3 AM and he still goin' strong\nI can really do my thang if the dick real long\nHe want me to bounce that thang up and down real slow\nAnd we both kinda hood so we hit it on the floor\nI'ma make him keep bustin' till his shit get sore\nI'ma work that nigga till I can't no 'mo\nBar after bar, bitch, I'm still goin' strong\nAnd I hit ya right back like a ping and a pong\nI be pushin' hoes' buttons like a ding and a dong\nI'm the baddest redbone out my city, puttin' on (Ahh)", "Real ass, big titties\nPoppin like woah\nThe shit jiggle different when the shit homegrown\nWant a real bitch? need to come out to Texas\nMegan from Houston, I'm naturally sexy\nGive me three niggas thats accommodatin'\nDo what I say 'cause they all wanna date me\nOne is a foodie, he don't wanna do me\nHe just wanna open me up and filet me\nI told him \"eat that shit up with no manners\"\nHe think I'm all that just like I'm Amanda\nI want a nigga that eat it so good\nI'ma jump out my body like I'm Danny Phantom\nBitch I'm Magneto, I love gettin' brain\nAll my ex men go to war for this thang\nI'm on the come up\nYo' nigga done for\nBuss on his face and make you wipe the cum up, urgh\nFreakiest rap, I call that shit cum-rap\nBitch wanna go against me? Tell her, come rap\nI just be eatin' shit like I'm Mileena\nGet in the booth and I go Mortal Kombat\nI am not scared of not none of these bitches\nI just be mindin' my muhfuckin bidness\nIf you want beef with me, get in the booth\nBut if you run up, I'ma knock out yo' tooth\nAah", "[Verse]\nAyy\nBitches gon' be mad regardless, so I turn up even harder\nThey be quick to spread a rumor, I be flexin', spreadin' dollars\nThey gon' hate me if I'm rich, they gon' hate me if I'm broke\nThey gon' hate me when they nigga gargle my nut in his throat\nHe so nasty and I love it, bought me VVs and they bussin'\nI ain't never had to argue with a nigga 'bout no money\nI ain't trippin' with these niggas, get lost or get with it\nI ain't crying in your motherfucking Honda or your Bentley\nDon't be worried 'bout who I date, just know I been getting ate\nEvery time I throw that ass, watch them haters take the bait\nJust because I'm getting change, that don't mean I'm finna change\nStill a hood bitch, doing hood shit with the gang\nHe know that I'm a student, he trying to make me truant\nHe make it hard to get up out the bed when he chew it\nThese bitches want to be my partner cause they want the blueprint\nTalking down on me, I ain't worried 'bout what you did\nEverybody watching me, they treat me like the new kid\nBitch, ain't no escaping me, I'm still behind your eyelids\nThe way I beat the beat up, I ain't rapping, this is violence\nHoes want a pity party? I ain't got the violin\nBitch, I'm a rapper, you's a motherfucking actor\nAll you niggas need to pledge, cause you niggas really cappers\nBeat that hoe like rat-a-tat-ta", "Aye, look\nYou bitches actin'\nI’m sick of all this cappin'\nI'm the only bad bitch that’s out right now really rapping\nYou niggas soft, can't handle all this boss\nI ain't mad, nigga, I just got that pimpin' in my talk\nBitches runnin outta bars, tryna keep up with me\nIf I ain't playing with your pussy, why you coming for me?\nYou only doing all that shit because you want me to see\nYou can't stunt on bitches that you really tryin' to be\nLook, I'm getting money\nYou getting out of pocket\nTalking cash shit, probably ain’t even got no wallet\nNow hurry up and clock in, before I get to clocking\nYou up in your motherfucking head with this Prado\nReal freak bitch, bad attitude\nSnatch a rich nigga ice if he actin’ cool\nAnd I ain't showing no respect if I don’t fuck with you\nAnd I ain't showing no respect if I don't fuck with you", "[Intro: Ludacris & Shawna]\nYeah, yeah, yeah, yeah\nGive it to me now, give it to me now\nGive it to me now, give it to me now\nYeah, yeah, yeah, yeah\nGive it to me now, give it to me now\nGive it to me now\nI wanna, li-li-li-lick you from your head to your toes\nAnd I wanna, move from the bed down to the, down to the, to the floor\nThen I wanna ahh ahh, you make it so good I don't wanna leave\nBut I gotta kn-kn-kn-know, what-what's your fan-ta-ta-sy?\n\n[Verse 1: Megan Thee Stallion]\nDick a'ight but where is my head?\nYeah, nigga, yeah, you heard what I said (Heard what I said)\nTalk that shit but now you all scared\nOnly real niggas allowed in my bed (Yeah)\nWhack ass niggas be sending me dick pics\nLike I'ma text back and jump on that shit?\nIf it ain't about this fuckin' money, I ain't interested\nI get a lotta head like a hood (Like a hood)\nIn the burbs but I came from the hood (From the hood)\nReal thick 'cause I eat real good (Real good)\nBig lips like my name Megan Goode (Mwah)\nI do what the fuck I want to\nDo shit your bitch won't do (Ahh)\nShe talkin' shit about me 'cause she know I'm something she'll never be (Nope)\nEven on a bubble, couldn't level me (Nope)\nI keep messy hoes away from me\nI bet your boyfriend rubbin' off to me\nBecause I kn-kn-know his fantasy\nHe wanna lick-lick-lick all over me\nBut I'ma need a few shots of the Hennessy\nBust my nut then take my leave\nAnd he ain't even realise that I took the keys (Ahh)\nI kick that nigga to the curb (To the curb)\nIf he don't know better act like he heard (Like he heard)\nI'on fuck around with no goofy shit\nSniff a fake nigga out on some Scooby shit\nDon't ever try to play like you knew me bitch\nI hit a quick left then make it slip (Make it slip)\nThrow it in reverse then make it dip\nThen send it right back like a round trip", "[Chorus: Megan Thee Stallion]\nI pop that shit like a bubble (Like a bubble)\nLight on my feet, Barney Rubble (Barney Rubble)\nIf they let me in, that's some trouble (Yeah)\nI'ma work it hard like a double\nYeah, I smell good with the stank (With the stank)\nGet hard, move slow like a tank (Like a tank)\nH-town dance with the drank\nLil' bitch better know, don't thinkYeah, I'm a real H-town Hottie (Hottie)\nPretty face with a whole lotta body\nErr'body wanna know something bout me? (Yeah)\nSouth side came down on [?], yeah\n\n[Verse 2: Megan Thee Stallion]\nEenie meenie minie mo\nI let a nigga know, go if you wanna go (Bye)\nPick another nigga quick like I interfered\nAnd take his ass off the bench and put him in the field\nYeah, E-W-W (Eww)\nBitch, I never fucked with you\nPop out on a hoe like Pikachu\nThen throw it on a nigga like pinky do\nMake it sloppy like ahh, it's wet all over these carseats\nI own his heartbeat\nEven with a switch, couldn't off me\nLaid up with a boss B (Boss B)\nJack honey with a bad b\nYellow bone with a fatty\nMake her throw it back like a jersey\nBreak that Xan' up in the lean (In the lean)\nGettin' money with my whole team\nCut him off with the laser beam\nAnd put him in the dirt if he actin' green\n\n[Outro: Megan Thee Stallion]\nNow pop that shit like a bubble (Like a bubble)\nLight on my feet, Barney Rubble (Barney Rubble)\nIf they let me in, that's some trouble (That's some trouble)\nI'ma work it hard like a double\nYeah, I smell good with the stank (With the stank)\nGet hard, move slow like a tank (Like a tank)\nH-town dance with the drank\nLil' bitch better know, don't think\nYeah, I'm a real H-town Hottie (Yeah)\nPretty face with a whole lotta body (Yeah)\nErr'body wanna know something 'bout me? (Somethin' 'bout me)\nSouth side came down on [?]\n\n[Outro]\nYeah, I get a lotta head like a hood (Like a hood)\nIn the burbs but I came from the hood (From the hood)\nReal thick 'cause I eat real good (Real good)\nBig lips like my name Megan Goode (Mwah)", "[Intro: Jay Z]\nBig pimpin', we spendin’ cheese\nBig pimpin' on B.L.A.D.'s\nWe doin’ big pimpin' up in N.Y.C\nIt's just that Jigga Man, Pimp C, and B-U-N B\nYo, yo yo\nBig pimpin', spendin' cheese\nWe doin' big pimpin' on B.L.A.D.'s\nWe doin’ big pimpin’ up in N.Y.C\nIt's just that Jigga Man, Pimp C, and B-U-N B\n\n[Verse: Megan Thee Stallion]\nH.B.I.C, P.I.M.P, it’s the same thing\nI'm committed to this money, something like a wedding ring\nSuper pussy, make it bang, something like a .45\nShoutout to them bitches who be beefed out on the other side\nWhat's up to my daddy? Taught me hustlin' was the only way\nWhat’s up to them niggas? Woke up, Who chain they gon' take today?\nWhat's up to them bitches makin' money in the booty club?\nBring all of my niggas in, I bet they gon' show y'all love\nMoney makin' Megan\nMegan the assassin\nI rode any beat and crash it\nLike I'm drunk driving and spazzing\nShow me any bitch, I'll pass her\nTrain her like her master\nPut her on her knees\nPray to me like a pastor\nPussy tighter than a trapper\nWrap that dick up like a wrapper\nStand over his face then stroll on it like a capper\nTell your bitch I'm just your cousin if she get to buggin'\nRunning round the city , blowing money with your husband\nSmoking loud, pouring up\nTwo-piece and some Gucci pumps\nRiding round with a thug, watching money piling up\nErrybody want a piece, errybody wanna eat\nNiggas out here playing hard but don't got them dirty feet\nHanging at the south with the best sun\nStill get low with the worse some\nDon't come around me 'less you worth some\nIf the bitch wanna hang, tell her twerk some\nIf the bitch wanna jump, tell her do some\nIf the nigga want me, tell him eat some\nSay you gotta lotta money? Let me see some\nMe and you and the money, have a threesome\nPut you on some playa shit\nShake that ass like Diamond did\nBooty make him run and tell all his friends\nWet wet make him wanna have a lot of kids\nKick that nigga if he acting like a bitch though\nRide round getting money with a rich hoe\nBreaking these niggas, tryna see what he hit for\nIf you wanna play, have my nigga do a kick door\n\n[Outro: Pimp C & Bun B]\nSmokin' out, pourin' up\nKeepin' lean up in my cup\nAll my car got leather and wood\nIn my hood we call it \"buck\"\nEverybody wanna ball\nHolla at broads at the mall\nIf he up, watch him fall\nNigga, I can't fuck with y'all\nIf I wasn't rappin', baby\nI would still be ridin' Mercedes\nComin' down and sippin' daily\nNo record 'til whitey pay me\nUhhh, now what y'all know about them Texas boys?\nComin' down in candied toys, smokin'\nWe be big pimpin', spendin' cheese\nWe be big pimpin' on B.L.A.D.'s\nWe be big pimpin' down in P.A.T\nIt's just that Jigga Man, Pimp C, and B-U-N B\n'Cause we be big pimpin', spendin' cheese\nWe be big pimpin' on B.L.A.D.'s\nWe be big pimpin' down in P.A.T\nIt's just that Jigga Man, Pimp C, and B-U-N B", "[Verse]\nOkay\nBanana-nana-fo-fana\nMy pussy taste like a Fanta\nNiggas goin' bananas, they wanna eat me for dinner\nBitches really pretenders, don't wanna be my contender\n'Cause if we go bar for bar then I guarantee I'm the winner\nFree JT, y'all know real bitches fuck with me\nHoes talkin' down but them hoes won't give up on me\nI be in the hood, movin' through that bitch comfortably\nUnderground, but I bet your favourite rapper study me\nKriss-Krossin’, just touched down in Atlanta\nI'm looking for a baby, suck me like a Kool-Aid jammer\nI'm way too hot to handle, I'm the H-town Hottie\nHe come to all my shows just to watch me shake my body\nOkay, P.I.M.P, come get down with the team\nFucking broke niggas ain't gon' get you what you need\nWhy you give that pussy to that nigga for the free?\nIf you can't call him when you having a emergency, ahh", "[Intro]\nYeah\nLove me all day, tryna fuck me all night\nLove me all day, tryna fuck me all night\nYeah, yeah, look\n\n[Verse]\nWhack hoes take offence to my flow (Yeah)\nGet rid of the trial bitch and upgrade to pro (Ahh)\n‘Cause a real bitch know to keep her man home\nHe ain’t never complaining, suck his dick is all I’m sayin’ (Ahh)\nI ain’t never had a problem keeping niggas\nNow I’m done teaching niggas and I’m waiting on a winner\nHe could be a drug dealer or a boss in the city (In the city)\nWork a nigga out in the back of the coupe\nHe digging in my pussy like a ice cream scoop (Yeah)\nBut he know he can’t stay at the crib past two (Past two)\nKeep that shit player is the number one rule\nIf you blowin' up my phone, you’s a motherfuckin’ fool (What?)\nBut if by chance you blew my back out\nAnd hit the right spot, you know what I’m ‘bout\nI’m Megan, the dick stiffener (Stiffener)\nGet up in my pussy, five strokes, given up\nI want you on your knees, tongue out, give it up (Give it up)\nAnd then wear it out like you been locked up (Yeah)\nI get the nigga hard but he know he can’t touch\nAnd we ain’t even fuck and he ‘bout to bust a nut\nHe like it when I dance in my heels with the cuffs\nHe tell me ride slow ‘cause he tryna make love\nI go, on and on and on it\nNever let a broke ass nigga bone me (Uh-uh)\nLying on your dick wit’ your whack homies\nIs the same reason why you’re lonely\nI keep a lil' somethin' in the love run\nIn case a weak motherfucker wanna act hard\nI got big dogs in my backyard\nI bring ‘em out when it’s time to pull a nigga card out\nI appreciate when you stay up late (Yeah)\nJust so I can come and put this ass in your face (Ass in your face)\nMy idea of a bomb ass date is a dinner with a whole lotta money on my plate\nI need M’s on M’s (M's)\nNiggas on rims (Rims)\nMove a lotta weight, I don’t mean in the gym (Yeah)\nIf I tell him game over, he gon’ do a lil' flip (Lil' flip)\nHe a slim thug so I still let him tip (Still let him tip)\nShoot the P.O.V with my pussy on his lips (Mwah)\nThrow it back hard tell him hold on my hips\nCan you command pussy? Understand the pussy?\nTake it from behind and upper hand the pussy?\nIf I bring it down slow, can you land the pussy?\nNew thang in the game, call me Megan the rookie (Ahh)", "[Intro: Big Freedia]\nI wanna know who mothafuckin' representin' in here tonight\nHold on, hold on\n\n[Pre-Chorus: Lauryn Hill]\nI keep lettin' you back in (You back in)\nHow can I explain myself?\n\n[Chorus: Lauryn Hill, Drake, & Megan Thee Stallion]\nCare for me, care for me, you said you'd care for me\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me\n(Murda on the beat)\nGive to me, give to me, why won't you live for me?\n(And I'm gon' murder the beat)\nCare for me, care for me, I know you care for me\n(Yeah, aye, hot girl, hot girl)\nThere for me, there for me, said you'd be there for me (Yeah)\n(Aye, hot girl, hot girl, yeah, ahh)\nCry for me, cry for me, you said you'd die for me\nGive to me, give to me, why won't you live for me?\n\n[Verse: Megan Thee Stallion]\nPicture me rollin', cadillac coastin'\nI can finally get my momma all the money I owe her\nI been pumpin' myself up and now they watching me blow up\nUsed to have a bad temper now I'm trying to control it\nAye, send a text to my ex, told him I wish him the best\nAnd I really mean it\nAnd he ain't work for me but I know somebody gon' love him\nBut he gon' still give me hug when we see each other\nBecause I got that sticky-icky, like a sycamore\nI hop up out that benz, finna make him sicker more\nHe ain't gon' get no sleep at night like a party next door\nHe trying to think about me less and now he see me more\nI got that little shop of horrors, yeah that Seymour\nAnd he ain't get the vision then, now he see it more\nAnd any bitch after me is just a decoy\nYou know you don't want her, you need me, boy\nAnd I wrote this on my way to a dick appointment\nEx nigga keep calling, and I keep ignoring\nHow you mad at me? You the one who cheating on me\nAnd you don't need me, nigga, you need neosporin\nI break it down, break it down, like a old man\nGon' talk about me to his kids when he a old man\nLike \"She the one that got away\", like oh man\nAll on me now but he ain't want me back then\nI got that Mike Jones, 281-330-8004\nHe mad at me 'cause I like to play nice to some of these niggas\n'Cause that's how you get all the funds from these niggas\nYeah, ahh\nAye, aye, I said you gotta play nice to some of these niggas\n'Cause that's how you get all the funds from these niggas\nYeah, ahh\n\n[Outro: Megan Thee Stallion]\nHot girl, hot girl\nHot girl, hot girl\nYoung Tina Snow, coming soon\nYeah, ahh", "[Verse 1]\nI'ma kick off like this\nI ain't come for a hug, head straight for a kiss\nDon't come for my face cause I'm talking 'bout my (Yeah)\nI'ma need all o' my kisses down there\nOne hand on my neck, one pulling on my hair (Hol' up)\nI'ma tell you everything I want from you\nBut if it's real then you know what you 'posed to do\nBut it's cool cause I like to be the captain too\nI control that dick like a Bop-it\nFive minutes in and he beggin me to stop it, ooh\nAll that shit he was talking, cool\nHow many licks did it take? Two\nNow that's a bad bad muhfucka\nA real hot girl so these niggas can't touch her\nI put him in the cuffs when we playing undercover\nThen I shove him in the back of the car and I fuck him yeah\n\n[Chorus]\nI know you been feenin'\nI been looking for a reason\nHe say I be teasin'\nBoy, get ready for this treatment\n\n[Verse 2]\nBut first I gotta make him beg for it\nCause I treat these niggas like play toys\nI might grind on him like a skateboard\nThen make him bust hard like a AR\nI heard he had a BBC\nAnd if he half Puerto Rican tell him 'ven aqui'\nAnd if the head whack I'ma duck him like Ali\nBut if it's on point he ain't gotta look for me\n'Cause I'ma keep that, pop that, whip him 'round like a cowgirl but I really look tropic\nThen I'ma switch it to the hot seat on the edge of the bed up and down to the beat, hol up...\nUh, uh, uh, lemme tell ya\nHe call me movie star, he say I like to act\nHe call me Hollywood, 'cause I don't text back\nI got a big purse, for a big sack\nAnd I ain't fucking with no nigga who ain toppin that\nGirl, I got new money\nMight be your boo money\nI blow my money on this ice, bitch, that's cool money\nI got that ooh-na-na, and it make him so horny\nHe say he done with other bitches, they got nuttin on me\nI pick, the hip up and I get licked up\nHe suckin on my pussy like it was a sip cup\nHe hit it from the back like I had a hiccup\nAnd I wear a nigga out, he'oan wanna get up\nIf I had to pick a side, it'd be the south\nNiggas love when I stay \"Know what I'm talkin bout\"\nAll my H-Town girls know I'm talkin bout\nAnd if I fuck him on the purp, he gon' stalk me out\nA lotta these niggas try to talk me out\nBut if it ain't about shit, throw the deuce, I'm out\n'Cause I'm a real ass bitch, no lames allowed\nAnd I get the dick stiff like he standing trial\n\n[Chorus]\nI know you been feenin'\nI been looking for a reason\nI think I'm done teasin'\nNow I'm ready for my beatin'\n\n[Verse 4]\nBlow my cake out like a candle\nFlip then flop on the dick like a sandal\nPopped a wheelie with no handle\nTreat that dick like instrumentals\nHe gon' gimme hella facetime in between my waistline\nThicker than a drink, lime\nPretty and I'm hood fine\nSay what yo name is\nEverybody know who the Stallion is\nBig lips, real titties\nBig juicy booty and a waist itty-bitty\nI'm the real H-Town hottie\nEverything tight but he gotta do it sloppy\nAll of them hoes look floppy\nEverybody know I'm the hottest shit poppin, ahh", "[Verse 1]\nAyy, ayy, ayy, bad bitch in the keepsake\nTrapping like I'm J-Zay\nYe fuck with Trump so I didn't buy the Yeezys\nThink I seen Obama hooping in DC in these days\nRapping loops around your favorite rapper like a freeway\nHear a story 'bout me, then they spin it like a DJ\nPlaying telephone with that \"He say\" and that \"She say\"\nWhy in the hell are they fucking with the Huxtables?\nNiggas turn 99, now they wanna say somethin'?\nJust another hero turned to a zero\nThat is why they need to put more women in these lead roles\nLet my niggas eat though, let the streets eat though\nFiends walking round like it's Resident Evil\nReal bitch, pre-opp, pictures with the peace sign\nLow rise jeans, belly chain like it's '05\nBachelorette, getting that bachelor's degree\nI ain't gonna be on my ass if a nigga leave me\nI be tryna make A's while my niggas movin' P's\nHe know I'ma have his back 'cause that's how it's 'ppose to be\nWhen your niggas ain't got you, momma didn't watch you\nMove with your granny but your granny couldn't stop you\nMaking all that money, now these bitches wanna top you\nGo to sleep, then they pick your pocket, Peter Piper, huh\n\n[Interlude]\nAyy, hold up, ayy\n(Hoodrich)\n\n[Verse 2]\nToo hood for the 'burbs, too 'burbs for the hood\nBut I know anywhere I go, I'ma be good\nBig bank like I'm Hillary\nPrissy bitch, but I still visit penitentiaries\n'Cause I got some niggas that'll take care of my enemies\nDon't play me like I'm pussy\nI'll mace you in this Gucci, yeah, I'm snooty but I'll lose it\nThey say \"Megan too raw and Megan too nasty\"\n'Cause I make him eat it on my couch like he castin'\nWalk in, make the dick salute like a captain\nWalk in, in the—aah!", "[Chorus: Kehlani & Megan Thee Stallion]\nA player, I know that\nAnd I still want that\nTold you I own that\nFuck whoever was before that\nA player, I know that\nAnd I still want that\nTold you I own that (Stalli)\nFuck whoever was before that (Ay, yuh)", "[Intro]\nI'm that (Yeah)\nBeen that, still that (Ah)\nWill forever be that (Forever be that)\nYeah (Ayy, ah)\n\n[Verse 1]\nI'm the hood Mona Lisa, break a— into pieces\nHad to X some cheesy— out my circle like a pizza (Yeah)\nI'm way too exclusive, I don't shop on Insta' boutiques\nAll them lil' clothes only fit fake booties\nBad bad, still talking cash\nLike water, I'm unbothered and relaxing\nI would never trip on a— if I had him\nThat's my trash, you the maid, so you bagged him, ah\n\n[Chorus]\nI'm a savage (Yeah)\nClassy, bougie, ratchet (Yeah)\nSassy, moody, nasty (Hey, hey, yeah)\nActing stupid, what's happening? (Woah, woah)\nBitch, what's happening? (Woah, woah)\nBitch, I'm a savage, yeah\nClassy, bougie, ratchet, yeah\nSassy, moody, nasty, huh\nActing stupid, what's happening?\nBitch, what's happening? (Ayy, ah)\n\n[Verse 2]\nEat me and record it, but your edge-up all I'm showing (Ah)\nI keep my— private, so his AP all I'm showing (Baow)\nBeefing with you really getting kinda boring\nIf it ain't about the money, then you know I'm gon' ignore it\nI'm the—, ooh (Ayy)\nI need a mop to clean the floor, it's too much drip, ooh (Too much drip, ooh)\nI keep a knot, I keep a watch, I keep a whip, ooh (I keep a whip, baow)\nLet's play a game, Simon says I'm still that, ayy\nI'm still that, yeah (Ah)\n\n[Chorus]\nI'm a savage\nClassy, bougie, ratchet (Yeah)\nSassy, moody, nasty (Yeah)\nActing stupid, what's happening? (What's up?)\nBitch, what's happening? (What's up?)\nBitch, I'm a savage, yeah\nClassy, bougie, ratchet, yeah (Bitch)\nSassy, moody, nasty, huh\nActing stupid, what's happening? (What's up?)\nBitch, what's happening?\n\n[Verse 3]\nI'm lit like a match, ooh\nAnd any I let hit is still attached, ooh\nThat body right, but you know this, know this fat, ooh\nI drop a picture, now these— feel attacked, ayy\nDon't let that— gas you up and get you whacked, ooh\nI make a call and get a— smacked, uh\nThese talkin' 'bout pulling up, well, where you at? Ooh\nI'm in a Lam', catch me if you can, ooh\nI'm kickin' out they spot, Stalli' Chan, yeah (Ah, yeah)\n\n[Outro]\nSay I taste like sugar, but ain't— sweet (Ah)\nMwah\nAyy, ayy, ooh, ooh, ooh, ooh, mwah", "[Intro]\nWhat makes you wanna lie to me?\n\n[Verse 1]\nI hop up on the beat with no topic\nOther bitches hop up on the beat and need to stop it\nI ain't out here rappin' bout the D'uss I be coppin\nFuck around be rappin' bout the places I be shopping\nAnd if I'm out here shopping, bitch, you know just who I'm with\nDon't act like you ain't know I was your daddy main chick (Ahh)\nDon't act like you ain't know exactly who he came with\nI ain't given him no pussy and he still paying rent (Ahh)\nA lot of hoes don't like me, yeah, I know\n'Cause I'm shaking like dice and I'm always on the roll\nI'm always on the move\nBitch, I'm always on the go\nAnd by the time you catch up, I'll be already gone\nThey be wishin' that I would but I won't\n'Cause I'm too fucking pretty and these lames can't get me (Nope)\nI'm pushing all these bitches when they get to actin' shitty\nAnd they sleep, but y'all better get some Faith like Biggie (like Biggie)\n\n[Chorus]\nYeah, it's been a cool lil week\nAnd tonight I'm looking for a cool lil freak\nHe hit me Monday, been tryna see me\nNow I finally got some time at the end of the week\nI'm getting money and he like that (Like that)\nAnd every time I poke it out he tryna bite that (Bite that)\nHe say I'm crazy but he like that (Like that)\nAnd every time he try to leave, I put that right back (Right back)\n\n[Verse 2]\nLook, pussy wrap a nigga up like a turban\nI throw it back and hit it hard like a suburban\nHe fell in this peanut butter then he started swerving (Yeah)\nIn and out this thang, now these lames I be curving (Yeah)\nDon't be showing me your money nigga (Uh-uh)\nIf you spending then spend it nigga (Spend it then nigga)\nA nigga with some money don't excite me (Nope)\nProlly why a lotta lame niggas don't like me (Ha)\nProlly why I end up with a ring, being wifey (Okay)\nProlly why he always in my face like we Skyping (Okay)\nProlly why his baby mama always tryna fight me (Damn)\nProlly why he calling me the sugar honey iced tea\nShit, I got a whole lotta confidence\nA ugly motherfucker might mistake me for a cocky bitch (What?)\nPussy watching me, ain't putting money in your pocket bitch\nI give it to you gangster but I'm really on some model shit\n\n[Chorus]\nLook, it's been a cool lil week\nAnd tonight I'm looking for a cool lil freak\nHe hit me Monday, been tryna see me\nNow I finally got some time at the end of the week\nI'm getting money and he like that (Like that)\nAnd every time I poke it out, he tryna bite that (Bite that)\nHe say I'm crazy but he like that (Like that)\nAnd every time he try to leave, I put that right back (Right back)\n\n[Outro]\nAnd every time he try to leave, I put that right back\nAnd every time he try to leave, I put that right back", "[Chorus]\nIt don't take that much, just hit me when you home\nI'm leaving the club, you should see what I got on\nDon't take too long, I'll be waiting by the phone\nAnd I need you to come get me\nCan you come get me?\nCan you come get me?\nCan you come get me?\nCan you just come get me tonight?\n\n[Verse 1]\nI admit that's my ex\nGot some good sex\nCall him Dracula\nHe bend me over suck that pussy from the back, and I\nBe shivering, he delivering, all kinda long dick\nIt make me kinda homesick\n\"Megan where you been at? It's been a minute\nYou best not be lettin' these niggas get all up in it\"\nI laugh it off like I ain't hear him, mind ya bidness\nCause you stupid or something to think that I'on know you fuckin\nPull up, yeah, we both know the routine\nThe last time we talk we say some shit that we ain't mean\nIt's a shame your new girl stalkin' me\nThe bitch know your tongue crip walkin' me\nShit, how you gon' resist this?\nBoy, you know you miss this\nForever be your missus, even as a mistress\nYeah, I know you're missing how I tongue kiss\nGot your body covered in my lipstick\n\n[Chorus]\nIt don't take that much, just hit me when you home\nI'm leaving the club, you should see what I got on\nDon't take too long, I'll be waiting by the phone\nAnd I need you to come get me\nCan you come get me?\nCan you come get me?\nCan you come get me?\nCan you just come get me tonight?\n\n[Verse 2]\nI got that ooh-wee\nThrow it back at ya while you squeezin' on my booty\nThrow them legs up like the doors on the 'ghini\nBendin' in positions and I make this shit look easy\nWhich way you wanna do me?\nI need a romancer\nTell me have you ever made love to a dancer?\nI ain't talking strippers\nI'm talking bout ballet slippers\nUp-do's and jazz shoes\nI got all the right moves\nTo make a nigga tan-do\nMaybe it's the dip in my hips when I switch\nOr the way I lick my lips that keep a young nigga stiff\nSo who's it gonna be? Her or me?\nReal bitches do real things so these double d's is really me\nBoy, I know you feeling me, I know where you wanna be\nBut if you choose to lose, just know you ain't offending me\nShit, why you fuckin' with a five?\nNigga, when you're lookin' at a dime\n\n[Chorus]\nIt don't take that much, just hit me when you home\nI'm leaving the club, you should see what I got on\nDon't take too long, I'll be waiting by the phone\nAnd I need you to come get me\nCan you come get me?\nCan you come get me?\nCan you come get me?\nCan you just come get me tonight?", "[Verse 1]\nOkay, my momma not at home, so we gon' do this right\nYou ain’t gotta rush 'cause we ain't running outta time\nYou been eyeing me at school, talkin’ dirty on my line\nAnd it started off \"I like it from behind\"\nShit, I ain't playing games witchu\nI know what you came to do\nI'm just tryna take my time and get a lil comfortable\nI'm just tryna kiss yo' neck, you just wanna see me sweat\nI need you to make it drip before I push your face in it\n\n[Chorus]\nShit, you ain't heard of that\nClimb on top, I'm looking back\nLeg up, I'm working that\nHe hitting hard, I’m hitting back\nBoy, you better not spit me out\nKeep my name all in your mouth\nLet these hoes know where you go when you dip at night\nShit, I’m just tryna make it feel good for ya\nMake you understand these other bitches ain't no good for ya\n(Shit, I’m just tryna make it feel good for ya\nMake you understand these other bitches ain't no good for ya)\n\n[Bridge]\nShit, shawty got me gone\nErrytime she leave I be blowing up her phone\nShe ain't gotta [?] she can get it when she want\nMan it turn me on, errytime I hear your moans\nAnd I can get her how I wanna, make her do it real nasty\nI get her how I wanna, make her do it real nasty\nShe got that good shit, I couldn't let her pass me\nI get her how I wanna, make her do it real nasty\n\n[Verse 2]\nIf not me, then who? Who gon’ love you like I do?\nWho gon' whip yo' dick out while you drive and suck you like I do?\nBitch, it's me, act like you know\nSame bitch witchu when work slow\nI'm the same bitch that was fuckin' witchu when your boys turned hoe\nAnd there is no competition, he know what he be missing\nThese bitches is some fishes so they better get to swimmin'\nHe say \"Loving you is wrong\" when y'all know this nigga sinning\nNiggas think they on my team when these niggas really pending\n\n[Chorus]\nShit, you ain't heard of that\nClimb on top, I'm looking back\nLeg up, I'm working that\nHe hitting hard, I'm hitting back\nBoy, you better not spit me out\nKeep my name all in your mouth\nLet these hoes know where you go when you dip at night\nShit, I'm just tryna make it feel good for ya\nMake you understand these other bitches ain't no good for ya\n(Shit, I'm just tryna make it feel good for ya\nMake you understand these other bitches ain't no good for ya)\n\n[Outro]\nShit, shawty got me gone\nErrytime she leave I be blowing up her phone\nShe ain't gotta be [?] she can get it when she want\nMan it turn me on, errytime I hear your moans\nAnd I can get her how I wanna, make her do it real nasty\nI get her how I wanna, make her do it real nasty\nShe got that good shit, I couldn't let her pass me\nI get her how I wanna, make her do it real nasty\nGet her, get her how I wanna, make her do it real nasty\nGet her, get her how I wanna, make her do it real nasty", "[Intro]\nHair done? Yeah\nNails done? Yeah\nBody right? Yeah\nMoney right?\n\n[Verse 1]\nFuck is my-fuck is my mirror?\nI need to check myself\nTell that bitch \"Slow down\" 'fore she wreck herself\nMy lipstick so fly, I wanna kiss myself\nYou don’t like me bitch? Go kill yourself, hoe\nFuck is you looking at, hoe?\nFuck is you staring at, hoe?\nFuck is you wearing that fo'?\nI ain't never ran from a bitch\nBut I run up on the beat real slow\n\n[Chorus]\nHair done? Yeah\nNails done? Yeah\nBody right? Yeah\nMoney right? Yeah\nH-town? Yeah\nSouth side? Yeah\nHold it down? Yeah\nFuck is you-fuck is you-fuck is you looking at, hoe? (Hoe, hoe)\n\n[Verse 2]\nHe say he wanna party at my kickback\nI’ma turn around and give him something he can Snapchat\nLiking all my pictures 'cause he wanna double tap that\nGirlfriend calling, asking where her man at\nHoe, you know I got your nigga with me, hoe\nYou know I got him gone off the dope\nMoving real slow, you ain't gotta worry where he at\nHe with me, and he ain't never coming home (Ahh)\n\n[Chorus]\nHair done? Yeah\nNails done? Yeah\nBody right? Yeah\nMoney right? Yeah\nH-town? Yeah\nSouth side? Yeah\nHold it down? Yeah\nFuck is you-fuck is you-fuck is you looking at, hoe? (Hoe, hoe)\n\n[Verse 3]\nCreep in, don't let me catch you hoes sleeping\nOn any day of the week or on the weekend\nYou can find me deep in, these streets\n'Cause I'm eating, like a shark, I'll just snatch you in the deep end\nGimme dat, I want that number one spot\nHatin’ ass hoes always talkin’ 'bout what I’m not\nBut I don't give a fuck, cause the grind don't stop\nI was waiting for these hoes at the door like knock knock\n\n[Chorus]\nHair done? Yeah\nNails done? Yeah\nBody right? Yeah\nMoney right? Yeah\nH-town? Yeah\nSouth side? Yeah\nHold it down? Yeah\nFuck is you-fuck is you-fuck is you looking at, hoe? (Hoe, hoe)\n\n[Verse 4]\nBig-big-big-big booty\nThrow it back on him, make him lose it\nBuss it, buss it back like an uzi\nIce cream on his face like Gucci\nOw, my bitch look cute like oww\nMy bitch got a whole lot of style\nMy bitch get wild\nMy bitch love Henny like me\nShe ain't scared, she know how to get down\nBig-big-big booty\n\n[Chorus]\nHair done? Yeah\nNails done? Yeah\nBody right? Yeah\nMoney right? Yeah\nH-town? Yeah\nSouth side? Yeah\nHold it down? Yeah\nFuck is you-fuck is you-looking at, hoe? (Hoe, hoe)\n\n[Outro]\nYeah hoe, yeah hoe, yeah hoe, yeah hoe\nBig-big-big-big booty\nBig-big-big-big booty", "[Verse]\nNigga, yo money don't excite me, my wrist is just as icy\nThat’s why I got these CEO niggas beggin' to wife me\nI gotta type, I like a nigga with ice, I like a nigga with M’s\nI wanna nigga that’s fuckin' with me so I know these bitches ain’t fucking with him\nI want a man that’s under control, I want a nigga that act like a savage\nI need a nigga that’s rough in the bed, when I throw it back, I know he can handle it\nSlipping off my panties (Huh), make me call you daddy (Huh)\nEat me to some gangster music 'cause that shit romantic (Huh)\nLet’s play cat and mouse, come over and let’s play house\nMatter fact, let’s play anything that put my pussy in your mouth\nI’m the face sitter, the money getter\nBefore I let you hit this pussy, bet you fall in love with my charisma\nHold up bitch 'cause I don’t know what he be telling you\nBut it seems you knew about me before I knew about you\nYou get hurt by the lies but you in love with the truth\nWe can get into this gangster shit or we can keep it cute\nI am not in competition with none of you rapper bitches\nYou wouldn’t be better than me if genies granted yo' wishes\nProlly wouldn’t had your nigga if I wouldn't have never dissed him\nHow do it feel to taste my pussy every time you kiss him?", "[Verse]\nAll these rap bitches love to talk hot shit\nRap about guns to impress these niggas\nPut my peace on a beat then arrest these niggas\nPut my pen to the paper then I check these niggas (Check these niggas)\nThrow the heels on and seduce that boy\nI’on think he knew he could make that noise\nTell your bitch calm down, don’t go so hard\nSpit my verse how I sip my oil\nReal slow (Yeah), so smooth (Yeah)\nThey put the mic in my hand 'cause they know what I'ma do\nSkip to the end 'cause they already knew\nWhen I came in the game you was already through (Already through)\nI’m the real H-Town Hottie\nAll these other bitches moving way too sloppy\nNever gettin' better, you’ll forever be a copy\nI like to get nasty then I like to rap about it (Ahh)\nI love gettin' money so I had to trap about it\nThen I got up in the booth and ain’t a fucking doubt about it\nI’m the coldest rap bitch out the H, really poppin'\nAnd I’m from the south side so I better rock a body\nRunnin' circles 'round a bitch like a motherfuckin Audi\nAnd he licked me in the middle so I let him call me Lolly (Lolly)\nA lot of these hoes got me yawning (Yawning)\nShe don’t like me 'cause I prolly\nMade a fan out her baby daddy\nWhen he hit you from the back\nHe be thinkin' 'bout the Stalli— (Thinkin' 'bout the Stalli) —ion\nMake him eat it in till it’s glistening\nLike my rock or the cock when I get on top\nHe being good like a nigga tryna get off lock\nWe bleedin' blocks for my niggas, ain’t working the clock\nHe think he cool, give a fuck if he speakin' or not\nI rub my pussy on your mouth and tie your tongue in a knot\nNiggas better say my name like Beyoncé\nBitches can’t keep up like I’m Usain\nYou was number one fan, he my groupie\nGot the nigga goin' crazy like he Lupe\nI put my booty on his face, he a headass\nHe said he finna kill my pussy, he was deadass\nAnd when he hit it with Thee Stallion, nigga fell fast\nHe tried to lock it but I got it out of jail free\nAnd he gon' do what I say like he Jeffrey (Jeffrey)\nI got dumb ass like my name Hillary (Hillary)\nAnd niggas can’t touch this but they feelin' me (Feelin' me)\nAnd when these bitches gon' learn? Ain’t no killing me\nI bring it back, back, back like a trilogy (Trilogy)\nI love Pimp C 'cause I got trill in me (Trill in me)\nI turn my phone off when I’m on that Hennessy\nI’ll fuck around and see a nigga I'on wanna see\nBig ole' ass, love to watch me sit (Watch me sit)\nLook back at him while I bounce on the dick (Bounce on the dick)\nHands on my waist, tell me \"Take that shit\"\nI’on got a problem taking you from your bitch (You from your bitch)\nKnow her ass don’t clap like this\nI bet her pussy don’t grip like mine\nShe a cute girl but she ain’t this fine\nI’on jaw jack, don’t waste my time", "[Intro: Too $hort & Megan Thee Stallion]\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nYeah, yeah\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nHold up, hold up\n\n[Verse 1]\nBad motherfucker and I know that\nPurse come first, fuck a nigga, where the dough at?\nNigga barely know me, baby, I'ma make him more mad\nDown south hottie with a whole lotta body\nI could probably make him spend a couple racks if I shake it right\nAin’t no maybe bout this money, I be making right\nHe say I'm dead wrong but he like to keep me right\nPut that bitch up on my team if her mind right\n\n[Pre-Chorus: Megan Thee Stallion]\nI make her take it off then bring that cash back to me\nBreak 'em off then run that bag back to me\nBeen a bad bitch from the H to the D\nHit that nigga in his pockets, easy like a damn freak\n\n[Chorus: Too $hort]\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\n\n[Verse 2: Megan Thee Stallion]\nThat’s how you gon' get popped\nTryna get that cheaper price\nBring my niggas out erry night, case this shit ain't moving right\nCase these niggas wanna act up, case these hoes wanna act tough\nCase you acting big mad because my bitches stuck up\nAnd I'm leaning harder than a D'uss and a quarter\nGot your momma trippin' cause I turned out her daughter\nTwenty five bitches taking twenty five orders\nTwenty five bands in my bag by the morning\n\n[Pre-Chorus: Megan Thee Stallion]\nTake it off then bring that cash back to me (Back to me)\nBreak 'em off then run that bag back to me (Back to me)\nBeen a bad bitch from the H to the D\nHit that nigga in his pockets, easy like a damn freak\n\n[Outro: Too $hort]\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nGet it girl, like the way you bounce\nYou must have learned that deep down way in the south\nGet it, get it, girl, like the way you bounce\nYou must have learned that deep down way in the south\nWay in the south", "[Intro: Megan Thee Stallion]\nTryna keep my pockets swole, I don't answer to nobody\nIf it ain’t about the money then it ain't about nuttin\n\n[Verse 1: Megan Thee Stallion]\nSomebody call a Uber and get this bitch away from me\nDirty ratchet bitch wanna fight but I'm too Maybelline\nGet this bitch a hug or some drugs or some tissue please\nI don’t know what her issue is, I don't know where her nigga been\nI ain't no [?] bitch but my outfit be talking shit (Bitch)\nRunning through the mall with your daddy, he bought all this shit\nI gotta keep breaking hoes out (Break em out)\n'Cause my name stay in these hoes mouth (Yeah)\nI can bet on they ass like the south\nLiving like a vacay, taking off\nAy, lighting up my phone, he like \"Megan, what you on?\"\nI'm like \"Chillin, getting money, sipping Henny in this thong\"\nHe say \"Girl, I'm finna come see\"\nI said \"Nah, nigga, stay where you be\"\nI don't need your bitch trippin' on me\nMr crab ass hoe, salty (Ahh)\n\n[Chorus: Wiz Khalifa & Megan Thee Stallion]\nI’m tryna find a way that I can spend all of this paper (Make this paper nigga)\nI’m riding round, I'm chiefing loud\nI’m tryna keep my pockets on swole (Tryna keep my pockets swole)\nI do just what I want, don't see myself answering to no one (I don't answer to nobody)\nAin't bout the money, then I’m not involved (If it ain't about the money then it ain't about nuttin)\n\n[Verse 2: Megan Thee Stallion]\nWhat the fuck I did? What the fuck I do?\nSad ass hoe, still mad, what's new?\nCame in this bitch with the too live crew\nAnd a two-piece looking like new-new\nEverythang on fleek, yo' old bitch so weak\nYo' best friend my freak and yo nigga take me to eat\nPop that, pop that, pop that, pop that, pop that shit, don't stop\nAh, wop, wop, wop, wop, wop, booty on jiggle when I walk\nAy, she damn near wrecked my car\nTryna drive all on this bar (Damn)\nBitch I am a star, I live next door to Mars (Ay)\nI ain't with the drama, I ain't with the drama (I ain't really with it nigga)\nDon't be blowing up my phone, call your baby mama (Call your baby mama nigga)\nIf you hit me more than twice it must be 'bout some money (Motherfuckin' money)\nAy, I'm just being real, I ain't actin' funny (Ay)\n\n[Chorus: Wiz Khalifa & Megan Thee Stallion]\nI'm tryna find a way that I can spend all of this paper (Make this paper nigga)\nI'm riding round, I'm chiefing loud\nI'm tryna keep my pockets on swole (Tryna keep my pockets swole)\nI do just what I want, don't see myself answering to no one (I don't answer to nobody)\nAin't bout the money, then I'm not involved (If it ain't about the money then it ain't about nuttin)", "[Intro]\nAw! Getcha money, man\nAin't shit out here for free my nig-\nBetter go out and get it, come back with it\nStraight like that\n\n[Verse]\nButt naked in the house blowing O's with my nigga\nSippin' on the Henn, getting throwed with my nigga\nWearing all this ice getting cold with my nigga\nI've been hustling all day, puttin' on for my nigga\nSo, don't you wanna come and fuck with a real bitch?\nYou could be my nigga, we could kick it on some chill shit\nDrop them other hoes, I bet they switch up on you real quick\nDip up on you real quick, if the money don't flip\nAll you gotta do is put it on me when I ask you to\nAnd better not tell me no unless you ready for my attitude\nI hop up on big daddy, then I start doing gymnastics\nTurn around and slow it down, and tell him he can have this\nNeck like a yo-yo\nCatch a bitch talking to my nigga, I go loco\nHis ex bitch mad 'cause I look good in every photo\nIf the bitch get the trip and bring it straight to her front door\nWipe her up like Fabuloso\nBitch you out here playing\nSee come get up on this money team\nYou broke 'cause you acting great\nYou out here sucking dick for free\nYou can't be in your feelings when you out here getting this money\nEverybody treat you different when your pockets looking funny\nSo, don't you wanna risk that ass in this glass house\nBitches throwing stones, they ain't knowin' what this cash 'bout\nI ain't ever slippin', I ain't ever broke, I ain't assed out\nIf I ever need it, I run straight to my stash house\nI pull up wit' yo daddy, looking like a baddie\nBad bitches in the backseat, rolling faggots\nI pull up wit' yo Pusha and I push up with my foot up\nEverybody fucking with me 'cause they know I got the hookah", "[Intro]\nGirl, look at this shit\nThis girl really think her nigga faithful, haha\nLook at this shit he just sent me, look\nBitch, that's our nigga\n\n[Verse]\nLook, oh that's your boyfriend? (Shit)\nWell he my head appointment (Okay)\nI treat that face just like a horse and throw a saddle on it\nSuper shiny pussy, look like it got diamonds on it (Yeah)\nHe spell his name in cursive letters like he signing on it\nWaist on nothing but that booty on a hunnid\nHe got Mickey D, I love it when he keep throwin' them hundreds\nWalk in with my ass out, sugar daddy passed out\nKissed him on the cheek in the mall then he cashed out (Mwah)\nI ain't got the time to ask these bitches what they mad 'bout\nProlly 'cause I'm shittin' on them while they got they hands out\nBitch, it ain't my fault yo' daddy nutted and you came out\nReally I'm just tryna get some brain like a ring\nGo head, forehead, edge up between my legs (Yeah)\n'Cause that's all I'm tryna see when I'm laying in the bed\nHe fell in love with my vernacular, I kiss that dick like Dracula\nHis last girl was cool but she ain't doin' it like Thee Stallion\nBitch, I know you can't stand it (Stand it), how I just command it\nWanna take my style but you just can't grab it\nBitch, you can't keep up with me (Nope)\nBitch, you know you can't compete\nBitch, you know you better not ever bring yo' nigga round to jeet\nBitch, I'm getting tutor, getting head up in a Uber\nRide his face just like a scooter, whatever I say he do it (Ahh)\nBitch, I'm gettin' tutor, getting head up in a Uber\nRide his face just like a scooter, whatever I say he do it, yeah\n\n[Outro]\nYeah\nYoung Tina Snow bitch\nKeep ya nigga on a leash, ahh", "Unreleased", "Ayy\nI wish a nigga with no paper would try to check me\nBig bank take lil bank, nigga, bank me\nI ain't never gave a fuck about what a bitch said\nPull that wig up off her head, like a perforated edge\nHoes know my repertoire, looking like my replicas\nRappers underneath me because of where I set the bar\nAin't up in my caliber, excuse me while I calibrate and take a couple of shot at the birds I'm about to bait\nBusy and I'm booked uh, bars got 'em hooked uh\nMake him give me head 'til his neck get a crook\nNo panties on a date uh, put it in his face uh\nCause I ain't wanna hear the nigga talking anyway aye\nPussy so bomb, slam it down like Batista\nI can make a nigga hit a note like Aretha\nImagine going down looking up at these D cups\nHave a nigga looking for his soul like a ouija\nBout it, bout it, I'm booted\nWe 69, going stupid\nHe say that his dying wish is to suffocate in that booty\nPut my hand on that neck and I tell him to hold his breath\n'Cause where I'm about to take you it's 'bout to get very wet, ahh\n\n[Outro]\nHot girl, hot girl\nReal hot girl shit, bitch", "[Hook]\nI wanna fuck lowkey, yeah, aye\nI wanna fuck lowkey, yeah (mwah)\nI wanna fuck lowkey, yeah, aye\nOoh\n\n[Verse 1]\nShe don't like me, but she know her nigga do, ooh\nBitch I'm stamped, I ain't got nothing to prove, ooh\nHe's a liar, but he know Megan the truth, ooh\nWet box, so you know I got the juice, ooh\n\n[Refrain]\nHe gone eat it off strip\nI ain't no ho, I pimp\nI don't like niggas that tell\nThis ain't 22 tales\nJust like water I drip, I talk what I live\nI ain't have to ask, he gone eat it off strip (aye)\n\n[Verse 2]\nAin't no detective, but you know I got the clues, ooh\nWhen I'm fresh, all these niggas wanna chew, ooh\nI'm so fly I had to go and buy a coupe, ooh\nShe don't like me and the feeling mutual, ooh\n\n[Refrain]\nHe gone eat it off strip\nI ain't no ho, I pimp\nI don't like niggas that tell\nThis ain't 22 tales\nJust like water I drip, I talk what I live\nI ain't have to ask, he gone eat it off strip (aye)\n\n[Hook]\nI wanna fuck lowkey, yeah, aye\nI wanna fuck lowkey, yeah (mwah)\nI wanna fuck lowkey, yeah, aye\nI wanna fuck lowkey\n\n[Verse 3]\nSneaking off to our favourite spot\nTreat you like a king like you in Camelot\nKeep coming back because you came a lot\nThis ain't no freestyle, but he come off top\nLike a rollercoaster, imma make it drop\nI'm a rap bitch, but imma make it pop\nImma down bitch, but I'm tip-top\nGot sandals on but I don't flip-flop (aye)\nLook, aye, I wanna fuck low-key\nDon't tell nobody it's me\nImma give you what you need\nThen you can't fuck up my cheetah\nBitches be worried bout tea, I just be worried bout M's\nWalk in and I get the fee\n\n[Hook]:\nI wanna fuck lowkey, yeah, aye\nI wanna fuck lowkey, yeah (mwah)\nI wanna fuck lowkey, yeah, aye\nI wanna fuck lowkey\n\n[Outro]:\nI wanna fuck low-key\nKeep it between you and me\nHe told me keep it a spare-are\nI told em' give me some drinks\nI wanna fuck low-key\nKeep it between you and me\nHe told me keep it a spare-are\nI told em' give me some drinks\n\nI wanna fuck low-key\nI told em' give me some drinks", "[Chorus: Halsey]\nI feel you, I feel you, everything's so hard\nBut I'm right by your side, always\nEvery night, there's fire\nBut I'm right here with you\n\n[Verse 1: Megan Thee Stallion]\nUh, fuck with your bitch, fuck with your nigga\nI taste like suga\nYou're a bad bitch I can't take you too long\nI can't believe you're acting like an asshole\nI'm that bitch, been that bitch, still that bitch, will forever be that bitch, uh\nMegan is the superstar, I can do anything\nI'm better than all of those stupid girls out there\nSavages and bitches hanging around\n\n[Chorus: Halsey]\nI feel you, I feel you, everything's so hard\nBut I'm right by your side, always\nEvery night, there's fire\nBut I'm right here with you\n\n[Verse 2: Megan Thee Stallion]\nI'm acting stupid like a bitch should\nParty with a nigga, so high and shit\nThe clock strikes midnight we drink beer and much more alco-shit\nBeer, wine, champagne, and shit all over this party, yeah!\n\n[Chorus: Halsey]\nI feel you, I feel you, everything's so hard\nBut I'm right by your side, always\nEvery night, there's fire\nBut I'm right here with you\n\n[Outro: Halsey]\nI feel you, I feel you, I feel you, but I'll make sure we're fine", "Lyrics already made", "-TBC-", "[Intro]\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth\n\n[Verse 1]\nI hit your phone but you ain't hit me back (Back)\nI hit my other nigga and he hit me right back (Right back)\nSend a pic from the back 'cause that's my good side\nNow he say he coming over so don't be surprised when I dip off\nLet another nigga know my lips soft\nChuck a damn deuce then I lift off like a damn ship\nI don't trip over niggas, I'm a muhfuckin' pimp (I'm a muhfuckin' pimp)\nBut don't act like— (Like)\nLike you ain't really tryna keep me nigga (Keep me nigga)\nLike you ain't really tryna see me nigga\nLike it ain't a bunch of niggas tryna be my nigga (Shit)\nI'm a college girl and my booty big\nI'm from the South with no kids\nNow who the hell else you seein' yourself with? (Who?)\nNigga, you know you like this shit\n\n[Chorus]\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth\n\n[Verse 2]\nI got pearly whites in my grill (In my grill)\nI ain't got a lotta diamonds but I got this here (But I got this here)\nMan, I love me a nigga with a all gold grill\nPull up on me in the slab, puttin' flavor in my ear (Yeah)\nBut maybe that's just a Southside thing (Southside thing)\nLike a styrofoam cup or a pinky ring\nBumpin' Pimp C, blowin' weed, switchin' lanes\nMan, them Northside niggas love my Southside slang (Southside slang)\nI pull up then I hop out (Hop out), just so I could I show out\nWith my skin lookin' like Hennessy (Hennessy)\nI'm with my cousins who ain't kin to me\nI tell a bitch nigga, \"Get back\nHold up, be cool, don't run up on me like I know you\"\nTalk to me quick, don't talk to me slick\nTo them hoes in my business, don't worry 'bout me, bitch\n\n[Chorus]\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth\n\n[Verse 3]\nWhat's up in my cup? Got me fucked up, comin' home on a Sunday\nRemember Hollywood, used to have me in the hood\nGoin' out there to screwed up records and tapes (Records and tapes)\nIt ain't hot if it ain't chopped (Ain't chopped)\nAnd the shit ain't cool if the shit ain't screwed\nAnd the shit gon' flop if it can't make the trunk pop\nOr the doors knock like the cops at the trap spot (Trap spot)\nI'm in love with a dope boy (With a dope boy)\nSting you with that burner and that bitch ain't gon' make no noise (No noise)\nSouthside broads actin' bad on they ass (On they ass)\n\"How Megan always show up and show out?\"\nI smile like I got a bunch of diamonds in my mouth\nReal niggas ain't dead, they just live in the south\n\n[Chorus]\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth\nFrom the South, I got the diamonds in my mouth\nFrom the—, from the South, I got the diamonds in my mouth", "Aye, ain’t none of these niggas really playa no mo’\nI guess a bitch like me gotta get up, show 'em how it go\nI never kiss and tell, I abide by the code\nIt really ain’t confusing, I fuck with you or I don’t\n\nBitch I’m 24 and single, ain’t no ring on my finger\nAnd if that nigga looking good, you know I’m tryna mingle\nI heard he got good mouth, and you know I’m trying to feed him\nI got these bitches shaking like I’m out here throwing singles\n\nIt took no effort, I woke up special\nEverybody know Megan that bitch\nThese niggas on Nintendo playin 'them games, but still these niggas gon’ switch\nYou never gotta worry about me trying come back\nBoy I never double dip\nThese niggas on the internet worried about pussy they know never gon’ get\n\nRealizing I ain’t regular\nHomie turned to competitors\nEverytime Megan bust a move, bitches gon’ put they cameras up\nI go, but I be actin up\nPay me my vernacular\nBitches be talking shit\nBut they doin it from the back of us, ahh", "{Snippet 1}\nBought a yacht so I could make em drive the boat in Miami\nLong legs, thick and fine\nFrom the front or from behind\nYou can see it, ever side\nDrop the top, I wanna ride\nBend it over, buss it wide\nI get money, don't get tired\nDon't be playing, on my time\nKnow them girls, Make it pop\nHe want a down south girl\nPlay the booth\nPimpin on a nigga\nMoney on a dresser\nBitch I'm hot, i'll never sweat you\nDown south girl\n\n{Snippet 2}\nKeep em coming home every day(uh huh)\nDown South Girl\nBout to put it on em in a different way\nI know what ya like yea", "[Verse: Megan Thee Stallion]\nAy, ay, look\nYou bitches acting\nI'm sick of all this capping, I'm the only bad bitch that's out right now really rapping\nYou niggas soft, can't handle all this boss\nI ain't mad nigga I just got that pimping in my talk\nBitches running outta bars tryna keep up with me\nIf I ain't playing wit' yo' pussy why you coming for me?\nYou only doing all this shit because you want me to see\nYou can't stunt on bitches that you really trying to be\nLook, I'm getting money, you getting outta pocket\nTalking cash shit probably ain't even got no wallet\nNow hurry up and clock in before I get to clocking\nYou up in yo' motherfucking head wit' this Prada\nReal freak bitch, bad attitude\nSnatch a rich nigga ice if he acting cool\nAnd I ain't showing no respect if I don't fuck wit' you\nAnd I ain't showing no respect if I don't fuck wit' you\nAah", "[Verse]\nFinna get into some gangsta shit, real quick\n'Cause when I chill that's when bitches seem to trip, okay\nI said, finna get into some gangsta shit, real quick\n'Cause when I chill that's when bitches seem to trip\nStyrofoam cup and it's full of that aw\nSwingin' and swervin' down the boulevard\nAin't I the baddest redbone you ever saw?\nMy milkshake bring all the niggas to the yard\nMy whole clique bad make your niggas drop they jaws\nIf a nigga wanna play I'll pull his player card\nMy body super soft, but my mentality hard\nI shuffle niggas, cut 'em up, and deal 'em like they cards, okay\nI'm in this bitch with my eyes closed\nHands in thе air, and I'm movin' slo-mo\nI'm eating good so I really can't do no complaining\nI'm poppin' bands off of all this money I been makin', okay\nOkay, H-Town madе her, H-Town raised her\nI'm so proud to be a H-Town native\nDraped up and dripped out, niggas in the parking lot\nBooty so big that he ran to make the booty stop\nThese niggas have no chill so I throw 'em in the freezer\nI'm a bitch, I must admit that I am not a people pleaser\nI don't kiss no ass, you don't gotta ask\nI guess I'm lookin' too good that's why these bitches mad\nI'm talking cash shit, that's what I gotta do\nCause it's just something bout shittin' on hoes that downed you\nThey downed you, they clowned you, on the come up now they wanna be 'round you?\nHold up, they got me fucked up, okay\nBitch I'm cuttin' deep like a knife up in a steak\nGive me a break, this niggas cake and I just cook 'em easy bake\nAnd when I dip he be like \"wait\", and I'm like \"nah, nigga, I'm late\" and I'm really not fuckin' with all this time you trying to take\nHe said I do it so good that he had to lick the plate\nHe said \"I wanna slip n' slide\", so I put pussy on his face\nAnd I know the nigga miss me, I know he's gonna kiss me\n'Cause ain't too many hoes out here just really fuckin' with me\nWho gon' love you like I do?\nWho gon' fuck you like I do?\nWho gon' whip yo dick out while drive and suck you like I do?\nBitch it's me, act like you know\nSame bitch with you when work slow\nI'm still the same bitch that was fuckin' with you when your boys turned hoe\nAnd there is no competition, he know what he been missin'\nThese bitches is some fishes so they better get to swimmin'\nHe say \"loving you is wrong\" when y'all know this nigga sinnin'\nNiggas think they on my team when these niggas really pendin'\nAnd I'm chillin' how I'm chillin'\nHoes sick, penicillin\nAll you bitches calm down\nAin't no hook, I'm just ventin' bitch", "Yeah\nSex-sex-sex-sexy\nAin’t met a bitch that sex like me\nLookin’ like at how I rock these C’s\nFresher than a bitch, boy you can’t tell me\nShit, my outfit nasty\nJewelry on me, nasty\nTake a pic, flash\nI got all these haters mad\n\nHe wanna fuck with a hottie, huh\nHe wanna touch on my body, hey\nHe say he like how I rap, huh\nCuz I be makin it naughty, yeah\nPussy get wet like it’s gnarly, huh\nHe want a body, be sharkin, aye\nSlow it down all the way\nYou know you want you Houston bae, yeah\n\nLiking my pictures, I’m sexy as shit\nWondering if I can do that on a dick\nHe on that nae nae, he like how I whip\nPut on that rubbing and get in his grip\nLay on yo back, let it drip on yo lip\nPOV baby, I’m shooting the vidz\nHe wanna know me while it goin’ in\nGettin’ some head to some ol’ Lil’ Kim\n\nI want that neck like I’m holding your spine\nI got that SZA, he yours and he mine\nI got that mouth on loop like a vine\nThat mean he lick on this cat all the time\nI got to come back, I got to rewind\nI just might just have go back and show 'em\n\nRemind bitches that I am the one, not the two\nIf you offended, I’m talking to you\nNo panties on, like I’m Winnie the Pooh\nCatch me outside on the route with your boo\nDropping the top, and I’m throwin' the deuce\nMegan is hot, and these bitches is poo\nBitches is duckin me like I’m a goose\nPull out that Betty then boop boop boop boop", "[Megan Thee Stallion]\nWhat does it mean to be a woman of color?\nShe's gotta be strong, because that's just the expectation\nLoving herself, but not too much\nBecause then, she's conceited\nBeing his lady in the streets, but his freak in the sheets\nInheriting her grandma's love, but always loving the wrong one\nTwerking for her man, but not with her friends?\nBeing constantly told she's \"too much,\" or, \"not enough\"\n\n[Malcolm X]\nThe most disrespected person is the Black Woman\n\n[Megan Thee Stallion]\nConstantly having to prove she's a victim because society sides with a man\nNot being able to express her traumas because she can't show no weakness\nIs constantly told that she's too dark, too thin, too thick\nToo much of a bitch\nBeing murdered, beaten, abused\nThen questioned if she evoked all of it\nIs left out on the street to become the flower that grows from the concrete\n\n[Malcolm X]\nWho taught you to hate yourself, from the top of your head, to the soles of your feet?\n\n[Megan Thee Stallion]\nShe marches for everyone else\nRiots for everyone else\nDies for everyone else\nShe loves everyone else\nLives for everyone else\nBut when it comes down to her, it ain't a mothafucka in sight\n\nThe system as a whole has failed her\n\nIf you've never been shot, you don't know her pain\n\nSay her name\n\nEighteen women of color murdered", "[Intro: Asian Doll]\nAyy, uh-huh\nIce poppin'\nI got different type of niggas\nAyy\n\n[Verse 1: Asian Doll]\nWatch that while drip, I'ma stash him like a tub (Ayy)\nI got different kind of niggas that loyal and want a thug (Thug)\nHe get high off my vibe, for that bitch, he kinda bug (ug)\nStreet nigga, D nigga, up in Houston, he the plug (Ayy)\nBust that ass and shake it (Uh-huh)\nEat this pussy up on the sofa (Sofa)\nHe say, \"You don't even listen,\" 'cause the money got my focus\nBitch, I'm badder with no makeup, when I rock it, I'm a token\nFendi, Prada, Gucci logos and Dior (Uh-huh)\nThis pussy golden (Golden)\nWho textin' me, who checkin' me? (What?)\nEat these beats like Pedigree (Mmm)\nEight-hundreds on me readily\nYeah, I gave him bed like charity\nMy bitches love tech (Uh-huh)\nYeah, I'm droppin' when it's bare of me (Bare, ayy, ayy, let's go)\nAyy, ayy, real bitches back in style on the front line (Line)\nHe eat it up, beat it up, like it's drum-line (Line)\nHe stealin' money, goin' shoppin', all that fun time (Time)\nThese niggas waitin' on this pussy like the lunch line (Line)\nAyy, pop that ass and move it (Uh), give me neck like I'm a choker\nMy new nigga caught a felon (What?), he can't even leave the notice (Notice)\nGive me money, fuck me good, he say I'm his lucky potion\nGrind strong, money long, my loyal pussy comin' home (Ayy, ayy)\nBust that ass and shake it (What?)\nEat this pussy up on the sofa (Sofa)\nHe say, \"You don't even listen,\" 'cause the money got my focus\nBitch, I'm badder with no makeup, when I rock it, I'm a token\nFendi, Prada, Gucci logos and Dior, this pussy golden\nPlay with my name, it's about to get violent (Violent)\nRan down a broke ho, now post up, I'm comin' (Comin')\nYou ain't spinnin' dividends\nPeace out, I'ma holla (Bitch, peace out)\nGot a nigga with a scholar, he gon' suck me like a—\nAmiris, he rockin' (Uh-huh), he icy and cocky (Cool)\nBig racks, he don't fuck with niggas 'til them get back (Get back)\nStreet nigga, whole way, six-pack\nLowkey fuckin' with that nigga, he don't chit-chat (Chit-chat)", "[Hook]\nRun and hit that pussy like a crash dummy (Run it)\nBend it over, touch ya toes( Real hot girl shit)\nShake that ass for me (Shake)\nBounce that ass on the flow, bring it back up (Back up)\n(And if the beat live, you know Lil Ju made it)\nHit a split on the dick\n\n[Chorus]\nShawty act up (Act up)\nNow bring it back, Bring it back\nBring it back, Bring it back\nBring it back, Bring it back\nBring it back, Bring it back\nYou can act [7x]\nBody crazy, curvy, wavy, big titties, lil' waist\nBody crazy, curvy, wavy, big titties, lil' waist\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody\n\n[Verse 1]\nLook at how I bodied that, ate it up and gave it back (Ugh)\nYeah, you look good, but they still wanna know where Megan at (Where Megan at?)\nSaucy like a barbecue but you won't get your baby back\nSee me in that dress and he feel like he almost tasted that (Ah, ah, ah)\nNum, num, num, num, eat it up, foreplay, okay, three, two, one\nYou know I'm the hottest, you ain't ever gotta heat me up\nI'm present when I'm absent, speakin' when I'm not there\nAll them bitches scary cats, I call 'em Carole Baskins, ah", "[Chorus]\nShawty act up (Act up)\nNow bring it back, Bring it back\nBring it back, Bring it back\nBring it back, Bring it back\nBring it back, Bring it back\nYou can act [7x]\nBody crazy, curvy, wavy, big titties, lil' waist\nBody crazy, curvy, wavy, big titties, lil' waist\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody\n\n[Verse 2]\nI'm a hot ebony, they gon' click it if it's me (If it's me)\nAll my pictures been gettin' these niggas through the quarantine (Yeah)\nBitch, I'm very well, on my shit as you could tell\nAny ho got beef from years ago is beefing by herself, ah, ah\nIf we took a trip on the real creep tip (Yeah)\nBitch, rule number one is don't repeat that shit (Don't repeat that shit)\nRule number two, if they all came with you\nThey better know exactly what the fuck they came to do (Yeah, yeah, yeah, woah, woah)\n\n[Chorus]\nShawty act up (Act up)\nNow bring it back, Now bring it back\nNow bring it back, Now bring it back\nNow bring it back, Now bring it back\nNow bring it back, Now bring it back\nYou can act [7x]\nBody crazy, curvy, wavy, big titties, lil' waist\nBody crazy, curvy, wavy, big titties, lil' waist\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody\n\n[Verse 3]\nThe category is body, look at the way it's sittin' (Yeah)\nThat ratio so out of control, that waist, that ass, them titties (That waist, that ass, them titties)\nIf I wasn't me and I would've seen myself, I would have bought me a drink (Hey)\nTook me home, did me long, ate it with the panties on (Ugh, ugh, ugh)\nI could build a house with all the brick I got (Yeah)\nBitches spend a lifetime tryna get this hot (Tryna get this hot)\nAnd if her head too big, I could make that pop\nI'm not the one to play with like a touch-me-not, ah\n\n[Hook]\nRun and hit that pussy like a crash dummy (Run it)\nBend it over, touch ya toes\nShake that ass for me (Shake)\nBounce that ass on the flow, bring it back up (Back up)\nHit a split on the dick\nShawty act up (Act up)\nNow bring it back, Bring it back\nBring it back, Bring it back\nBring it back, Bring it back\nBring it back, Bring it back\nYou can act [7x]\nBody crazy, curvy, wavy, big titties, lil' waist\nBody crazy, curvy, wavy, big titties, lil' waist\nBody-ody-ody-ody-ody-ody-ody-ody\nOdy-ody-ody-ody-ody-ody-ody\nBody crazy, curvy, wavy, big titties, lil' waist\nBody crazy, curvy, wavy, big titties, lil' waist\nBody crazy, curvy, wavy, big titties, lil' waist\nBody crazy, curvy, wavy, big titties, lil' waist"]}