{"artist": "Slick Rick", "encodings": ["[Produced by Slick Rick]\n\n(Now here's a little something that needs to be heard)\n\n[Intro]\nUncle Ricky, could you read us a bedtime story?\nPlease, huh, please?\nAll right, you kids get to bed, I'll get the storybook\nY'all tucked in? Yeah\nHere we go\n\n[Verse]\nOnce upon a time not long ago\nWhen people wore pajamas and lived life slow\nWhen laws were stern and justice stood\nAnd people were behavin' like they ought to: good\nThere lived a little boy who was misled\nBy another little boy and this is what he said:\n\"Me and you, tonight we're gonna make some cash\nRobbin' old folks and makin' the dash\"\nThey did the job, money came with ease\nBut one couldn't stop, it's like he had a disease\nHe robbed another and another and a sister and her brother\nTried to rob a man who was a D.T. undercover\nThe cop grabbed his arm, he started acting erratic\nHe said \"Keep still, boy, no need for static\"\nPunched him in his belly and he gave him a slap\nBut little did he know the little boy was strapped\nThe kid pulled out a gun, he said \"Why'd you hit me?\"\nThe barrel was set straight for the cop's kidney\nThe cop got scared, the kid, he starts to figure\n\"I'll do years if I pull this trigger\"\nSo he cold dashed and ran around the block\nCop radios in to another lady cop\nHe ran by a tree, there he saw this sister\nShot for the head, he shot back but he missed her\nLooked 'round good and from expectations\nSo he decided he'd head for the subway stations\nBut she was coming and he made a left\nHe was runnin' top speed 'til he was outta breath\nKnocked an old man down and swore he killed him\nThen he made his move to an abandoned building\nRan up the stairs up to the top floor\nOpened up the door there, guess who he saw? (who?)\nDave, the dope fiend shootin' dope\nWho don't know the meaning of water nor soap\nHe said \"I need bullets, hurry up, run!\"\nThe dope fiend brought back a spanking shotgun\nHe went outside but there was cops all over\nThen he dipped into a car ‒ a stolen Nova\nRaced up the block doing 83\nCrashed into a tree near university\nEscaped alive though the car was battered\nRat-a-tat-tatted and all the cops scattered\nRan out of bullets and he still had static\nGrabbed a pregnant lady and pulled out the automatic\nPointed at her head and he said the gun was full o' lead\nHe told the cops \"Back off or honey here's dead\"\nDeep in his heart he knew he was wrong\nSo he let the lady go and he starts to run on\nSirens sounded, he seemed astounded\nAnd before long the little boy got surrounded\nHe dropped his gun, so went the glory\nAnd this is the way I have to end this story\nHe was only seventeen, in a madman's dream\nThe cops shot the kid, I still hear him scream\nThis ain't funny so don't ya dare laugh\nJust another case about the wrong path\nStraight and narrow or yo' soul gets cast\nGood night\n\n[Outro]\n(Knock him out the box, Rick\nKnock him out, Rick)\n- Oh boy, that Uncle Ricky is really weird\n- I know right what does he mean\n“Straight and narrow or yo’ soul gets cast\"?\n- I don’t know, I think he be crackin' it up or something\n- Well, good night\n- Good night\n\nAnother (that's right!) Rick the Ruler presentation\nCrumbs!", "[Intro]\nCheck, check, check, check, check\n\n[Verse]\nWell, let us skip the boring foreplay, I'm slidin' right in\nThis girl over my house who had to be about 19\nAss, hoes in my poster\nShe's sweatin' although she tried to hold her composure\nI hoped she'd take it in the ass and suck dick\nMy, my, what a nice apartment you got, Rick\nOn her knees about to make her fall too\nAll platinum and gold jammies hangin' on the wall too\nYou got it goin' on\nNow my mouth start foamin'\nThe lights dim, we're kissin' and my hands start roamin' in her drawers\nStop\nKnew she was joking\n'Cause I ain't even fuck her and her pussy was soaking wet\nAlready had her tit out\nIf I play my cards right, fuck her, dig in the hole she shit out\nRick, I gotta go, my girl's waitin'\nShe recaps, finally when honey drawers down to her kneecaps\nBreathed heavy, all mushy\nBitch swore up and down I was gonna fuck her in the pussy\nSince friends waitin' on subtle\n'Bout time to make a move upon the hungry little butt hole\nMeanwhile, she acted quite passive\nLickin' the hun neck while lotionin' that ass with jelly\nTit hung out the frame, nigga loco\nSurprised honey didn't put up too much of a struggle, at first\nSinkin' in she ain't know how to be\nThe bitch went\nAhh, Rick, it hurts, take it out of me\nKnocked my magazine down, bitch threw my papers\nYou wanna keep it down? I mean, I do have neighbors\nSquirmin' away although the table was barrin' her\nFelt real good, my dick was sunk so far in her\nShe said it felt like a bulldozer boring her\nSquealing about she couldn't take it anymore in her\nMy cummed on her straight in the perm in her, (Here)\nAs I drained every last drop of sperm in her (Where?)\n\n[Chorus]\nSo, girls, when we kiss and we cuddle\nAin't no way to put it subtle when I want the butt hole\n\n[Verse 2]\nAnother girl I met, her experience vast\nBecause most girls with kids done been hit in they ass before\nPicked her up, sunset\nDon't be late for dinner, ma\nBringin' honey home from the date at the cinema\nThinking how to fuck the ass so plottin'\nBlown in the elevator, hit the stop button\nShe smiled, by knowing that her butt I wanna bore\nI said, \"Can I have a kiss now instead of in front of your front door?\"\nUhhmm, Oh yeah\nAlthough The Ruler tried not to push hard\nI'm all over the bitch like an octopus\nDeep down I know she also wanna fuck\nThough I kept my tongue in her mouth so not to put her on the spot\nTo have to talk no shit to prevent me from bonin'\nUnzap the bra, when the hooker start moanin'\nAnd expose my espresso, suck on her and lick on her\nUnbucklin' pullin' out mad long dick on her\nPanties in the way of that, but I want to check it out\nSlipped her wet drawers down her thigh and took her leg out\nHer butt was juicy, kinda fat\nSpun around, start to stick her in the pussy from the back\nShe came, mad juice dripped out\nStill in the pussy then acted like it slipped out\nCum on the floor, she said \"Pardon the puddle\"\nSpread open her cheeks, pushed hard in her butt hole\nUhhmm, wasn't a bad date at all, she went, \"Ahh, ahh\"\nStart pullin' at my balls while I'm still penetratin'\nFelt fantastic, she said\n\"Rick, I'm not really into this ass kick\"\nMeanwhile, Rick cummin' by the gallon\nPut your hands on the wall, please\nAnd try and keep your balance\nLickin' the grill in her, meanwhile fillin' her\n'Til sperm start pourin' out her butt hole while I'm still in her\nThen start rammin' the pine in her\nI almost picked her up with these final grinds in her\n\n[Chorus]\nSo, girls, when we kiss and we cuddle\nAin't no way to put it subtle when I want the butt hole\n\n[Outro]\nMy ass, more, more, more", "(Singing)\nDavy, Davy Crockett, King of the Wild Frontier, yeah\nDavy, Davy Crockett, King of the Wild Frontier\n\nWell he's in Indian Town and what spots his eye?\nA nice looking Indian and honey looked fly\nHe had to talk because he just couldn't hack it\nShe wore some moccasins and plus a tough leather jacket\nHe trotted over and invented a line\nHe said \"Excuse me, um, do you happen to have the time?\"\nAll was on his mind was sex, sex, sex\nSo she said, \"Why do ask? You got your own Timex\"\nTo poor old Dave that line was cold blooded\nIt seemed like her ego was way over flooded\nShe started to laugh and then she started to say\n\"I'm sorry some times I do get carried away\nI didn't mean to like ill treat you\nMy name is Running Rabbit and I'm glad to meet you\"\nHe said \"I'm Dave, with crazy clout\"\n\"Oh you're the one the girls keep talking about\nYeah, you must be, because you look like a winner\nCome to my house, we'll discuss it over dinner\"\n\n(Singing)\nDavy, Davy Crockett, King of the Wild Frontier\n\nWell, he met her father, Big Chief Beretti\nHe said \"What's for dinner?\" \"Soup and spaghetti\"\nThe dinner was rotten and he swore he's gonna puke it\nHe never would have took it if he'd known that he had cooked it\nLater on they was chilling in the bedroom\nSitting at the window looking at the Moon\nNothing was being said so he swore she was hot\nHe said \"Are you in the mood?\" She said \"No I'm not\"\nFrom what he believes and from what he gets\nWhen a girl says no, he really thinks she means yes\nSo, he started touching her and coming out strong\nWhispering sweet nothings and singing a song\nHe said: (singing) \"I'm in the mood for love\nSimply because you're near me\nFunny but when you're near me\nI'm in the mood, don't mean to be rude\nBut I'm in the mood for love\"\nAnd the she said \"Oh Dave, you've got my poor back hurting\nI want you, first close the curtain\"\nHe closed the curtain and also the doors\nThe next thing you knew it was off with those drawers\n\n\"Take it easy Davy, you're hurting me. Stop\"\n\nWell, he was playing with her tits, they were soft not lumpy\nAnd then he cracked the legs like Humpty-Dumpty\nHe's fucking, sucking, also finger popping\nHe had no intention of stopping\nCrazy fun, he did not want to leave\nHis head was between her tits and he could barely breathe\nHe had to toss, turn, turn, toss\nMeanwhile he was riding her with crazy force\nShe was burning hot, she said \"Stop, stop.\"\nHe said, \"Are you talking sex or what?\"\nI guess she didn't realize what she started\nNext thing you knew she was acting retarded\nShe said to him strangely and kind of merry\n\"Stop now, or I'll be unable to marry\"\nHe didn't take her warning\nHe rode her till the morning\nHe rode that ass till the pussy started yawning\n(Yawning sounds)\nHe said \"What? Wait\" His dick went weak\nIt said \"Dave, pussies ain't supposed to speak\"\nHe took all his clothes he wanted to leave this place\nBut first he wanted to see the vagina face to face\nHe opened it up, with his bare two thumbs\nHe seen crabs with spears and Indian drums!\n\nThey's going:\nHeya hiya heya hey, hey\nHeya hiya heya hey\nHeya hey, heya hey\nHeya hiya heya hey\nHeya hiya heya hey", "[Intro]\nGuess who's back\nGuess who's back\nGuess who's back\n\n[Chorus]\nHey young world... the world is yours\nHey young world... the world is yours\nYoung world young world... the world is yours\nYoung world\n\n[Verse 1]\nThis rap here... it may cause concern it's\nBroad and deep... why don't you listen and learn\nLove, peace, happiness... that once was strong\nBut due to society... even that's turned wrong\nTimes have changed... ay it's cool to look bummy\nAnd be a dumb dummy and disrespect your mummy\nHave you forgotten... who put you on this Earth?\nWho brought you up right... and who loved you since your birth?\nReward is a brainwashed kid going wild\nYoung little girls already have a child\nBad company... hey, now you've been framed\nYour parents are hurting... hurting and ashamed\nYou're ruining yourself... and your mommy can't cope\nHey, little kids don't follow these dopes\nHere's a rule for the non fool.. your life don't drool\nDon't be a fool like those that don't go to school\nGet ahead... and accomplish things\nYou'll see the wonder and the joy life brings\nDon't admire thieves 'cause... hey, they don't admire you\nTheir time's limited, hardrocks' too\nSo listen, be strong, scream whoopee-doo\nGo for yours, 'cause dreams come true\nAnd you'll make your mommy proud... so proud of you too\nAnd this is a message... that the Ruler Rick threw\nAnd it's true", "[Refrain]\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\nYou know, you know what, you know what?\nWe like to party (Hey young world, the world is yours)\n(Hey young world)\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\n\n\"Yo peep this\"\n\n[Verse 2]\nHey Mr. Bigshot... hey, don't you look fly?\nBut you don't have a dollar... ohhhh, my my my\nYou've been fightin again and, you forgot why\nHey kid, walk straight, master your high\nWhy? Because you make your family cry\nAnd all jokes aside, are you in good health?\nHey little boy... now have you really checked yourself?\nYou're a disgust, you know someone that I can't trust, you'd\nSteal mom's welfare... and you'd run and buy some dust, and\nPlus, I must say... big shot, you're not\nYour friends are talking and I'm hearing that your girls are what?\nYou didn't know? Go steal and rob\nAnd while you're at it... go get a suit for a job\nYou see you're actin like this urge is demanding\nC'mon, wake up... have some understanding\nSociety's a weak excuse for a man\nIt's time for the brothers... it's time trying to take the stand\nBelieve it or not, the Lord still shines on you, he\nGuides you... and he watched you as you grew, plus\nPast the age of... a little child, that's true\nBut folks your age don't act like you do, so\nSo be mature... and put the point to a halt\nAnd if you're over eighteen... I wish you'd act like an adult\nDon't live in a world... of hate, hate, hate\nPull yourself together... and get yourself straight\nMen don't steal... hey, most don't borrow\nAnd if you smoke crack... your kids'll smoke crack tomorrow\nSo be more mature... and kids do your chores\nMake your own money... hey, be proud that's yours\nYou know why, 'cause that's a man... that's brains, no spite\nStayin out of trouble... when it comes in sight\nAnd a man never loses a fight... in God's sight\n'Cause righteous laws are overdue\nAnd this is a message that the Ruler Rick threw\nAnd it's true\n\n[Refrain]\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\n(Hey young world, the world is yours)\n(Hey young world)\n\n[Outro]\n\"Yo peep this...\nMC... Ricky... D...\nThe Grand Grand Grand Wizzard...\nAnd his and his partner...\nAnd his and his and his\nAnd his and his and his partner...\nSay what?\nLa-Di! Da-Di! La-Di! Da-Di!\nLa-Di! Da-Di! La-Di! Da-Di!\nLa-Di! Da-Di! La-Di! Da-Di!\nLa-Di-Da-Di...\"", "[Intro: Ricky Walters & Slick Rick]\nLadies, and gentlemen... and lowlifes\nIt is with outstanding pleasure\nThat we are here to present tonight...\nSlick Rick, the Ruler! And MC Ricky D!!\nDoing their smash hit, \"Mona Lisa,\"\nYou know, like the picture?\nAnyway, I'd like to take this time out\nTo bow before his divine majesty\nOh your majesty...\nHmm\nCan I kiss your hand?\nMm-hmm\n*Kisses his hand loudly*\nEnough!\nCome your highness.. they await you..\n\n[Verse: Slick Rick]\nWell, it was one of those days -- not much to do\nI was chillin downtown, with my old school crew\nI went into a store -- to buy a slice of pizza\nAnd bumped into a girl, her name was Mona -- what?\nMona Lisa (what?) *singing* Mona Lisa, so men made you..\nYouknowhat I'm sayin? So I said, \"Excuse me, dear\nMy gosh, you look nice!\nPut away your money\nI'll buy that slice!\"\nShe said, \"Thanks - I'd rather a slice of you\nI'm just kidding, but that's awfully nice of you\"\nThe compliment showed she had a mind in her\nAnd when I smiled (PING!) I almost blinded her\nShe said, \"Great Scott! Are you a thief?\nSeems like you have a mouth full of gold teeth\"\nHa-ha, hah! Had to find that funny\nSo I said, \"No child, I work hard for the money\nAnd calling me a thief? Please! Don't even try it (Right!)\nSit down eat your slice of pizza, and be quiet\"\nShe almost got cut short -- you know, scissors\nShe tried to disrespect WHO?! The Grand Wizard\nMe! \"Well what's your name, son?\"\n\"MC Ricky D,\" but not to be so harsh I said to Mona Li-hee\n\"I'm.. sorry and I know that's low class (uhh, yeah)\nPlease sit, and tell me a little about your past\"\nShe said, \"Well I got courage, and I don't like porridge (uh-huh)\nI've never been to college, but I've got crazy knowledge (uh-huh)\nOver eighteen and my eyes are green (uh-huh)\nI wear more gold than that man on A-Team (uh-huh, uh-huh)\nTrim, slim, (yeah) and I'm also light skinned\nBest believe Mona's a virgin\"\nA virgin?! Honey needed a slap\nShe tried to tell me she's a virgin -- with her yay wide gap\nI said, \"It don't matter, see, I'm not picky (word)\nLet me spell my name out for you, it's Ricky:\nR - ravishing, I - impress\nC -- courageous or careless\nK -- for the Kangols which I've got\nThat I wear everyday and why? -- Why not?\nTo fight's not right that I recite and I'm..\nQuite polite like Walter Cronkite\"\nWell, just about then, Trevor my friend came in\nHe said, \"Hey Rick, don't you know playing with these snakes is a sin?!?\"\nHe grabbed me by my shirt and pulled me right out the store\nHe said, \"I don't want to see you playing with these lowlifes no more!\nNow come along, we have a party to attend\nWith some real mature women and some more of our friends\"\nHe hailed down a cab and he waited for a minute\nAnd as the cab came, he thrusted me in it!\nAnd as we were leaving and driving along\nI could hear a melody as Mona sang a song\n\nIf you see me walking down the street\nAnd I start to cry each time we meet\nWalk on by, walk on by, foolish pride\nThat's all that I have left, so, let me hide\nThe pain and the hurt that you gave me\nWhen you said goodbye\nYou walked on by", "[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand\n\n[Verse 1: Slick Rick]\nOutKast and Slick, the answer is in it\nHon you need to get your ass on the dancefloor this minute\nWe bruise stuff, knock you out shoes, socks\nShow your ass, move your fuck out, we're mad smoove snots\nLa-Di-Da-Di, mmmmm we like to party\nDon't make me get money and platinumize my body\nWith bright stuff, known to earn a dyke's love\nBlind folks be like, \"Somebody turn the lights off\"\nImmense rep, poppin out a muffin\nMake famous artists that's dead hop out a coffin\nAt the real estate, behavin type choosy\nWant a palace with the shit beige and light blue please\nGot the kid like \"watch your manners\"\nSince I came out of jail, it's like the planet gone bananas\nLack of strength a badder fella had\nLady lookin at me all stink, I had to tell her that\n\n[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand", "[Verse 2: Big Boi]\nUhh, I went from Player's Ball to bulldoggin\nFrom bulldoggin to bowhoggin\nNow bowhoggin and pimpwalkin\nThat strictly fresh and street talkin\nAnd we all last like that there\nRuin them all up like cat hair\nWe never fall off like hat wear\nWe some of the dopest MC's out there\nNow eat that, OutKast and Ricky D, bitch, can you beat that?\nRemember the time I laid them down to Teenage Love?\nNow see that\nJust to sport a rhyme and break in new patterns like hymens\nShuckin' and jivin' was never the style\nI'm gon' keep on being this lion\nSpittin' that king shit, you cling shit\nA tailor and a seamstress\nBlue gators for you haters and the penis for all you beatches\nLike an addiction 'cause I need it, hip-hop is that I fiend it\nLike a junkie, show me your monkey, 'cause I sho' nuff like to beat it\nMight just eat it just to skeet it\nFold you up like you was pleated\nLike some slacks and, relaxin', be strollin' like Sir-Captain\nSee, I got a, baby daughter, and I feed her with this rappin'\nNot trappin', d-boy, but rappin', huh, yeah, yeah\n\n[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand\n\n[Verse 3: Slick Rick]\nSeems everybody's open off the grammar\nThe white fox pink velvet suit, white cabana\nListen baby girl, genius Rick ta..\nDreamboat, bitch, you shoulda been clicked picture\n(Check her out) I don't know what you're tryin to figure out\nDown South, barbecue ribs fly out a nigga mouth\nAnd touchin' me The Chosen, for such a will opposin\nMe and Big Boi tryin to give our children clothing\nSmokin' love—do we provide dope enough?\nEven people unborn kid wide open off\nThe enginin' I'm sendin' in\nEven make construction workers start actin kind of feminine (Hi)\n10%'ll blast this hit from me and Big Boi\nWho represent the OutKast clique\nA jealous cat, lack of strength a badder fella had\nLady lookin at me all stink, had to tell her that\n\n[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand\n\n[Outro: Slick Rick]\nSlick Rick and OutKast is on this jam\nTryin to help raise all youth to man\nSo give the Ruler Rick his space to slam", "\"This type of shit, it happens every day\"\n\"This type of shit, it happens every day\"\n\"This type of shit, it happens every day\"\n\"This type of shit, it happens every day\"\n\"This type of shit, it happens every day\"\n\"This type of shit, it happens every day\"\n\"This type of shit, it happens every day\"\n\"This type of shit, it happens every day\"\n\n[Slick Rick]\nIn the slammer kid — but I'm innocent\nLord played witty wasn't having any pity—\nNow in Razor Blade City\nCries oppose the situation seen mad eyes of foes\nDrives a Rolls, \"Hey, yo, money, what size are those?\"\nNeed to phone, \"me too,\" another sprang up, hmm, to gang up\nOn this kid, housing the phone like he didn't know how to hang up\nWould be hard though, up to a minute or so and then yells time on a\nAnd when you get your commissary, buy this and that or else I'm gonna\nBe on that ass and won't stay off—extort, fig' [you safe?], way off\nBeaten to death — \"you ain't protecting me?\"\nForgot today's my day off\nHold my head and drift the Sumo weight in knots and cars\nInstead of sitting here accumulating cuts and scars, behind bars\n\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\n\n[Slick Rick]\nShowing off because on the phone, click, losing all the hoes off\nNiggas housed the watch and Donna took all of the clothes off\nNigga hell with drawers that's what my clothes figured telling\nEvery night it seem like mice be in and out a nigga cell and\nStill ain't home, like on the hook, seen a bunch of kids look\nMiss outdoors, never know what you have until it's took'en\nAnd in fact, the moment you fear, all of that, you quote snaps\nWell in a cell, did the exercises and wrote raps\n\"I'll be a bigger star than you\", though never heard of the nigga\nTakes my raps and read aloud, I wanted to murder the nigga\nJust kidding, no offend to it, finally he ended it\nCase dismissed, but your honor, D.A. kindly prevented it\nHe told to the judge, don't free him, this brother trigger wars\nAnd not just that because I refuse to wash some jive nigga drawers\nSo hold the head, drift the Sumo weight in knots and cars\nInstead of sitting here accumulating cuts and scars\n\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\n\n[Slick Rick]\n\"What fight? The nigga trip, C.O.\" the rest he might scared\nBut couldn't squeal. I's like, \"Officer that nigga right there\"\nNow if he ain't get me his friends will, needed a utensil\nIt turned out, I had to stab him in the eye with a pencil\nState of shock, he made a yell, I said, \"Now what you want traitor?\"\nC.O. puts me in the bin, I see ya about a month later\nBack in population, didn't matter that his friends tensed\nThe phone privs, the years added to the sentence\nStill chilling and all of that and I escaped when...\nI don't think so, don't hit the stove cause they made a rape attempt\nThank goodness, failed, call out next, he wail out\nHere go the C.O., \"Ricky Walters, pack up, you're bailed out\"\nThe C.O. couldn't see the rape, the kid'll snitch mass figure\nFast trigger, you'll be back, you little bitch ass nigga\nAu revoir, back to dating sluts and stars\nAt least for now, no more accumulating cuts and scars\n\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars\nBehind bars...", "[Intro]\nHere's an oldie but goodie\nHit it\n\n[Verse 1]\nExcuse me (what?) Can I have your attention? (mhm-hmm)\nThere's just a few things that I've got to mention (mhm-hmm)\nThere's girlies out here that seem appealing\nBut they all come in your life and cold hurt your feelings\nI'm telling you, as Rick is my name\nI wouldn't trust no girl unless she feels the same\n\n[Hook]\nTreat 'em like a prostitute (do what?)\nDon't treat no girlie well until you're sure of the scoop\n'Cause all they do is they hurt and trample\nListen up close, here comes my first example\n\n[Verse 1]\nNow ya been with your girlfriend for quite a while\nPlans for the future, she's having your child\nCelebrate with friends drinking cans and quarts\nTelling all your friends about your family thoughts\nOne friend was drunk so he starts to act wild\nHe tells the truth about the kid, \"It's not your child\"\nActing like a jerk and on his face was a smirk\nHe said, \"Your wife went berserk while you was hard at work\"\nAnd she led him on and tried to please him\nShe didn't waste time, she didn't try to tease him\n\n[Hook]\nTreat 'em like a prostitute (do what?)\nDon't treat no girlie well until you're sure of the scoop\n'Cause all they do is they hurt and trample\nListen up close, here comes my second example\n\n[Verse 2]\nNow your wife, you buy the tramp jewels and clothes\nYou get sentimental and bring home a rose\nGive her everything 'cause you swear she's worth it\nAll your friends tell you \"The bitch don't deserve it\"\nLove is blind, so there goes your wealth\nUntil one day, you see things for yourself\nCame home from work early Mr. Loverman\nYou had a card and some candy in your right hand\nThere's the mailman, he was short yet stout\nHe went inside your house and didn't come back out, bust it\nJust a friendly stop, come on, is it?\nThe mailman comes and he pays your wife a visit?\nThe thought alone makes your temperature boil\nYou say to yourself \"She might still be loyal\"\nYou open up your door and stand in a trance\nYou see the mailman's bag and the mailman's pants\nCame home to party, at work had a hard day\nLook around your house and you say \"Where the hell are they?\"\nRun upstairs up to your bedroom\nYou look inside your room, you see something brewin'\nCover your mouth because you almost choke\nYou see the mailman's dick way up your wife's throat\n\n[Hook]\nTreat 'em like a prostitute (mhm-hmm)\nDon't treat no girlie well until you're sure of the scoop\n'Cause all they do is they hurt and trample\nListen up close, here comes my last example\n\n[Verse 3]\nNow your girl, she don't like to have sex a lot\nAnd today she's ready and she's hot, hot, hot\nAs you open up the door she says \"Get on the floor\"\nShe wants to try things she's never tried before\nShe takes off your drawers and works you over\nShe calls you Twinkles and you call her Rover\nNext thing you know the ho starts to ill\nShe says \"I love you, Harold\" and your name is Will\nThat's not the half 'til you start to ride her\nTake off your rubber and there's one more inside her\nIt's not yours - who can it be?\nI think it was a slick rapper, his name is M.C. Ricky\n\nTreat 'em like a prostitute\nDon't treat no girlie well, treat no girlie well\nTreat no girlie well until you're sure of the scoop", "[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\n\n[Verse 1]\nHey sport, here's a thought from the old school crew\nA serious situation we all go through\nIt deals with your feelings, so hear what I say\nIt's like a day where nothing seems to go your way\nBust this, two people, they really like each other\nHe says there's no one else and she claims there is no other\nThe feelings are same, and you receive a notion\nTo reveal your inner thoughts and deeply hid emotions\n\n[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again", "[Verse 2]\nPrecious times, hoping they won't end\nTell your mother 'bout your lover, also your best friend\nYa mighty proud while you're holding her hand\nBoys, yo that's my woman, and girls, yeah that's my man\nThis person brings a certain warmth to ya heart\nAnd everything seems so great at the start\nFor she loves him, and he also loves her\nAnd it's hard to turn back to who the person you were\nBut later on, problems start to occur\nAnd the bond, which combines y'all turn into a blur\nFor the feelings were the same, now here's the score\nYou love 'em too much, and they don't love you anymore\nDue to your attitude, a number or because you're not being true\nOr maybe they're just plain sick of seeing you\nWord, now it might seem strange\nYou better take hints quick, and make the right change\n\n[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\n\n[Verse 3]\nSee just when you swore, the ball was rolling\nThey're gone, and part of your heart's been stolen\nGet back on your feet, with a hop and a skip\nBut no, you'd rather go with this dead relationship\nHanging around, and buying him stuff\nYou seem him every darn day, you don't see him enough\nYou follow them around, and they claim ya hawking\nWhen conversation comes, you do all the talking\nNot to mention, attention, we all need a bit\nBehind your back they're saying, yeah he's all on my...\nThey're getting sick of you, and quite annoyed\nAnd if you had plans for the future, they're now destroyed\nYou saw what was happening, and you still let it\nAnd if you ever let him make love to ya girl, you can forget it\nSweetheart, you been caught\nIt'll spread around town faster than ya thought\nAnd break up time, and you receive the words\nYo, this is from the heart, and I know the part hurts\nGet over it, from now don't take short slick\nIf it's not true love, you shouldn't deal with it\nJust think of your future, and what is to come\nAnd pay attention to the words that's in this song, they go\n\"Don't hurt me again\nDon't, don't, don't hurt me again\"\n\n[Bridge]\n\"Do you know where ya goin' to\nDo like the things that life is showin' you\nAnd are you going to\nDo you know?\"\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\n\n[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again", "\"Halt, who goes yonder?\"\n\"It is I, sire, Richard of Nottingham\"\n\"Well, speak up man, what is it?\"\n\"News from the east, sire, Rick the Ruler has returned!\"\n\nScratches: Stop Lyin'!\n\nGather 'round party goers as if your still livin'\nAnd get on down to the old Slick rhythm\nNow this one here is called the Ruler my dear\nIt's a mere party booster that will set things clear\nIt's a hundred percent proof from champions of truth\nAnd if you feel you need spirit I'll bring back your youth\nRelax your mind, and folks unwind\nAnd be kind to a rhythm that you hardly find\nAnd off we go, let the trumpets blow\nWell hold on, because the driver of the mission is a pro\nThe Ruler's back\n\nNow in these times, well, at least to me\nThere's a lot of people out here tryin' to sound like Ricky D\nNot tryin' to cause trouble cause it's really a small thing\nBut they're bitin' what I'm writin'\nGod it's great being the king\nSome sound alright, but then they act illy\nTry conquering my crown and that's really very silly\nNow I'm not the type that gets upset\nTry to disrespect folks just to earn respect\nBut learn this fact, whether white or black\nI can't get conquered in my style of rap\nFor jealousy and envy are dumb ones' tools\nSo Ricky says nothing, he keeps his cool\nRevenge is not a mission that the Ruler's on\nJust forgiveness required for the wrong that's done\nSo off we go, let the trumpets blow\nAnd hold on, because the driver of the mission is a pro\nThe Ruler's back\n\nScratches: Hit it!\n\nNow one day when I was chillin' at this outside jam\nI seen folks havin' a ball and plus clappin' their hands\nTo beats of records that conquer the streets\nLike Pee Wee Herman and Clubhouse Treats\nGirls was chillin', boys rule as usual\nThe slacks, the golds, the rings, I hope I'm not confusin' y'all\nBut everyone in the house looks smashin'\nFresh clothes on their butts and nothing out of fashion\nAnd just when you thought nothing couldn't get better\nA news flash concealed in a bright yellow letter\nA kid ran up to the mike and said \"Alert, hear this,\"\nCleared his crummy throat and then began to persist\nHe said \"Hallelujah, kids hear this\nThe Ruler's back and he's here to assist\"\nSo off we go, let the trumpets blow\nAnd hold on because the driver of the mission is a pro\nThe Ruler's back\n\nScratches: Stop Lyin'!", "[Verse 1]\nWell I've been a public figure for quite a long time\nKnown to the whole world for what? my style of rhyme\nBut tonight let's talk about the ones who bite\nAlthough they know they won't never get it right\nBecause they have no class and they have no shame\nThey'll bite another brother to boost their own name\nGet paid correct on a one way gimmick\nI'm happy for you lowlifes but 'member there's a limit - so say\n\n[Hook]\nTeacher, teacher, tell me how you do it\nIt looks kinda easy like there was nothing to it\nBut they don't understand that the master will be\nThe creator of the style (Ricky D)\nTeacher, teacher, tell me how you do it\nIt looks so easy like there was nothing to it\nBut they don't understand that the master will be\nThe creator of the style (Ricky D)\n\n[Verse 2]\nWhen I walk into a party coke snorters laugh\nAs the girls be crazy coming for my mere autograph\nAnd it seems that they aspiring my new style of rappin'\nAnd brothers all around me out of vanity, they;re snapping\nThe girls say, \"Wow, Rick you're so unique\nPlease tell us how you organize the words you speak\"'\nBut my will says chill and I go upon my way\nCause class will be taught some other day - so say\n\n[Hook 2]\nTeacher, teacher, tell me how you do it\nIt looks kinda easy like there was nothing to it\nBut they don't understand that the ruler will be\nThe creator of the style (Ricky D)\nTeacher, teacher, tell me how you do it\nIt looks so easy like there was nothing to it\nBut they don't understand the ruler will be\nThe creator of the style (Ricky D)\n\n[Verse 3]\nWell I remember one night when the world was dead quiet\nAnd out of nowhere some boy starts a riot\nHe tore my clothes, I had to throw blows\nA shotgun barrel was dead on my nose\nI froze - it was Big Foot and the Toes\nYup, a bunch of small timers that be at all my shows\nSurrounded the ruler with machetes too\nThey said um, \"If you don't teach us how to rap you're through\"\nI said 'okay, now let me go, please'\nI seen an officer - then the officer screamed 'freeze!'\nHe said, \"Slick Rick you okay?\"\nI had to play it off, some girls were looking my way\nSo I smacked one in the face and told him, \"I won't retire\nAnd many years from now I'll just be getting higher\"\nFor I am the master, said and done\nMy name is Ricky D and I'm the only one - so say\n\n[Refrain]\n(Ricky D)\n(Ricky D)\n\n[Verse 4]\nNow when I was a lad my style was bad\nSo I had to use what little bit of knowledge that I had\nSo I quote and I wrote 'till I was up to par\nSome rhymes were [boo-hoo] and some rhymes were [hahahaa!]\nI educate myself so I'm able to reach ya\nAnswering the call of teacher, teacher\nTell us how you do it, it's so easy for me\nThe creator of the style, MC Ricky D\nNow my only task is to warn all biters\nSlimy sluts and fake rhyme writers\nDon't try your luck and get the ruler annoyed\nFor when I'm through with you boy your whole world will be destroyed\nSo chill mister muscle or I'll come and hunt ya\nIf you are a girl I'll make no man want ya\nSo if you wanna rule and no pride's in the way\nPay attention to my syllables and come see me and say, \"Hey hey\"\n\n[Hook 2]\nTeacher, teacher, tell me how you do it\nIt looks kinda easy like there was nothing to it\nBut they don't understand that the ruler will be\nThe creator of the style (Ricky D)\nTeacher, teacher, tell me how you do it\nIt looks so easy like there was nothing to it\nBut they don't understand the ruler will be\nThe creator of the style (Ricky D)", "[Verse 1]\nWell I'm sittin on my lunch break, grinnin my teeth (my teeth)\nIt's the last day of the week, boy what a relief (relief)\nMy muscles kind of ache, they felt rigid and stiff\nSo I looked around, and I smoked this big fat spliff\nNow I'm happy as can be I'm in this pothead spell\nI put some Visine in my eyes so that no one can tell\nIt's 12:55 almost time for the bell\nPut the breathmints in the mouth so that the mouth don't smell\nNow back on the job, I don't bother no one\nI keep strictly to myself and all my work gets done\nNow the job's finally over it's time to have fun\nAnd I'm hangin out with Trevor there's a kid named John\nGot real drunker than a skunk and happy as can be\nWe went, to the Latin Quarters and we got in free\nScoopin all the girls like nuttin with my truck jewelry\nCause I'mma fly brown brother and you can't school me\nBoogie Down was performin hey they ain't no joke\nAnd a bunch of Brooklyn kids was lookin all down my throat\nWas it my big chains with the big plates on em?\nThen they rolled on me and told me to run em\n\n[Hook]\nThis was the moment I feared...\n\"Hey yo homeboy take off your chains man\nBout to hurt you real fuckin bad, I'm gonna fuck you up\"\nThis was the moment I feared...\n\"Yo what's the matter stupid? Take the shits off man!\nThe fuck is up?\"", "[Verse 2]\nI said, \"They're really not real, they're just a front for the girls\"\nThen a whole bunch of furious fists caved my world\nI was in pain, so ashamed, I wish I had not came\nHad to kindly pick up my face and then ride home on the train, then\nI went to an open store that's where I bought me a quart\nThen I went to the park, and I sat and I thought\nI seen Danny Boy though he's with his girl named Sarah\nIn one of his cars, I think this one's a Riviera\nShe calls out to me, but, I really couldn't hear her\nSo I went just a little bit closer so I'd hear a little clearer\nShe said, \"I need Veronica Place that's right near Tilden\"\nI said, \"I know where that's at cause that's right next to my building\"\nI gave em the information and they went on their way\nI went home, and there I slept til almost three the next day\nThen someone knocked on my door, I opened up, no quit!\nIt was Sarah with some magazines and a band-aid kit\nShe tried to use me and seduce me and at first I wasn't with it\nThen we did it and we did it and we did it and WE DID IT\nShe said it was great, she said she's glad we had done it\nThe elevator came and Danny Boy was on it\n\n[Hook]\nThis was the moment I feared...\n\"Hey yo what the fuck's goin on here?\nWhat you doin to my girl homeboy?\"\nThis was the moment I feared...\n\"Oh I just KNOW y'all didn't just finish fuckin\nI just KNOW y'all ain't just finish fuckin\"\n\n[Verse 3]\nWell he was huffin and puffin and he swung at me -- word\nSo I pulled out my jammy and I silenced the nerd\nThen he was dead two in the head I took the cash and the Visa's\nShe said, \"Don't worry about a thing just make sure nobody sees us\"\nWe went back to her apartment, there was blow in the freezers\nShe said, \"We're rich we're rich we can have whatever will please us\"\nNow I don't hang with no one who ain't good for my health\nSo I put the sugarhead out and I went for self\nNow I was rich as I was rich I could have whatever would please me\nNow I could wear real gold in front of folks that would tease me\nYah me, I'll be a new neighborhood dad\nCats'll roll up on me screamin, \"Yo Rick my man!!\"\nI guess I was too fly word up I'm sorry to say\nYa see a cop rolled up on me and told me, \"Make my day\"\nI said, \"Relax brother,\" but he had proof that I had done it\nYep, he had poor Sarah's underwear with my fingerprints all on it\nThis was the rise and fall of my fast lane style\nAnd I was the main event on the TV for a while\nBut now I'm in jail doin life and I'm scared\nSome kids snuffed me cold and greased me where no one dared\n\n[Hook]\nThis was the moment I feared...\n\"Turn around nigga (HAHAHAHA)\nSpread your cheeks\"\nThis was the moment I feared...\n\"UHH, AOWWHWHWAA! STOP STOP! AHAOWWHAHAOOHO\"", "[Verse 1]\nExcuse me, I'm trying to earn a mere buck or two\nA solemn rapper come in -- and who the fuck are you?\nAround this part of town with diamonds and your girl in fur\n\"I'm trying to enter in this rap contest you're having sir\"\nYou're kinda late \"Flat tire\" Well that do occur\nWell alright, pay me now, and you'll be after her\n\"I hope I don't mess up, or run out of breath, or even break\"\nDon't worry hun you're hitting 'em harder than a fucking brick\n\"But what do you think Van?\" Please, no one can serve us\n\"Wish me luck dear, I'm scared and I'm nervous\"\nSo who stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!\n\n[Verse 2]\nNow every time I write dope raps they come kicking it\nNow you know the title of this, so start licking it\nLips kicking it, hey bitch, there is a brick in it\nSo when you think you're prepared, I keep sticking it\nNow here they come with a spike to fight, take it light\nNow who the one you're trying to be like with all your might\nAnd anyone that attempted to remove me out the race\nBest give me space before I fly in their fucking face\nNow raise that vocal, play that role around your local hoods\nDon't worry about a thing cause Ricky Rick is bringing home the goods\nWho stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!\n\n[Verse 3]\nNow everything that come out your mouth, sound like it's out of spite\nI'm back on a mission and this time I'm gonna anchor right\nThat's right, ads help, he's improving it\n\"Thank gosh Rick! We love the way you're moving it\"\nWho's hitting rough in eighty-eight I bet your momma knows\nBack slap you all down like y'all were dominoes\nStun em all, come on y'all, give me a taste of life\nAct trife, I'll let my dog go fuck ya wife\nSo be my friend and don't pretend you will not be forgiven\nYou're cleaning house up to the master, that's how we both are living\nSo who will stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!\n\n[Verse 4]\nGo Vance Wright! Go Rick! Look at the style we bring\nHow come you cannot write a rap that will erase the king\nThe girls you worship are some tramps and want to see me slam\nShit on mother fuckers and I tell them who the fuck I am\nMy name is Rick, but now you know who's ruling it\nPump the world and the DJ put the fuel in it\nCome ride the dick and if you wanna know what is the word\nWho write the baddest raps you and your boys have ever heard\nI eat you up and give your girl a bowl of Puppy Chow\nYou understand alright? Hello! I'm trying to tell you now\nWho stands, who falls, who crowds the halls?\nThis one the DJ calls... lick the balls!", "[Intro]\nSo you get my point son, you just don't trust no bitch\nYou know what I'm sayin? (Okay, daddy, I understand your [?])\nCause bitches ain't no good, you know what I'm sayin?\n(Okay, I get your point) Anyway, listen to this, check it out\n\n[Verse 1]\n1994, as the world gets trifer\nI'm wondering, fuck I need a woman in my life for?\nYa know, cause it's like a nigga whole history\nWith you hoes been nothing but misery\nFirst rater, five-one stood\nMad coke fiend though the bitch looked good\nMet her at the Fever, \"What's going on, stranger?\"\nAnd like a fool took her in and tried to change her\nI don't who I thought I's bluffing\nThat bitch wasn't giving up that coke for nothing\n\"Oh you tryna dis, mister bougeois nigga\nYet back in the day, you used to smoke coke cigarettes too\nThat type shit you ain't admitting\"\nBecause, home girl, I grew out of it, you didn't\nAnyway, dead outta order\nCame in with a sheepskin her ex-lover bought her\nWho gave you that? \"My ex\" I said \"Who?\"\nBelieve she had the nerve to say \"You can wear it too\"\nWhen I found strength to depart, I do\nWithdrew, for something brand new\n\n[Hook]\nSomeone who would be true\nYes, I should find someone who would be true\nCause Ricky needs a love that's true, true\nOh dear, Scooby Dooby Doo..\n\n[Verse 2]\nThen I met Syb, sweating the viking\nA brown skinned fox, slim just like I like 'em\n\"What? Sweating you? Picture that, nerd.. please\"\nAnyway, the bitch had herpes!\nYou know, imagine me, the fool being the spouse\nDoctor said I couldn't catch it 'less I got aroused\nFound out snooping in her bag what she got\nNow why you ain't tell me? You worthless slut!\n\"Because I loved you at the time and couldn't afford to\"\nYou know homegirl should get the Oscar award for her lying\nAnyway, stayed with the creep\nOne day, Sybil here, talking in her sleep\n\"Chris, wait,\" the bum bitch said\nSo loud 'til a mothafucka fell out the bed\nWho the hell is Chris? She putting up resistance\n'til I caught her calling the nigga long distance\nHad the nerve to dispatch loving\nBoy am I lucky that I didn't catch nothing\nWhen I found strength to depart, I do\nWithdrew, for something brand new\n\n[Hook]\nSomeone who would be true\nYes, I should find someone who would be true\nCause Ricky needs a love that's true, true, true\nIndeed, I need a love that's true\nIt seems I need a love that's true\nOh dear, Scooby Dooby Doo\nOh gosh, Scooby Dooby Doo\n\n[Verse 3]\nThough happy I was free, the need for love was still in me\nGot to the point like the need for it was killing me\nThen I met shorty here, hanging with my cousin\nFound out later how young the bitch was and\nThough I done hit it and she opened up a world\nAnd remind me of that song \"Go Away, Little Girl\"\nIt had to end because the bitch weren't loyal, and spoiled\n\"That's because I had you pussy whipped royal\"\nYou see the type of shit a nigga was gonna marry?\nYou see the type of attitude the bum bitch carry?\nLike oil and water, impossible mixture\nThen temper tantrums came into the picture\nYelling, carrying on bad and cursing\nComplete embarassment to the Ruler as a person\n\"Gimme shorts\" Ruler will not permit you\nThen she goes wild, starts breaking up my furniture\nFlirts too, excuse me, a whore\nLike the world's worst groupie when I brought her on tour\nSo when I found strength to depart, I do\nWithdrew, for something brand new\n\n[Hook]\nSomeone who would be true\nYes, I should find someone who would be true\nCause Ricky needs a love that's true, true, true\nIndeed, I need a love that's true\nIt seems I need a love that's true\nOh dear, Scooby Dooby Doo\nOh gosh, Scooby Dooby Doo", "[Intro: Warren G]\nCheck this out, this Warren G, y'know what I'm sayin'?\nChillin' with my man Slick Rick, you know?\nAnd we gonna give you all a little tale about this jail stuff\nYou know? So Rick, why don't you run it homie? Yeah\n\n[Verse 1: Slick Rick]\n\"In the slammer, kid!\" \"But I'm innocent!\", Lord played witty\nWasn't havin' any pity, now in Razor Blade City\nCry, suppose the situation seen mad eyes of foes\nDrives a Rolls, \"Hey, yo, money, what size are those?\"\nNeed to phone me to another sprang up, hmm, to gang up\nOn this kid housin' the phone like he didn't know how to hang up\nWould be hard, though\nUp to a minute or so and then yells, \"Time on, and when you get Your commissary, buy this and that or else I'm gonna\"\nBe on that ass and won't stay off, extort, fig I say, way off\nBeat to death, you ain't protectin' me, forgot today's my day off\nHold my head and drift the Sumo weigh in knots and cars\nInstead of sittin' here accumulatin' cuts and scars behind bars\n\n[Hook]\nDum ditty dum ditty ditty datty day\n\"This type of shit happens every day\"\n\"See, some punk locked up to get beat down\nRaped down, till his booty is broke down\"\nDum ditty dum ditty ditty datty day\n\"This type of shit happens every day\"\n\"Riots, melees and disturbances of the peace\"\n\n[Verse 2: Warren G]\nMr. Slick Rick, let me take it for a second\nAnd tell a short tale about the L.A. county jail\n9500, that was the lock up\nWhen the lights got dim, it was time for the sock-up\nJackin' for the money, back-stab was my mission\nIf a riot jumped off, it's time for incision\nStickin' niggas here and stickin' niggas there\nI turned around and looked and seen cops everywhere\nJackin' brothers up, slappin' brothers up\nIf you got blood on yo' clothes, lock up!\nHigh-powered was the level, level fo'\nNiggas sentenced to life and you can't be no hoe (biaatch!)\nOr you get tooken with homies overlookin'\nEsés next door with the Puma, straight cookin' (Come here, homes)\nLighten up the whole module\nHuh! God damn, yeah, another squabble\n\n[Hook]\n\n[Verse 3: Slick Rick]\nWhat fight? The nigga trip, C.O. the rest he might scared\nBut couldn't squeal, I's like, \"Officer, that nigga right there\"\nNow, if he ain't get me his friend's will, needed a utensil\nIt turned out, I had to stab him in the eye wit a pencil\nState of shock, he made a yell, I said, \"Ah, what you want traitor?\"\nC.O. puts me in the bin, I'll say about a month later\nBack in population, didn't matter that his friends tensed\nThe phone prints, the years added to the sentence\nStill chillin' and all of that and I escaped when I didn't think\nSo, don't hit the sto' 'cause they made a rape attempt\nThank goodness, failed, call out next, he wailed out\nHere go the C.O., \"Ricky Walters, pack up, you're bailed out\"\nThe C.O. couldn't see the rape, the kid'll snitch mass figure\nFast trigger, you'll be back, you little bitch ass nigga\nAu revoir, back to datin' sluts and stars\nAt least for now, no more accumulatin' cuts and scars behind bars\n\n[Hook x2]", "[Chorus]\nSomething tells Rick he's a fool\nTo let girls treat me so cruel\nBut never-the-less, Rick said \"You got me waiting\"\nSitting in my car, waiting for you-ooh-ooh, lalalala\n\n[Verse 1]\nI got a girl, but I'm about to switch all that\nBecause my girl be trying to play me like the bitch all that\nShoot, clocked her daughter, for acting out of order\nTo impress a girl who to me knocked her out the water!\nBut because the kid swears love\nThough when I see her friend it's like the shit wears off\nI don't bother, while she want to kiss and then cuss and full of hate\nGet her friend? Mission Impossible\nBecause she's the one the hon chose to boast to\nThe way that her and the bitch is so close to be a waste\nSo make music in my basement\nDon't cut her off until I find a good replacement\nOne day I jumped in my Jeep, drove her to her friend's\nHouse, cause the hon was sleeping over\nMy girl was acting fine, then the slime switched\nWanna diss, I said \"It's over, you waste of time bitch\"\nTried to kiss her friend, twice then a third\nShe said \"Stop, Rick\", but didn't tell her friend a word\nI went to bed, here come my girl touching me tenderly\nSnuck out later, girlfriend wasn't acting as friendly as before\nBecause she swore a nigga hit her\n\"Well if you ain't love her why'd you go back to bed with her?\"\nBut I didn't (no you ain't), now the hon badgering\nI don't know, maybe it's me, maybe I'm imagining the love affair\n\n[Bridge]\nGot Rick sitting right here\nWaiting for you my dear\nWondering if you're ever gonna show, you ho\n\n[Verse 2]\nAnother brother out for one thing, mistook him for\nSteady relationship is what I'm really looking for\nSincerity, scoop the hon I done it\nI said \"Being straight up, you I really wanted\"\nThough she fucked niggas with money like mad\nStill found myself wanting the honey quite bad\nLoyal to her friend, though she wanted wood\nThen we did it, boy that pussy was good\n\"But what if shorty finds out?\" Never be too clever\n\"Rick, she has to know if we're to ever be together\"\nChill, then we started to button the strap and\nWhen my girl woke up, we acted like ain't nothing happened\nLater on, my girlfriend stormed in\n\"We going to the supper club, some kid's performing\nBye, see you later\"\nHer girlfriend hot, let me see how they livin', Rick decide to follow\nI'm outside of the club sipping a beer through the best can\nBoth sluts were sliding numbers to the next man\nContradicting of words being together\nMy girl, too, I should've known, birds of a feather\nBack in my Jeep, about 4:11\nPopped another can, looked up to the heavens\nI'm a good man, in fact I know that I am\nAnd I deserve a lady love, that's why I'm wondering why I'm\n\n[Chorus]\nSitting in my car, waiting for you-ooh-ooh, lalalala\n\n[Bridge]\nGot Rick sitting right here\nWaiting for you my dear\nWondering if you're ever gonna show, you ho\n\n[Chorus]\nSomething tells Rick he's a fool\nTo let girls treat me so cruel\nBut never-the-less, Rick said \"You got me waiting\"\nSitting in my car, waiting for you-ooh-ooh, lalalala", "Yeah\nPremier and Slick Rick kid\nJonah Hill\nYeah kid, check it out\n\n[Hook]\nGood gosh the world's so bad\nIt's trying to drive me, a sane man, mad\nGreat gosh I needs some bad\n'bout to drive me, a sane man, mad\n(Kick it Rick)\n\n[Slick Rick]\nAre you peeping this floosie\nOr queens, eh excuse me\nCan't believe how many times I had to eat the chick's sushi\nWho she?\nLook at how a brother gotta roll\nAll cold, kid\nAnyway truth being told\nFit boy too, big\nWhich one you pick\nRico suave or chick one, two kid\nOnce I was born in this thick\nWhy I gotta deal with this horniness tip\nThis, not enough flair\nThis, lack lot wares\nGot her holding my tears, trying to act like who cares\n\nReaching, if I say I see kids in the mix\nWanna cuddle, go out something, trick with the chick\n\nMotivate through it though I know it ain't true\nWhy argue, tell a chick \"You're okay too\"\nDelilah\nThough I flirt too beside her\nEasy to play dumb while your IQ is higher\nWhy ya, you treat me like a sucker\nI don't know should I keep maneuvering Tanaka?\nTo what, something sexual, puppy\nAnything to get into this shallow chick's body\n\n(Know what I'm saying kid)\nCause it bad, trying to drive me a sane man mad\n(Say what my kid)\nI needs some bad about to drive me a sane man mad\n(Bring it on kid)\nGood Gosh the world so bad, trying to drive me, a sane man, mad\n(Bring me home kid)\nGreat Gosh need some bad, about to drive me a sane man...\n\nI want you, munch too, comes to hun, how long do\nMa duke caught the kid masturbating once too\n(no)\nPassed, looked stunned, kept on like\nDon't you have a steady piece to smash yet son?\nWhat to do Mom, none touching dude's joint\nLike to see me out here buying some prostitute's bum?\nNo?\nPicking up scroin, cop pursuing\nFrom the stripper club hairdoing\nThen laughed and none but wise after\nSoulmate, more than sex, a live partner\n\nSnatch can't get, cat frantic\nSo, in the meantime stripper club, lap dance tip\nA professional press box arouser\nSome condoms so I don't mess up me trousers\nThen start paying, mark swaying\nGirlfriend just sit down and start playing\nHere's an extra, parading the wealth\nDon't want a real kid feel like I'm degrading myself\nBouncing on me funny, bouncing with my money\nOr its back to playing cat and mouse games with the honey\n\n(You know what I mean kid)\nCaught a script so bad, trying to drive me, a sane man, mad\n(Say what Slick Rick)\nI need some bad 'bout to drive me, a sane man, mad\n(Premier)\nGood gosh the world so bad trying to drive me, a sane man, mad\n(Jonah Hill kid)\nGood gosh, need some bad, about to drive me a sane man...\n\nI need some bad X 4", "[Hook]\nFinally, a change from these fake rap artists\n(Me and Nas bring it to you hardest)\nFinally, real niggas that are Billboard charters\n(Me and Nas bring it to you hardest)\n\n[Verse 1: Slick Rick]\nSkills provide the shows, also fright the foes\nAnd when I step into a room, pimps hide they hoes\n\"Is that really him?\" \"Yes, that's His Highness\nAnd for the last time, stop lookin' at his fine ass\" (Y'know!)\nHomosexuals smirk, converse and say\n\"That nigga box is WORKIN', girlfriend!\"\nYou wanna talk about a fat phrase carrier\nTo billionaire white chick jump the race barrier?\nYou know a nice girl, but I didn't want a bit of her\nSayin, \"I like your slang, what's with the wife? Get rid of her\"\nSon, Sony talkin' Japanese\nWith mice like, \"Whattup Rick? You can have my cheese, kid\"\nI am such a heavy hitter\nEven chandelier jealous off the patch eye's glitter (bling!)\nRappers walkin' 'round strappin', fearsome, HERE, SON\nAnd remember, your rap career's done\n\n[Hook]\nFinally, a change from these fake rap artists\n(Me and Nas bring it to you hardest)\nFinally, real niggas that are Billboard charters\n(Me and Nas bring it to you hardest)\nFinally, we'll separate the men from the heartless\n(Me and Nas bring it to you hardest)\nFinally, a tag team from the top all-starters\n(Me and Nas bring it to you hardest)\n\n[Verse 2: Nas]\nRun in spots, pants leg tucked in my socks\nPuffin' Lamb's Bread, order drinks, Henn on the rocks\nWintertime, sport a fox, maybe a sable\nThree-quarter length mink sound right for this occasion\nHeard me John Blazin', see me in gangster flicks\nLife is so amazin', hate to be paperless\nBill Gate in this, it must be God, I'm not a atheist\nWanted like kingpins by ATF\nYour girl want my name on her chest\nMe and Rick argue about whose chain is the best\nGucci boxers, my diet changed from sushi to pastas\nWear my hat like the late Sinatra's\nModels pop they coochie when the spot us\nFinally, rappers you could be proud of\nFrom the Bronx to Queensbridge Houses, what?\nIf you feel me, then holla\nThug niggas who bail be worth a million dollars, what?\n\n[Hook]\n\nTrackmasters, Def Jam\nBaby, what the deal?\nSlick Rick, big Nas, yo", "[Intro: Slick Rick]\nYeah, know what I mean Rick?\nKnow what I mean Rick?\nKnow what I mean Slick, Whoa!\nYeah, wee!\n\n[Verse 1: Slick Rick]\nFine, grown Pine-Sol, heavenly rhyme throne\nRemember when you were young in the '70 time zone?\nStages, age is 'bout seven, I say, kids\nThe dress code of our parents looked awfully outrageous\nNot down on 'em, games and clownin'\nWhen soul was at its highest rate like James Brown and them\nSoothin' every black thing, a groovy era actin'\n'Member seein' Shaft in the movie theater back then?\nI feel Richard Roundtree got 'em a fly deal\nBlack men wearin' bell bottom and high heels\nLaughed a lot, some action, mass production\nRemember when cars were darn near half a block long?\nParents were so into that crap\nBunch of sweet memories to us older rap cats\nMuhammad Ali knucklin' in tournament\nPimp daddy hats with buckles and ornaments\nHow we forget Snappy?\nFive people sleepin' in one mattress and yet happy\n\n[Hook x2: Slick Rick]\nCould even make sex seem sour\nAs I impress the world with my extreme power\n'Cause Rick make memories sealed in almanacs\nNot to mention the immense appeal the mack had\nWhen you wake up in the mornin' (redeem from any crap)\nBecause I bring that lovin' feelin' back to rap\n\n[Verse 2: Slick Rick]\nFor situated as poor beneficialator\nKool-Aid couldn't last a hot minute in the refrigerator\nSchool notes, slidin' and stealin', hidin 'em\nBazooka, bubble gum cartoons still inside of 'em\nNo way, same essence of it's earned paper\nPimps flyest dressin' muthafuckas, weren't they?\nBut hood lies, you afraid of a good wine?\nI used to love the actor who portrayed one on Good Times\nYou need a friend to warn a soul, man, it kinda slow\nOne thing 'bout it bro, overflow when it's kinda so (shame)\nLife, a pitiful game\n'Member the robot? That was my shit on Soul Train\nGot hyped too, psyched too and the feelin's right too\nChillin' on the fire escape on a nice night, too\nNo one gone try hurt di mon\nRemember Right On, Blood and Jive Turkey slang?\nBrothers chippin' in for alcoholic money\nWhen you look at old flicks don't we all look funny?\n\n[Hook x2]\n\n[Verse 3: Slick Rick]\nYo' mama, damn, we used to talk improper then\n'Member when we used to walk bop, walk bop again?\nGivin' them the rhythm that we brought\nPush our hand back like we was swimmin' when we walked\nBad all about, Huggie Bear, Rat all about\n'Member afros, what the fuck was that all about?\nBuenos noches accents too, friends too\nEverybody had a lot of roaches back then, too\nProfusely around us, Lucy Afarensis\nFleets wearing Bruce Lee Bananas\nAnd kick shit, ball in the hand and stick with\nAnd we use to be in some of the \"Man, you in deep shit\"\nMost cases, father away for good\nLocal Flat Foot was part-of the neighborhood\nStandard, and the panthers (Wow)\nUsed to dress like Erykah Badu and Amanda's now\n\n[Hook x3]", "[Slick Rick]\nWell, I'mma tell you a story and I come out bluntly\nBorn an ugly child; hey, nobody would want me\nI used to walk around and get upset and upsetter\nTill I figured out ways to make myself look better\nAs I got older, my awareness expanded\nI met this beautiful girl and my wish was commanded\nDidn't hang wit fellas cause they started gettin shady\nI'd always be wit my girl and ya could call her my lady\nI loved her a lot, word up, not going to front, see?\nThe problem that arose is why on earth did she want me?\nCouldn't figure it out, and to make things worst\nI was cursed, wit the torment of not being the first\nAnd the first was this fly guy, made me very jealous\nOoh, I think he cheat on me, and talked to other fellas\nTwo wrongs don't make a right, but any time that we fight\nI would call and took a phone and call a girl outta spite\nI shouldn't have done it\n\n[Hook 2X: scratched up]\nI'm feelin sad and blue\n\n[Slick Rick]\nI will to make this right, so director was admirin\nI tried to stop my love, but no love was not retirin\nTo catch her in a lie was near impossible and tricky\nDidn't want her in certain clothes, gettin really picky\nWe got into it again, this time she got to bright\nSo me preventin a fight, I just stayed out for the night\nI had to ease up of the record, all this hot increase\nI went up to the Parrot, with Omega, Vance, and Dane\nThis girl came over, she was trucked down extensive\nStartin talkin to me, and she was probably quite aggresive\nA pretty young thing, she didn't strike me as no ho\nSo meet my nigga, rude and went on wit the flow\nBut Joe was gettin hard, without me even knowin\nWe stepped up back to my van and I could it's for growin\nThe girl took off her coat her body was no joke\nWell, I rubbed it to unzip it, and I went for broke\nI shouldn't have done it\n\n[Hook 4X: scratched up]\n\n[Slick Rick]\nNow I'm seein, that there's no one to blame\nThat night when I went home, I felt real guilty and ashamed\nSnucked right into bed, I felt just like a shady fella\nWhat made me so unsensitive, how I'm ever gonna tell her?\nShouldn't have cheated, just because we'd always doubt\nEndurance, be a man, that's what I had to learn about\nHow me, I guess I like the wanted secrets that I did\nI figure, I'd patch things up and then I'll tell what I did\nThen after that, she started actin heaven sent\nI found a house spot, let's say she help out wit the rent\nSo, I bought the ring, it was a good 20 Karat\nThen word got back about me chillin at the parrot\nSo when I got home, I thought she'd just be out to roast\nInstead I found this letter, and I found her overdosed\nIt said \"I had it for you but I guess you didn't care\"\nAll this wouldn't happen come of me and this fear\nI shouldn't have done it\n\n[Hook to fade]", "[Slick Rick]\nAll of you cock-pullers are frontin\nWave your arms around like your some octopus or somethin\nTo better ya\nFor any chick you want, I'm gettin her\nRob people, mad ignorant, et cetera\nWho the one to entertain and fume with?\nWho you no-breed humans can't be in the same room with?\nReefer sweet, wrap it up, free fix greet\nEvery rapper rap maggot underneath Rick's feet\nEvicted -- why you tryin to find shit to lick with?\nEven your kids tell you that you ain't shit to Slick Rick\nThough you pretend to be glory\nI'm number one, that's the end of the story\nThe black Clark Gable leave you numb\nEvery single one, frontin on your label is a bum\nLet me slow it down, that's enough of that\nThis I have to say to you, nothing, other rapper cats\n\nChorus: repeat 2X\n\nFrom New York to Cali none'll fuck with\nThe awkward, you think Muhammad Ali used to talk shit?\nBing!  This sure hit alone'll bury ya\nAnd even if I got deported, I own America\n\n[Slick Rick]\nHe's so crazy -- I smash rippin up the place\nGive the mack a taste -- I wipe my ass with a rapper face\nCars come to a dead stop\nRain find ways not to drop on my headtop\nTycoon rush at the richest\nEven my complexion is a must-have to bitches\nEven without, car money to budget\nI would have the most elegant apartment in the projects\nKnahmean?  Bitches are in awe * at the lingo\t\t* (pronounced OAR)\nKnow that Rick'll put an end to all rapper income\nAn old-timer, lock up all vagina fills\nFrance nor Italy can fuck with my designer skills\nSaltin inferior, faultin to where we are\nTryin to find fault in superior\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\nChorus\n\n[Slick Rick]\nYou lack the taste hook I'm stickin em with\nWhile degenrate like yourself make our race look ignorant (mm)\nAnd your girlfriend wanna kiss and deploy\nBout in the groin gets none of this tenderloin\nFeet planted on deep black firmament\nBow -- in the presence of who lead rap permanent\nLike a lion rap rips a chunk of kids\nYou stunk, cause mortals ain't shit to conquer\nSomebody said new pharoahes have appeared\nHow when everything I wore ten years ago you wear now?\nI coulda murder heard a word out quick Rick stomp it kid\nHung to it, you complete bum to Rick\nSource Awards, yeah Rick every seminar\nEven make Sadaam Hussein tell me where the weapon are (mm-hmm)\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\nChorus", "One of the greatest rapper, walk - I'm sayin'\nIn the field makin' my brick without hayin'\nMad busy kid, nah whip cut here\n\"You, Boy, drop your bundle bring your butt in.\"\nA soldier, what I do to that hood?\n\"Are you that slave everybody tellin' me rap good?\nCalm down, not goin' ta murder ya\nClean yourself, Pharoah said he wanna have a word with ya\"\nMy mom, pop, look concerned\nAfter takin' a shower, dress and returned\nThe soldier, kinda on the dark end\nBrought me and the motherfucking palace was barking\nIn the midst, a poet, dryin'\nPharoah and his girl being entertained by him\nMotherfucker got some nerve\nSaid \"Bring slave forward, let me observe\"\nHe asked me my name and start badger me\n\"Ricky, what?\", 'Ricky, your majesty'\nAnd bowed because I had to\n\"Kick a rap that shit better sound fat too.\"\n\nWho rotten 'em\nPlaits swing, but have you forgotten 'em\nBiggest big shouts since King Tut and 'em (who rotten 'em)\nKids ville, motherfucker couldn't sit still\nAll bitches is open off Rick's grill (who rotten 'em)\nDefinetly exort, any stalkin'\nHawk gawkin' at silk fabrics when I'm walkin(who rotten 'em)\nFondle with right, yet, spec get delighted\nAll a that jungle shit, whites rap\n\n\"He's fat\" queen said to the pharoah excited and\nDid seem obvious the rap delighted him\nThen start banging on the plate (Yes your honour?)\n\"Send this other rapper to the lions\" (Please, no!)\nPleaing with merit, if you kill him for my sake\nMy raps will lose spirit\n'Please let him live, I prefer that'\n\"OK, well, send him where this slave used to work at\"\nDo or die jammin' me into\nEven was allowed to move the family in too\nAny beat better rap good on\nEven gave me mad nice outfits to put on\nKnowing that my rap stlye bumped many\nAnd expecting some important company\nThe king visits where I was put to write\n\"Slave, you're behind, better rap real good tonight\"\nIn other words, lay your mack down\nCause these cats not the one to sound wack round\nSo that night, when they summers be them clapping\nTook a deep breath and then began rapping\n\nWho rotten 'em\nTryin' a find out what excite, what I write\nWhat ignite with\nLion never once tried to bite Rick\nExcusely, assumed to meek, refuse to greet\nA smoother geek, just move ya feet\nShocked all dippin' and stoppin'\nEven slave owner wanted me to whip a man, fucker\nShakin' any prison, kickin' back, sick of crap\nAnd sista breakin' when a nigga rap\n\nWell it was obvious the raps unpluggin'\nDignitaries spat wine out they mouth, buggin'\nThis they never heard that type a tactic\nGold sandles all over their fat steps\nOne dignitary overwhelmed me said\n\"I'll give you half the eastern border if you sell him\"\nBack at the rest spot to nap a bit\nMom! Pop! They delighted with the rap i did\n\"Son\", my mom said sweepin' up\n\"That lunatic'll kill you if you don't keep it up\"\nWhat's wrong with you, \"Son, I'm not scornin' you\nLeave your best for a rainy day, I'm warnin' you\"\nRipped my ego apart\nSo I set upon a mission to change the king heart\n'Sire, whippin don't pay off\nA lot more done you give a nigga one day off'\nHe took my advice, steady elegance\nSir noticed that my input was accurate intelligence\nThat type meant ta stripe, kids\nEven after he died, I still write raps like this\n\nWho rotten 'em\nAll teacher and scholar try proceed me, believe me\nI am all culture that you need be\nAnd superior juice to abuse, I choose\nUse words racist slave owner used to\nSandwich known crook, redbone hook too\nGot his own land, which you're known look to\nNot only ass wipes, swept side kick\nShocker and them niggas even try to dress like Rick", "Yeah, check, check, I can't, I can't manage I, I can't\n(But you must Rick) I can't, I can't manage\n(But you must Rick) Ah, shit\n\nHoes ass kiss cause I'm like Jason, vision\nReleasin' me a basket case from prison - Pissed\nBlood feenin', the villain like 'Wassup ya'll'\nDeep down schemin' how to kill 'em\nMisleadin' a bit, although proceedin' a hit\nI made 'em feel I'd never jeopardise my freedom for shit\nPlayed the empty headed part\nThough the moment they dreaded start, neat\nBack of the head and took the credit card\nSeen properly decease\nMade it look like an everyday robbery to police\nAnd I's out\nPolice believed a thief pop for sureity, a jerky\nAlert the rest to beef up security\nAnd not to get flashy, although another blast occurred\nAnother brother deservin' to get massacred\nPleasure in poppin' that flea\nShould a heard mister tough guy coppin' mad pleas\nNot insane, nor am I biased\nThough feels good to watch a motherfucker die before\nMy fly ass\nAin't nuttin' to blast, fuck it\nThen I put some crack vials in the ass pocket and was off\nPolice said a thug awaited, since I didn't leave no evidence\nA drug related incident\n\nI still clock the mil' figures, cock back triggers\nReason why your girlfriends dig us - cause I kill niggas\n\nYou are my shining star, my guiding light, my thug fantasy\nYou are my shining star, my guiding light, my thug fantasy\n\nWell I had it up to here, that's why a brother buckin' trife\nAnd gettin' way with murder, this the motherfucking life\nAt a jam, nine figure on shelf\nWhile your army a nigga snickering among self - thiefs\nWho wanna clock the bread off the next\nThat's why Im gonna blow their fucking head off\nMaybe the victor get stuck up\nGiving these clowns opportunity to bulk up\nThey knowin' that the kid crew showers, eye cowers\nAnd leaves for 'bout a good two hours\nWhile they're like 'we coulda caught Rick what, for allsort'\nThat's what the assholes thought\nTough guy mumblin', I thunderin'\nWhy I had a motherfucking A-K ya wondering\nAnd raise it higher, start giving them the fire\nAs they scream like high pitch women like Mariah\nBlood on the wall like, other brothers ball like they hit\nSeein' shots split a motherfuckers skull like lettuce\nRun a nigga best bet is for another duck in gage\nI'm in a motherfucking rage\nMask 'bout face, Now figure dash\nSmash 'bout 10 ta 15 nigga ass out\nMore enemy dug, deceased, caught\nHad not, gave one fuck what police thought (what?)\nBut first I best provide all brainiacs\nWith evidence of a suicidal maniac\n\nWhile I clock the mil' figures, cock back triggers\nReason why your girlfriends dig us - cause I kills niggas", "[Verse 1]\nWell, I shot some deer, then I copped some beer\nAnd did a show up in West Bubblefuck somewhere\nDue to rap's wider ratio, satellites to Nato\nHillbilly drawers flew on the stage like tomatoes\nApparently more mack than I thought\nUnfortunately, wife piece back in New York\nAnd I'm starvin'\nBeing human and open with\nA mad fine hillbilly woman was scopin' Rick\nThought entered how to lean and bent it\nThough I'm not gonna lie, I was extremely tempted\n(To what, Rick?) To discharge in a sister\nNext thing, in the dressin' room, \"Pardon me, mister\"\nYes, I said cautiously, \"Crazy, but possibly you could sign\nYour name on the back of these Dazy Duke shorts for me\"\nTry to resist, now girlfriend startin' it\nThe pen won't write, \"You can press down hard on it\"\nNow, my hand browsin' her South end\nSpun around about to shove my tongue in her mouth when\n(Rring!) Loosen the grip my hell had\nMy girl, she was talkin' so nice I felt bad\nBeing untrue, no tellin' what it might do to her\n\"I love you\", forced to say, \"I love you back, too\" to her\nAny thought of gettin' pussy was doomed too\n\"You got a wife?\", anniversary comin' up soon, too\nGot off the phone, cock just got mute\n\"Don't get me wrong, it's not like you're not cute\" (Uh-huh)\nI'm wrong for mistreatin' her, the wantin' to skeetin' her\n\"I understand, goodbye, it was real nice meetin' ya\"\nWhat an angel overcomin' his wrongness\nThe moral I am tryin' to get across in this song is\n\n[Hook]\nIf goodness is what you're fillin' your soul with\nAnd wanna find a woman you can chill and grow old with\nWho keeps no secret, like who they creep with\nRealize early, it's a 2 way street, kid (Say what?)\nIf goodness is what you're fillin' your soul with\nAnd wanna find a woman you can chill and grow old with\nWho keeps no secret, like who they creep with\nRealize early, it's a 2 way street, kid\n\n[Verse 2]\nCasually seatin' with some thick chords eatin'\nWith my album playin' at a big board meetin'\n\"I love this!\"\nBeing the coolest and the ruffest\nA big willie woman pulls the Ruler in her office\nAnd fixed a wedge in her garment, unsteady my heart went\n'Cause her office looked like a three bedroom apartment\nPoundin' was inevitable\nShe said to me, \"Rick, I think your album is incredible\"\nThe way the hon' upon I, comin' on a sun I\n\"You're so darn sexy with that patch over your one eye\"\n\"Well, I'm glad you think it's boomin' and I catch ya\nMeans a lot to me, comin' from a woman of your stature\"\nI mean, who could resist the Don head?\nStart caressin' Rick private, kiss me on the neck\nAnd I can't be held accountable if down her gown I pull\nGirlfriend pussy look plump and poundable\nShe sweats to set the emperor\nPut one of your legs up on the desk and let me enter ya\nFantastic, though I start to act drastic\nWhen I see my weddin' band 'pon the bitch left ass cheek\nDeep down, she felt that I tried to diss\nI'm like, \"I can't do this as much as I'd like to, miss\"\nAn angel overcomin' his wrong, kids\nThe point that I am tryin' to get across in this song is\n\n[Hook]", "[Verse 1: Snoop Dogg]\nI falls off into a party in the N.Y.C\nNiggas lookin' at me strange but they lovin' my chain\nBang bang, same thang, game came when I left 'em\nI do it by my lonely, now, I'm the Big Homie\n\n[Verse 2: Slick Rick]\nBut I'm his Royal Slickness, ghetto weakness, 'cause  Rick is\nThe one who expose cornball rappers with the quickness\n(Uhh) Who bum from and who balls you hung from\nWouldn't give a fuck what part of the country you come from\n\n[Verse 3: Snoop Dogg]\nI'm Snoop Dogg, I'm smooth and imperial\nI wake up every mornin' to my Lucky Charms cereal\nTimes get drastic, yeah, I'm a classic\nDogg Pound Gangsta chokin' off that Boombastic\n\n[Verse 4: Slick Rick]\nNow, put my verse on the first one, peep the herds come\nSo, be careful 'cause my rap will make you eat your words, son\n(Word to God) Scratch I? Who the hardest to match? (I)\nBite, rewrite, you're still garbage to Patch Eye\n\n[Verse 5: Snoop Dogg]\nHaven't you heard? I'm loose, shook the Feds like The Juice\nSnoop Dogg is 121st proof\nFool, you's a deuce-deuce of some Genuine Draft\nI'm genuine, like vintage wine and all about cash\nCash, cash, so indeed I got the weed\nAnd keep the lighter for the hash\nHas it ever been a time when you didn't have a dime\nAnd the only way to get it was to go and do a crime?\n\n[Chorus x2]\nMany underclothes hangin' on the hoes\nSince (Snoop, Slick Rick) crushed anyone opposed\nLot of ladies - pop Cristal, toast to all those\nLike (Kid Capri) helpin' to Unify both coasts\n\n[Verse 6: Slick Rick]\nI'm shreddin' ya temper, none 'head of the emperor\nWashed up gang member? Better remember\nI wipe my feet upon a rapper like a doormat\nI hit 'em where they sit around actin hardcore at\nThank God for the guardians, in light of this\nRappers always beg for me to show them who The Mighty is\nGats gonna limp, snaps on a kid\nThat always wanna start rap, boy, they're not gonna win\nAnd wanna dash at lethal or evil\nCould a King bring style and class to black people?\nStick a whole log in and he buggin'\n'Cause I represent self, with my man Snoop Dogg and 'em\nI drop a pile of semen on 'em\nEven in a Yugo, I could take they woman from 'em\nI make the hardest chew they kewl to this\nKid Capri (Yeah?) Notify the peasant who The Ruler is\n\n[Chorus]\n\n[Verse 7: Snoop Dogg]\nI'm 26, still in the mix\nMy hair gettin' longer, my game gettin' stronger\nA nigga been on one, I thank God\n'Cause life in the city of stars is gettin' hard\nAnd it's odd, for a G to get a job\nSo, I'd rather steal and rob and mob with my squad\nMy homie used to bang, now we follow Farrakhan\nUsed to read The Source\nNow all he read is the Holy Qu'ran\nTime brings change and change brings time\nListen to me hit you with this gangbang rhyme\nNigga, whattup? Who up? YOU up!\nDoggy Dogg is on the mic, I'm here to fuck it izzzup\nI give it to y'all, like you really gotta have it\nDogg Pound Gangstaz, boy, this shit is gettin' tragic\nBut I'mma make me a grip and dip quick\nAnd fuck with my nigga Kid Capri on this G shit\nDial tail and bail with my nigga Slick Ricky\nAnd all you niggas talkin' bullshit can just miss me\nCan't twist me, you fuckin' paper haters\nI'm dippin' in my '98 gold Navigator\nI'm dippin' like a lo-lo\nBouncin', smokin ounces', fo' sho', tho\n\n[Chorus x1.5]", "[Intro]\nSay, Rick, why you keep playin' me and shit?\nThat's some foul shit (I know, I know)\nI stand by you and shit (you're right, you're right)\nNah'msayin? (That's fucked up)\nThat's my word, I should cheat on your ass\n(Nah, don't do that, don't do that)\n\n[Verse 1: Slick Rick]\nBack in the day, we'd slow kiss\nAnd man, I did search for an ulterior motive\n'Cause all your look is sound hype\nI wanna see if you're worthwhile, settlin' down type\nGod knows there's bigger\nSo, observe to see if you're gonna sweat the next nigga\nOh, help me make green light furriers\nYou know in life you can't race around with no worthless\nSo, continue the sequel\nYou weighed in the scale and we lived as free people\nThen disagreein' erupt too\nI don't feel my standards are bein' lived up to\nSo, erection conquers, I ran out, went and had sex in Yonkers\nGod knows that's flakin', jerkin' her\nAnd not the replacement grade is lookin for\n\n[Hook]\nI thought you didn't love him, didn't need? (lay hey hey)\nI thought you said forever, 'til deceased (lay hey hey)\nI swore you were dishonest, do you believe? (lay hey hey)\nI'll search this world forever, are you real? (lay hey hey)\n\n[Verse 2: Slick Rick]\nLow is my time of honor\nFriend material and not that type of barner\nSo, myself out of chump\nWould the problems with havin' worth that type of jump?\nCommitment, Rick act cruddy\nAnd regardless, move made and back studyin'\nStill screamin', thrown and elegance\nGrown, don't play around, grown intelligence\nFix what bother, and another\nIf speed's not made, once again, who gonna suffer?\nStubborn fools game, the mule came\nOver here wit a girl from the old school name\nThough hit and all though back's about wit memories\nAnd that's about it, 'cause\n\n[Hook]\n\n[Verse 3: Slick Rick]\nAn uneasiness kept here\nEven after we made this big giant step here\nWomanhood, somewhere in the basement\nSlowin' down again, so I'm lookin' her replacement\nMusic, poundin' a slow jam\nWit a girl knowin' and down wit the program\nAlthough the honey aim style king\nWould of took groomin' and tamin' the wild thing\nLoud, uneasiness brought out\nStill tried to shove my tongue down the bushy broad mouth\nSpeedin', chasin' after vacant\nTried to string along but I didn't have the patience\nLearned from cussin' and confusion\nBreakin' commandments wasn't a solution\nThough a few minor clicks in relationship, still time to fix things\n\n[Hook x2]", "[Intro]\nKit, where you goin'?\nSorry, Michael, it's Rick the Ruler, I have to go\n\n[Verse 1]\nLights, camera, action, you're on\nGet 'em Ricky D, what's wrong?\nThe crowd's gone\nSo help me out Kit cause this thief has to be caught\nRadio the chief of police, get a report\nChief of police said \"Welp\nI'm sorry Ricky D cause I really can't help\"\nAhh drats I think I'll take a long walk\nKit put your scan on all these rappers in New York\n\"But Michael's callin' me Rick, I have to go\nIf I get a word you'll definitely be the first to know\"\nWell all that night I felt really uptight\nHello?, \"Rick, it's Vance Wright\nThrow on your clothes, I found 'em, they're down town\"\nWord?, \"Someone's havin' a concert and they're using your crown\"\nWhat?, you sure its mine?\n\"Yo Rick, I know the shape of it, come on\"\nYou know your scratches? \"Yeah, plus I got tape of it\"\nGet over my house quick, ride your motorcycle\nKit, Ricky Rick, pick up, forget old Michael\nWell here came the DJ, trucks to say the least\n\"Ayo let me hear the tape,\" it's a complete masterpiece\nYelp, I guess it is, but this one bound to overtake\nI heard a *honk honk*, that's Kit, so let's break\nHere go my rap Kit\nAnalyze a hit, so Kit what's the scoop?\n\"Slick Rick, this one is it\"\n\n[Verse 2]\nWell my tummy was growling while I was chilling in my seat\nWe stopped by McDonald's so I get something to eat\nSkipped the line and the crowd started to break\n\"Hey yo, let me get a Big Mac and a strawberry shake\"\nSomeone snatched me by my neck I thought I must be dead\nInjected me with something, threw a bag over my head\nI felt real weak, word, I couldn't even stand\nI fell, next thing I was being thrust inside a van\nUnconscious, who could be this shady?\nWhen I awoke I was in a room with this lady\n\"So you're the boss, Rick Rick with all the clout?\"\nUh-huh know why'm I tied up and what's this all about?\nAnd this she left the room this was my one chance for hope\nI used my watch lighter to burn away the rope\nThen I's free, I's free, an alarm was alerted\nI made a flying leap through the window and it hurted\nSomeone threw a knife, who could be this trife\nSo I ran and I ran cause I was petro' for my life\nStranded and raw I saw a phone not far\nI radioed in to my supadelic car\nYo, what's with the concert, am I still in it to win it?\n\"Yes I'm in Manhattan and I'll be there in a minute\nAnd oh, by the way, I re-listened to your hit, hey Rick\"\nWhat's the scoop? \"Oh man, this one is it!\"\n\n[Verse 3]\nTight tight security - MAN, they was the softest\nCame in with some cannons and bumrushed the office\nGrabbed up the one who liked to front and pretend\nNo, I don't know who it is, some brother looking like a hen\n\"Let me go, let me go, please,\" you must be dusted\nHand cuffed this brother cause the thief could not be trusted\nGrabbed up my money and my crown that's how I dissed 'em\nI went on the mic, and DJ, man, I'm on the system\nHe warmed up the techniques to show he ain't soft\nThe crowd was up and this is how it started off\n\n[Refrain]\n(Who, who, who is the top choice of them all?)\n\n[Verse 4]\nYo Vance, cut, thanks a lot, who wanna die?\nWe up top, somewhat, forget me not\nThe class that I have won't last\nSoon as I blast, from out the past, dash fast, and here at last\nVance Wright, no man can bring you this\nAnd Ricky Rick, clean shot, cause I'm the king of this", "(​​​​​​​Scratches)​​​​​​​ get, get, get, get, get a lil' stupid... Let's get crazy!\n\n[Verse 1]\nWell it's me (​Rick D)​, and it's time to mingle\nSo wake up world and bus' out my new single\nI take dead bodies and I boost them up live\nSo straighten up and be alert because the ruler's arrived\nNo (​​not uncle Sam)​​ but I can still recruit\nAs (hip-hop commander)​​ of the people's troop\nSo troop be troopers and follow commands\nCause (​​no one can rule like the ruler Rick can)​​\nThough some like it hot and some may like the shock\nSo let's get together what I mean is rock\nNo vanity, insanity (strictly clout)​​\nNow put your hands together and scream and shout\n(Go Slick Rick!)​​ and then go berserk\nBut (keep it at a limit so no one gets hurt)\nAnd don't be boring please not lazy\nMy jam's packed so let's get crazy\n\n(​​​​​​​Scratches)​​​​​​​ get, get, get, get, get a lil' stupid... Let's get crazy!\n\n[Verse 2]\nThe original, that's the title I've earned\nAnybody disagreeing been burnt' and learnt'\nTold a thief straighten up as I humble hell\nAnd I (​​bring a little rhythm)​​ wherever I dwell\nCuz' the door's wide open and I'm taking the chance\nAs I dip through Europe and I'm going to (France)\nNow I always may try and play like full of fun\nBut in this type of rap I number one\nNot number (​​two)​​ on a wild-style blizzard\nAnd if I was in the OZ I'd be (Slick Rick the wizzard)​​\nOr some young man named MC Ricky D\nAnd no fool can say they created me\nSo wild child, let's go berserk\nBut keep it at a limit so no one gets hurt\nAnd don't freeload cuz' I'm not lazy\nMy jam's packed so let's get crazy\n\n(​​​​​​​Scratches)​​​​​​​ get, get, get, get, get a lil' stupid... Let's get crazy! (x4)\n\n​​​(Scratches)​​​​​​​ Oh my God!\nExcuse me, Doug E. Fresh (​​Yes)\n\n(​​​​​​​Scratches)​​​​​​​ get a lil' stupid... Let's get crazy! (x2)\n\n[Verse 3]\nWell we're in the last stage, you know the final chapter\n(Oh Ricky don't go)​​ But you know that I have to\nSo tell me daily news and all the magazines\n(Ricky D's in control)​​ Of what? {​​​​​​​Hip-hop scene}​​​​​​​\nUptown downtown the man's rated supreme\nIf Martin Luther were here he'd say (​​Hey Rick I had a dream)​​\nAnd if I'm at a jam it must be pumping\nPeople dwell us light cuz' it's them I'm stomping\nSo y'all be adventurous (​​Shake and twist)\nI insist that this will bring more than just bliss\nSo posse's and crews' (exercise your best)​​\nIt's time to get (Stupid)​​, what I mean is (​​Fresh)​​\nHey wild child let's go berserk\nBut keep it at a limit so no one gets hurt\nAnd don't be a crumb and try to phase me\nMy jam's stacked so let's get crazy\n\n(​​​​​​​Scratches)​​​​​​​ get, get, get, get, get a lil' stupid... Let's get crazy!", "[Slick Rick]\nIt's me at last, the Rickster, Def Jam's where I be\nAnd most agree it’s kinda amazing folks are born from where we pee at\nThough I definitely fiend it, baby no way, chills, clever mean it being\nGot to be careful (…be told), commercial ever seen it?\nWant a few hot ropes, some ask am I cheatin’, do I? Nope\nNot a dope, love the mother, also loves me too I hope\nSo I dig her a lot and although shorty honey break a nigga\nHow you figure, bein’ a big rap money makin’ nigga\nCute as a button, he tell ’bout the time we picked for cotton\nSo it ain’t forgotten, hope I don’t spoil the nigga rotten\nAlso, don’t discriminate white, he’ll be quite bright, if taught him right\nIf not he like ask heavenly father, help me raise my shorty right\nSo when I come home with the coil, I say “yo shorty run to royal”\nSeein’ as I’m loyal and livin’ on soil, it’s best when you have someone to spoil\nSo any toy, he wants he gets, yo kids ain’t worth it midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy\n\nPictured friends, milk and cookies, when you’re done with the boy’s game\nToy plane, Ricky Jr. being bundle of joy’s name\nAnd furthermore teach birds and bees\nSo won’t be a nerd and burst herds of, second and thirds of\nAnd “Dada” better be the first words of\nJust kiddin’, son’ll be [need] a one man girl, spend a lot on what I be wearin’\nBest of care, best that money can buy is what he’ll be wearin’\nWith these weathers around, protect him, they’ll say in a cage I kept him\nThough wage you kindergarten probably be another major step and\nLo and behold a star holdin’, ‘cause yo be loadin’ trips and sowin’\nYa knowin’, throwin’ a fancy home for him to grow in\n“He’s kinda pleasin’ to raise\"… so baby say. No thank you… ease in\nSneezin’, now what do I do when he cry for no reason?\nThough any toy, he want he get, yo kids it ain’t worth it, midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy, yo\n\nBaby mom, under wing, though if dress up, could string\nLine of cuties, though cling, don’t wanna mess up a good thing\nYou know how it is when guys that pay girls seem to hog us\nFiend and dog us, scheme for more guts\nGoin' into labor date, 18 of August\nIt’s that time tellin’ friends, congratulate’s yellin’\nGonna be six weeks premature, but thanks to God, he’s doin’ well\nAnd givin’ credit where it is due, while rap’s achievin’ let it\nAs for bills forget it, ’cause the way I rap, don’t even sweat it\nMy own when me and my hon son, don’t fuss, agree\nThough son, I still kinda wish I coulda been there when he was born at 3:01\nBygone be gone, there’s nowhere wrong and all\nYour son’s about and since I didn’t and this being the first\nYou know I had to write a rap about the incident\nAnd the rose is for the squeeze, I would’ve sent a few no women with the kin in it\nWish us luck world as we enter a new beginning\nAnd like I said, any toy, I’m tryin’ to tell ya that midst the toys\nThat they destroy, annoy, though me and his moms in middle of fits of joy and it’s a boy", "[Intro x4]\nHow can I forget you?\n\n[Slick Rick]\nRick the Ruler, Raekwon, hehe the Chef, check one, two\n\n[Verse 1: Raekwon]\nTouch more, taste a glass of oil, flash yours Rick\nMoney we saw, left 'em dead on the door, dick\nRocks look chunky on the index\nStraight up, Lee vets and like old Adidas sweats\nWe the illest vets\n\n[Verse 2: Slick Rick]\nApologies, even a non-dog holler \"He's honor\"\nPlease, appreciate shit I Clark Wallabee's\nBrothas wit they fists like oaks wood\nProvokes doom, and you're also about to go broke soon\n\n[Verse 3: Raekwon]\nMad current merchants, we nursed it, bad guerillas\nFeed us like guaranteed they gon' kill us\nFleein', ninety in a night suit, G-in' white dudes\nHit the locks first, we made a right troop\n\n[Verse 4: Slick Rick]\nI'm lushin' Russian women, via satellite I'm watchin'\nI dare a nigga say he wanna battle me, I'll crush him\nEven blind girls rush next to Hammera and scream out\n\"Oh my gosh, get the camera\"\n\n[Chorus: Raekwon]\nYo, we frozen, lay on, about now we a day on\nIll niggas yellin' \"Throw Rick and Rae on\"\nHydro, how did I blow, how did I flow?\nDid I glow? Let them niggas know\n\n[Verse 5: Slick Rick]\n(Yo) Rap wars commence and they kids cause offense\nI don't have to say a word and your bitch' drawers are drenched\nDidn't say I was gonna murder the fella\nBut The Ruler got some shit the could stop a herd of gorillas\n\n[Verse 6: Raekwon]\nStressed wit Hollywood hoes, actin' up\nBackin' up, what? This yours, what?\nCrawlin' in the cut, we Lee Major\nGems on wit Timbs, brims on drawn to lay you up\nLayin' in the 'dezvous, what?\n\n[Verse 7: Slick Rick]\nNext pull up CEO wit bank books full up\nEven though he's overwhelmed, this nigga Rolls Royce pull up\nOne of the baddest come, noddin' to a Spanish song\nSlung, orange Woolridge park and a Savannah pump\n\n[Verse 8: Raekwon]\nSevere teaspoons, scary money on the moon\nLampin' wit a big goon, keep shit tight like a kid's room\nBig Bird in the driveway, pull it out, Friday\nI'm liver that way, I ride only the fly way\nOlive-green thinkin', ship sinkin'\nDeep-dish thinkin', big fish tank, wrist full of Franklins\nThis is mock-neck, shark-skin money\n'88, summer, read the dunn, dummeries rock dungarees\n\n[Verse 9: Slick Rick]\nPunctures his lung, son says \"I don't want this\"\nEven this so-so beat I make monstrous\nLady cops stake to watch pair hoods\n\"Freeze, you're under arrest, you look mad good\"\nHot and don't fret retard who won't let\nThe new sheriff's in town, what part you don't get?\nRick and Rae are now restorin' the passion\nThe fashion, the class, I went to work on your ass\n\n[Chorus x2]", "All alone, no one to be with (in the background throughout the song)\n\nAs a youth, each Sunday, Dawn went to Church and\nPaid her respects and not to mention was a virgin\nKid pushed up, Dawn lettin' him\nSince he made her laugh and all the other girls was sweatin' him\nThen things started to move without pause\nAnd a couple o'months later kid's pushin' for the drawers\nUnder pressure while exchangin' glances\nDawn finally gives in to the sexual advances\nAlthough it was a mad high cost for her\nCuz' after the thrill was gone, so was the lust for her\nEventually he left her for another\nNow feeling alone and betrayed by her lover\nShe cried--for no longer knew which way she headed\nOnce dreamed of actually wearing white at her wedding\nAnd really being pure, now she thought she'd die without\nStill she finds strength to continue with her life without\nLove...\nWithout love...\nWithout love...\nWithout love...\n\nVerse two of Dawn's life--the second segment\nWhat could be worse than to now find out you're pregnant?\nPoor Dawn couldn't sleep--laid awake\nNot ready for a child and plus her mother's gonna break\nAnd she doesn't know how she's gonna bring up the subject\nConsequences of being used as an object\nIn church though time's runnin' thin\nShe decides to have the child because she doesn't want to sin\nProps to the girl although ahead hard times;\nIt was Hell finishin' school and working part-time\nYet Dawn did it though her youth went to waste\nLittle help from the government, she got her own place\nHARD for an independent woman and a kid\nAnd as soon as she could get off the assistance, she did\nWithout no man who she once thought she'd die without\nStill she finds the strength to continue with her life without\nLove...\nLife without love...\nLife without love...\nContinue with her life without love...\n\nWhile Dawn worked two jobs tryin' to meet ends\nHer son was busy cuttin' school and hangin' with his friends\nSo when she got words she tried to slap out the taste in his mouth\nAnd explain how important education is\nUnder stress, she takes two Bufferin\nSon now tired of seein' his poor mother sufferin'\nStarts to sell drugs though the cops did a raid\nGuess who's in the mix, and being legal age\nCould do time, please call her employer\nTo inform her that her son is gonna' need a lawyer\nNever no good news, just more strife\nDawn barely havin' enough time to live her own life\nHears the judge's sentence, beggin' and pleadin'\nNow spends nine hours on the bus to go and see him\nHere's the judge's sentence, beggin' and pleadin'\nNow spends nine hours on the bus to go and see him\nWithout no man who she once thought she'd die without\nStill she finds the strength to continue with her life without\nLove...\nLife without love...\nLife without love...\nLife without love...\nContinues life without love...", "[Slick Rick]\nCheck, check, check, check\nCheck, check.. * Slick Rick starts humming a snake charmer song *\nYeah..\nThey say.. that Rick Rick is..\n\nYou're all garbage, that type talk I'm on\nDumb one becomin glad the great one walks among\nWhisperin, couple I scuffle eye\nYou little feedback niggas don't want any trouble\nRick'll own clout, sewn bout\nLick a throw now, how til death I kick a bone out\nWhy pursue for folk object?\nMy record will be barkin all through your broke project\n?? Yes my dog art, best to park her, kark her ??\nYou don't want death to walk her\nNot sayin that -- ain't nuttin could do me\nBut in the rap game, all secondary to me\nWHOA, whatever I settle\nIf a nigga wanna eat he better never cry battle\nHell yeah, ram the one sell fare elsewhere\nPut you and your family on welfare\n\nChorus: Canibus\n\n(Ricky D!) Rip it up, your watery blood\nAin't thick enough, yo wack niggas ain't slick enough\nReady and willin to face you, death awaits you\nThe king piece in the chess game, to checkmate you\n\n[Slick Rick]\nOoooooooooh, twist shot bitch, ?? voter ignores ??\nWatch toys duck, consider rap's ultimate voicebox\nDevour, and addressin dem coward\nHow can one man posess so much power?\nRhyme tearin through, bash all trifle\nThe eyes and spare a few assholes lives\nThis object -- brothers are glued to knob lick\n'Scuse me, if I'm bein overly rude to public\nThe favorite -- make you fall in love, make whoever with\nClever kid, make you do the best steps you ever did\nThe trick is, managin to kick it\nIt's no such thing as challenging the Slickest\nIt's double-or-sure shot, crumble before spot\n(I know) Must be humble before God\nRinging, cat must fear king-ing\nParty over here, type atmosphere spinning\n\nChorus\n\n[Slick Rick]\nOoooooooooh, I toy your cheddar top-netter\nYou find me a human being, boy or girl bet-ter\nIt's short son -- nurse and them soundkick bark on\nStop talk, stop worshipin the ground Rick walk on\nBitch play number one bougie\nWish they could give motherfucker some pussy\nSeen the face of supreme in tasteness\nNever see another human being this greatness\nSuccessful, and the hype is effectful and\nSorry God if bein any type disrespectful and\nHip-hop, assume pop's acquited\nNow with tick-tock, you don't stop, hit it!\nCommand Rick, shower the firmament\nEarnin it, tremendous power is permanent\nUnless frame interest dame\nLet's name who the king piece in the chess game\n\nChorus 4X\n\n[Canibus]\nYo, we can battle in front of the castle, I'll disgrace you\nI roast you, I burn you, I bake you\nI cremate you -- I motherfuckin hate you!\nThe king piece in the chess game'll check mate you, nigga!\nRicky D y'all..", "[Intro]\nOh dear, Scooby Doo do\nOh gosh, Scooby Doo do\nRicky needs a lover that's true\nShow me the love that's true\nShow me the love that's true\nShow me the love that's true\n\n[Verse]\nSnap outta dat and I bet I snap outta dat\nSnap outta dat and I bet so that -\nAny time a girl a-flip on you like acrobat\nAny time a girl a come wi too much back chat\nCome now back to the bed, to dolly all to that\nCome on to that, you damn a pure alley rat\nMost sent to Mr. Fabulous and learn how fi act\nNobody make mi alley rat come challenge hijack\nWe know some boy wi know's a idiot, a idiot\nHolding you back, holding you back\nGirl I hold you back\nSnap out, then run out,  race soldier\nTrue anytime you touch I make a million fi that\nAny time Ricky-D chat dance must start\nThink he annoying, then, girl now I know that\nShe may never know - give plenty a gal heart-attack\nEverything you got, now you know I carry on the response\nWhen we check it out dominate we pure tit-for-tat\nHey can ya man one glimpse o' them attract?\nResponsibility, they never want to factor that\nThey want all a ten-thousand dollar fract'\nSo sit with Mr. Fabulous and learn how fi act\nAnd any type of girl a-use ya money fi ya drug\nAny type of girl em have negative impact\nYour type of girl and not intelligent intact\nTime enough, I know I deserve better than that\nLooks are not the only that they got to distract\nSaid the looks are not coming on strap, better on chat\n\n[Hook]\nScooby Doo do\nScooby Doo do\nAh ha ha\n\n[Outro]\nDad loves you, dad's love is true\nHeaven on earth, when dad's with you\nSon please know dad's love is true\nTogether we'll make it just us two", "[Slick Rick]\nCall me the freaker, I bump it in ya speaker\nWeek on my birthday, met this girl named Tameka\nAstonishing creature, made the rest look tired\nDesired, that was the beauty I admired\nOut by the 41 Brook, no joke\nCan I have a toke, finally, she smiled and smoked\nGave the girl my number, though I still felt rejected\nHectic, called me more than I expected\nMonths passed by, even lived together and all\nDream come true, until suddenly a call\nOh brother, why do I discover\nMy honey, Tameka, yeah callin me another\nBroke-hearted again, it offend and I pretend\nMistakes of a woman in love with other men\n\n\"How low can go\"/\"Hold it now\" (4X)\n\n[Slick Rick]\nWell, tried to block it out my mind, here it was again:\nOther men, confronted lady and she said he was a friend\nDidn't believe her, she packed, brave her\nStrange behavior, so silly, we forgave her\nLate again Thursday, alone Rick sat\nLeft flat, look in the mirror and I wonder where she at\nGave the girl my heart and soul, it's after 10\nAnd again couldn't manage if she slept wit other men\nOut wearing my jewelry so you know she looked truck\nStruck 3 o'clock, here she come, fishy like a fuck\nCome and let me smell you, I wanted to say to hell you\nHi honey, sorry I'm late, but let me tell you\nIt's a fast chat, need the phone, slow rollin\nCould you go to the store and get some soda cuz they open\nAgain it offend and I pretend\nMistakes of a woman in love with other men\n\n\"How low can go\"/\"Hold it now\" (8X)\n\n[Slick Rick]\nStrike one, strike two, no exaggeration\nTry to play it off like it was my imagination\nBeer mix wit alcohol, help me to forgive\nDeal wit weak minded and I have no will to live\nI deserve honesty, and treated like a pet\nNow she's being nice, but no I still can't forget\nPut the cards on the table, don't get loud, cut the bull out\nIf you slept wit another man, I'm strong enough to pull out\nShe confess and then she left, smooth\nWanted to kill myself because to live ain't the move\nBroke-hearted again, it offend and I pretend\nMistakes of a woman in love with other men\nOnce again it offend, and I pretend\nMistakes of a woman in love with other men\nOnce again it offend, and I pretend\nMistakes of a woman in love with other men\nOnce again it offend, and I pretend\nMistakes... in love with other men\n\nHow low can you -- how low can you go (to end)", "* originally appeared on the Rush Hour soundtrack\n\n[Intro: (DJ S&S), Slick Rick]\n(Uhh check it out..... S&S......\nRick the Ruler '98........Def Jam.....)\nAnd here we are, in the phase again\nThat ol' funeral music, is he goin to heaven or is he goin to hell?\nI don't know, he's right in the centre, y'knowhutImean? (Uhh uhh)\n(Uhh-huh huh, uhh-huh huh, uhh-huh huh, uhh-huh c'mon\nUhh-huh yeah, uhh-huh c'mon, uhh-huh '98 c'mon.....)\n\n[Verse 1]\nNigga no way any rap better than, act better, that\nVeteran of rap *?ceteran?*\nBrung on, motherfucker sung on, run on\nCome on, go and have fun on, run on\nImmediate, conceited?, no he really ain't\nThe main ingredient, comedian, must be obedient\nReason why the player who away a few, say that too\nCos no one else can talk shit way I do\nSchool kid, the cool slid\nAnd I rule wid, still shoot wid my tool kid\nAin't no way on Earth to faze Rick, the man plays with wit\nEras-ed the man amazin the bassin\nBorder him, all on ya albums slaughterin\nBetter spin like slavery when I order him\nRejects creep yet keep step\nEvery borough, every state, every country in deep check\n\n[Chorus]\nMack all of it, controller shit, catch hold of it\nHow you gonna move Slick when cats lack soul to Rick\nAccept, yet no chances that they make plans\nTo wreck and make a nigga, breakdance the record\nI turned and learned this sequel I burned went\nUrgent, mad white people like servin\nInterested with, gets congested with\nClowns, haven't made a record yet, impress the kid", "[Verse 2]\nNo entry, let's keep a hood rhymin shit (A-party people)\nAre you tryin to have yourself a good time or what?\nNo stressin you, type of beat bring out the best in you\nAllegeble, ruler came to add a touch of blessing to\nNiggas think they bashin me, his majesty\nAre garbage and never were no match for me and actually\nMany a girl catch this fever\nAnd I don't need anyone else rap with either\nIf this is based on skill, kill anybody will\nAffiliate Rick grill to Hicksville\nSame ruler move with cowardness out of this\nNever out power this, devour this and now it is\nTime for one to leave upon impeach\nHelp teach all men how to live amongst each (KnowI'msayin?)\nAlthough a lotta creep yet keeps\nEvery borough, every state, every country in deep check\n\n[Chorus]\nMack all of it, controller shit, catch hold of it\nHow you gonna move Slick when cats lack soul to Rick\nAccept, yet no chances that they make plans\nTo wreck and make a nigga, breakdance the record\nI turned and learned this sequel I burned went\nUrgent, mad white people like servin\nInterested with, gets congested with\nClowns, haven't made a record yet, impress the kid\n\n[Verse 3]\nThe bounce men, S&S sound bend\nListen up kid, an important announcement\nThere's a rapper I know many interested in\nNamed Rick, no rapper alive could mess with him\nMakes records all audience roar to\nGrandmothers show, skill on the dance floor too\nFreakin awesome, of course I'm married\nHigh school broads keep your drawers on\nCos this one in perf' pace\nGuaranteed to make you break fool at the work place\nDiligent, shout out Mr. Militant\nAllow me to do my thing, it's all brilliant\nAlthough sometime the reign may slip\nCan't skip my part on the humane tip\nAin't shit, you rejects creep yet keep step\nEvery borough, every state, every country in deep check\n\n[Chorus]\nMack all of it, controller shit, catch hold of it\nHow you gonna move Slick when cats lack soul to Rick\nAccept, yet no chances that they make plans\nTo wreck and make a nigga, breakdance the record\nI turned and learned this sequel I burned went\nUrgent, mad white people like servin\nInterested with, gets congested with\nClowns, haven't made a record yet, impress the kid\n\n[Outro: DJ S&S]\nSlick Rick and S&S now, c'mon\nSlick Rick and S&S now, c'mon\nSlick Rick'll make ya move your butt, c'mon\nS&S'll make ya move your butt\nThrow your hands up, throw your hands up\nThrow your hands up, throw your hands up\nS&S and Slick Rick'll make ya move your butt\nSlick Rick and S&S'll make ya throw your hands up\nS&S and Slick Rick make ya move your butt\nS&S'll make ya throw your hands up, c'mon\nSlick Rick'll make ya throw your hands up, c'mon\nS&S'll make ya move your butt now c'mon\nYeah c'mon, yeah c'mon\nYeah, S&S and we're out, OOOOHHHHH!!!!!", "* cut and scratched \"Slick Rick\" *\n* audience applause *\n\n* siren sounds *\n\"MC... Ricky... D\" * last syllable scratched *\n\"Okay party people in the house\" * scratched *\n\"This is the original grand wizard\"\n* cut and scratched \"Slick Rick\" *\n[Sample] * scratched \"Slick Rick\" *\n\"Something funky push that in em\"\n\"Ricky... D\"\n\n[Slick Rick]\nIs it a custom - to what? To provoke out a hostile apostle\nAnd make him smack the coke out your nostril\nBAP, the butter cat at gutter rappin and I'm all man\nWhatever gotta happen gotta happen\nBoy don't make me put my grown man shoe in you\nAnd I'm sorry father, for any wrongdoing doin you\nCause dogs barkin and the girl sigh\nHere to present myself as the sparkle of the world's eye\nPicture I - where Spice Girls chick arrived\nEngland, January 14th, six-five\nWhile you scream out \"Grannyville\nYou old ass rapper!\" You got it, but can he still\nSever, in other words, rap more clever\nLike no other younger rapper walkin could ever?\nApparently I done this, on this\nStunned his behind - out the way of who reign\nI RUN THIS\n\n\"Hurry up, run\" * cut and scratched*\n\"Run, run, run, r-run\" * scratched from Run-D.M.C.*\n\"Hurry up, run\" * cut and scratched*\n[Rick] Out the way of who reign, I RUN THIS\n\"Run.. run, r-run\" * scratched from Run-D.M.C.*\n[Rick] Stop the world kid, bring it home Slick\n\"run, r-run\" \"run, r-run\"", "[Slick Rick]\nAre, you, ready? \"run\"\nThe fact is, mack caught cable in an actress\nAnd really is the black Clark Gable of the rap biz\nRacists reactin, hastin for action\nThe motherfucker got exquisite taste for a black man\nWhat you never know? All clothes come off a ho\nEver see me with my jewels and toast from off of Mo'?\n*psssh* Past where handsome measures\nLike the whole entire Rat Pack, AND some precious\nAnd chartable, such a big spark I pull\nNuns even say, \"That motherfucker's remarkable!\"\nAnd aliens who came to earth gathering\n\"Great gosh the man has soul, we must have him\"\nLike a catastrophe, there isn't none after me\nLiz will throw away her walker and run after me\nSnatch crowns -- done this, on this\nStunned his behind - out the way of who reign\nI RUN THIS\n\n\"Hurry up, run\" * cut and scratched*\n\"Run, run, run, r-run\" * scratched from Run-D.M.C.*\n\"Hurry up, run\" * cut and scratched*\n[Rick] Out the way of who reign, I RUN THIS\n\"run, r-run\" \"as we go\" \"run, r-run\"\n\"run, r-run\" \"as we go\" \"run, r-run\"\n\"run, r-run\" \"as we go\" \"run, r-run\"\n\"as we go a little somethin like this, HIT IT!\"\n\n[Slick Rick]\nUp Hastings, crew downfaced and lose\nEither one way or the other, foundation choose\nAlthough the prune I kick, I didn't come to wound a sick child\nHit a lost world, actin like a lunatic *blblblblbl*\nWho provoke til a heard of smoke\nForced good men to pull out and start to murder folk\nTired of the basement placed in\nTake responsibility for your action as a race then\nInstead of put cheer in our bone, paperhood promote\nNegativity, and fear in our own neighborhood\nSince royalty breed to be (uh-huh)\nAnd I puts small seed where small seed need to be\nLike an angel tend to fly as, mention I as\nI didn't make the laws, but they make sense to my ass\nWhile waiting for the world end, won this\nStunned his behind - out the way of who reign\nI RUN THIS\n\n[Rick] See what I mean kid?\n\"Hurry up, run\" * cut and scratched*\n[Rick] That patch-eyed motherfucker RUN THIS\n\"Run, run, run, r-run\" * scratched from Run-D.M.C.*\n\"Hurry up, run\" * cut and scratched*\n[Rick] I RUN THIS\n\"run, r-run\" \"run, r-run\"\n\"run, r-run\" \"run, r-run\"\n\"run, r-run\" \"run, r-run\"\nAre, you, ready?? \"run\"\n[Rick] RUN THISSSSSSSSSSSSSSSSSS\n\"Hurry up, run\" * cut and scratched*\n\"Run, run, run, r-run\" * scratched from Run-D.M.C.*\n\"Hurry up, run\" * cut and scratched*\n\n[Slick Rick]\nYeah BABY, Slick Rick\n1999, 2000, the whole damn thing kid it's all mine\nGo AWAY\n\n\"MC\" *scratched* \"Ricky D\" *last syllable scratched to fade*", "[Slick Rick]\nWell, I waited long time sweatin it\nGettin jerked but yea I'm gettin it\nEarly mornin, stiff's the dawnin' of\nCuz a brother give the warnin' of\nA new we do we and\nParanoid to near silly and\nI said meet me in the lobby skip\nSo one could cut down on the chubby tip\nAlright, he flighty scared\nTo be in fear to show a mighty that\nLa Di Da Di wanted Gotti and\nAlthough depending on the body and\nWho I know was gonna runaway, how am I to live to serve the next day\nWhen I know she's gonna be wit him, so hallelujah, praise God's King\n\n[samples]\n\n[Slick Rick]\nCheck it out, even candle light I figure and\nBetter handle it my nigga and\nI think the best thing is to block her out\nCuz she doesn't give a fuck about\nSomeone change the choony and\nYou would of cared to wish the u-nion\nShe's not a phony, turn the Sony off\nYou better overcome the lonely of\nAlthough a brother leaden bad\nThus don't know where I'm headin at\nYou see, cause even though we fought a bit\nI find that just the very thought of it\nWhen I know she's gonna runaway, how am I to live to serve the next day\nWhen I know she's gonna be wit him, so hallelujah, praise God's King\nAnd I know you're gonna runaway, am I to live to serve the next day\nWhen I know you gonna be wit him, can't believe that this is happenin\n\n[samples]\n\n[Slick Rick]\nWell, I should say fine phoney gone\nAlthough you say that I'm the only one\nBut, behind my back's thinkin of\nHer father not the one I'm thinkin of\nI'm distrustful what one done to end\nDown wit this burden here I'm wonderin\nI know I should say fine fair to ya\nAnd think about all the girls ahead of ya\nThough hard for me to just forget her and\nTry to follow to the letter end\nAlthough the terrible things we riff about\nHer father wise that I can't live without\nWhen I know you're gonna runaway, how am I to live to serve the next day\nWhen I know you gonna be wit him, so hallelujah, praise God King\nWhen I know you're gonna runaway, am I to live to serve the next day\nWhen I know you gonna be wit him, can't believe this is happenin\nI know you're gonna runaway, I know you're gonna be wit him\nSeems I know you're gonna runaway, I know you're gonna be wit him\nCan't believe this is happenin", "All the lonely guys.. {*echoes*}\n\nJust gettin' off my job, ‘round Wall Street, with the ties on\nFinest girl, a brother think he ever set eyes on\nNice day, weather sunny, as he made a run for honey\nWith a warm personality, well it’s on the money\nI’d have tounged her right there, seemed kinda fun up there\nWonderin’ there, as he tellin' me he could get the underwear\nMeanwhile, still jockin' her, like a real sucka\nSister which was so fine, she could have AIDS, I’ll still knock her\nHeart beatin' for her since a brother didn’t figure meetin'\nAs I ask her if she’s single, “yeah, caught my nigga cheatin'”\n“Nice to meet ya”. Leaves… she had dope combined features\nWatched her walk away and observin' the fine creature\nNext day again, went in uninvite[d], super angry with us\nRan into so much that her and her friends had start to hang with us\nThey pair and move, though fine, they both swine\n“Can I take you out to movies wine, dine, the whole nine?”\nShe condones, good riddance, nigga slid this on her\nDidn’t want to get to bone her, though I knew I didn’t own her\nAnd I could’ve made a move, a little will power ‘cause although\nThat she told me she liked him as a friend and that was all\nAnd since hang with us, she already told her, cool he freaked her\nThe week on my birthday bought me a pair of Gucci sneakers\n“Did she like me?”, racin’ the thought. “Was it a sign?” Guess it weren’t immoral\nWhen she saw me, definitely this is kinda special\nSince for this dish, none abate, but everybody wanna play\n“How long is money gonna wait?” So I asked a honey on a date\nAnd she accepts, though thought it wasn’t much [of] a plan\nWindows on the world, even had the nerve to touch her hand\nThough not lookin' at. Bashful? No sir\nSuppose I was so shy and then the hon' pulls closer\nThought “clever hint”, so what she straight, never been so excited\nAnd convinced, kiss, in heaven ever since\nHoldin' her hand too, chillin', future plan to build\nCouldn’t believe my dream fulfilled and then that girl began to ill by sayin'\n\nLady if you will\nSay you’re the one that sent for me to thrill\nSomeone that I can hold close in my arms\nWith all the charms of you\nAll the charms of you\nOf a lady, this world is just for ladies\nA heart screams out to ladies\nA world of love’s for you", "* Slick Rick *\n+ Doug E Fresh. +\n@ both @\n\n*Excuse me Doug E Fresh.*\n+Yes?+\n*Have you ever seen a show with fellas on the mic Wit one minute rhymes that don't come out right?They Bite*\n+They never write! +\n*that's not polite! Am I lying? *\n+No, you're quite right!+\n*But tonight on this very mic you're about to hear*\n@We swear the best star rappers of the year So@\n+so+ *cheerio* +yo scream+\n@bravo also if you didn't know this is called the show@\n\n*ayo Doug\n+What?\n*Put your ballies on!*\n+Yo Rick I was about to but I need a shoehorn!+\n*Why*\n+ Because the shoes always hurt my corns!  +\n*6 minutes 6, minutes 6, minutes Doug E Fresh. you're on!*\n@Ah on ah, ah on ah, ah ah ah ah ah ah on(2x)\n\n+Here We go (Here we go) +C'mon\n(C'mon) (2x) +Yo\n\n+ Where's will and barr +\n*Well I don't know they're late\nTold 'em the time - oh, I forgot the date! *\n+Man You did it again oh, no +\n(Yo Here, we go c'mon, here, we go c'mon, here, we go did We miss the show?)\n+ No No, n-n-n-no we didn't (what) No\nN-n-n-n-no, we didn't (w-w-w-what) No +\nWe didn't well, don't get us wrong\n*Excuse me Doug E- excuse me Doug E- Excuse\nMe Doug E Fresh, you're on\nAh Ah on on, on, on, on, *\n\n+Well... It started up on 8th Avenue And\nI made up the name\n@ the Get Fresh Crew @\n+ It was me my, two dj's Chill Will and Barry B and, My Right hand man Ricky D\nI Used to rap and sing make sounds and things For\nExample here's, a telephone ring\n[ring Ring]+\n*Hello is Doug E Fresh there? *\n(No He's not in right now)\n+But Anyway no more delay Just\nCheck out the new style I display Now\nYou got to be fresh to rock wit fresh And\nI'm D-O-U-G-I-E Fresh And\nI'm know for the (sound effects) Not\nFor the (sound effects) The\nHuman beat box or the entertainer No\nOther title that fits me plainer In\nA passing generation I am a remainder And\nI'm also known as a beat box trainer\nCashing checks make sound effects And\nAfter I'm finish rocking Slick, Rick is on next (You\nKnow it) Slick Rick\n\n*Well here's, a little something that needs to be heard Doug\nI, was going downtown (+Word Rick?+) word (+Sure+)\nAll along no, one to be wit Step\nOn the D-train 205th, I\nSaw a pretty girl (so) So\nI sat beside her Then\nShe went roar like she was Tony the Tiger I\nSaid oh, no there has been a mistake Honey\nMy name's Slick Rick, not Frosty Flakes! (oh\nGolly, wolly) She was raising hell She\nSaid um, my, name is Maggie but you can call me Michelle\n\nMichelle, Ma belle Sont\nDes mots qui vont très bien ensemble Très\nBien ensemble\n\nSlick Rick and I'll rock the house you, know what I'm sayin And\nWhen I 'm on the mic there won't be no delayin Bust\nA move we, show and prove Hey\nYo, Doug, do, that record jam on a groove! *", "[Verse 1: Slick Rick]\nAll of you cock pullers are frontin'\nWave your arms around like you're some octopus or somethin'\nTo better you, for any chick you want, I'm gettin' her\nRob people, mad ignorant, et cetera\nWho the one to entertain and fume with?\nWho you know breed humans can't be in the same room with?\nReefer sweet, wrap it up, free fix greet\nEvery rapper rap maggot underneath Rick's feet\nEvicted, why you tryin' to find shit to lick with?\nEven your kids tell you that you ain't shit to Slick Rick\nThough you pretend to be glory\nI'm number one, that's the end of the story\nThe black Clark Gable leave you numb\nEvery single one frontin' on your label is a bum\nLet me slow it down, that's enough of that\nThis I have to say to you nothing other rapper cats\n\n[Hook: Slick Rick] (x2)\nFrom New York to Cali none'll fuck with the awkward\nYou think Muhammad Ali used to talk shit\nBing, this sure hit alone'll bury ya\nAnd even I got deported, I own America\n\n[Verse 2: Slick Rick]\nHe's so crazy, I smash rippin' up the place\nGive the mack a taste, I wipe my ass with a rapper face\nCars come to a dead stop\nRain find ways not to drop on my head top\nTycoon rush at the richest\nEven my complexion is a must have to bitches\nEven without car money to budget\nI would have the most elegant apartment in the Projects\nKnow what I mean?\nBitches are in awe at the lingo\nKnow that Rick'll put an end to all rapper income\nAn old-timer, lock up all vagina fields\nFrance nor Italy can fuck with my designer skills\nSaltin' inferior, faultin' to where we are\nTryin to find fault in superior\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\n[Hook: Slick Rick] (x2)\n\n[Verse 3: Slick Rick]\nYou lack the taste hook I'm stickin' 'em with\nWhile degenerate like yourself make our race look ignorant\nAnd your girlfriend wanna kiss and deploy\n'Bout in the groin gets none of this tenderloin\nFeet planted on deep black firmament\nBow in the presence of who lead rap permanent\nLike a lion rap rips a chunk of kids\nYou stunk cause mortals ain't shit to conquer\nSomebody said new pharaohs have appeared\nHow when everything I wore ten years ago, you wear now\nI coulda murder heard a word out quick Rick stomp it kid\nHung to it, you complete bum to Rick\nSource Awards, yeah, Rick every seminar\nEven make Saddam Hussein tell me where the weapon are\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\n[Hook: Slick Rick] (x2)\n\n[Outro]\nYeah, from New York to Cali none'll fuck with the awkward\nYou think Muhammad Ali used to talk shit\nBing, biatch", "(Chorus)\nWhat a surpriser, Open your eyes, A Woman advisor\n\n(Verse 1)\nThe name of this entertainement is 'Women lose weight'\nOur first years of mariage everything was just great\nBut after two kids And a weight gain factor\nThe fact is Now she's completely unattractive\nLook fat chicks I don't mean to sound rude\nI tell her nice hit the gym And don't eat so much food\nBut no Your shallow\nYou need to run the course of unconditionnal love and so forth\nBut how if desire's is not there That's just delayment\nDivorce is, child support, alimony payments\nMy happiness i doubt discouraged\nSo hurry for an easier way out of this marriage\nMeanwhile my secretary June well groomed\nWhen you gonna leave your wife I tell her soon mommy soon, i assume\nOr my destiny is blue Interestingly The only thing left for me to do is to kill her\n\n(Chorus)\nWhat a surpriser, Open your eyes, A Woman advisor\nI'm gonna have to kill her\nOf course there's laws which enforces divorces\nSend that ass right to the morgue miss\nWhat a surpriser, Open your eyes, A Woman advisor\nI'm gonna have to kill her\nOf course there's laws which enforces divorces\nSend that ass right to the morgue miss\n\n(Verse 2)\nMy plans against or shenanigans Kinda ran thin\nKnowin' nothing about poisoning And i can't swim\nBad intentions pumping Might as well become numb\nCut her lungs or the obvious robbery gone wrong\nBut the catch is do i have the nerve to dispatch this\nWho can i get to help me murder this fat chick\nI guess i'll have to play a dude robbin\nOn wednesday The day she usually goes food shopping\nAnyway long story short hit the side of her Chrysler\nAnd sent her clean over the divider\n\"You bastard\" she said\nAs the wreck went tumblin down the hill I thought \"she has to be dead\"\nLater on get a call (from a) Lieutenant O'Rourke\n(had me) leapin like a frog We need you at the morgue\nSo i selfishly persue\n\"boohoo\" there was nothing else for me to do i had to kill her\n\n(Chorus)\nWhat a surpriser, Open your eyes, A Woman advisor\nC'mon ya'll know i had to kill her\nOf course there's laws which enforces divorces\nSend that ass right to the morgue miss Kill her\nWhat a surpriser Open your eyes, A Woman advisor\nI had to kill her\nOf course there's laws which enforces divorces\nSend that ass right to the morgue miss\n\n(Verse 3)\nSo you mean to tell me officer you don't have no clue who did this hit and run\nNo sir we don't have no clues right now\nThis is terrible what am i gonna tell the kids?\nPull yourself together sir\nI'm so broken up inside i just can't believe this\nI understand, I understand\nCatch the person who did this\nWe're gonna try sir Please\nScreamin \"who done took my heart\" acting shakin up a lot\nAt the funeral though everyone was lookin at me odd like i did it\nLike i was the reason my mates slain murmuring\n\"I heard he was displeased with her weight gain\"\nWhile my secretary sort of a sexy blonde can't cook\nAll she does is order from restaurants\nAll of the sex you want I doubt could adress\nClothes not washed proper and house look a mess and\nTalkin to detectives that was waitin outside\nHow i took a long lunch break day the wife died\nI darn near turned pale\nAnd because of betrayal they indicted me, and gave me an impossible bail\nGood fortune to anyone admiring the rawtent\nMoral of the story is\nDesire is important\nSo watch your weight It'll keep you mate smitten it's a given\nThough looking back i realised i didn't have to kill her\n\n(Chorus)\nWhat a surpriser Open your eyes, A Woman advisor\nI didn't have to kill her\nOf course there's laws which enforces divorces\nSend that ass right to the morgue miss\nI killed her\nWhat a surpriser Open your eyes, A Woman advisor\nI didn't have to kill her\nOf course there's laws which enforces divorces\nSend that ass right to the morgue miss\n\nWell there you have it Keep thin trim Keep your mariage healthy Do you know what i mean?\nSmall message from Morcheeba and Slick Rick the ruler\nPeace", "[Slick Rick]\nYeah kid..\n\nWell first of all, sit your, cause I'm Victor\nThe Ruler decorate a record just like a picture\nSlicker licker isn't this vigorous\nMotherfucker too Don Suave for any nigga it's\nI sold that offender\nShort killer note is that I wrote a tremendous\nOld neighborhood chow, now Rick vow\nEven rich niggas must bow now\nExtrordinarily handsome, grandson\nPack your bags, suitcase out the mansion\nAny time that you wish that - I flow that\nA whole bunch of big shots bums, now you know that\nOpinions, wifepiece - hers fat\nYou wish a rapper could be better than perfect\nCandidate, who talk shit anyway\nAnd this is what most bitch walk this planet say\n\nRicky your rappin is trapped in me\nRicky your rappin is trapped in me\nYour rappin is trapped in me\nYour vocals is trapped in me\nYour voice gets trapped in me\nYour lyrics is trapped in me\nYour vocals is trapped in me..\n\nYeah, yeah, yeah, yeah\nFecal sick of it, through the thick of it\nEven my cat like, \"Ricky you the nigga kid\"\nCertain rappers earned thou on shit\nWatch them nigga ass squirm now in front Rick\nHow dare you figure it out one come fair\nNigga career, buried now somewhere\nGladys Pips and off her, force her\nEven back when I was the fattest shit the world saw\nDJ, attack the eight track\nWhite black motherfuckin men RCA jacks\nRoyal, holla me, all y'all know I lead you\nFollow me, all four\nCenterpiece, narrow in the shit ass\nWhite House bounces off the power that the kid has\nWhile other rap plunderin under ya\nYou incredible, unstoppable wonder you\nCandidate, who talk shit anyway\nAnd this is what most bitch walk this planet say\n\nRicky your vocals is trapped in me\nRick your voice gets trapped in me\nRicky your lyrics is trapped in me\nRicky your rappin is trapped in me\nRick your voice gets trapped in me\nRicky your style gets lost in me\nRicky your lovin gets trapped to a T\n\nEyepatch and kneel, don't well that's a heel\nCan't even go to the bathroom mat for real\nVision, won't patch eye kiss of the\nThree gay niggas pushin up like prisoner\nCan't stand it - and the Ricky is organic\nOn the real, got too much style for this planet\nWoman hard mark, old charcoal nigga\nDon't make me get the jewels start sparkle\nAnytime you hear the La-Di-Da-Di start\nBitch underwear been flung off the bodypart\nAnd find, they assembling grand rhyme\nCan't find, I'm overwhelming to mankind\nWhy discrepancies erupt to\nAnd play with intelligence you cannot measure up to\nCandidate, who talk shit anyway\nAnd this is what most bitch walk this planet say\n\nRicky your rap gets trapped in me\nRicky your vocals get trapped in me\nRick your voice gets trapped in me\nRicky your lyrics get trapped in me\nRicky your lovin gets trapped in me\nRicky your style gets trapped in me\nRicky your lovin gets rocked in me..", "Cuz it's wrong...\nCuz it's wrong...\n\n[Slick Rick]\nSang my songs, stuck in my tongue, girl strung\nSweating among them was a hun\n'Got a man, but we not getting along'\nLick the balls, I know some girls that lick it, not around dick it\nRick it's amazing how you rap, word up, you sound wicked\nDo I dig her, silly pressure, picture drig up, do a drig up\nIf you only knew how good, Rick, you look into mirror\nBuck perfect, to her car, said when I walk, not ever\nTell her 'call me later on, just to talk, or whatever'\nStirring it up, learn the digits, to be safe, burn it up\nAnd here's another Slick Rick one, and her man turned it up\nNow on the strap, very soon, she be all hot wanna rap\nSome cat over there, but Rick, ain't nothing gonna happen\nComes over, stuck my tongue in her mouth, she gave me a hickey\nShocked me, the way she jock, truck me not, me Ricky not\nKnown to faking, and you probably kidding rock, just something\nThought your ho strung, nah, didn't knock on tongue\n\nCuz it's wrong...\nCuz it's wrong...\n\n[Slick Rick]\nAnother honey, real sneaky, lines thrown on the freak\nSends money, works away, but he be home on the weekend\nWanna say your best, I'm charging the rest though\nSends the guest off, now massaging the breast off\nWhile I'm getting info out of her, girlfriend side of her\nDoing this already, I be in that and out of here\nAsk her friend, what poet best? Rap my vote\nDon't know, girlfriend asking like down to cut throat\nYou seem too hard for the rest of the them, met all into them\nGet to a friend, sometime today, so we can get all into\nSo then friend said don't take all day, whore, I mean\nDrops her number on the floor, make sure the dog seen it\nAlone asked, can you help me rap, maybe, winking\nThink me, you go far, oh yeah, that's it, baby, drink it\nDon't effecting on your pop, kid rock just one\nThough your ho strung, nah, didn't knock on tongue\n\nCuz it's wrong...\nCuz it's wrong...\nCuz it's wrong...\nCuz it's wrong...\n\n[Slick Rick]\nA good look strike ya ho, you attack mic, it's on\nI wanna ask is that really real? Bitch, act like you know\nGive me a line for your joint, make to every story define me\nGetting noisy, everybody leave, but you close the door behind me\nLeft your man dressing room, you try to diss me cuz you rule in school\nI said word, so won't you kiss me, you fool\nShoulder shook, she popped why not, another fan of word, on the lord\nWell anyway like an autograph and a cut\nMade my move to triple excitement, stop Rick, you're flipping\nAs I grind against her pussy and I gently lick her nipple\nLess than a minute, warmth is missing, look at the high in her dressing\nLights off, pull panties to the hide and caressing\nMass roll the plan of life, wonder keep her in, passed off\nBolt than she sang, more deeper than my pants off\nDon't effect and now you pop, kid and rock, just stop\nNo strung, no I didn't knock on tongue\n\nCuz it's wrong...\nCuz it's wrong...\nCuz it's wrong...\nCuz it's wrong...", "[Slick Rick]\nAs you see Ruler show's, is Inquiring noses\nGoin into a story about a kid named Moses\nOnce a prophet was to be born, so for anything else furve it\nFear of orders, every first born, some murdered\nOne got away, a girl wit profit for a river\nGently put him in a basket, went floatin down a river\nThen hands up by a fair up relative, or honey peep it\nCouldn't be the severed, once determined to keep\nDon't say a word, she told this slim, who was a real witch\nSnitch, it'll definetly be the last day you breathin\nWild kids slaughter, cuz they was fronted them\nSoldiers tellin the kid that they murdered every one of them\nThanks said Pharoah, guys little friend tips\nSister showin her baby sayin her River God sent it\nTo a brother who arose and said, \"whoa sis\"\nCure as I suppose this, the upward knows about Moses\n\n[whistling and samples]\n\n[Slick Rick]\nAs time passes, prove he wasn't the type to beg or borrow\nGroup to conquer land like ain't no tomorrow\nMade the Sun King jealous cuz he couldn't do a moldin\nPops I'm not to happy the way you jackin this Moses\nSome dish rap behavior ruins every piece of bash\nThough I complain, where's the several action build\nYou piece of trash, tree or switch\nMo' you buildin, and find your cream's hero\nBuilt it, anything else, you need pharoah\nCome to star this, this my crown\nOne say \"How can he\" but since not takin any chance\nHe threw the hooker off the balcony\nBut word sold out to King, he bank cold cuts blessed\nStripped him of his honors and dumped him in the desert\nBut I'm return for the people, this chest about saw\nKing said \"You want war? Make brick without straw\"\nThat's a son not being king, and shorty knows good roses\nWhen I be, suppose this the upward knows about Moses\n\n[whistling and samples]\n\n[Slick Rick]\nThe new King said, S be the threats, filled wit stuffing\nOh boy, what do I do? Now pray to prophet\nThen a vision said chill and prophecy fill\nScorm build, hells of fire, or there first born killed\nIt's gettin scary for the king, he made the sufferin go by Mario\nYou win, take these peasants and get the fluck outta my area\nMore villains, still in heat, didn't want my 2 to fill him\nWasn't chillin, then I flat sent the troop to go and kill him\nSo more, prophecy, when a crossing said run him\nDid some ol' abracadabra and water fell upon him\nThe soldiers that is, since Moses was suave\nThen Mo' and the mounds havin a convo wit the father\nCame back in the tens, seen panty hoes dropin\nPartner suave, folks wasn't into what po-pop was poppin\nSo the Earth shouldn't kill those, bible takes clothes\nTalked about a time when not the worst spit foes and met Moses\n\n[whistling and samples]", "\"I'm the king, I'm the king, I'm the king\" (4X)\n\n[Slick Rick]\nIs there a party over here, wit no guns and knives gettin in\nNow let and best, get sweat the life threatnin\nNettin is suggestin, guest do the restin\nMic test, kiss BLS, who the best then?\nCuz when I appear wit hoes off a chair wit\nStare wit, I'm talkin bout a party over here wit\nMain wreckon, girls be checkin, could be neckin\nTo respect and to remember every one of y'all a second to\nRelaxin, gonna be fraction, affraction, attraction\nYou don't wanna see action, I ask then\nScrew, cuz you don't what the Rico do\nGiggle to and as you can see a butt wiggle to\nFried and spin my bride and move your hide in\nNuttin but a jammy on my side and\nSo cling on brother's arm I'm thin\nI'm wonderin, should I begin to kick ya mind in ching\nCuz I'm King\n\n[Various samples scratched up]\n\n[Slick Rick]\nIf ya forgot who was the man I'll stand and live kid\nYou will be bouncin up and down cuz I'm a grand individual\nShit you will fist and cheer to dear, disappear\nTo where you no where near to\nAnd could never dream, run horse for Debra and\nClever trap a hook and screamin on yours forever and\nTown to town wit the B-Boys sounds\nThat has the Ruler Rick announce, which ammounts to bounce to\nClassin, still hum the lassin, smash jewelry have like\nKids from the Bassin, cuz bodies lay about\nRespect you better pay about\nObey about, cuz Ricky isin't sweatin what you say about\nHum on the clause, silent jay younger boy\nRap bein strong, cuz see this is violence ya hunger for\nSo cling those on them cling, I'm wonderin\nShould I begin to kick ya mind to ching, cuz I'm King\n\n[Various samples scratched up]\n\n[Slick Rick]\nLike Ceaser, I wanna chill ho on knees for\nPlease for, breeze, why money grow on trees for\nTen to play, I'm poppin willie on the way in\nTo K, the Rick could make a milly in a day in\nKid shot, cuz we on the boy's hot\nCuz the part don't start that's killin noise fart cuz\nStrive kid, go for the nicest\nOne for the trife shit, run for ya lifest\nAs I scrape hoes, graspin to shape up\nClothes drape, tell me why you blastin the tape up\nAnd up high to, as you boyfriend tried to be\nHoes fly to Vance Wright, tearin inside of me\nSonya, sweat so I bone ya\nLet nobody clone ya, and get what I own ya\nSo hoes cling, those aren't I'm thin\nI'm wonderin should I bring to kick ya mind to ching\nCuz I'm King\n\n[Various samples scratched up]", "[Slick Rick]\nBeen a public figure for quite a long time. Known to the whole world (for what?) style of rhyme\nBut tonight let's talk about the ones who bite\nAlthough they know, they won't ever get it right\nCuz they got no class, and they have no game\nAnd can't find another brother who boost it on pain\nAnd hey hooray, on a one way give me\nI pack for ya lover, for them, cuz Slick Ricky is a\n\n[samples]\n\n[Slick Rick]\nWalk into a party, come smart and laugh\nAs the girls go crazy, want me for my dear autograph\nAnd it's me they be admirin, my new style of rappin\nAnd brothers go around me, how I done the insanity\nThe girls say \"wow\" they can't spell the hate\nSay fellas how you organize the word's today\nOn my will says \"chill\" and I do it by my way\nCuz that's how we port son, represent, represent\n\n[samples]\n\n[Slick Rick]\nRemember one night when the world was dead quiet\nAnd outta nowhere some boys start a riot\nTake off my clothes, I had to throw blows\nThe shotgun barrel and dead on my toes\nThe pros, it was people and the knows\nHad a bunch of small timers, the people on my show\nSurround it and bring it wit my empty shift\nAnd said um, will you teach us how to rap, no doubt\n\n[samples]", "Ladies and gentlemen, boys and girls, allright\n\n[Doug E. Fresh]\nThis is... a world premiere...\nOne time y'all, as we turn the heat\nOnce again, as we turn the heat\nMake it hot, make it hot, hot, come on, uh\n\n[Slick Rick]\nHer legends, trying keep it soulful\nBut just since its (Slick Rick) being an old school legend\nI decide to make a jam the kids will slam on\n(DING DONG) How you doing, Gigi? Is your man home?\nIn the living room I see the brother sitting\nSay what up yo?\n\n[Doug E. Fresh]\nYo we cooked 'em in Atlanta\n\n[Slick Rick]\nYou think we didn't?\nBitch coming on, beat box stunning, son\n\n[Doug E. Fresh]\nYo, where'd you get that outfit?\n\n[Slick Rick]\nOne twenty from (?)\nSeen the vibe Cali's on\nLets do an up to date, Doug, put your Ballys on\nI burn 'em on, chick got to storm\nWhile other rapper cat' kettle go hot to warm\nWe Turn It ON\n(Uh uh on, uh uh on, uh uh on)\n\n[Doug E. Fresh]\nAs we turn the heat, yo, yo, uh\nHere's a blast from the past,crowd movers of the future\nUnlimited, hitting it like we used ta\nBoost a track son, we all that son\nWhere you been Rick?\n\n[Slick Rick]\nMe? Missing in action\nHere's a story bout a cutie, bout a rich, bout to ditch\nI'm also known to fuck the beauty out a bitch! (Say what?)\nMight not shoot you in front of group two\nRun a boot, did I mention I'm also quite cute too?\n\n[Doug E. Fresh]\nYo, yo, yo fashion and glamour is ammunition\nCats wishing to rip it like this, keep fishing\nYour flow ain't long enough, strong enough\nAnd record sales aren't (vocal scratching)\n\n[Slick Rick]\nEnough. Slang it on a phatter to a badder kid\nDon't matter a bit, I had to shit, and boomerang\nInadequate\nChick got to storm\nWhile other rapper cat' kettle go hot to warm\nWe Turn It ON\n\n[Doug E. Fresh]\nYo, as we turn the heat, yo, yo, yo\n\n[Slick Rick]\nI bogart through, and then be screaming no hard screw\nHey go-cart crew, your checking out \"The Show Part 2\"\nA fellow I know, \"Is this supposed to sell?\"\nI hope, so well, I spoke, and this is what I tell white folk\nI don't discriminate, don't lack the stimulant crack has\nBattle story man, and I'll eliminate your wack ass\nBackwards tactics, Show for act it\nMe and Doug Fresh took over this rap shit\nFlushes, so as usual tossers\nBetter give us our props as you're new school wusses\nGood times, patch rhyming brought back\nAnd all you other rappers that's trying to talk crap\nI'm not the devil, but your worst nightmare\nSick of rebels, and none of you motherfuckers can\nReach the cat's level\nFour motherfuckers got to storm\nOther rapper cat' kettle go hot to warm\nWe Turn It ON, nigga", "[Verse 1]\nOne day fishing heard Indian drums\nSaw a brother, listen too, wife kissin' too\nThen on another mission to\nThe city with the sistas, though was a far distance\nThere’s Lone Ranger outta area that needed my assistance\nTo deliver cash, last man got robbed, pimped\nHe never returned, I said “ok” and put the money in the Fendi\nThen bumped into this girl\nLooked like that that girl on “Mork & Mindy” and\n“How” I said to the white trim, jockin' me the Indian\nComin' in all this heat, the kind for hopin' a chance for ropin' in\n“How’d you like to put your Indian teenie in my openin'?”\nSaid that would be because the nigga wasn’t new to this\nTrue to this, double barrel slide out the uterus\nCalm, started singin' sad popular songs\nTook the money and the hon', screamin' at the top of her lungs\nNow on a hunt, “You carry leaf?” I was about to smoke a blunt\nNo, not without frontal, screw girl pronto, mean Tonto\n\n[Verse 2]\nWas extremely pissed, still picturin' screwin' this\nWoo, woo, woo, woo, woo\nI don’t know why the fuck I’m doin' this\nNuisance, brother’s/horse tracks, whose to choose?\nSaddle loose, both thirsty cuttin' a cactus for the juice and\nAll of a sudden, these women like model ho’s in Paris\nGanged to rape me the Indian, I was so embarrassed\nDon’t pull a kid a minute, to give in within a minute\n‘Til I seen a shack yonder, a couple livin’ in it\nShook my hand, friendly manner, though she pack her up and ran her\nCouldn’t stand her, fondle her feathers like she wanted some banana\nLed me to the back of the house, the hands that started track\nUsed it as my marks and then I nearly had a heart attack\nBrush it off, deal wit the floss, way past disgusted\nSaid “what’s the matter granny? Is your blind ass dusted”\nBack in the hunt, now what do you want, poor granny offered me a blunt\nNo not without frontal, screw girl pronto, mean Tonto, grandma\n\n[Verse 3]\nFound they’re small timers after all, wasn’t her intent to brawl\nPulled out my 45, “How, y'all… up against the wall”\n“Where’s the hooker and the money?”, here she came, sweatin' mine\nThen the bitch is pointin' a pistol at my fine behind\nNow she a smart ass, should of figured when getting' off the hottie\nSo the horse busted in, started lettin' off the shottie\nKilled the men, slapped the girl, ‘cause he figured I’m stuck trapped in\n“Come on Rick, a horse cappin’?” Yeah, that’s what the fuck happened\nGrieve the folks, bleedin', sides red, I’m pleased and\nIndeed, now I’ll let the Apache kill the bitch, no I need her\nPlayin' the role, better yet, “well is your pole up?”\nSignals from the wife sayin' “what the hell is the holdup?”\nAlthough he scares the honey, hit the switch dares to run it\nCaught and scalped the daffy hooker, said “bitch where’s the money?”\nGave it up… hunt done, she wants a blunt and so it’s frontal\nThat’s not what I want, so drop drawers pronto mean Tonto", "\"Yes, yes the original\"\n\"Ricky, you the nigga don't forget it\" (6X)\n\"Ok, ok, ok, ok\" (6X)\n\n[Verse 1: Slick Rick]\nWell as you know, thousand tear off their blouse\nBe aroused, have a spouse, try 'member who house\nAnd big hitter in leavin' a fitter in literin'\nGet rid of considerin', rocks glitterin'\nWalkin' over like a hawk and stalkin', king souls\nEvery one walkin', one of a batch, want a hatch for a poppin'\nWhen a catch for a play in batch four another match for\nAs can vision upon pull, now it's all full to a rich or for the poor\nWithout no more delays, sissy world flips, [?]\nBecause of our way, niggas yell, hiphiphoorayin'\nIs it? So as the next kiss it, and a sex miss it\nRemain the exquisite, as I shower the hits\nBest split or let me see you overpower me twit, 'cause I ship\n\n[Samples]\n\n[Verse 2: Slick Rick]\nBlocks and blocks stare in the jocks\nHip hop the fox, knock niggas out box\nWit the fly green socks and the limelight flappin\nIt's nothin dap in this, so champion of rappin is\nBrother girl fiend brought a jugga\nThough I overlook her, being dream but a hooker\nYo who got things sowed, one guessed it\nBlessed with, he can't mess wit\nBulletproof vest sweat like doors like Coron'\nHello psycho home, pass that microphone\nHearin', whole world cheerin'\nNun scaring, eight million dollar ring wearing\nSo let it be as the world said it\nCold sweat it, Ricky you the nigga don't forget it\nAs I shower the hits, he best split\nOr let me see you overpower me twit, 'cause I ship\n\n[Samples]\n\n[Verse 3: Slick Rick]\nYo, why in the world is rap white wind\nThen sent for a mental, who dance or I enter\nPresent to the fans, who want a picnic bent\nTo get sent to spray praises on new found intellect\nThough I'm wettable, who fedeble, unedible\nMic said mad incredible\nNever heard of us, when your words are dust\nSend you move like murderers, not murderers proud to say\nGirls go 'wow' and 'ow' to now show ya how to bow to\nScoop-a, in the train goopa, don't bloop a\nWhat, Rick you playin supa dupa\nHow Slick ya? You best get the picture\nThe one eyed kid, remain victor\nAs I shower the hits, he best split\nOr let me see you overpower me twit, 'cause I ship", "[Intro: Rick impersonating a couple talking to each other]\nWoman: Come on honey, wake up\nWoman: You said you's gonna get a job today\nMan: *yawn*\nWoman: Come on, we got bills to pay\nWoman: I'm tired of this, no, y-you taking this too far\nWoman: Come on, get up\nMan: *sucks teeth* Rick'll give me some money\nMan: Chill out, I'll go tomorrow, pass me a beer\n*opens a beer*\n\n[Slick Rick]\nWell I'm riding round the Benz truck with fake friends\nWord, here they come now, yo Ricky lend me couple lenses\nFor lunch and all of that, I got to listen to this nonsense\nWhat the hell Crumb, don't you have a consciense?\nIll treat the vogue, get the gold, chuck a heat in gear\nDon't understand it til the blood sucker beat it\nI see my doc, I'm said 'yo, doc, how's the health there'\nDon't worry bout these pretzel muthas acting like your welfare\nWord to parasites, tell me, hasn't it ever occured of\nStand on your own two, please, I never heard of\nBy the window in the bathroom, that one did it\nGot a dress like a brother, then both of them will quit it\nPotential is intelligent, and it's me you wanna rob\nHey, half cent hookers trynna act like snobs, get a job...\n\n*DJ scratches*\n\n[Slick Rick]\nYou want a damn hood? No, here she go, I'mma gonna try, here to try it\nRick, my baby needs pampers; so buy 'em\nCome on take me to Pizza Hut, work class cow\nWhat would your man say if he could see your slut ass now\nFor five bucks, cool, window while she drives, barely missed him\nPissed him, dissed him, turn up the system\nYou ought of treat us to dinner, I'm hungry, said her daughter\nShe tried to crawl behind home, and heat bread & water\nA rich girl, don't like, I said he's always the best\nYea, whatever, no question, project destined\nYo, what the hell is with you people, are you all incoherent?\nFifty years old, and still be living with your parent?\nNot a break to breathe, yell on the phone\nTake all I own, everything, and leave me the hell alone\nWord up, now shorty rock steals and robs\nFor you half cent hookers trynna act like snobs, now get a job...\n\n*DJ scratches*\n\n[Slick Rick]\nThis other hottie used to knock, used to buy her pearls\nPlease drive me across the whole entire world\nMy new man sure can't budget and he ain't too bright in math\nLike it's my fault he couldn't manage money like that\nSurvive with your man, I didn't say grind the strife\nAnd even worse when they never heard of 9 to 5\nAnd you can't be gentle, or they get all sentimental\nI don't work for white people, well work for Oriental\nHer baby's mother, her friend, that's why plenty get killed\nI'm in Peru, kids hurt, and I need twenty mil\nOn man written traps, deaf, dumb, blind too\nI lost my wallet, son, sorry Gramps, lost mine too\nLonely on the step, but still I have a cold heart\nSo on the spot, is one horny old fart\nWord thinking he intelligent, it's me you wanna rob\nAnd all you half cent hookers trynna act like snobs, get a job...\n\n*DJ scratches*", "Yeah, this one goes out to all them Moet clickers, knahmsayin'?\nFrom the old school, no, not the Crisal group\nIt's the Moet click, yaknahmsayin'?\nSometimes the lesson I'm still holdin', yaknowhatImean?\nHere it go.. are you..?\n\n[Verse 1: Slick Rick]\nDimes trash about, beg Rick ask them out\nMoet click -- back in the house kid, ask about\nIn a vehicle not proud of, hi shouter and\nMarvel at the cars that the one I got outta\nDismantle all vandal who cannot hold a candle near\nI outglitter the chandelier\nBougie [niggas] talk and glance at enhance\nWho makes every [nigga] walkin' dance\nPlus the clothes you saw me gorgeous bout\nWould make a homosexual ask where I bought that outfit\nNo question, I answered all gangsters and\nParalyzed moves like professional dancers and\nSo go West, we a family skunk of rap hits\nTo snap out of you that divide and conquer crap\nPass the bubbly - to the good guy starter\nRap style keep you in a good high bark, I sparkle\n\nAnd move the middle\nAnd move the middle\nAnd move the middle\nAnd move the middle\n\n[Verse 2: Slick Rick]\nGlitter enter, even the stars in the million\nAnd even the sun be like, \"That kid over there brilliant\"\nKnew this isn't new deficit, all figure ripped\nWhen I'm in the club, mad noise, at who the nigga is\nEntertainment, alter, baldhead slaughter\nAnd Moet sparks curse, hi my name Rick Walter and\nAbout to offer lead to drop another muffin\nEven dead folks nowadays hoppin' out a coffin\nWhat's one to do, goin' to do, blunted too\nSon to who conduct the whole world if wanted to\nWho assault viking, when he touch like lightning and\nEverybody know me, walk in sparkling\nThe co-sponsor, although I sworn all out\nAnd don't doubt it if you see me in some cornball outfit\nPass the champagne to good guy start\nRap style keep you in a good high bark, I sparkle\n\nAnd move the middle\nAnd move the middle\nAnd move the middle\nAnd move the middle\n\n[Verse 3: Slick Rick]\nBrother arouser, a chauffeur of dause propped\nAgainst stars bright, so stay over my housetop\nEven little kids give up their milk and cookie to\nThe bartender open off Rick and start lookin' to\nA trailer full of women lovin' the rhythm, I'm givin'\nAnd skin -- for what Rick -- for artiller within 'em\nSo let me explain it, famous, same\nYou know that the legendary reign this game kid\nMassage and awaken who start to it\nOld folk drop teeth breakin' so hard to it\nThat's Rick, so any drunk like a glad kid\nDo that little dance where you spin round a tad bit\nAll battlin' done, just one hunch and I'll\nFight punch you all, all you fans dysfunctional\nSo pass the bubbly - to the good guy starter\nRap style keep you in a good high bark, I sparkle\n\nAnd move the middle\nAnd move the middle\nAnd move the middle\nAnd move the middle\n\nAnd move the middle\nAnd move the middle\n..\nAnd move the middle\n\nAnd move the middle\nAnd move the middle", "\"Bust a move\" 6x\n\n[Slick Rick]\nWhat's good? Chit-chatter, back to work last week\nHad to spit, muthafucka, I ain't doing jack shit\nGo ahead, squeeze the trigger, cuz I don't see how you figure\nTwo lashes, ok, it can be a good nigga\nI'm the last man cooking, I was in heat suppose\nCrawl back to the house, the wife cooking pig toes\nLife's rough, that's the tore up, peace, but that ain't enough\nHad to see master plow her, and my honey pie stuffed\nThen trifle like bring her body, had Rick's wife\nAnd she's nice and the kids be like 'daddy, that's life'\nTake it like a man, money, try, keep rocking\nThen one day, clock the balls, honey drive by and said\nI'll do anything for you, kept drinking up\nHero of my wife, tell ya man stop sticking her\nMaster's coming, I'm not saying you're not attractive\nWhip snap, if a nigga run high active, I'm captive...\n\n*samples scratched up*\n\n[Slick Rick]\nOne day he was dogging her back, got me mad too\nDish it like you like this, she said, Rick I tried to\nAiding to the problem, master wife, what you wanna do?\nHoney was naked and parading in front of me\nShe said, that's the slut, Rick, and I'm over her\nI said chill out sweetheart, because I like life a lot\nShe said, I have sources who will burn you on the cross\nIt will cost you, don't make me have to force you\nMan, I had a decision, so I winked and to the granny\nAnd she said, well you can start by eating my fatty\nChange of plans, she said, no Rick, stay here\nQuality's a whole, is never seen in a man\nCan some change for me, said I attract because I'm handsome\nForgive me Rick, and step back to the mansion\nThat night be home, I'm finding blood all on my feet\nSaid shorty got shot for eating an extra piece of meat\nI'm not even gonna start, no dad, I didn't budge\nNext day master acting feminine like a fuck\nThinking I'm mean benching, no, hands is on the hips\nKept winking at Clinton, tried to kiss me on the lips\nAnd here came master wife, saying I'm attractive\nThe whip snapped, if a nigga weren't high active, I'm captive...\n\n*samples scratched up*\n\n[Slick Rick]\nMaster departs, can have some? You never bought some\nQuoting from the bible, telling me to have a heart\nSo I shove aside the price, cuz I asked her, I'm above it\nUntil we asleep, she's like master, I love it\nThe slut, he suppose to be gay, I figure not\nBut, here came master trynna squeeze a nigga butt\nLook you getting too bold, well ain't you the meanest?\nBang bang, my liver son, he shot him in the penis\nI said, chill, son, he chilled at his little Teddy\nHe said, don't go home, I done killed mom already\nYou know the half, now my life is full of laughter\nFell in love with granny, lived happily ever after\nDue to the fact, the hooker found me attractive\nThe whip snapped, til the hooker weren't high active, she's captive...\n\n*samples scratched up*", "[Verse 1]\nEatin’ a bit and nap, human being make way spittin’\nAs I’m skippin’ through an alley in New York, a stray kitten\nDog chase couple of blocks, shucks, tough being a fox\nHe in a tux, some good samaritan’ll stuff me in a box\n“I’ll find you a home.” Why do you cry? Where went? Just like whine\n‘Cause ASPCA to me a kitten ain’t like right and\nConstable comes, wonder why? I heard say “unhand the fly kid”\nBecause the bitch looked like she needed a home more than I did\nWord, bit her off another like, not a committee, hit her off\nNot to mention, sweatin’ the kitty litter off\nHad to do this, ain’t no regular, see the loot is\nWith this rich white lady sayin’ “Ain’t he the cutest?”\nClerk said all deals are straight, so when the car wheels away\nAlthough the ho’ better know I want four meals a day\nThe rest is firm bein’ a trap as the hon adopt cat\n“Better be a good lil’ kitty”, hooker don’t pop crap\n‘Cause I’m Top Cat\n\n[Verse 2]\nLet me hug him for the millionth, and again, great the zillionth\nHuggin’ me so much, she almost suffocate the brilliant\nSad eyes, plus she had a bad pad, nice\nSaid I have to do my share of work, the hooker had mad mice\nWas like a fleet of them niggas, though it was kind of fun to be ill treatin’ them, clean the mess, must’ve thought I was gonna eat ‘em\nCat food, this ain’t none to me, see a rat, you come run\nOr like “hunt” to me, “you wanna get this shit from in front of me?”\nWord, Thanksgiving too? Please, now shout for somethin\"\n“Can a nigga get some air”, she wouldn’t let me out for nothin’\nI guess I could be called a brat and now a jolly ball of fat\nSo let me rub my head against her, so she think she all of that\nAnd every day of the week, sweatin’, works like a sinner, stay off\n“Would you lay off? I’m watchin’ Prince of Bel-Air, you’re in the way of”\nMouse race across the room, should’ve seen me stop trap\nYou’re still a hooker snap, didn’t I tell you don’t pop crap?\n‘Cause I’m Top Cat\n\n[Verse 3]\nMale come and the sex triggers, and his penis stiffer, bigger\nSaid “boy she sure be sleepin’ with a lot of different niggas”\nTen positions as he coaches, do it in the mood above reproaches\nI wish the bitch would clean her house, you wouldn’t have so many roaches\nBut still he buggin’ and he comin’, and the naughty with the hottie\nFall asleep, burglar come, “up shorty get the shottie!”\nTried meowin’, nothin’ stirred him\nThe ho’s meal blurred him\nPeed on a bitch, got up and chased me ’til she heard him\n“What was that?” Got her gun, she had a dozen, mad lot\nAnd for a over horny lady, definitely wasn’t a bad shot\nPolice came and all of that and now a hero hops, run to her\nSo I snuggle up under her, ’cause I’ve kind of grown fond of her\nWhen a mouse run across, should’ve seen me stop trap\nI thought the ho was gonna snap, she better not pop crap\nTo who? Top Cat", "[Godfather]\nCome get on the HOOOOOOOE Train!\nPimpin ain't easy\nPimps up\nHoes down\n\n[Slick Rick]\nWell I'm a pimp y'all, out here protecting\n1972, 42nd, mad (?), lot of cops gather\nCause my pink Rolls-Royce known to stop traffic\nAt the curb, looking close to regal\nMy hoes, pure dimes, now approach the vehicle\nWhat you call this?  Quite appalled with\n\"Must've been a slow night,\" 20 grand, that's all bitch?\nTook the cash and just about to dally\nWhen Peaches, beat down, ran from out an alley\nDelayed, more beef now placed upon a player\n300 pound pervert don't wanna pay her\nPimp my hoes, strolling, I don't like that\nHold my pink fur derby, I'll be right back\n\n[Slick Rick and Dana Dane]\nDana Dane, Slick Rick, lords of wrecking\nWe the biggest pimps from Hunt's Point to 42nd\nWhen it comes to (uhh) we the Captain Kirks of\nWhere you think we getting all the jewels from\nJerkoff?\nFor suresy, for sheezy, believe me\n\n[Godfather]\nMan, Pimpin ain't Easy\n\n[Dana Dane]\nCheck it\n\n[Slick Rick]\n18 hour day, money getting racked up\nEven if we got to Krazy Glue a chick, ooh she back up\n\n[Dana Dane]\nYou can squeeze it, hoes pick my doo doo when they sniff it\nJuice is Breakfast at Tiffany's terrific\nMy baby blue Eldorado coupe is just the sickest\nMy stable boast the most exotic bitches (come here hoe)\nA make a quarter roll of hoes bubble like Cristal\n3 grand a night each, three ways I fish out\nHoes better have my scratch\nWord to Slick Rick's diamond covered eye patch\nI scoop my cash out the air, white lineyed out\nOut comes a dime, red dress, bottom shimmeyed out\nAskin if I'm the great one, like there's any doubt\nShe want to split her gorilla pimp Jimmy house\nI spit iceberg cold, and plenty pound\nRun, your funny soft stories they don't get me roused\nYou wanna ride in the train?  Put some (?) out\nHere's a quiz, baby girl, are you in or out? (I'm in!)\n\n[Slick Rick and Dana Dane]\nDana Dane, Slick Rick, lords of wrecking\nWe the biggest pimps from Hunt's Point to 42nd\nWhen it comes to (uhh) we the Captain Kirks of\nWhere you think we getting all the jewels from jerk-off?\nFor sheezy, for sheezy, believe me\n\n[Godfather]\nMan, Pimpin ain't Easy\n\n[Slick Rick]\nCheck it, 18 hour day, money getting racked up\nEven if we got to Krazy Glue a chick, ooh she back up\n\nWell rest from sleep my test to (?) each\nPort Authority trying to scoop fresh, not (?)\nNow hoping, I'm the only one that's open\nThis bright hot shorty with ponytail approaching\nSo I move in on her hot drawers\nI'm like hey baby, my name's Sweet Daddy, what's yours?\nI spun a 360, impose on\nNow she in the palace alone with no clothes on\nAnd my flagpole blazing in the trimmer\nSay about 2, 3 days of this dilemma\nNow got lots to do, say to the prostitute\n\"You love me?  Prove to Sweet Daddy how much you do\"\nNow noticing the chick look puzzled\nTill I dialed her up like she was a Heidy Fleiss model\nHigh heels, make up, then I inspect the chick\nAnd fling her outside to suck a Wallstreet executive\n\n[Slick Rick and Dana Dane]\nDana Dane, Slick Rick, lords of wrecking\nWe the biggest pimps from Hunt's Point to 42nd\nWhen it comes to (uhh) we the Captain Kirks of\nWhere you think we getting all the jewels from jerk-off?\nFor sheezy, for sheezy, believe me\n\n[Godfather, Slick Rick, and Dana Dane]\nMan, Pimpin ain't Easy\n\n[Slick Rick]\nCheck it, 18 hour day, money getting racked up\nEven if we got to Krazy Glue a chick, ooh she back up", "Yeah, boy!\nCheck it out Slick, ya know what I'm sayin?\n\nNo complaining\nI reached my destination and its raining\nI'm in Colombia, the Bond steps off the plane and\nI hear a hollar from a bro with ring around the collar\nIts chief of police, grease Bond, tell me to follow\nTreated me to everything, no taxin, maxin\nGives me a hotel suite for me to relax in\nSeems everyone was on my silk drawers\nA cloud does it have to bug me a daffy nerve\nJumpin out the closet, word up, dead nigga\nSaid \"Chief how do you figure tryin to arrest me, the Double for the\nMurder of the nigga?\"\nNow in a cell, but not for long, and now I'm out, I hear a weeping\nOne asleep, other sleeping, kept creeping\nBumped into another, my appearance was alarming\n(To who) some lady that thought I'm charming\nPlease, the way I is I don't even have to say hon\nSo who's a Don?\nYou better believe the nigga keeps girls fond\nThe name's Bond!\n\nWell, I'm outside and its the chief with twenty thiefs like the brainiac\nAware because the Double 0 was bucking like a maniac\nTill nobody lives, so hon, nowhere to do correct\nSaid \"excuse me baby, but where they hiding the hooker at?\"\n\"Around the block, but chill at least chill till the storm has stopped\"\nDecided it was a helicopter, sounds like its warming up\nGrabbed ya leg, shot the chief, someone said \"Stop hawking\"\nShook me off at twenty-thou, the Bond got up walking\nThey was laughing as they left they grew thinner like Iraqi\nGot the plans from the dying chief of police in her pocket\nTo make it even worse honey girl was definitely rattin'\nWas holding her in a club that was happening in Manhattan\nI'm on the plane in the day seemed nothing was a phasing\nExcept for the stewardess jocking the Amazing\nBut kept my composure, had another honey hon\nWho the Don?\nBetter believe the nigga keep girls fond\nThe name's Bond!\n\nBack at home in New York, I didn't want to get too overfly\nYou wanna know why I pulled out my 535i? (pimp!)\nBoy I see some lookouts with some girls that's annoyed\nIt was a private engagement for the dealer and the boys\nDouble just passed the hoods with their faces painted\nWalked in, say a good twenty girls fainted\nThrow cousins all out but seems that everyone was shitting\nAnd man I was so cool I even carried me a kitten (reowr!)\nTrouble for the Double 0? Wouldn't swallow that\nWho's the man with the Golden Gun and all of that\nTurned curls of mercy, left blood on the walls of\nRescued the shorty who was all on the walls of\nWhore said \"You're late!\" I don't wanna hear none of your dissing\nNabbed the cash, made a good twenty million on the mission\nGood job, not to mention had the boss honey hung\nSo who's a Don?\nBetter believe the nigga keeps girls fond\nThe name's Bond!", "Okay, low-lives, let's start the war\nWhen I'm through with you [*scratch*] I'll have you keelin' on the floor\nYou sayin' every curve has a story to tell\nYou say you put my son under some magical spell\nYou say you'll take my lady, freak, that's only because\nWhen I look at the monster, I say, \"He can be yours\"\nHe's a dog, you're a snake\nTwo cobras for ya\nLeft over little hotties with not under desire\nSo, where's the crown for the great snake conqueror?\nA slap across the face to show how much of a punk you are\nYou wanna play? Well, I carry a tray\nLet's call it self-defense if I blow you away\n\nYou (Snakes of the world today)\nYou (Snakes of the world today)\n\nOh, so now you're gonna front like you are one man\nI'll beat you down, 'cause they might lie and play me like I'm a fan\nBlood-suckers, I'm healin' that it's not on your side\nBut, honey, word's out, and your man's a duck\nFrom freeload city, he ain't worth a damn\nTryna come out on the scene tip like that-\nYes, you, little girl\nMore familiar faces\nDon't play brave or you'll need more than [*scratch*]\nSo, snakes unite\nRespect you'll never get\nYou sold your innocence to a royalty check\nAnd my words are true and they hold no mystery\nIt's written in the past and you cannot change history\n\n(Snakes of the world today)\n(Snakes of the world today)\n\nSo, you want me to bow\nWell, I'm sorry, Your Highness\nPayback is a witch for your undeserving kindness\nYour claim-to-fame is now properly over\nSo straighten up your life or go join Jehovah\nBricks through knives, thug's a played out user\nCountin' up your joints just like another loser\nAll you snakes, whassup\nYou think we're playin'\nYour mic styles weak like the man L was sayin'\nSo, cheerio, stream or vote, it was fun while it lasted\nYo, love's not the message for you, you white bastard\nYes we're supposed to play that we carry a tray\nWe'll call it self-defense when we blow you away\n\nYou (Snakes of the world today)\nYou (Snakes of the world today)", "It makes no sense just standin' around\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nIt makes no sense just standin' around\n\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nIt makes no sense just standin' around\n\nI'm a live nigga, standin' out like a rash\nA live nigga, keep cash in a stash\nWhat's the eggs without the corn beef hash?\nBlowin' up like Sarah Dash\nJerkin' up the neck, known to cause whiplash\nDance and get down with me\nPeep the steelo, the strategy\nWhat killed the cat's curiosity?\nYou better believe that I be freakin'\n\nPull my ass if the M4 leakin'\nSame MC who wreck shop at the beacon\nUptown lingo is what I'm speakin'\nSo put your pedal to the metal\nAnd feet to the ground and peep this uptown sound\nMakes no sense just standin' around\nHey, it makes no sense just standin' around\n\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nCome on everybody lets all get down\n\nCome on everybody lets all get down\nCome on everybody lets all get down\nCome on everybody lets all get down\nIt makes no sense just standin' around\n\nI'm chillin' with nice and smooth with my phat farm outfit\nThey say what's up Rick what's up good to see you out kid\nWhere the party at, askin' and relaxin'\nAnd pop a couple of Moe's listenin' to some fat tracks with them\nBeing a kid was locked, want to check the the scene and shit\nZulu nation havin' somethin' tonight at the Arena Greg\nLets get drunk and roll, said they like the sound of it\nRolled a couple of blunts, but ruler wasn't down with it\n\nFans did some plead to go and hit somethin'\nBe off work release even if you get caught with weed in yo system\nBe up north quick, since we all down to roll\nWent to the club havin' the up most amount of fun\nShould've heard them groupies scream for\nWonder why this brother lookin' at me all mean for\nIgnored it, kept wappin' till my neck hurt\nThen Greg Nice and smooth did this very same record called\n\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nCome on everybody lets all get down\n\nCome on everybody lets all get down\nCome on everybody lets all get down\nCome on everybody lets all get down\nCome on everybody lets all get down\n\nHappy birthday, what's the word say\nTo papa smurf, I cover the globe like earth day\nRollin' with G and the Rickster\nFlavor full boogie down mixture\nWe came back to attack with the ruler\nYou can't get no cooler on our way to the bank\nNow do the Patty Duke and then do the Spank\n\nCome from the heart things spark\nAnd keep your eyes glued to the top of the chart\nOh shit, it's the man with the fronts and the jewels\nThe kids with the blunts and the tools\nSewing up shop like needles\nSellin' more record than The Beetles\nSo don't be astound\nAnd makes no sense in standin' around\n\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nIt makes no sense just standin' around\nCome on everybody lets all get down\n\nCome on everybody lets all get down\nCome on everybody lets all get down\nCome on everybody lets all get down\nIt makes no sense just standin' around\n\nCome on everybody lets all get down\nCome on everybody lets all get down\nCome on everybody lets all get down\nIt makes no sense just standin' around\n\nCome on everybody lets all get down\nCome on everybody lets all get down\nCome on everybody lets\nCome on everybody lets, all get down\nCome on everybody lets all get down\nCome on everybody lets all get down\nIt makes no sense just standin' around", "(Lyn Collins - Think (About it) starts playing)\n\nGreat now it's (?)\nTry keep, bump my nigga bump to this uh\nI just give it (?)\nDrop more, hustle nigga watching this, huh\nMy dad said ''End of discussion nigga'' (?)\nHe's tryna (?)\nStill got it (?)\nChill before the (?)\nHospital, discuss a nigga (?)\nWhat up dog, (?)\nI told you that i'm sexier than a hot my nigga\nMy lady can't stop (?)\n(?)-what up nigga?\nIt's a bird, it's a plane when im popping nigga\nCan't (?)\n-\nHot damn my nigga they just did an aimin' on us\nPrefering just saying not to any other\nAnyway, answers the ground with the\nLove the next man (?)\n(Aoaahhhh)\nYou understand my nigga?\nSee (?)\n(?) body-slam my nigga\nWhat part from ? I am that (?)\n(?) head to ground, carry out my nigga\nPlus my nigga, trust my nigga\nMidas touch my nigga", "[Intro]\nPut chicks in it!\nOkay you kids enough TV get to bed, get to bed\n\"Ohh uncle Ricky, we wanna watch TV please\"\nNo more TV, get to bed\n\"Oh uncle Ricky [?] anymore\"\n\"You're gonna read us a bedtime story uh, please? Uh, uh, uh, please?\nAhh, all right, all right you kids get in the bed i'll get the arabian story book\n*Happy babbling*\nAll right kids, you tucked in?\n\"Ye\"\nHere we go...\n\n[Verse]\nOnce upon a time, not long ago\nWhen people wore pajamas and life slow\nWhen laws were stern and justice stood\nAnd people were behaving really, really good\nThere were three mean giants that came from the east\nThey were up to no good and some ugly beast\nThey lived in the forest where no one goes\nAnd were evilly inflicted from their head to their toes\nEverytime they came around and snatched a few humans up\nThey'd eat their poor souls and throw their bones in a cup\nFor years and years the peasants lived in fear\nBut nothing could be done besides to pray, my dear\nFor the giants were rulin' and the peasants were not\nAnd the little bit of happiness was now forgot\nSo three brave boys full of smokin' youth\nWent on a mission trip to find the king of truth\nFor when he come, justice be done\nNone only as the most high ruler, son\nNone only as the most high ruler, son\nNone only as a hoe's high ruler, son\nHit it!\n\nSo the story is, what is to come?\nWill the peasants survive and justice be done?\nOr will the giants continue to rule as one?\nWell, nevertheless we'll see son\nStory's begun\n\n[Outro]\n*Kid humming along the melody*\nHeyo, imma stop right there", "(featuring Slick Rick)\n\n[Common]\nYeah yeah\nYou know, Slick, why do he wanna come crib\nActing like he know how the brothers live?\nWe have to let 'em know\nWe have to let 'em know\nHeeeeere we go\n\nBehold a pair of white horses on the Death Wish course\nBeen watching MTV, reading articles in The Source\nLost on the other side of the river\nWhere death approaches the livest nigga\nI wonder why this wigga\nWould even come around my tilt\nWith grandmothers cry, uncles get high, and cats get pealed\nMy guys will deal with him, he got no rhythm\nSo let the steel hit him, we speaking jail diction\nHoe work and day oppression\nTurn up the bass and let the system thump\nSo my neighbors won't hear the sparks as the lead gets pumped\nIts a prenup agreement in the cement jungle\nKill each other over money and white boys for fun\n\n[Female Singer]\nDon't come my way\nHawks feel the day\nThings don't change, oh no\nDon't you come my way\nCome my way\nSee the day, oh no\n\n[Slick Rick]\nLittle family so a junky living act as\nStarted smoking crack to fill the void within my black ass\n1999, rolling as some broke cat\nThese white kids asking questions\nAbout where to buy some coke at\nKinda shock a dude, Ruler turn a sucker to\nShow 'em where these cats at, maybe earn a rock or two\nRetarded, not knowing the kid hardest trife\nKill 'em, asswipes, I'll have a new start in my life\nTill the drug lord knock upon their debutante\nDisprespected, \"Washed up rapper, what the fuck you want?\"\nThe often asked, I could see others laugh\nI got my man he wanna a buy a half a ki off your ass\nScolding 'em, sleeping and sold on 'em\nGimme the cash\nLet me flash it through this peephole on 'em (Check it out)\nHe got hyped quick, pursued in the tight crib\nEmptied on their asses, including the white kids", "[Female Singer]\nDon't come my way\nHawks feel the day\nThings don't change, oh no\nDon't you come my way\nCome my way\nSee the day, oh no\n\n[Common]\nYo, How'd dude go cop a brick when he ain't got the loot\nRicky D, get the heat and 'Treat 'Em Like a Prostitute\"\nThis wigga gots no heart from his Iowa start\n\n[Slick Rick]\nAnd a Section 8 cat, he don't want any part\nI put two in there, ruin their, pursuing their souvenir\nNigga, what the fuck is that white behind DOING here?\nWon't you say you wanted to slug 'em\n\"If your not here for the cable or the (?) ya BUGGIN\"\n\n[Common]\nLights flooded the scene, there was blood and si-reens\n(sirens)\nThe cops shot the brother, I still hear him scream\nBlack mans reality, white mans bad dream\nFamiliar scene from the Ickeys to the Brady Green\nIts pissy hallways, broke elevators always (ya know)\nAin't no place for our children to play\nI try to go out in the summer and be feeling the day\nThese broke and stupid niggas, yo they still in the way\n\n[Slick Rick]\nOne of the mightiest slang, and plus the night is young\nI got long term money draining ideas from\nSince they far, I'll find your brown sweetheart\nJust being white your like golden goose around these parts\nHey retard, better hurry in, my name is Father Marion\nI'll hold that American Express card your carrying\nPut your nose up, don't, shut up, provoking and woke up\nFirst where do you live, how much money your folks got?\n\n[Female Singer]\nDon't come my way\nHawks feel the day\nThings don't change, oh no\nDon't you come my way\nCome my way\nSee the day, oh no\nDon't come my way\nHawks feel the day\nThings don't change, oh no\nDon't you come my way\nCome my way\nSee the day, oh no\n\n[Common]\nWe let the rhythm go\nCommon Sense will 'em hit where I hit 'em\nCommon Sense will spin 'em check it out\nI guess I did 'em where they should to be done\nAin't nothing new about the wonder rap son\nClosed styles like captions yo its time for some action\nMan, I get bread, niggas get me sled\nWhen I come up off their head, it was said\nFor that, yo, it's like this\nCommon Sense'll strike this, mic this\nJust like some punchlines\nHow niggas follow me like one time\nEverybody love me like the sunshine\nCombine, ain't that you never knew of\nNiggas say one but I've got two loves\nCheck it out, now how I do love...", "Well I shot some deer, then I copped some beer\nAnd did a show up in west bumblefuck somewhere\nDue to rap's wider ratio, satelites-to-NATO\nHillbilly's drawers flew on stage like tomatoes\nApparently more mack than I thought\nUnfortunately wifepiece back in New York\nAnd I'm starvin - being human and open\nA mad fine hillbilly woman was scopin' Rick\nThought entered how to lean and bend it\nThough I'm not gonna lie I was extremely tempted\n(\"To what Rick?\")\nTo discharging a sister, next thing in the dressing room\n(\"Pardon me mister\")\n\"Yes\" I said, cautiously\n(\"Crazy but possibly you could sign your name on the back of these daisy duke shorts for me?\")\nTried to resist, now girlfriend's starting it\n\"The pen won't write\", (\"You can press down hard on it\")\nNow my hand browsing her south end, spun around, about to shove my tongue in her mouth when (\"RING\")\nLoosen the grip my (?) had; my girl she was talking so nice I felt bad\nBeing untrue no telling what it might do to her\n\"I Love you\" - Forced to say \"I Love you\" back too to her\nAny thought of getting pussy was doomed, too\n(\"You gotta wife?\") \"Anniversary comin' up soon too\"\nGot off the phone, (?)\n\"Don't get me wrong, it's not like you're not cute\" (uh huh)\nI'm all from the street and I be wanting to skeet in you (\"I understand good-bye it was real nice meeting ya)\nWhat an angel overcoming his wrongness, all I am trying to get across in this song is...\n\nChorus: (repeat 2x)\nIf goodness is what you're filling your soul with\nAnd want to find a woman you can chill and grow old with\nKeeps no secrets, like who they creep with\nRealize early it's a two way street kid\n\nCasually seating with some thick (?) eating with my album playing at a big board meetin'\n(\"I love this!\") Being the coolest and the roughest\nA big (?) woman pulls The Ruler in her office\nI fixed the wedge in her garment unsteady; unsteady my heart went\nCause her office looked like a three bedroom apartment\nPoundin' was inevitable, she said to me \"Rick I think your album is incredible!\"\nThe (?)\n(Rick I think you're so darn sexy with that patch over your one eye)\nI'm glad you think it's boomin and I catch ya', it means a lot to me coming from a woman of your stature\nI mean who could resist the darn hat, start caressing Rick's private, kiss me on the neck\nAnd I can't be held accountable, down her gown I pull, girlfriend pussy look plump and poundable\nShe sweats (?), put one of your legs up on the desk, and let me enter ya\nFantastic girl I start to act drastic, when I see my wedding band palm the bitch left ass cheek\nDeep down she felt that I tried to diss. I'm like\n\"I can't do this as much as I'd like to, miss\"\nAn angel overcoming his wrong kids, the point I'm trying to get across with this song is...\n\n[Chorus]", "You know, The Rock's gonna tell you a little story\nYou ain't gonna believe it, but he's gonna tell you anyway\nIt's tough to be the Rock!\nOh no, no, shut your mouth! No, no, it really is\nEven though The Rock is...\nThe Rock is the most electrifying man in all of show biz!\nYou see, when the Rock gets too much...\nToo much of the fame and all the bright lights...\nHe likes to kick back and have a slice of that unadulterated delight!\n\nDing!\nSlick Rick: Welcome to Rick's Bakery, can I help...\nWait a minute... Aren't you the famous Rock?\nThe Rock: Yeah, The rock, the people's champ in the house\nWhat's happening, Slick?\nSlick Rick: Hey, how're you doing, guy?\nLook, you gotta take a picture with me before you leave, guy\nThe Rock: Whoa, whoa, The Rock doesn't want to take pictures\nThe Rock just wants a piece of pie\n\nYou got any of that in this bakery?\nSlick Rick: Oh, I got every pie you can think of\nI've of strawberry pie, blueberry pie, apple pie...\nThe Rock: Blueberry? What? Oh, no, no, whoa, whoa\nActually, Slick, it doesn't matter what type of pie you have\nLet The Rock tell you a little story about pie...\n\nDriving down South, though quickly aroused\nWhen my car caught a flat near this old farm house\nI hope somebody's home, takin' a chance at it\nKnocked on the door, and this fine chick answered\n(You're The Rock!) Can I use your phone?\n(I'm shakin, sure, if you try some of this pie I'm makin')\nDaisy duke shorts on, five foot stood\nSaid, \"sure, what the heck, I mean it did smell good.\"\n(So she called Rock to the kitchen, towards the vapor)\nThere's her grandmother, aunt, and a Chinese neighbor?\n\nWell, The Rock is gonna tell you again\nYou see, it's tough to be The Rock!\nYeah, The Rock knows, that might sound crass\nOh, and by the way...\nAll you jabronis in the locker room...\nYou can all come kiss The Rock's ass!\n'Cause you know after The Rock lays the smackdown\nOn some big, fat, ugly hermaphrodite!\nThe Rock needs a little distraction...\nAnd a slice sounds just right!\n\nThe Rock said \"thanks ladies\", and more kind words\nGrandmother said, \"Be polite, eat mine first.\"\nSo I sat down, tried her's, she looked quite glad\nHad a strange tasting mold, but it wasn't so bad\nThat's right, The Rock having pie in the country\nDevoured her's, her aunt's, and still I was hungry\n\"That's all?\" Rock said\nBored and reading the paper\n'til finally, a plate of the next door neighbors\nDogged it down fast, 'cause it really did please\nI mean it tasted so good, Rock was talkin' Chinese!\n[Rock shouts incoherent \"Chinese\" words] That good pie!\nSlick Rick: Oh, that's the pie you was talkin about!\n\nOh yeah, The Rock knows the millions can smell it now!\nIt's tough to be The Rock!\nNo, no, no, no, it really is\nBecause you all know, The Rock is the most...\nElectrifying man in all of showbiz!\nYou see when The Rock gets too much... Too much of the fame...\nAnd all the bright lights\nHe loves to kick back and have a slice...\nNo, no, no, no, no, The Rock is gonna eat the whole damn pie!", "[slick rick]\nAll of you c***-pullers are frontin\nWave your arms around like your some octopus or somethin\nTo better ya\nFor any chick you want, I'm gettin her\nRob people, mad ignorant, et cetera\nWho the one to entertain and fume with?\nWho you know breed humans can't be in the same room with?\nReefer sweet, wrap it up, free fix greet\nEvery rapper rap maggot underneath rick's feet\nEvicted -- why you tryin to find shit to lick with?\nEven your kids tell you that you ain't shit to slick rick\nThough you pretend to be glory\nI'm number one, that's the end of the story\nThe black clark gable leave you numb\nEvery single one, frontin on your label is a bum\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\nChorus: repeat 2x\nFrom new york to cali none'll fuck with\nThe awkward, you think muhammad ali used to talk shit?\nBing! This sure hit alone'll bury ya\nAnd even I got de-ported, I own america\n\n[slick rick]\nHe's so crazy -- I smash rippin up the place\nGive the mack a taste -- I wipe my ass with a rapper face\nCars come to a dead stop\nRain find ways not to drop on my headtop\nTycoon rush at the richest\nEven my complexion is a must-have to bitches\nEven without, car money to budget\nI would have the most elegant apartment in the projects\nKnahmean? Bitches are in awe * at the lingo* (pronounced oar)\nKnow that rick'll put an end to all rapper income\nAn old-timer, lock up all vagina fields\nFrance nor italy can fuck with my designer skills\nSaltin inferior, faultin to where we are\nTryin to find fault in superior\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\nChorus\n\n[slick rick]\nYou lack the taste hook I'm stickin em with\nWhile degenrate like yourself make our race look ignorant (mm)\nAnd your girlfriend wanna kiss and deploy\nBout in the groin gets none of this tenderloin\nFeet planted on deep black firmament\nBow -- in the presence of who lead rap permanent\nLike a lion rap rips a chunk of kids\nYou stunk, cause mortals ain't shit to conquer\nSomebody said new pharoahes have appeared\nHow when everything I wore ten years ago you wear now?\nI coulda murder heard a word out quick rick stomp it kid\nHung to it, you complete bum to rick\nSource awards, yeah rick every seminar\nEven make sadaam hussein tell me where the weapon are (mm-hmm)\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\nChorus", "You can open your eyes and see I've devoted\nAll this time to it\nPans labyrinth, my hands looking to fine tune this\nWhat slumbers here is not human\nI brought an atom bomb with me call me Von Neumann\nI'm not a scientist, just innovative\nI'm tryna climb just with the things I say displayed on the grave stone of these rappers favourites\nPick your poison you can sleep in peace and get out of the way, or lie awake assured that you could die in vein\nYou should select your placement\nAnd register that thought\nIn fact there's a line in a verse for every person that's been talking trash\nYou not in my class, same study but you have not advanced, hopeless\nI hope you grabbed your moment cause it's closing\nFast, they hoping slowly, but he no Aleister Crowley\nCrash, comes the moonchild\nI've spoken\nLight faces the darkness\nThe devil versus my soul\nHe can keep it if wishes, he just has to cut my marriage to these quotes he can't control me\nHoly matrimony\n\nYou can open your mind and see I've devoted\n\nOnly Every single word and sentence\nThey've been working, efforts show that\nThey could never burn my essence or deter what I work towards with records\nA perfect record of 100 wins, so when he losing?\nNever\nThey life a fairytale what happens after ever\nEver after cash to burn through the rainy weather, I'm eating better\nThey tryna come for beef, how dare he try to spill my cheddar?\nThey've been thinking cow but I'm the goat\nWe on a different level\nI'm on an open road, applying pressure to the pedal\nWhile They in the house on the couch, they working, no Geppetto\nI've been focused on my goals, while they focused on the measure\nI am never scared to crash, I got this shit in the bag, man I was cut for the clash, A different cloth is apparent within my craft\nKendrick verse on control, I am that\nThe embodiment of telling your competition they trash\nI feel like Michael Myers, this knife might take your life in a flash and I know violence sounds obscene\nBut in October we don't trick or treat\nThis isn't Halloween", "I got no limit\nThis expression is impressive I'm getting it how I live it\nIt's best to bet that they will never stand next to this, I am winning\nI do this shit to brag not for attention, don't forget that\nI got no limit\nCould've been a child of god but found that I am bound to fall victim to this sinning\nFor this money I'm in prison\nBut the bars is what they lay behind and I forgot to mention that I\nNever needed practice only passion\nDreams like Cassius a vision you can't imagine\nHands made of stone, competition bout to catch 'em\nThey a statue, I'm clay, this chip on my shoulder isn't in frame\nBut what about the caption?\nThey've got a picture of the moment, a moment within the action\nI don't care about reactions\nA picture speaks a thousand words, I'm just tryna grasp 'em\nThey can take the moment for granted, they open handed, they don't Deserve to be so understanding of all this magic\nObsessed with the kid, they got a fatal attraction\nBut keeping focused on the lane only gets you stuck in the traffic\nNick Orton, I've been dodging all the masters\nRicky pouring in that lane with the fastest whip\nI'm back on my radioactive shit\nThey've been active on the radio but they ain't this immaculate\nImagine if you lived the life we actually live\nI'm on about a wink of sleep within the year and it's the twenty sixth of march\nWorking for no pay, no cars, no status yet it's easy to see that I am all that and a bag of chips\nI bet if you showed the best they'd get mad at it and throw a tantrum on they throne\nCause i'll make your favourite rapper play within the average role\nI'm coming after the goal\nFuck it, I'm mad, I'm coming after they throat\nAlexander McQueen\nYou can swing above the floor for ever claiming that my rap isn't inspiration\nWhat Im sayin? McQueen was the goat\nBut you don't like what I wrote\nThen take a lap with him\nLightning strike in a flash and its actually just my heart within a lapse again\nIt's pounding out my chest, I ran a lap on this, I'm after this\nBar that they claim is higher than a mountain ridge to push it out the atmosphere and fly around the solar system blasphemous", "[Verse 1]\nI'm so God damn sick of not living up to expectations\nMy stomach's in a knot\nI think about the distance I've come an awful lot\nAnd I don't really have too much to say about my spot\nI'm caught up in the chase after everything I want\nWith no progress, I'm out of reach and out of touch with reality\nI think they mad at me\nMy, focus is salary\nTheir, focus anatomy\nThey worried about the calories I eat\nThey worried about gravity, I leap\nI've been jumping off the balcony\nThis a different side to me\nI've changed for the better\nI plan to take reign but the weather is brisk\nI feel sick!\nThey telling me I'll never forget what I did\nBut I don't really plan to\nMy success isn't circumstantial\nI'm moving for the plate\nBut this weight has been heavy like an anvil\nI've been at a stand still\n\n[Hook]\nI don't even know if I'm okay...\n\n[Verse 2]\nIt's been two years since I left\nAnd honestly I meant no disrespect\nBut I obviously haven't even learned who I am\nAnd yet take a look at what everybody expects\nI'm sick! But pretend I'm in perfect health\nThat's the problem I guess\nI focused on the wrong things\nMy art is a way to help me\nBut this isn't really healthy...\nI'm just tryna vent\nCold air through my window\nI've been running from my past since the intro\nI'm just looking for some justice, wins low\nAnd the losses getting loud, crescendo\nI don't, even, hear the, crowd\nI have been drowned in my mental\nAnd they don't even listen in the first place\nSo I guess I'll just fade away\nInvisible, worst case\n(Fuck)\n\n[Outro]", "(Verse 1)\nWell, took a blast of vodka, then dashed\n‘Cause I had to run and teach an unruly ass class\n(?) adults, they’re a pain in the buttocks\n“Sit your worthless asses down now and shut up!”\nOne tried sneaking out the back, (?)\n“Hey asshole! Class just started, where ya goin’?”\n(Well Coach said since all my fractures\nHave healed, that I could skip this class and go practice.)\n“Well, I’m afraid Stu\nYou’re request’s denied, now please turn to page 2\nIn your science book ( NO! ) the airhead hollered\n“Calm down, and take your hands off my shirt collar!”\nThis behavior did not appear wrong to this\nClown, flung me to ground then went on to his\nPractice, always gets the besta\n“Don’t let that big bully get to you, professor\nHe’s just a big fronter, not stellar, a stunter.”\nI’m 10 years older than the bitch, I STILL WANT HER\nShe was the girl I always dreamed about tappin’\nBut with my geek character, never gonna happen\n‘Cause you know how redbone chicks act\nDown low, workin’ on a formula to fix that\n\n(Hook)\nThe Nutty Professor\nA professor that’s a little off, but not soft", "(Verse 2)\nI mix some of this, some of that, watchin\n(?) toxin, then I drank the concoction\n(gulp, gulp, gulp) the room starts twirlin’ ‘round\n(dun, dun, dun) (?)\nMouth foamin’, I’m shakin’ like schizo\nMeanwhile at a club where the hip college kids go\nAll focus centerin’ (?)\nGentlemen’s enterin’ the building\nImmediately, music stoppin’\nAs he’s walkin’, eyes ball out, trays droppin’\nPunks couldn’t front as they drunk (?)\n“Who’s this well dressed, confident hunk here?\nBilly Dee but hair more curlier.”\nHere comes bully from Professor’s class earlier\nWith Stella, walkin’ about bold\n‘Til a suave motherfucker knock the bully out cold!\nStart dancin’ better than kids do\nGot on the mic, sang a song for the bitch too!\n(Lonely, I’m Mr. Lonely) (Applause)\n“Could this be Professor Walters?” “Sure coulda.”\n“Did the potion really work like he truly hoped it woulda?”\nBrown sugar, (?)\nThe name’s Buddy Love, girlfriend, (?)\n\n(Hook) x2\n\nWell, there’s girls all over me, I had to go “ENOUGH!”\n‘Cause I felt more confident, mad showin’ off\nSince I been (?) dreamgirl, (?)\nPut Stella in the car, then dashed to a deserted\nArea, I quickly uncovered\n“How ‘bout a little bit head, my beloved?\nOpen up your mouth and put my big peepee in it.”\n“You arrogant ass, take me home this minute!”\nShocked, I almost choked on my mucus\n“Listen, I’m sorry, I’m acting like a fool ‘cause\nI’m tryna impress ya, but instead I disappointed ya\nFirst time I saw ya in my classroom, I wanted ya\nSo in my head I thought actin’ like a mack’ll-\nGreat, I’m changing, my voice just cracked.”\nLeft the rest of the formula on the third self\nSo, right before her eyes, back to my nerd self\n(AAH!) the fine bitch yelled out!\nHer eyes poppin’ out so far, shits almost fell out!\nExplained when I make certain things, how it alters-\n“You went through all of that for ME, Professor Walters?”\nSaid we oughta become more than friends\nWe tongue-kissed, and been together ever since then\nMoral of the story is: ‘stead of fuckin’ ‘round\nJust be yourself and have a young bitch locked down\n\n(Hook to the end)", "Guess who's back (3X)\n\nHey young world... the world is yours\nHey young world... the world is yours\nYoung world young world... the world is yours\nYoung wo-ah-huh-huh-huh-urld\n\n[Verse 1]\n\nThis rap here... it may cause concern it's\nBroad and deep... why don't you listen and learn\nLove mean happiness... that once was strong\nBut due to society... even that's turned wrong\nTimes have changed... and it's cool to look bummy\nAnd be a dumb dummy and disrespect your mummy\nHave you forgotten... who put you on this Earth?\nWho brought you up right... and who loved you since your birth?\nReward is a brainwashed kid goin wild\nYoung little girls already have a child\nBad company... hey, now you've been framed\nYour parents are hurting... hurting and ashamed\nYou're ruining yourself... and your mommy can't cope\nHey, little kids don't follow these dopes\nHere's a rule for the non cool... your life, don't drool\nDon't be a fool like those that don't go to school\nGet ahead... and accomplish things\nYou'll see the wonder and the joy life brings\nDon't admire thieves... hey they don't admire you\nTheir time's limited, hardrocks too\nSo listen, be strong, scream whoopee-doo\nGo for yours, cause dreams come true\nAnd you'll make your mommy proud... so proud of you too\nAnd this is a message... that the Ruler Rick threw\nAnd it's true\n\n\"You know, you know what, you know what, you know what?\nWe like to party, like to party\"\n(repeat 3X)\n\nHey young world, the world is yours\nHey young world\n\n\"Yo peep this\"\n\n[Verse 2]\n\nHey Mr. Bigshot... hey, don't you look fly?\nBut you don't have a nickle... ohhhh, my my my\nYou've been fightin again and, you forgot why\nHey kid, walk straight, master your high\nWhyyyyyyyyyyyyyyyy.... because you make your family cry\nAnd all jokes aside, are you in good health?\nHey little boy... now have you really checked yourself?\nYou're a disgust, you know someone that I can't trust, you'd\nSteal mom's welfare... and you'd run and buy some dust, and\nPlus, a must say... bigshot you're not\nYour friends are talkin and I'm hearin that your girls are what?\nYou didn't know? Go steal and rob\nAnd while you're at it... go get a suit for a j-awhh-ob\nYou see you're actin like this urge is demanding\nC'mon, wake up... have some understanding\nSociety's a weak excuse for a man\nIt's time for the brothers... rap is trying to take the stand\nBelieve it or not, the Lord still shines on you, he\nGuides you... and he watched you as you grew, plus\nPast the age of... a little child, that's true\nBut folks your age don't act like you do, so\nSo be mature... and put the point to a halt\nAnd if you're over eighteen... I wish you'd act like an adult\nDon't live in a world... of hate hate hate\nPull yourself together... and get yourself straight\nMen don't steal... hey, most don't borrow\nAnd if you smoke crack... your kids'll smoke crack tomorrow\nSo be more mature... and kids do your chores\nMake your own money... hey, be proud that's yours\nYou know why, cause that's a man... that's brains no spite\nStayin out of trouble... when it comes in sight\nAnd a man never loses a fight... in God's sight\nCause righteous laws are overdue\nAnd this is a message that the Ruler Rick threw\nAnd it's true\n\n\"You know, you know what, you know what, you know what?\nWe like to party, like to party\"\n(repeat 3X)\n\nHey young world, the world is yours\nHey young world...\n\n\"Yo peep this...\nMC... Ricky... D...\nThe Grand Wizzard...\nAnd his partner...\nAnd his and his and his partner...\nSay what?\nLa-Di! Da-Di! La-Di! Da-Di! (repeat 2X)\nLa-Di-Da-Di...\"", "Intro (Slick)\nWhy would i do that at that part, what the fuck\n\nVerse 1 (Slick)\nIm sittin half naked in the room her ass shakin\nShe fuckin with bum ass dudes, who claim they cash makin\nBut you find out they still live in mama basement\nThese hoes too basic now im all in her dreams\nFreddy no jason\nShe gettin clingy im needin my space bitch\nWe takin of like a spaceship\nSippin im on my bombay shit shit\nKeep ya mouth shut dont say shit\nLane switch, switch the flow\nI thought i been told you\nYour hoe my property look at her\nWhen she goin down to deepthroat\nIm grabbin the wax, takin dab\nRobbin the stores for some candy like damn\nI got the munchies, im feelin hungry\nPoppin the shots out the roof, dummy\nTakin the shots out the shot glass\nPercocet 30 we pop that, yo bitch we fuck that\nBalenciaga we rock that, bitch suck that\nCan't touch that, hammer, she foxy, tanner\nIm back, with the strap, teammate got my banner\nHop out the phantom, hot like a summer day\nPop like a landmine, were all fine, all day\nGotta dime rollin blunts on the raw trey\nGot a lotta hate but the result of my game make it fuck what yall say\n\nVerse 2 (Cole)\nUh huh, yeah i like this, turn me up in the headphones a lil bit\nUh huh, right there\nFuck the, fuck the, fuck the\n\nFame and stardom, i just want the fortune\nI want a bad bitch with no kids im not, against abortion\nFuck the bullshit, pulled up in the porsche that horse shit\nThrowin thumbs up at the whip they always sayin oh shit\nExperiment gone wrong, im notorious unlike the warriors\nIma win all 6 games come in the finals\nUpon arrival, we’re takin titles, blast past my idols\nTo go viral, suicidal im not\nBut these drugs just be killin me slowly\nOnly seein bitches faces like a new pair of oakleys\nSame birthday as toby, diamonds dancin on my wrist\nWatch how they dance hokey pokey, uh\nI only need 3 more lines, just adidas\nShots tearin up ya stomach without the tequila\nOff the pills can never find my weakness\nEver wonder how im hot, tell me ever seen venus, uh"]}