{"artist": "Warren G", "encodings": ["[Produced by Warren G]\n\n[Intro]\nRegulators. We regulate any stealin' of his property. We’re damn good too. But you can’t be any geek off the street. You gotta be handy with the steel, if you know what I mean. Earn your keep. Regulators, mount up!\n\n[Warren G]\nIt was a clear black night, a clear white moon\nWarren G was on the streets tryin' to consume\nSome skirts for the eve so I can get some phones\nRollin' in my ride, chillin' all alone\n\n[Nate Dogg]\nJust hit the east side of the LBC\nOn a mission tryin' to find Mr. Warren G\nSeen a car full of girls, ain't no need to tweak\nAll you skirts know what's up with 213\n\n[Warren G]\nSo I hooks a left on 21 and Lewis\nSome brothers shootin' dice, so I said \"Let's do this!\"\nI jumped out the ride and said \"What's up?\"\nSome brothers pulled some gats, so I said \"I'm stuck!\"\n\n[Nate Dogg]\nSince these girls peepin' me I'ma glide and swerve\nThese hookers lookin' so hard they straight hit the curb\nOnto bigger, better things than some horny tricks\nI see my homie and some suckas all in his mix\n\n[Warren G]\nI'm gettin' jacked, I'm breakin' myself\nI can't believe they takin' Warren's wealth\nThey took my rings, they took my Rolex\nI looked at the brother, said \"Damn, what's next?\"\n\n[Nate Dogg]\nThey got my homie hemmed up and they all around\nCan't none of them see him if they goin' straight pound-for-pound\nThey wanna come up real quick before they start to clown\nI best pull out my strap and lay them bustas down\n\n[Warren G]\nThey got guns to my head, I think I'm goin' down\nI can't believe it's happenin' in my own town\nIf I had wings I would fly, let me contemplate\nI glanced in the cut and I see my homie Nate\n\n[Nate Dogg]\nSixteen in the clip and one in the hole\nNate Dogg is about to make some bodies turn cold\nNow they droppin' and yellin', it's a tad bit late\nNate Dogg and Warren G had to regulate\n\n[Instrumental Interlude]\n\n[Nate Dogg]\nI laid all them bustas down, I let my gat explode\nNow I'm switchin' my mind back into freak mode\nIf you want skirts, sit back and observe\nI just left a gang of hoes over there on the curb\n\n[Warren G]\nNow, Nate got the freaks and that's a known fact\nBefore I got jacked I was on the same track\nBack up, back up, ‘cause it's on\nN-A-T-E and me, the Warren to the G\n\n[Nate Dogg]\nJust like I thought, they were in the same spot\nIn need of some desperate help\nBut Nate Dogg and the G child\nWere in need of somethin' else\nOne of them dames was sexy as hell\nI said \"Ooh, I like your size!\"\nShe said \"My car's broke down and you seem real nice\nWould you let me ride?\"\nI got a car full of girls and it's goin' real swell\nThe next stop is the Eastside Motel\n\n[Instrumental Interlude]\n\n[Warren G]\nI'm tweaking into a whole new era\nG-funk, step to this, I dare ya\nFunk on a whole new level\n\n[Nate Dogg]\nThe rhythm is the bass and the bass is the treble\n\n[Warren G]\nChords, strings, we brings melody\nG-funk, where rhythm is life and life is rhythm\n\n[Nate Dogg]\nIf you know like I know\nYou don't wanna step to this\nIt's the G-funk era, funked out with a gangsta twist\nIf you smoke like I smoke\nThen you're high like everyday\nAnd if yo' ass is a busta, 213 will regulate", "[Chorus: Nate Dogg]\nAs I travel this lonely gangster road\nJust me and my negroes\nWe still got bomb hydro\nWe just double independent\nAnd the night falls that's when young girls go home\nBig girls put on small clothes\nA party we will throw\nA party we will throw now\n\n[Verse 1: The Game]\nYeah, all I need is the chronic to keep me fit\nA bad bitch, a project apartment and 2 pits\nRed chucks, a red Bic to keep my kush lit\nThank god for what I get but never really needed shit\nI'm a hustler nigga, that's how I got this red Bentley\nSlay the competition and told them that Dre sent me\nWalk through the smoke like, \"what up loc\"\nCause Warren got that bomb that kind that make me choke\nWe gonna twist up 8 for Nate, blow the smoke through the clouds\nIn hopes that it reaches the pearly gates\nNow, how many niggas wanna throw up a dub\nAnd be surrounded by the baddest bitches up in the club, yeah\nIt's the 'math blood, sixes on the ave cuz\nPhantom got your girl pussy wetter than my bathtub\nFuck her all night, wake her up at 6\nLil mama grab your shit, get ghost\n\n[Chorus: Nate Dogg]\nAs I travel this lonely gangster road\nJust me and my negroes\nWe still got bomb hydro\nWe just double independent\nAnd the night falls that's when young girls go home\nBig girls put on small clothes\nA party we will throw\nA party we will throw now\n\n[Verse 2: Warren G]\nClick-clack what up, zig-zag run up\nKnick-knack paddywhack, twisting up a fat sack\nTic tac toe up, I be in them streets like an\nIntersection, I got connections, from every section\nCritical, political, it's killer Cal'\nRoll it up, now pass that shit around\nMy mental is cynical, original\nThinking you could see us, I'm like nigga how?\nI'm in that diamond lane, I'm in that diamond chain\nGlistenin', glowin', I'm sippin' liquor I'm blowin' zippers\nMy nigga, I'm on one, I'm twistin' the zone up\nI'm sitting up low, my pistol shinin' my chrome up\nMy nigga Game got the gun load, one shot\nMix a nigga brain like some gumbo, uh, oh\nAll that tough talk nigga, what for?\nShut your scary ass up at the front door\n\n[Chorus: Nate Dogg]\nAs I travel this lonely gangster road\nJust me and my negroes\nWe still got bomb hydro\nWe just double independent\nAnd the night falls that's when young girls go home\nBig girls put on small clothes\nA party we will throw\nA party we will throw now\n\n[Verse 3: Warren G]\nCouldn't, nobody diss my nigga\nDamn I miss my nigga, pour out a little liquor\nBig Nate Dogg nigga, 2-1-3\nFrom the city by the sea, where them Gs ride\nTurn around baby let me listen to the b-side\nSlap that, tap that, after that, East side\nAs I travel this road I see the street sign\nReady for whatever, Beretta's you know I keep mine\n\n[Verse 4: The Game]\nIt's the L-B, C-P-T nigga we be\nOG to BG, that's where the weed be\nKiller (what?) Cali-forni-a\nEh, load the strap, hop into the six-trey\nSnoop, what up loc?, I'm headed to the East side\nG ride, throwin' up everything but the peace sign\nGold Daytonas, gangbang persona\nNigga trip, I'ma pop the top off his Corolla\n\n[Chorus: Nate Dogg]\nAs I travel this lonely gangster road\nJust me and my negroes\nWe still got bomb hydro\nWe just double independent\nAnd the night falls that's when young girls go home\nBig girls put on small clothes\nA party we will throw\nA party we will throw now", "[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Verse 1: Warren G]\nCan I get in where I fit in? Sit in, listen (uh-huh)\nLet me conversate better yet Regulate\nShake the spot with my knot, may fade\n'Cause I don't like to dream about gettin' paid\nI played ball through the halls of CIS\nWith Snoop Dogg's big brother, call him Dirty Left\nRack 'em up, crack 'em up, stack 'em up against the gate\nThe homies tryin' ta catch me but they can't, wait\nDamn, the street lights just came on!\nAnd my momma's in the streets tellin' me to come home\nI hit the gate and I hops on my Schwinn\nAnd I tell the homies, \"Aight then,\" yeah\n\n[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Verse 2: Warren G]\nVerse two (uh-huh), now what the fuck I do?\nCatch the bus to Cal State, or chill with the Voltron crew?\nAnd make a few ends on the side\nHere comes a baby blue van, time to ride\nSo I hops in the van with my nigga Tick\nAnd Baby Poppa back then, that was my clique\nWe groovin' to Santa Ana\nAnd we plan-on makin' hellafied mount of money (hell yeah)\nAnd what I did for extra fees\nWas break niggas after work playin' get like me\nI was fourteen years old, havin' a sack\nJust a young motherfucker eatin' ValuPaks\nShootin' dice in the corners of them public schools\nAnd I used to gangbang, but now it's a G thang\nAnd I still know how to make those ends\nYou don't believe me? go ask The Twinz, motherfucker\n\n[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Outro: O.G.L.B]\nYeah, check dis out, this is I'm O.G.L.B\nKnowhatI'msayin'? I'm on my little O.G. Warren G\nAnd he just droppin' this to let you BG's know\nWhat's happen, y'all got to recognize\nCause this is y'know a Long Beach thang\n21st Street, but check this out\nG gonna go out there, yaknowhatI'msayin'?\nAnd handle that shit y'now? Yeah\n\n[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Outro]\nHey Greg, I hope you was tapin' that shit!", "[Verse 1: Warren G]\nThis DJ, he gets down\nMixing records while they go round\nTo the hip to the hop, you just don't stop\nProducing funky tracks til it makes you drop\nConjunction junction, whats my function\nI'm hookin up tracks so that niggas can function\nIt's not Pete Rock or that nigga Dr. Dre\nIt's this muthafuckin nigga from around the way\nThe one that brings you styles on timesy, whymsy\nThats why it's so hard to find me\nConduction, construction when I bust choo choo, bustas\nIt's a must when I bust when I bust, I gotta come correct\nThe R to the E to the S-P-ect architect\nYup nigga no I'm not tweaking\nIts one of the sixteen minds that I'm speaking\nThe W-A the double R the E into the R\nA-B-C-D-E-F to the muthafuckin G\nOoh shit as I flex I wrecks I checks\nSo what's next\n\n[Verse 2: Mr. Malik]\nOh who's next, to catch wreck on the menu\nI snap necks when I flex let me continue\nSend you, on a mission when I rock\nIt goes on and on and on and you know it don't stop\nYes I'm back on another route, ready to take em all out\nNow can't get with this, cause they get faded without a doubt\nCheck em, I wreck em like 1-2-3 why\nThey can't fuck with that rude one Malik\nWill I drop it, can't stop it, lit it up like a rocket\nWhen they get out of line I grip the nine out my pocket\nLock it down yeah that's what I do\nHow could you come solo nigga when I run through your whole crew\nI rule, fool, act like you heard it\nThe one I run with, can't remember the last he murdered\nDem do away or dem get dealt with\nKill the noise I want silence, no bubbaclad bullshit\nNigga, it's all about my grip\nSo the one who starts to slip is the one who gets ripped\nKept a chip on my shoulder not now that I'm older\nThey, all of me, the LBG high roller\nCause back in the days on the side where we sat\nNiggas come up missing if they didn't have they strap\nSo why, try to be, like me\nJust when you pull back a G and I think I'm Mr. Malik", "[Hook]\nWell if the beat is funkadelic then the tune is right\nMr. Malik and Warren G so tonight's the night that we spark\nWe spark in the dark when we do it in the park\n\n[Verse 3: Mr. Malik(Warren G)]\nWell its the A to the B (and the C to the D)\nHey my name is Mr. Malik with that DJ Warren G\n(Mr. Malik can you hear me)\nYes I'm the host with the most they can't get close or even near me\n(I said a tick, tock, ticking to the era)\nI said a pick which Glock bitches get shot its still terror\n(Terror, terror, pick which Glock)\nWhich one, (the black one with the big pin lock)\nMe and Dre in a five hundred so those who wanna get dropped\nNigga go knock, knock I trick a flow non-stop\nFly double I never slip trip or flip flop\nThe tune is funkadelic, the crew was right\nBut if Malik will make you smell it then tonight's the night\nFor me to stay trump tight up with my nigga Warren G\nThat's sorrow when you borrow but you can't be oweing me\nWhat's next\n\n[Verse 4: Warren G]\nI say what's next, what's next what's N-X-E-T\nIt's me, Warren to the muthafucking G\nFlowing with my little homey named Malik\nYes everybody will just tweak\nOff the new style ill ease that we got\nYes it's me Warren G on the block\nPump pump, block Glock, let me just tick tock\nIt's me Warren G on the muthafuckin rock-n-roll\nStroll, then stiff back to the rap\nIts me with the big black mack eleven strap\nSo let me flix into the flex\nWoo, so what's next\n\n[Hook]\nWell if the beat is funkadelic then the tune is right\nMr. Malik and Warren G so tonight's the night that we spark\nWe spark in the dark when we do it in the park", "[Intro: Gil Scott-Heron]\nThe blues has always been totally American\nAs American as apple pie\nAs American as the blues\nAs American as apple pie\nThe question is why\nWhy should the blues be so at home here?\nWell, America provided the atmosphere\n\n[Verse 1]\nYou don't see what I see, every day as Warren G\nI take a look over my shoulder, as I get older\nGetting tired of mothafuckas saying, \"Warren I told ya\"\nYou don't hear what I hear\nBut it's so hard to live through these years\nWith these funny-bunny niggas, ain't shit changing\nGot my Mama wondering if I'm gang banging\nBut I don't pay attention to these father figures\nI just handle mine, and I'm rolling with my niggas\nOff to the VIP, you see Snoop Dogg and Warren G\nUnbelievable how time just flies\nRight before your eyes, but you don't recognize\nNow who's the real victim, can you answer that\nThe nigga that's jacking or the fool getting jacked?\n\n[Refrain]\nYou don't see what I see, every day as Warren G\nYou don't hear what I hear\nBut it's so hard to live through these years\nYou don't see what I see, every day as Warren G\nYou don't hear what I hear\nBut it's so hard to live through these years\n\n[Verse 2]\nAnother sunny day, another bright blue sky\nAnother day, another muthafucka die\nThese are the things I went through when I was growing up\nThere's only one hood, and niggas shit be throwing up\nAnd I knew it, there really ain't nothing to it\nThinking every fool's gotta go through it\nNow let's go back, how far, back in time\nDragging to these hookas trying to mack for mine\nI remember when we all used to stop at the spot\nBack then my nigga-name was Snoop Rock\nIt was all so clear, '87, '88, then '89s the year\nYou say everywhere we roll, you can say we roll thick\nWay back then 2-1-3 was the clique\nSomething to stay paid I was just a young hog\nWarren G, Snoop Rock and Nate Dogg\n\n[Refrain]\nYou don't see what I see, every day as Warren G\nYou don't hear what I hear\nBut it's so hard to live through these years\nYou don't see what I see, every day as Warren G\nYou don't hear what I hear\nBut it's so hard to live through these years\n\n[Verse 3]\nYou make me wanna holla, get out the game\nToo many muthafuckas know my name\nWhile Snoop Dogg's serving time up in Wayside\nI puts it down on the street, don't try to take mine\nI had to reassure the homie that he wasn't alone\nWe'd talk, and him and Nate'd conversate on the phone\nHe kept saying, \"Nigga, it won't be long\nBefore a little skinny nigga like me'll be home\"\nI said \"Snoop, things done changed, it's not the same\nWe need to get up out the game\nCause we can get paid in a different way\nWith you kicking dope rhymes and I DJ\"\nWell as time goes past, slowly we try to make it\nBut things are getting hectic, I just can't take it\nShould I, A: Go back to slanging dope\nOr should I, B: Maintain and try to cope\nOr should I, C: Just get crazy and wild\nBut no, I chose D: Create the G-Child\nIt's been on ever since with me and Mista Grimm\nThis shit is getting so hectic that I can't even trust him now\nWhat would you do for a Warren G cut\nWould you act the fool and nut the fuck up\nBack the fuck up, act the fuck up\nNiggas talk shit they get smacked the fuck up, straight up\n\n[Refrain]\nYou don't see what I see, every day as Warren G\nYou don't hear what I hear\nBut it's so hard to live through these years\nYou don't see what I see, every day as Warren G\nYou don't hear what I hear\nBut it's so hard to live through these years\nYou don't see what I see, every day as Warren G\nYou don't hear what I hear\nBut it's so hard to live through these years\nYou don't see what I see, every day as Warren G", "[Verse 1: Warren G]\nWarren G Top Dogg patrolling the beach\nNiggas say they’re hard as bricks but they’re soft as a peach\nClaiming the G of all G’s, please\nI come blowing through like the breeze\nSitting on the threes\nPosted coast it and mash it down Pacific Coast\nIn the bomb chrome rims, black on black Yukon\nWith nuts hangin’\nFrom the city, where the bangers be bangin’\nIt don't seem like has changed and\nI hollered at a homey the other day\nG’d up at the park, Sippin Alisay\nOne of the homies took a beatin’\nSo now we'll start to be a gang and checkin’ at the meetin’\nLike cycles repeatin’\nIt’s just another sunset fall and see\nI can hear the homies that pass calling me\nAnd you know what I discover what they keep sayin’\nKeep your mind and your money motherfuckers\nAnd shake busters\n\n[Chorus: Sissel]\nУлетай на крыльях ветра\nТы в край родной, родная песня наша\nТуда, где мы тебя﻿ свободно пели\nГде было так привольно нам с тобою\n\n[Verse 2: Warren G]\nHave you ever sold millions\nBut yet you niggas persist to talk shit\nGet off my dick\nYa never catch me slippin’\nRollin’ with the heat slap the clip in\nI never thought the world would start trippin’\nMy life's a trip though, hit the crypto, blow the whistle\nThey think I bang, so I pack a pistol\nWarren to the G is a G\nI don’t fuck with you nigga\nSo don’t fuck with me, let’s ride\nTo the East Side, slide like a fo\nI packs a fo-fo, when I'm steppin’ out doors\nTo the bang to the boogie, if I speak then I spoke\nWarren G you do it every time, till ya loc\nGet the party lit like blazin’ smoke\nThe East Side of the beach, West side of the coast\nYou know the niggas that arrive with hogs\nAttack dogs to say niggas are down to die with, motherfucker", "[Chorus: Sissel]\nУлетай на крыльях ветра\nТы в край родной, родная песня наша\nТуда, где мы тебя﻿ свободно пели\nГде было так привольно нам с тобою\n\n[Verse 3: Warren G]\nWho’s the man, I’ve been from London to Japan\nStomp land to land\nTo the Egyptian sands\nYou can't check me, disrespect me or mock me up\nWith the bass bumping out my truck\nAnd all these police tryin' to lock me up\nMoney rules the world, and I made the loot\nSo don't make me shoot\nCause trying to match’ll\nGet you down every time\nI ain't trying to hurt nobody\nBut I'm down for mine, biatch\n\n[Bridge: Warren G]\nMoney over power, power over money\nMoney over power, power over money\nMoney over power, power over money\nMoney over power, power over money\nMoney over power, biatch, biatch\n\n[Chorus: Sissel]\nУлетай на крыльях ветра\nТы в край родной, родная песня наша\nТуда, где мы тебя﻿ свободно пели\nГде было так привольно нам с тобою", "[Hook: Nate Dogg] x2\nKeep on hustlin'\nCan't stop gotta claim what's mine\nIf I lose my grip on the game\nNo more bud, no more cash, no more dames\n(No, no more hoes)\n\n[Verse 1: Warren G]\nI'm realizing my struggle for what it is and taken\nAnd what belong to me and my responsibility\nKeep my enemies close cause they the ones that get me\nIn a minute they'll be trying to pump a gauge in me\nLeave the other \"G\" committee\nFunkadelic better tell it to the fellas I ain't the one to be played with\nIf you think you gon' be testing you sure in for a lesson\nThat's forever session I'm blessing to be the don\nBy the time you get the message outta this one I'll be dipping\nDipping the streets of LBC\nIts been a long time stepping up to the plate now\nI'm new and improved plus I drive a new Bent' now\nMy family straight, plus my homies in the game now\nLiving it straight, Long Beach the pen state\nBounce, rock, roller-skate\n(Them niggas know they can't fuck with Warren G and Nate)\n\n[Hook] x2\n\n[Verse 2: Jeezy]\n(Yeah, let's go)\nRest in peace Nate Dogg, I'll meet you at the gate (yeah)\nPac was alive, life still'll be great (yeah)\nDistrict attorney, go ahead and free Lil Boosie (Boosie)\nB.I.G was alive, everybody need some juicy (right)\nTell me the difference between Suge and Puff\nWhile you at it, tell me the difference between weed and dust\nMy hustle don't stop it's around the clock\nMy paranoia don't stop, hands around the Glock (that's right)\nSome of the shit I say man a nigga might kill me (kill me)\nIt's all good long as you motherfuckers feel me\nWhat the fuck is going on niggas acting like I owe them (owe em')\nThink I can't do it by myself, but I'ma show em' (yeah)\nWent from Air Force 1's to white Dolce Gabbanas\nNigga ain't shit changed, I'm still keeping them llamas\nYeah I use to cop them white ass bricks when they was high (high)\nGS400 Lexus when they was fly (yeah)\nIt don't stop nigga (it don't stop nigga)\n\n[Hook] x2\n\n[Verse 3: Bun B]\nWelcome to the ghetto (to the ghetto) just like my home boy Chico\nWhere everyday the block is on lock like Steve Biko\nEveryday brothers getting hit up with the R.I.C.O\nI see CE from PAT to CPT\nYou know they can't stand to see me \"G\"\nGetting my hustle on in these streets\nMeeting my ends meet (meet)\nSo they hate on me behind my back\nHoping that one time flash lights behind my lac\nThey say its no pain no gain (gain) well guess what then (then)\nI hurting bad as hell but it ain't for nothing ('thin)\nOnce I climb up out of this whole I been stuck in\nThe doors they kept me out they gone let me the fuck in (in)\nI didn't come this far for me to quit now (now)\nSo I'ma make sure I get all I can get now (now)\nCause tomorrow might be my last\nThat's why I'm stacking everything I can before I pass\nI gotta...\n\n[Hook] x2", "[Intro: Lady Levi]\nHey, nah ya goin miss up on the G-Funk era\nYa know we said things won for Warren G, him soon turned superstar\n\n[Verse 1: Warren G]\n11-10-70 that was my intro\nBut now in 94, I'm rollin a 64\nCuz things get shady where the grass is greener\nNiggas throwin up sets in hoods like they neva seen a\nYoung mack daddy do his thing cuz I pack right\nI got 44 ways to make you act right\nAnd its a shame how the game must be played\nIt was told never fold by the niggas you can't fade\nSo raise up off this young hog\nCuz I heard you punkin some but you can't punk me dog\nI got my own thang cuz I let my nuts hang\nIf you wanna bring it, bring it on no pain no gain\nSo as I creep can you peep what I speak\nTechniques unique, so what you sayin is obsolete\nSo there it is as I go about my days\nI can only bring it to you like this in so many ways\n\n[Chorus: Lady Levi]\nSome homies are bad minded\nCannot take them for no friend\nI’m sure they’re illegal (in so many ways)\nSure they’re illegal (in so many ways)\nCause I borrow, then they’ll borrow but I lend them a violin\nI’m sure they’re illegal (in so many ways)\nSure they’re illegal (in so many ways)\n\n[Interlude: Warren G]\nHey, hey, hey this is Warren G you know\nAnd I was in Baghdad\nBefore these lil youngstaz was in they Daddy bag\nYa know, yeah, they in violation Wayniac so hound em\n\n[Verse 2: Wayniac]\nIts all plain and simple\nI roll just to serve a lifetime wit my niggas\nIdiotic fools can't figure\nThe way I display or should I say more than that\nIts crucial when I name how many niggas got my back\nNeva lack, the skills when its time to handle mine\nYou can't front if you wanna but you still know the time\nI'm, the nigga that they call Wayniac (what that mean)\nI'm the nigga stayin down for the home team\nSo if you didn't know let me slow ya roll\nThis pro is on the go with some shit you ain't heard before\nSo recognize game in your face\nA touch of the bass then I'm gone without a trace\n\n[Chorus]\nPeople Warren G rhyme wit are gone put you on front lines\nAnd sure day illegal (in so many ways)\nAnd sure day illegal (in so many ways)\nCause me kofi drop the dime for officer not serve the time\nAnd sure day illegal (in so many ways)\nAnd sure day illegal (in so many ways)\n\n[Verse 3: Warren G]\nI stay true to the game\nBut some stay blind to the fact\nThat if I don't look good, you dont look good\nSo please rearrange and change the shit you doin\nYou fuckin yourself cuz you the one gettin screwed\nAs I, ease on down the brick road\nAs I shift from first to second, cruise control\nSo blaze up the buddha\nCuz I got drink, and dont think\nWe dont roll without a full tank\nOf that bomb ass shit called the funk\nCuz I am the G and the funk is what you want\nNow, lets take a trip to the other side of town\nNiggas flip flop and they never stay down\nWanna be all they can be, but gettin held back\nTryin to take what is mine, (what) what type of shit is that?\nSo, this is for the homies stay down for your pay\nI can only bring it to you like this in so many ways\n\n[Chorus]\nSome homies are bad minded, cannot take them for no friend\nI’m sure they’re illegal (in so many ways)\nSure they’re illegal (in so many ways)\nCause I borrow, then they’ll borrow but I lend them a violin\nI’m sure they’re illegal (in so many ways)\nSure they’re illegal (in so many ways)", "[Intro]\nWhat's up negros and negrettes?\nIt's your boy Warren G\nYou know what I'm saying?\nChillin' with the home boy Mack 10\nAnd we gon' lay a lil' sumpin' down for y'all\nLet y'all know what time it is\nShow you how we keepin' it real wit' it\nYou know, cuz this world is built on material thangs\nBut we ain't trippin' off that\nWe want y'all to know this, check it\n\n[Hook]\nI want it all; money, fast cars\nDiamond rings, gold chains and champagne\nShit, everydamn thing\nI want it all; houses, expenses\nMy own business, a truck, hmm, and a couple o' Benz's\nI want it all; brand new socks and drawls\nAnd I'm ballin everytime I stop and talk to y'all\nI want it all, all, all, all\nI want it all, all, all, all, all\n\n[Verse 1]\nThey say, 'There go Warren G with that envious stare'\nI love this game too much, I wish these haters wasn't here\nIt's a shame, we came too far to turn back\nIt's a cold world, it gets so hard, you learned that\n]From falling, tryin' to walk from crawl\nTryin' to hustle up from broke to ballin'\nAnd, yeah, y'all in effect that's all me\nThe jiggy G-Z, all my niggas that keep it real and do it easy\nBelieve me, young nigga, fat meat is greasy\nAnd shit stank, so if you plot a lick and hit a bank\nAnd get away, or get gaffled, the very next day\nDon't cry, hold your head up high\nAnd remember what you told yourself, nigga\nI said remember what you told yourself, nigga\nI said remember what you told yourself, nigga\nI said remember what you told yourself, nigga\n\n[Hook]\nI want it all; money, fast cars\nDiamond rings, gold chains and champagne\nShit, everydamn thing\nI want it all; houses, expenses\nMy own business, a truck, hmm, and a couple o' Benz's\nI want it all; brand new socks and drawls\nAnd I'm ballin everytime I stop and talk to y'all\nI want it all, all, all, all\nI want it all, all, all, all, all", "[Verse 2: Mack 10]\nI want it all, so I got to wake up and ball\nAnd thanks to y'all, I got plaques on the wall\nMack 10 laced with the know how to paper chase\nCrushed ice, throw my Rollie face in the platinum fan base\n]From net workin' and hustlin', no doubt, I got clout\nAnd live the lifestyle that Robin Leach talkin' about\nSlow down player, don't hate cuz you can't relate\nThe Bently Coupes and kickin' gears on Harley's with the straights\nI got more lime light than Vegas on cable\nWill it enable to shoot C-Note \"Yo's\" at the crap table\nAnd while you can't get off the ground, I'm getting high\nA nigga fly and fly, with the desire to build an empire\nI strapped up and took flight like a missle\nTold them loud and clear as a whistle 'Hoo Bangin' is official'\nHanding out gold medallions at roll-call\nI'ma ball and never fall cuz Mack 10 want it all\nWhat\n\n[Hook]\nI want it all; money, fast cars\nDiamond rings, gold chains and champagne\nShit, everydamn thing\nI want it all; houses, expenses\nMy own business, a truck, hmm, and a couple o' Benz's\nI want it all; brand new socks and drawls\nAnd I'm ballin everytime I stop and talk to y'all\nI want it all, all, all, all\nI want it all, all, all, all, all", "[Verse 3: Warren G + Mack 10]\nMe and 10 get paid escapade to the spot\nWe hot like rocks served on hot blocks\nI notice money make the world circulate\nSo we gon' stack and stack and take a sip and perculate\nBump, let the woofers sub (sub), show the homies love (love)\nWarren to the G (G), and Little G-Dub (Dub)\nSurface on the low, slide or don't slide at all\nRide or don't ride at all\nWarren, I couldn't be more serious about my 'fetti\nI stay tight on the mic and keep the pen movin' steady\nI want it all, dog, and it might be greed\nI hate to trip, but I got two little mouths to feed\nThey don't know nuttin' about no excuses and disrespect\nOr somebody bein' jank with they Daddy's royalty check\nAnd at that point, I'm through talkin', dog, enough said\nSo, if you owe Mack money, then I suggest you break bread\nI want it all\n\n[Hook]\nI want it all; money, fast cars\nDiamond rings, gold chains and champagne\nShit, everydamn thing\nI want it all; houses, expenses\nMy own business, a truck, hmm, and a couple o' Benz's\nI want it all; brand new socks and drawls\nAnd I'm ballin everytime I stop and talk to y'all\nI want it all, all, all, all\nI want it all, all, all, all, all\nI want it all; money, fast cars\nDiamond rings, gold chains and champagne\nShit, everydamn thing\nI want it all; houses, expenses\nMy own business, a truck, hmm, and a couple o' Benz's\nI want it all; brand new socks and drawls\nAnd I'm ballin everytime I stop and talk to y'all\nI want it all, all, all, all\nI want it all, all, all, all, all\nI want it all; money, fast cars\nDiamond rings, gold chains and champagne\nShit, everydamn thing\nI want it all; houses, expenses\nMy own business, a truck, hmm, and a couple o' Benz's\nI want it all; brand new socks and drawls\nAnd I'm ballin everytime I stop and talk to y'all\nI want it all, all, all, all\nI want it all, all, all, all, all\n\n[Warren G]\t\t\t[Mack 10]\nMack 10\t\t\t\tWhat up? I know\nThe paper's out there, ha ha\tYeah, Warren G\nWhat up?\t\t\tYou know\nThe paper's out there, ha ha\tYeah\nG Funk \t\t\t\tWhat up? You know\nThe paper's out there, ha ha \tThat's right\nWhat? Hoo Bangin'\t\tWhat up?  We know\nThe paper's out there, ha ha\tThat's right, what?\nThe whole world\nPaper's out there\t\tSpeak on it\nHa ha\nWrong:  All the hood\nRight:  All the hood rats\tWhat up? You know\nPaper's out there", "(Album Version Dirty)\n\n* Intro Ooh, yeah, yeah\nWhat's love got to do\nWarren G, rap for me, yeah-eah, yeah, mm mm\n\n* Verse 1\nWhen G-dog, the hog, come up in the place\nIt's dollar signs in your eyes and a smile in your face\nYou wanna live fat, off of my sack\nYou got more drag than a low lo-do, cut the act\nCause back before '92 and '93\nYou didn't give a damn about Warren G\nBut now that I'm slingin' platinum LP's\nAll of a sudden, you on my N.U.T's\nAin't nothin' you can do to make it stop\nCause money makes the world go 'round and the panties drop\nI ain't in love though, I don't need the pressure\nI just wanna dig it like I'm diggin' for treasure\nSome of y'all had a good thing that you couldn't keep\nThought you was TLC, you had to creep\nYou say you had love, I said you bullshiting\nIt's all about the dough, so what's love got to do with it?\n\n* Chorus What's love got to do, got to do with it (that's right)?\nWhat's love if you don't respect the game (uh-huh)?\nWhat's love got to do, got to do with it?\nIf you lack in this game, it's a shame, you won't make it\n\n* Verse 2\nNow, I'm the type of brother that's down for mines\nBefore I made beats, I was down the grind\nBack then, every single homey had my back\nNow they're peepin' my stack and they're talkin' bout jack\nBut I'm the same brother day in and day out\nAnd I'm-a stay that way until the day I lay out\nIn a casket, it's drastic, cause homies is plastic\nBreak 'em off some bread, they want the whole damn basket\nIf you's a true homey, you would wish me well\nNot plot to make a brother bail, jealous as hell\nWe used to get the same riches\nNow your trigger-finger got the itches, schemin' on my riches\nWhich is, not a suprise, my eyes peep game\n211's, 187's it's all the same\nIt's all a shame, homies'd jack you for your grip\nAin't no love involved, because it's all about the chips\n\n* Repeat chorus\n\n* Verse 3\nNow for these labels tellin' fables\nMakin' the fucked-up deals under the tables\nYou think that you smart, but, fool, I'm the smartest\nYou can't make no money if you can't keep an artist\nSign the dotted line, put 'em on the shelf\nBreak 'em off some crumbs, keep the rest for yourself\nI know how it goes, treat an artist like a ho\nFly cars, gold, clothes, but no dough\nSince it's all business, I'm-a handle mine\nKeep track of my stack down to the very last dime\nCause in this rap game, it's all about the buck\nYou bend over for the label and you will get fucked\nLike how we run up in them trick, and then you're through\nThe record label do the same shit to you\n90% business, 10% show\nAin't no love in this game, cause it's all about the dough\n\n* Repeat chorus", "[Verse 1: Jah Skillz]\nWell it's the super, the duper, the Landcruisin' trooper\n?Take action? at times, they hang on my rhyme like Mr. Cooper\nI'm takin' you to a zone that's much far from wackness\nSo please could you tell me oh bud buddy can you hack this?\nYo, oh no, grab a hold of fadeables, gettin' her flows on\nLike FloJo, rhymes in a marathon\nSmooth like chocolate, so call me Big Mamma Kane\nFeels like another one goin' out for her reign\nStep back, because I happen to be all that plus tax\nI got more subscribers than HBO or Cinemax\nMile after mile, I rip style after style\nCrack dope in all the vials, ooh I'm glad I used Dial\n'Cause it can get funky when I'm singin' my song\nBut I just flow on, and so on, not stinky cause I roll on\nAnd then I hear encore and I won't give it a rest\nThat's how I got the motherfuckin' Super on my chest\n\n[Chorus : Snoop Dogg]\nFly through the sky gettin' love\n(The whole wide world will watch me)\nFly through the sky gettin' love\n\n[Verse 2: Jah Skillz]\nMister it's the, Masta Aces of the spade\nRappin skills are thinner than niggas on AIDS\nUp up and away it's the Super Soul Sis\nI talk so much shit, I got halitosis\nI knows this, I flows this, how funky, you stank\nYou a walkin' blood bank I'm withdrawing my shank\nThanks for the memories, remember me no remedies\nOr end in the vicinity or catch a cap like a Kennedy\n'Cause I'm the Superwoman rapper I deserve a hail\nChasin MC's, got em on the run like Smurfs from Azrael\nNo bluff, the magic I puff, I'm chokin' sho 'nuff\nI'm takin' a bite out of rappers if my name was MC Negra\n(She's hotter than the South land on fire)\nAll you MC's desire, to run through my pyre\nI'm turnin' heads like the Exorcist while flexin' this\n'Cause it's the Super Soul Sis\n\n[Chorus: Warren G ]\nFly through the sky gettin' love\n(The whole wide world will watch me)\n\n[Verse 3: Jah Skillz]\nSat on the outside, but now I'm in the arena\nA superfly mackadocious one you never seen a\nSoulful, cause I got a bowl-full of soul\nStrollin because I have no vehicle to roll\nBut bring it bring it back to the topic of this flow of mine\nI can flow upbeat, to a slow beat, and be offbeat and still on time\nI rhyme, and swim waves of soul like Billy Ocean\nNever ashy, lyrics that soothe ya like some lotion\n'Cause I can Krush any Groove bust on any move ya make\nI keep my rhymes attached, like trains to a freight\nBreak ya Achy like Billy Ray, I'm fuckin up the industry\nAnd fins to be, Nanu Nanu like Mork and Mindy\n\n[Chorus: Warren G ]\nFly through the sky gettin' love\n(The whole wide world will watch me)", "[Chorus: Nate Dogg]\nI need a light (Light)\nSo I can smoke away this pain\nI need a drink (Drink)\nSo I can drink away this rain\nMaybe a wife (Wife)\nSomebody to share my name\nI need a song (Ooh)\nA brand new song to sing\n\n[Verse 1: Warren G]\nLong Beach back in the day was all hustlin'\nYoung niggas in the neighborhood strugglin' (Wassup?)\nPrayin' to God we amount to somethin'\nBy living on the street where they constantly bustin' (Pa-dow)\nBig Warren told us that they can't hold us\nNiggas ain't shit 'til they pass away, so I\nWatched my step, but when Ola Mae left\nI was a motherfucking basket case, for real\nGod bless me\n'Cause I be on the east where they wanna arrest me (Freeze)\nI break bread, so they wanna suspect me\nBut look me in my eyes and say they wanna protect me, yeah\nRuthless, my style as a juvenile\nRan with a gang, got me a profile\nAs a child in the Beach I was wild\nReady to die and that's why\n\n[Chorus: Nate Dogg]\nI need a light (Light)\nSo I can smoke away this pain\nI need a drink (Drink)\nSo I can drink away this rain\nMaybe a wife (Wife)\nSomebody to share my name\nI need a song (Ooh)\nA brand new song to sing\n\n[Verse 2: Warren G]\nCould it be it was all so simple? Dropping a slick instrumental\nSnoop busting 'bout the shit we went through\nNate singing 'bout the city we came from\nAnd niggas so tight, wasn't nothing we wouldn't do\nTime keep slipping, but I ain't tripping, nigga\nIt's all about my children\nSo you can save that bullshit\n'Cause if I pull my shit, nigga I'ma kill you\nThe streets is watching\nAnd niggas fell victim from L.A. to Watts and Compton\nBut life goes on\nIt's just another song if you ain't the one gone, listen\nRuthless, my style as a juvenile\nBut now I got a brand new G-Child\nBig Warren gotta stay Trump tight\n'Cause he got to fly and that's why\n\n[Chorus: Nate Dogg & Warren G]\nI need a light (Light)\nSo I can smoke away this pain\nI need a drink (Drink)\nSo I can drink away this rain\nMaybe a wife (Wife)\nSomebody to share my name\nI need a song (Ooh)\nA brand new song to sing (Listen)\n\n[Verse 3: Warren G]\nCaviar wishes (Wishes), twisting stitches (Stitches)\nAll out race for the riches\nGot a nigga missing what rich is\nAnd what a life mean when you do it for the kids (That's right)\nIt's for my family y'all\nReally the only one who understand me y'all\n'Cause it ain't hard to ball\nBut then who got ya back when it's time to fall?\nAnd it's amazing\nTo stay up on top, your game so close to the pavement\nTime brings change in mind\nBut then don't let the change bring your mind no time\nClearly, a conspiracy\nNiggas right near me and still ain't hearing me (Hello?)\nThat's how it's always gon' fly\n'Til you ready to die and that's why\n\n[Chorus: Nate Dogg]\nI need a light (Light)\nSo I can smoke away this pain\nI need a drink (Drink)\nSo I can drink away this rain\nMaybe a wife (Wife)\nSomebody to share my name\nI need a song (Song)", "[Produced by Warren G]\n\n[Verse 1]\nFor 94, I'm a just glide and swerve\nHop up the streets with my heats so observe\nIt's me Z the whee Z, the Warren to the G Z\nThe deuces and the treys as kickin' it through E-Z\nAnd the beach and the bottle where I'm found\nFuckin' around with the muthafuckin' Dogg Pound\nFuck it, Warren's goin wild\nThe G Funk Era and the muthafuckin' G Child\nFunk, melody, rhythm, base\nHe which is I is in the muthafuckin' place\nSo let me get away, come again like this\nI can turn into a murderer so please don't diss\n'Cause if you do, you know where I'm from\nRat tat tat tat diddy dum diddy dum\n\n[Chorus]\nAnd ya don't stop, and ya don't quit\nAnd ya don't stop, and ya don't quit\n\n[Verse 2]\nWell let me grab my stick and shift to first\nI'm spittin' plenty game on my second verse\nWell let me switch to second just for the rough ride\nL-O-N-G-B-E-A-C-H Eastside\nWhere the grass is greener, at some times\nAnd I don't do shit but drop funky rhymes\nNow I'm in neutral, shiftin' to third\n'Cause what you hear is what you heard, nigga\nFrom the G-Funk, G-Funk, 'cause we funk, we funk\nAnd if you step muthafucka you get stomped\nLike 1, 2, 3 I'm shiftin' to the fo'\nBut you don't hear me doe\n\n[Chorus]\nAnd ya don't stop, and ya don't quit\nAnd ya don't stop, and ya don't quit\n\n[Verse 3]\nI said humpty dumpty sat on the wall\nI guess it's time for me to sum it up for all\nG Funk, G Child, gangsta groove, locc\nPast tense it's the Indo smoke\nChoke, off the shit that I'm doin'\nI'm droppin' this shit for you and you and you and\n'Cause it's me, the Warren to the G\nComin' in 1994 you see\nThe LBC and that's my locale\nCheck it out check it out check it out now\n\n[Chorus]\nAnd ya don't stop, and ya don't quit\nAnd ya don't stop, and ya don't quit\n\n[Outro]\nYou know what I'm sayin', Warren motherfuckin' G beeyatch\nYou know what I'm sayin', it's 94 that's how we doin' it\nAin't nuthin' but a Long Beach thang doe big baby, hey\nG-Funk, where rhythm is life and life is rhythm\nCheck me out doe, beeyatch", "[Chorus: G Child]\nMr. President, hey, this is the G Child\nSpacekateers, I'm back baby yes I'm back\nAnd Mr. President you're not chillin in the house baby\nYou're not chillin in the house\nYa know why? huh? huh? Should I tell ya?\nYou know why? Yeah.. cuz ya ya ya ya chillin in the shack beeyatch!\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel\n\n[Verse 1: C-Knight]\nIts ya muthafuckin third letter of ya alphabet\nPut Knight at the end of it\nIts a nigga you can't get with\nFunky styles, I be showin niggas\nI be blowin niggas straight out they socks, because\nThe Dove Shack is comin more twisted than dredlocks\nNow plot on the shack if you wanna\nBut if you get caught slipping\nWe will be dippin\nDown your block\nJust to street sweep your spot, nigga\nBut you can still follow along, grab ahold of my nut sack\nBecause I've got the doja\nOh I haven't told ya much love to my nigga Warren\nHe's a G, hook me, now I'm gettin funky\nI'm chillin with my feet up on the table in the shack\nWith my revolver, problem solver\nWaitin for a nigga to fuck with this\nSo I can let his ass know who he is\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel\n\n[Verse 2: 2 Scoops]\nIts the nigga 2 Scoops, the Long Beach Eastsider\nNiggas start to duck when I come cuz I'm a ridah\nSo I suggest you get the 411 on the shack\nWe peelin caps to the front, then we peel em back\nApproachin the wrong way, with no delay I blast your ass\nDraw for the gat but the Scoop is much faster\nYou can't miss me with that, step in my path\nI let the AK ripper cut that ass in half\nI dwells, I bells, in the LBC\nThe real menace to society\nPackin up alrighty\nA flow, but watch the one I used to abuse this track\nWe in front of that ass and you still can't see the shack\nSo pack up your gear and run and hide\n(and pass the dutchie to the left hand side)\nWe comin like that, it ain't no love for no rat\nI guess thats how we act when we chillin in the shack\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel\n\n[Verse 3: Bo Roc]\nAs you enter into the zone called the G Funk (now relax)\nHere a lie a war with the west (Dove Shack)\nKicks it is a know em\nRip em will be torn\nDip it as we flip it\nWicked with the Warren G child\nSee styles, meanwhile freestyles have been rendered\nI see the door of your mind, may I enter?\nI knock and I promise I won't hurt you\nThe definition of G Funk is just something to like swerve\nTo something to smoke herb\nTo sunk we and we serve\nGet with the dope herb\nTake a tall kid beat the loccness\nLessons will be taught before caught in the shuffle\nFlexin all the muscle, livin large is fuckin rustle\nI'm Simmons, I'm Robin, like givin\nI know you love this funky style\nOut this world, make your head twirl\nHear the less, now play the squirrel as you earl on the track\nWho am I Bo Roc from The Dove Shack\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel", "[Intro]\nYou may be black, you may be white, you may be Jew or Gentile\nIt don't make a difference in our house\n\n[Hook]\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\n\n[Verse 1: Warren G]\nMy house, my pool, my sofa, my couch, my roof, my ceiling\nMy floors, not yours\nMy cars, my bikes, my rings, my yard, my hood, my corner, my gang\n(My house)\nNiggas don't play around\nMy killas will lay you down\nMy city, My town\nNigga, that's my stomping ground\nMy streets, my homies, my turf\nMy people since birth\nWith heaters under they t-shirt\n\n[Hook]\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\n\n[Verse 2]\nMy hoes, my caddy, my foes\nMy drink, my smoke, my suicide doors\nKush blowin', remy pourin'\nDon’t trip you know where all the bitches goin', hehe yeah\nMy plaques, My Chauffeur , My Chandelier\nMy mirrors, my dishes, my silverware\nMy silk, my leather, my suede\nMy steak, my milk, my bacon, my eggs\n\n[Hook]\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\n\n[Verse 3]\nMy carpet, my pillows, my rug\nMy marble, my granite, my wood\nMy curtain, my shades, my blinds\nAs far as my eyes can see, it's all (My House)\nMy sink, my closet, my minks\nMy socks, my draws, my charms, my links\nMy bank, my money, my savings\nMy burner on my waist, don’t try to run up in (My House)\n\n[Hook]\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\nMy, My, My, My, My\nMy, My, My, My, My\nMy, My, My, My, My\n(In the Middle of the street)\nMy House\n\n(Instrumental)\nMy House[faded]", "[Intro: Warren G]\nThe place is here, the time is right\nFor the Twinz and Warren G to rip shit tonight, right\n\n[Verse 1: Trip Locc]\nHold on tight to your seat\nComin from the city that's low, urban life near the beach peep\nSo come one, come all, fall into my smooth flow\nIts the Trip L-O-double-C yo\nThe game is trump tight, ain't no need for you to boo me\nCuz after it's over, all you hoes gon' wanna do me\nIts part of the plan to get mine from the jump\nG-Dub hooked it up, so you know its gotta straight bump\nA typical day on the Eastside\nA lot of gangstas buck mouths\nAnd some brothers slangin' bean pies\nBut that's how it goes in the city where I was born\nFamilies mourn, niggas slippin, never gettin born\nSo thats why you gotta stay alert\nCuz everyday somebody's out, they tryin to put in a little work\nFor the hood, or just on the solo\nWalking in Long Beach real late is a no-no\nBut don't let me scare you, you do what you gotta do\nRespect is a must, checkin niggas that try to check you\n\n[Chorus: Snoop Dogg]\nY'alls niggas betta recognize\nFocus your eyes cuz my homie's high\nY'alls niggas betta recognize\nE-E-E-E-Eastside\n\n[Verse 2: Warren G]\nTick, tock, tickin to the Era\nIts Warren G with the Twinz funk Era\nN to the A to the T to the E\nThe S to the N to the double O P\n\n[Verse 3: Wayniac]\nI'm a take you on a trip\nSo keep the game I display mane\nI run it to ya in a gangsta kinda way (hey)\nIt's all good when you dealin with the Locc\nStilll blazed the smoke with the homies and the kin-folk\nAnd ain't no nigga gonna be takin mine\nI'm servin niggas with a quicka picka up and on as a nine\nSo if you really wanna watch this trigga flow\nIt's kinda itchy but I know I shoulda pulled it a long time ago\nCuz I be connecting like dot to dot\nSo when it gets hot well I gotta shake the spot\nAnd move to that other level see Wayniac coming through in 94 LBC\n\n[Chorus: Snoop Dogg]\nY'alls niggas betta recognize\nFocus your eyes cuz my homie's high\nY'alls niggas betta recognize\nE-E-E-E-Eastside\n\n[Verse 4: Trip Locc & (Wayniac)]\nNow you know the game and the game's complete\n(Why's that?) Cuz the Twinz are bringing nothing but heat\nAnd ya know you didn't wanna see the Cavi flow\n(What kinda flow?) The kinda flow that'll make you slow ya roll (ahh)\n\n[Warren G]\nSo open your eyes and pay attention\nIts two of my homies on a muthafuckin' mission\n\n[Twinz]\nAnd I, kicks up dust cuz its a must\nAnd I, acts a fool cuz its my rule\nSo need we say more on this topic\nWarren G droppped it\nPut it on track and we locked it\nNigga, did I rock it?\nNigga, did I rock it?\n\n[Warren G]\nIt really doesn't matter cuz its still only poppin\n\n[Chorus: Snoop Dogg] x2\nY'alls niggas betta recognize\nFocus your eyes cuz my homie's high\nY'alls niggas betta recognize\nE-E-E-E-Eastside", "[Produced by Warren G]\n\n[Intro]\nYeah, if you want it I got it ya need it baby\nYeah, its Warren G beeyatch\n\n[Verse 1: Jah Skills (Warren G)]\n(Jah Skills will just speak)\nAs I enter the G-Funk Era\n(tell me why you tweak)\nWell I dont know why however\nMy mind is throbbing\nI went bobbing for snapple\nMixed with E&J so my insides just crackle pop\nSnap long time ago ya lost ya flow\nNow you realize wack MCs I must chastize (what)\nThe gun totin bumpin indosmokin\nBad ass english cuz its broken\nCouldn't turn my styles even if ya had a token\nYou was hopin that I would quit but (aww shit)\nI'm hangin around like nut sacs with a dick\nI'm sick, I know that styles abstract up your ass crack\nLovin this shit called rap ass burnin through your back (Jah Skills\nMuthafucka)\nI'm stoppin fools like blood clots\nMy lyrics ring out to stop parties like there was gun shots\nWhy oh why oh why well why not\nShouldn't I represent this shit called hip hop and it won't stop", "[Verse 2: Warren G]\nWell are you high yet\nCan you recollect ya talk shit you get checked\nMr. Smutly I'm not a punk thief\nLet me break thee, smoke thee, choke thee and locc thee\nMuthafuckin M-I-C right now how\nWow how dow wow how dow piggy pow\nIts me, the Warren to the G gee G Z\nIts me uh can I just please thee\nRock the muthafuckin M-I to the C all day all night\nCuz I will just fuckin fight till I get mines\nMy ends, let me roll with my friends\nNigga you can't fuck with this cuz uhh I bends\nWhen I bends my style\nYou can't see this cuz I'm wicked and wild\nMr. Smutly just slow ya muthafuckin roll\nIts me Warren G on the muthafuckin gangsta stroll\nRockin with the T-W-I-N-Ss\nSo uhh let me just bless this\n\n[Bo Roc]\nHave you ever heard of a nigga called Warren G\n\n[Verse 3: Trip Locc]\nThere ain't no puzzle\nI lets it be known that I'm the trip\nLocc packin mo stackin mo shit than I did before\nThe real niggas from the Eastside, darkside\nBreakin off fools in my way on this whoo-ride\nSo best believe that I'm a threat\n(fuck a chin check)\nI'm a shoot him while my nigga blaze up the buddha\nAnd when we light it up, its on\nA taste of the Chronic, another nigga gone, but gettin his head\nFlown\n(so what you really wanna do) I'd a done it\nCuz yo mouth like zip loc so I know you won't run it\nTop notch Glock cock so you remember\nThe flow that I kick is nuthin less than a life ender\nSo watch yo step before you step into my path\nTryin to take whats mine is some shit I just roll past\n\n[Verse 4: Wayniac]\nLet me tell you how it goes\nPrime example of a night stalker\nCaught up in that bind\nUsin time with my hood as that street walker\n(gang bang) so I'm gonna have to take whats mine\nNotorious bitches but I dont love no one time\nSo peep it as I take ya down the backstreet\nShow you how I do it (how ya do it)\nI breaks em off to get my ends meet (pow)\nVictim of the ghetto so I'm sluggin\nThe man won't give me mine so the whitey I'll keep muggin\nI'm trapped up in a cycle but I'm keepin my humanity\nCuz I ain't goin out (us niggas always keep activity)\nNiggas say I'm crazy but to others I'm just nutty\nCuz I dont give a damn, ya life ain't shit without no money\nThats why niggas keep doin niggas but I'm not that nigga to be done\nYa fuckin around and set it off Long Beach is where I'm from\n\n[Outro: G Child]\nWhoo!! Spacekateers, in case y'all didn't know\nThat was Warren G, that was Jah Skills, and that was the Twinz\nHahaha\nThis is the G-Child, spacekateer space cadets\nIts on like that and its on like this, so don't miss", "[Intro: Nanci Fletcher]\nEeee\nThis town is run by martial law\nAnd Warren G are the marshall\nSo, Warren G, just pick up yourself everytime\n'Cause you don't know I say you rule!\n\n[Chorus: Warren G, (Boogie Down Productions)]\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n\n[Verse 1: Warren G]\nI had to shoot the sheriff it was justifiable\nHe mistaked me for somebody who was liable\nTo more than many murders\nLA's a war fields\nWe keep making war shields\nStreets keep souls\nYoung brothers lose control\nI seem to maintain through this\nWatch where you kick it they'll put you in a twist\nAnd it ain't nobody like my down ass hommie\nAnd tha police always tryin to pin some bullshit on me\nI keep away from fools\nThey do crime and  attract cops\nCops got guns and cuffs\nAnd cells to stuff you in\n\n[Chorus: Warren G, (Boogie Down Productions)]\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n\n[Verse 2: Warren G]\nThey tryin' to stick with some shit that I did not do\nYou know who\nThe boys in blue\nThere they go with they assumpitons\nSlaverys over let us have somethin'\nWhy you wanna pull me over?\nCuz I'm bumpin?\nI just made a new song\nMy profession is music\nYour profession is protection with gats\nThen use it on him when he's tryin' to take my life away\nI'm just tryin' to live my life today\nSo I keep away from fools they do crime it attract cops\nCops got guns and cuffs\nAnd cells to stuff you in\n\n[Chorus: Warren G, (Boogie Down Productions)]\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n\n[Verse 3: Warren G]\nI shot the sheriff\nI didn't shoot the deputiy I didn't have to\nCuz in this game they always tryin' to blast you\nAnd leave it to tha cops to find out who did the murder\nThey harrase tha wrong clan and arrest tha wrong man\nThe hommie day-dog got strapped but thats okay\nCuz I'm gonna work for life\nSo he can see another day\nA hommies a hommie\nA fake is a snake\nStraight game from tha pen from tha hommie jake\nSo I keep away from fools they do crime it attract cops\nCops got guns and cuffs\nAnd cells to stuff you in\n\n[Chorus: Warren G, (Boogie Down Productions)]\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was)\n\n[Bridge: Nanci Fletcher]\nFire!\nMake one shot for da man Warren G\nA lick two shot for da G Funk family\nA lick three shot for da LBC\nA lick four shot for da Jamaican posse\n\n[Chorus: Warren G, (Boogie Down Productions)] x2\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)\n(I shot the sheriff)\nBut I did not shoot the deputy\n(All I could think about was war and)", "We'll like to welcome y'all back to the club\nI'm your host this evening, Mr. Tadah!\nYa dig, club Toe Jam, is once again off the hook\nFor ladies night, ya dig, everynight\nRight now, we would like to bring something very special for you\nCheck it out\n\n[Nate Dogg]\nOooooooooooooooh\nI like them girls with the tight black skin, dark and fine\nThats the kind of girl I wanna play with tonight\nI wanna do some nasty thangs, wanna make her scream my name\nI like the girls that don't say, \"what?,\" know that she fine\nAlways knows her line, because she knows she's a dime\nPut her on platinum chains, got her own cash and things\nI like them girls, their sassy ways, sassy ways\nOh I like them girls, man I could stay there for days\nOoooooooooooooooh\n\n[Snoop Dogg]\nWhy you so cute, why you so big\nWhy you bullshitin', come and deal with a pimp\nPut your bags in the trunk, holla at your boy\nYou can spend the night, we at the Elroy\nDoing things that we shouldn't, couldn't\nGirl you got that good chocolate pudding\nThe best in hood, whats goodin'\nShe got the Wizard of Westwood, like old John Wooden\nBut how could I need that\nI'm looking for feedback, because I can't believe that\nI fell into a little tree sap\nI got a woman at home, ain't fell in love where the weeds at\nStarted off with a dime, but by the time I was thug\nShe was less than a duece, I'm telling the truth\nConfessing with you, I'm just messing with you\nBecause on the real baby girl, you put in the S in Snoop\n\n[Warren G]\nSee I rock baby, nonstop baby\nWarren G baby, shake that thang lady\nI see you picky lady, you be tweaking lady\nPulling that '38 snub out your stock end baby\nYou put the G in the dub, we hot fuckin' in the tub\nI ain't trippin' off baby, so why you trippin' off cuz\nI'm trying to get my money right\nSo you could kick it with baby, but get your mind right\nWhat the fuck is up, you messing with a G\nWarren to the L to the B and the C\nRegulate get cocked and be original\nThe game don't wait for female individuals\n\nSo what you saying, you trippin' off my homeboy\nWe ride like that, you know what I'm sayin'\nHey baby, just take the grabic\n\n[Nate Dogg]\nOooooooooooooooh", "[Warren G]\n1, 2 buckle my shoe\n3, 4 we gotta hit the store\n5, 6 back in the mix\n7, 8 Warren G and Nate\n\n[Nate Dogg]\nBang to the boogy say up jump the boogy\nTo the rhythm of the boogidy beat\nI dont love no hoes they know so they don't be fuckin wit me\n\n[Warren G]\nA long time ago I met Annie Mae\nShe was killing me softly like everyday\nPenetentiary steel, was stickin for real\nBlockbustin through the walls\nNow I'm makin housecalls\n\n[Nate Dogg]\nI thought I'd met a lot of scandalous women, and then I met Annie Mae\nGot a thin big butt like steel\nBut she didn't have a place to stay\n\n[Warren G]\nShe was shackin at mine and shackin at his\nBlowin my socks, tellin his biz\nNate Dogg this and Nate Dogg that\n213 skirt, and we stay intact\nSo I told the homey Nate don't be mislead\nAin't no fun if the homey can't shake a leg\nSo I went to the house and knocked on the door\nAnd guess who it was, Annie Mae you H-O\n\n[Chorus: Nate Dogg]\nI once knew a trick named Annie Mae (Annie Mae)\n(I once met a bitch named Annie Mae)\nI once knew a trick named Annie Mae (Annie Mae)\nI once knew a trick named Annie Mae\n\n[Nate Dogg]\nRemember yesterday I asked you baby have I seen you somewhere before\nWith just one look, the pussy was took\nCuz I make music that you adore\nNow I'm not sure and I might be trippin\nBut in 94 I heard a song\nIt ain't no fun unless the homeys can come\nSo Warren G put a condom on\n\n[Warren G]\nNow Nate you know me and I know you\nI got rubbers, gin and socco too\nSo lets do the do, on how we do\nNever my boot, just a freak that I knew\n\n[Chorus: Nate Dogg]\nI once knew a trick named Annie Mae (Annie Mae)\n(I once met a bitch named Annie Mae)\nI once knew a trick named Annie Mae (Annie Mae)\nI once knew a trick named Annie Mae\n\n[Warren G]\nAnnie Mae, Annie Mae, you ran out of time\nWarren G and Nate Dogg blew your mind\nCuz if you trickin wit him\nYou trickin wit me, you trickin wit the 2 1 muthafuckin 3\nI came from rags to riches\nTrustin no snitches\nThats how we do on 9 C I X bitches\nBuck em, fuck em, and put em in the trash\nAnd jump in the 600 Benz and dash\n\n[Nate Dogg]\nHold up Warren before you go just a couple things I got to say\nAre you goin home, I wanna be alone\nYou need to take this... home\n\n[Chorus: Nate Dogg] x3\nI once knew a trick named Annie Mae (Annie Mae)\n(I once met a bitch named Annie Mae)\nI once knew a trick named Annie Mae (Annie Mae)\nI once knew a trick named Annie Mae", "[Verse 1: Warren G]\nWhen I step up in the place your chance is gone\nThat bitch you was glancin on\nIf she leaves with me, no chance that her pants is on\nNo bra no panties on\nMake me suck the same thang that my hand be on\nRedbone big bitch with a sandy tone\nWe gone, South Beach in the Miami zone\nDamn she wrong, bad little candy cone\nOne head nod from me she out the door\nOne head job from her she out the door\nBack to the beach, back yo, the line o\nAll bullshit aside she's a cold piece\nThe type to might go search the whole beach\nThe type to might go out and bring back somethin wild\nScreamin, fuck me fuck me fuck me!!!\n\n[Hook: LaToiya Williams]\nSexy walkin with that attitude, you lookin at me, I'm lookin at you\nAlthough I know I wan't you I just can't help but check for you\nLookin at me, I'm lookin at you\nSneaky ways but I ain't mad at you, lookin at me, lookin at you\nJust imagine how this could go, I wan't you so\nAnd if you give me a chance, boy you know it's gonna get real\nUh huh, yeah huh\n\n[Verse 2: Warren G]\nI take mine from all waist line, face to the dime, waste no time\nGrind on the dicktake mine with a lick\nYou still be singin that Sunshine shit\nIt's your world girl come collide with the dick\nSome hot tone champagne Heather Hunter dominant some moan shit\nHome alone on some groan shit\nKing Kong make you moan with this\nAnd still wan't it all, in the club bathroom stall\nBackseat take your clothes off\nAnd still fuck your broad, and all it take is one phone call\nShow up, and I'm beatin up all walls\nNo joke, she broke all laws,handcuff a nigga lost balls\n\n[Bridge: LaToiya Williams]\nThere we roll (Creep)\nI got a spot where we could go and roll (Creep)\nWhether you can kick it holla let me know (She creep)\nI'll keep it on the low, ooh oh oh (Creep creep creep creep)\n\n[Verse 3: Warren G]\nSexy walkin with a street attitude\nLove to get between the streets and cheat on your dude\nBesides, these drugs, got me in the mood\nAfter the club we can choose how Stella got her groove\nI ain't tryin to live rude, meet at my room number 2-1-3\nPrivate slumber party, with your name on the V-I-P\nThat's how we get crunked sip realy and get drunk\n\n[Hook: LaToiya Williams]\nSexy walkin with that attitude, you lookin at me, I'm lookin at you\nAlthough I know I wan't you I just can't help but check for you\nLookin at me, I'm lookin at you\nSneaky ways but I ain't mad at you, lookin at me, lookin at you\nJust imagine how this could go, I wan't you so\nAnd if you give me a chance, boy you know it's gonna get real", "[Intro: Warren G & Ty Dolla $ign]\nAnd now before we start this record, let me\nRelax ourselves (Oh, oh)\nAnd we rid our minds of all problems or any worries that we might have (Ooh yeah)\nEveryone I want you to sit back in your seats\nTake them persons out of your life\nFor the [?] (Ooh yeah)\nOkay\n\n[Verse 1: Warren G]\nI'm back on my bullshit, I'm a nuisance (Nuisance)\nOG status, I keep it movin' (Movin')\nI laid the blueprint, yeah, I do this\nCircle of winners, y'all losers\nShe say I'm always in the studio (Studio)\nPlottin' and plannin' on a movie role (Movie)\nAnother hit record on the radio (Radio)\nIt's another hit record on the radio (Radio)\nBitch, you look good with no makeup on\nI was gone for a minute, now I'm right back home\nWe gon' sip and paint down in Malibu\nAnd I can teach you the game, how to get it too (Get it too)\nBaby, I'm the man, just know that (Know that)\nPose for the picture, it's a Kodak (Kodak)\nPut it on the 'Gram, it's a throwback (Throwback)\nI'm a, I'm an Eastsider rider and you know that\n\n[Chorus: Ty Dolla $ign]\nAnd you know that\nAnd you know that, uh\nHow I'm pullin' up, you know that (Oh)\nYeah, you know that\nWe gon' always stay on top\nAnd you know that\nYeah, you know that, oh yeah\nYeah, you know that\nYeah, you know that, uh\nYeah, yeah (Ooh yeah)\n\n[Post-Chorus: Ty Dolla $ign]\nYou might catch me rollin', rollin', uh (Rollin')\nIn the Porsche or my '64 (Skrr)\nSay she like how I be slidin', slidin' (Skrr)\n'Cause lil' bitch, don't act like you didn't know\nShe know I'm from California, California (Ooh yeah)\nTell that bitch \"You better answer, pick your phone up\" (Ooh yeah)\nCatch me with another bitch, she ain't goin' for it\nYeah, she might pull the strap out like Carter (Carter)\n\n[Verse 2: Warren G & Ty Dolla $ign]\nBust down baby, check the Rolex (Rolex)\nIt's VVS diamonds in this Rolex (Bling)\nWe gon' stay on top and you know that (Know that)\nMy pretty girl pulled up in the Hellcat (Skrr)\nYou can catch me rollin', rollin' (Rollin')\nTop down in my '64\nChasin' that bag if you didn't know\nIf you wanna get it, then we gotta go\n\n[Chorus: Ty Dolla $ign]\nAnd you know that\nAnd you know that, uh\nHow I'm pullin' up, you know that (Oh)\nYeah, you know that\nWe gon' always stay on top\nAnd you know that\nYeah, you know that, oh yeah\nYeah, you know that\nYeah, you know that, uh\nYeah, yeah (Ooh yeah)\n\n[Post-Chorus: Ty Dolla $ign & Warren G]\nYou might catch me rollin', rollin', uh (Rollin', rollin')\nIn the Porsche or my '64\nSay she like how I be slidin', slidin' (Slide)\n'Cause lil' bitch, don't act like you didn't know\nShe know I'm from California, California (California)\nTell that bitch \"You better answer, pick your phone up\"\nCatch me with another bitch, she ain't goin' for it\nYeah, she might pull the strap out like Carter\n\n[Chorus: Ty Dolla $ign]\nAnd you know that\nAnd you know that, uh\nHow I'm pullin' up, you know that (Oh)\nYeah, you know that\nWe gon' always stay on top\nAnd you know that\nYeah, you know that, oh yeah\nYeah, you know that\nYeah, you know that, uh\nYeah, yeah (Ooh yeah)", "I come to find out though, all these years, man\nThe game won't wait no matter who you are\nWhere you are or how you are\nThe game won't wait\nIts a cold thang, its a cold game\nYou know how it is\n\n(Chorus) x3\nGame dont wait\nShit dont stop because the game dont wait\nGame dont wait\nShit dont stop because the game dont wait\n\n[Snoop]\nNow all I, see is we\nThe LBC, 213s\nCheese and please and the reason the season\nThe click's off the heezy, Mr. Warren G Z\nGots to make it easy, for Snoop D Z\nThey come back, and drop raps and make snaps so easy\nThe most hunted, and most wanted\nWith a pocket full of hundreds, you know how we run it\n[Warren G]\nSnoop D woop pass the M-I-C\nAnticipation 213\nWe contemplate, and regulate\nNow we got the game tight, its money to make (money, money, money)\nThe game won't wait but you can wait for the game\nWorldwide tour, with skirts screamin our name\n[Snoop]\nThe hits dont stop because the game won't change\nAll we goin to do is maintain, maintain\n[Nate Dogg]\nThe hits dont stop because the game dont wait\nI got no time for no payin much rate\nI gotta go out and buy some brand new clothes\nChange my socks before they reveal my toes\nThe hits dont stop because the game dont wait\nAnd the girls dont stop because the dick is straight\nLet me teach you what I already know\nThe hits dont stop so its time I go\n\n(Chorus) x3\nGame dont wait\nShit dont stop because the game dont wait\nGame dont wait\nShit dont stop because the game dont wait\n\n[Warren G]\nNow its the second time around ain't no phonies any fakes\nLet me holla at cha tryin to snake my stakes\nYou older than me, you say OG, you almost 40\nTryin to stay young and sporty\nSport you roll me those and stay in ya place\nBefore you see all-stars, right up in ya face\n[Snoop]\nYoungsta never bite the hand thats feeds you\nProceed to get back to your folks, the loccs that need you\nWe do, we always keep it on the true\n213, thats the name of the crew\nIts true, that the dirt i did\nAs a kid got me caught up, but I was brought up\nWith the M-O if a D-O, so play your info\nYoungster I been doin this before I hit the radizzo\nSnoop D Z is off the heezey\nSo you can make mine, extra cheesy\nThe crew's a twist cuz it consists of\n3 riders, eastsiders, one love\nThe hits dont stop because the game won't change\nAll we ever wanted was a small time rap chain\n\n(Chorus) x3\nGame dont wait\nShit dont stop because the game dont wait\nGame dont wait\nShit dont stop because the game dont wait\n\n[Nate Dogg]\nThe shit keeps movin it'll never stop\nLong as we able to make hit roccs\nLong as a papa can't stop my flow\nThe shit don't stop I gotta make my flow\nThe shit don't stop if you intend to take\nThe shit don't stop its companies we break\nTake all the money and toss them hoes\nThe shit don't stop thats just how it goes\n\n(Chorus) x3\nGame dont wait\nShit dont stop because the game dont wait\nGame dont wait\nShit dont stop because the game dont wait", "(Intro, Warren G)\nThis song is dedicated to all my people\nThat was caught up in hurricane Katrina\nLouisiana, Mississippi, Alabama\nWe ridin with y'all\nYou know what I'm sayin?\nI feel your pain\nWe gon' make it through this y'all\nYeah\nCome on\n\n(Verse 1, Warren G)\nWe here today, then gone tomorrow\nIt's got me singin a Marvin Gaye song\nIt made me wanna holla\nSo I hop in my Impala\nJust to cruise, shake my blues\nIt's hard to follow\nHard to swallow what they sayin on the news\nGood Lord, it's a crazy world\nWatchin cops puttin cuffs on a five year old girl\nRacism, racism, got our babies in the system\nMom and daddies in the prison\nThat's intention, no division\nThey the ones that's all you got\nThey keep the families divided\nKeep it gangsta, keep it real\nThat's all I hear, but I dont buy it\nWhen it's Revolution time, all these fool's will keep quiet\nLike shhhh, you can-you can hear a pin drop\nCan't go to one-ten cuz I might get popped\nPeople shootin on the freeway, when will it stop?\nBut stay strong, cause the rain don't last\nAnd push the war up in 'em, will fix the price on gas\n\n(Hook, Side Effect)\nDon't let nobody, no-o-o one\nGet you doooowwwwnnnnn\nCause if they do, if they do\nI'll be arouuuunnnndddd\n\n(Verse 2, Ice Cube)\nWhy the black and the brown got to fight in the Pen\nThe black and the brown, they squabbin again\nThem God damned sheriffs, is laughin again\nIt all stink, keep yo ass out the wind\nSee the black and the brown, we can share the same land\nWhen I was a slave, where the hell did I ran?\nCalifornia man, it was full of mexi-cans\nLook mu-fasa, this is they casa\nJust, kick back and enjoy the sunshine\nLive ya life, stay away from one-time\nGet'cha money man, find the lunch line\nThis ain't a joke, homie where's the punch line?\nThe ghetto is a trap homie, take the cheese\nSoon as you do it, here come the police\nInvented and designed for us to fail\nHomie, don't you end up dead or in jail\n\n(Hook)\nDon't let nobody, no-o-o one\nGet you doooowwwwnnnnn\nCause if they do, if they do\nI'll be arouuuunnnndddd", "(Verse 3, B-Real)\nWhat's really good?\nWhat's really hood?\nWhat's really goin on?\nOpen your eyes and ears\nWipin your eyes from tears\nFrom all the lies and fears\nPeople get blinded here\nLet me define it clear\nYou gotta cross the bed\nTell 'em some thoughts, oppressed\nSomeone who flosses there\nYou gettin lost in there\nHomie they cost they fares\nNiggas get bought and passed\nTell us, get caught somewhere\nNever get tortured, kid\nI heard the shot from there\nHit on the spot, from where\nRight on the street, prepared\nLevels of heat, you there\nSpit at my feet, I swear\nI will retreat, for years\nPeople deceive the peers\nMake you believe the cheers\nBut underneath the smears\nI keep switchin gears\nFall in my sleep, I wear\nFor all the seekin shake\nYou got a dime to spare?\nYou sound so sincere\nYou're bottom line, bitch yea\nYou sound so sincere\n\n(Hook)\n\n(Verse 4, Snoop Dogg)\nI try to do right\nI don't wanna do wrong\nI'm doin better things\nMan, I wanna live long\nAin't too many fools out there harder than me\nI love football so much, man I started a league\nOh what a pity, is made for the inner city\nUsed to be dark, but now the park's real pretty\nLil' boys outside, throwin footballs\nIn the hood y'all\nHey Snoop Dogg, how could y'all?\nLet 'em pass instead of blast\nThe football field is a class\nAnd I'mma teach ya, teach ya my lesson\nShotgun formation, no Smithson, no Wesson\nThe haters keep stressin\nAnd everybody wanna ask me the question\nHey Boss Dogg, how you feel now?\nYou helpin out the kids, and they still hatin on ya, wow!\n\n(Outro, Warren G)\nYou know what I'm sayin\nThere's a lot goin on in this world\nBut we gotta keep on pushin and movin and groovin\nYou know what I'm sayin?\nYea, even though we got these hard times\nWe still gotta keep it steady, ya know?\nKeep pushin\nSo I want y'all to ride with me and cha-cha to this\n\nDedicated to my people out there strugglin (Stay strong)\nSingle parents, nine-to-five, steady hustlin (Stay strong)\nCollege students workin hard to be somethin (Stay strong)\nAnybody makin somethin out of nothin (Stay strong)\nDedicated to my people on lock down (Stay strong)\nAnybody lost somebody, wish they still around (Stay strong)\nTo all the soldiers fighting for us on foreign ground (Stay strong)\nTo one and all, turn them frowns upside down\n\n(Hook)", "Good evenin'\nI must repeat, and cheat once again\nWe gon' talk about bitches and hoes\nThere is somethin wrong with 'em\nEspecially now (aha)\nThey want niggas (aha) to give 'em chronic (aha)\nAnd all that shit too (aha)\nBut bitch (aha)\nI said bitch (aha)\nI ain't gonna go for it (aha)\nNot now (aha)\nNot ever (aha) (aha)(aha) (aha)\nLet's raise the offerin'", "[Warren G]\nCall me Dub-A-Double-R-E\nN be the end last letter be the G\nG be for Griffin, smithin, like Wesson\nNiggas, that be 'fessin\nI'm crushin your whole chest and\nIn combat if they fat I'll skinny em\nSix times the terror pass the Era to Millineum\nG-Funk, bumpin in ya trunk\nCall me booshe nigga, LBC me nigga\n\n[RBX]\nStraight from Long Beach\nWhere, we gets more naughtier than Comăneci\nCan you say roundoff hand spring\nDo ya triple somersault fools will be flipped I'm sure\nLong Beach, right by the water\nRespect is due when you walk through the border\nLine, if you dont you might find your face in a gutter\nLong Beach will get ya wets\n\n[Kurupt]\nThe homey just whistled, gave us the signal\nTo act the fool with the pistols, pierce the gristle\nOne way out homey, in the cut\nHeat cocked, beef for weeks, heat for block\nTechniques to rock, the blocks socks\nUnorthodox, cannon cocking bandit nigga\nI daily rock the planet nigga\nScope out the vicinity, start seperatin(what?)\nThose thats cool and those hatin\nEvery nigga in between\nGot 5 seconds to evacuate the scene (yeah)\nHit the stash (nigga)\nNigga what the fuck you wanna do\nTalk, blast, nigga think fast, fast fast\n\n[Chorus: Nate Dogg]\nHit a nigga wit a little gangsta love\nGangsta love\nHit a nigga wit a little gangsta love\nGangsta love\nHit a nigga wit a little gangsta love\nGangsta love\nHit a nigga wit a little gangsta love\nGangsta love\n\n[Warren G]\nLets go to war, no, not with guns\nBlast you with heat, original beats they run\nFast and faster, Master like P\nOr you can just say, Master Warren G\nI'm bout it bout it, highly touted\nAnd I doubt it\nIf I let another nigga take my tracks and re re-route it\nI truck more styles, like my Yukon I puke on\nThe rest of these niggas, trying to contest\n\n[RBX]\nHold up, who's speaking of contest, no, none of that\nWe get gats beats technique rat tat tat tat\nSplat, and ya flat, pure satisfac\nX marks the spot of the brutal venacular\nYou drinks down like dracula\nListen here buddy you'll be found left bloody\nIts the beach nigga, straight up\nBefore ya hate, get ya weight up\nOr get wet up now what up\n\n[Kurupt]\nYeah, yeah OGs\nMy nigga Warren G, uh huh\nThats my OG\nMy nigga Nate Dogg, my nigga Snoopy, my nigga RBX\nThey're my OGs, my real OGs\n\nYou up against the aces nigga\nIt all takes place in many places nigga\nSeveral different faces nigga\nThe streets can watch me nigga\nBut the streets is up against Kurupt Momar Khadafi nigga\nOG, juggernaut, jagged edge, homey two to the head\nAs the sprinkle spread\nDeath will kiss ya, fuck around with the Militia\nStalking till the big homey Nate walked in\n\n[Nate Dogg]\nSame old niggas in the same old place\nLong Beach city is where I was raised\nI keep my heater right by my side\nWon't stop mashin till I get my prize\nEven if you blind we can make you see\nThe perfect combination Nate and Warren G\nWhen we bust we hit em everytime\nAin't no secret its about that time\nTo\n\n[Chorus: Nate Dogg]\nHit a nigga wit a little gangsta love\nGangsta love\nHit a nigga wit a little gangsta love\nGangsta love\nHit a nigga wit a little gangsta love\nGangsta love\nHit a nigga wit a little gangsta love\nGangsta love\nGangsta love\nGangsta love", "[Hook: Nate Dogg]\nShe said she wants to come over tomorrow\nBut I see two dudes and they look like trouble\nThe doorbell just rang, so I grabbed my pistol\nShe thought she could set me up, she was dead wrong\n\n[Verse 1: Warren G]\nOnce upon a time, not long ago\nI had to go and put the smash down on this ho\nNever been the one to chase nothing but my dough\nAnd I never waste time, I stay ready to go\nShe was thick, lightskin, with the prettiest eyes\nType to make a nigga listen to the silliest lies\nBut I don't believe her, I see through her disguise\nBut she so bomb, a nigga had to give it a try\nI met her at the club, she was sipping Mojitos\nShots of Patron had me ready to beat though\nShe told me she was ready to come over and chill\nTold her, \"hit me on my celly if you really for real\"\nOut the corner of my eye I observed\nA couple unsavory characters in the cut, the nerve of this bitch\nI hope its not what it's looking like\nShit, I guess I'm 'bout to find out tomorrow night\n\n[Hook: Nate Dogg (Warren G)]\nShe said she wants to come over tomorrow\nBut I see two dudes and they look like trouble\nThe doorbell just rang, so I grabbed my pistol\nShe thought she could set me up, (uh huh, okay bitch)\nShe was dead wrong\n\n[Verse 2: Warren G (Nate Dogg)]\nOn the phone she was sounding sexy\nTalking all nasty, reckless, acting real extra\nI think I hear her nigga's voice in the background\nWhispering, something funny style going down\nDoorbell ringing, I'm at the peephole with the strap\nI ain't hear them coming from the back\nI bet they thought they had me, but that fully automatic\nI let all them niggas have it\nThe bitch got it first of all for tryna trap me and set me up\nI had to show her what's happening\nDamn, why she wanna stick me for my paper?\nBlam, right between her eyes with that laser\nOne shot (one) two shot (two)\nThree shot (three) four (four)\nGun cock, unlocked, bodies on the floor\nI had to do what I had to do\nIf it could happen to me, it could happen to you\n\n[Hook: Nate Dogg]\nShe said she wants to come over tomorrow\nBut I see two dudes and they look like trouble\nThe doorbell just rang, so I grabbed my pistol\nShe thought she could set me up, she was dead wrong", "[Intro]\nToday, yea\nThe weather and the women and the weed\nOh yeah, it's Saturday and I am your favorite DJ\nDJ Easy-Dick, I'mma give it to you the long way\nIt’s Warren G, E-40, Fonzerelli, Too $hort, and Nate Dogg\nIt's Saturday\n\n[Hook: Nate Dogg]\nIt's Saturday, time to go out and find me a party\nI wanna play, got to have you all over my body\nI feel nasty, when the music hits me I get real naughty\nAnd I wanna play, yeah, if you feel me go raise your hand somebody\n\n[Verse 1: E-40]\nWho is that big African American in the Cayenne\nDoing what he want, not doing what he can\nBehind tinted windows, car worth a hundred grand\nSpeakers on tremendo, quaking, waking up the land\nPopping my izzim, better holla at this broad\nIn the Geo Prizm, I deserve an applause\nBruh, I know how to pick them, boobies shake like Jell-O\nNot from Pittsburgh but she black and yellow\nI said, “where’s your fellow?” she said, “I fired that buster”\nBum ass nigga, couch potato hustler\nHe spend more time with his homies than he do his honey\nAlways in her face asking for gas money\nI said, “today your lucky day, what’s your schedule looking like?\nCan you come out and play? I got a show tonight”\nYou deserve it baby let your hair down, let’s celebrate\nIt’s the weekend doll\n\n[Hook: Nate Dogg]\nIt's Saturday, time to go out and find me a party\nI wanna play, got to have you all over my body\nI feel nasty, when the music hits me I get real naughty\nAnd I wanna play, yeah, if you feel me go raise your hand somebody\n\n[Verse 2: Warren G]\nSunny skies it’s a beautiful day\nMoney wise it’s a beautiful day\nWhen the sun goes down all the fun goes down\nThongs go down and tongues go down\nShe looking for a man I’m like damn, look at this here\nI’m looking for a freak, but not this freak here\nIt’s time to switch gears, full speed ahead\nSome weed and some head\nNew sheets on the bed\nAll they want is sex, trees, and ecstasy\nAll I want is all bitches all next to me\nSurrounding me, all around me\nHounding me like they all wanna pound me\nAnd I’mma just let them, I’mma just hit them\nLike it’s my birthday, everyday a workday\nSunday, Monday, Tuesday work\nWednesday, Thursday, Friday…\n\n[Hook: Nate Dogg]\nIt's Saturday, time to go out and find me a party\nI wanna play, got to have you all over my body\nI feel nasty, when the music hits me I get real naughty\nAnd I wanna play, yeah, if you feel me go raise your hand somebody\n\n[Verse 3: Too $hort]\nThat’s how I do it pimping, woke up with two beautiful women\nI’m ‘bout to hit the carwash and the barbershop\nThen I might dip to the mall and shop\nJust ate at a nice little breakfast joint\nOn my favorite day, so what's the point?\nThe whole town’s in a good mood\nSmoking good weed, eating good food\nAnd I’m thinking, wish I could go the beach\nThe girls flirting, damn, they must know I’m a freak\nYou wanna be the best I ever had in my life?\nShoulda seen what I did last Saturday night\nTold these girls in my stable\nCall the VIP house and reserve a table\nAnd make sure you wear a new fit\nRock and patron man we too lit\n\n[Hook: Nate Dogg]\nIt's Saturday, time to go out and find me a party\nI wanna play, got to have you all over my body\nI feel nasty, when the music hits me I get real naughty\nAnd I wanna play, yeah, if you feel me go raise your hand somebody", "[Intro: Ron Isley]\nIf you wanna be with me, yeah\nLet me hear you say Warren G, Warren G\nIf you wanna be with me\nWell, well, well, let me hear you say Warren G, Warren G\n\n[Verse 1: Warren G]\nSmokin me out to the finish, I thought you knew\nI thought they knew, who was up in this\nRon Isley, I's be Warren G\nBaby said would ya please come roll deep\nChocolate Thai, I said I\nGot the hennessey chaser, skirt you look fly\nPeepin them lips, hittin two finger sips\nOn the 710 freeway, I straight dips\nWit a fat one rolled up to puff\nI'm ready to hit it and I won't quit it until I get enough\nTokin nothing but the bomb thats without no doubt\nAs she twist up another split she's straight smokin me out\n\n[Chorus: Ron Isley]\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\n\n[Verse 2: Warren G]\nI slinkin while I'm thinkin just how good it is\nTo do it how we do it in the hood I live\nPassin homies on the block, gettin major respect\nAnd by then y'all the hen dog is taken effect\nNever panic hit Atlantic then I banked to right\nPulled straight Nellin B's order steak and rice\nWith the gravy, baby gets the shrimps and fries\nI'm diggin on her figure as I glimpse her thighs\nShe's satisfied, I left the tip and dipped to get back\nTo twist another zag and to grab a six pack\nShe went back, so we proceed to parlay\nEverything is lovely and we doin it always\n\n[Chorus: Ron Isley]\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\n\n[Verse 3: Warren G]\nThis ain't no love ballad\nBut see baby I gots to have it\nWhen I see that bomb I grab it, cuz its a habit\nSo dont come with that toe down stretch\nI ain't stressin, Long Beach baby keep smokin me out, she learned a lesson\nFloatin high as a kite as I chill and lay low\nBumpin time is collected, sunday nights on the radio\nOh, I forgot, how lit I was, crazy glued to the seat\nDog said she need\nSo conversation ain't needed\nWhen she know that I'm weeded\nHeadin to the hotel to regulate it and beat it\nI exhaled, I seen a cloud of smoke\nI banged it to the boogie by my head and got locced\n\n[Chorus: Ron Isley]\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love\nShe's smokin me out, smokin me out\nSmokin me out, smokin me out\nOh she's smokin me out with the homey's love", "[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\n\n[Verse 1]\nLet me tell you bout the village where I dwell, it's a...\nLiving hell still tryin to make a heaven outta this right here\nWatching fo' the postman hopin fo' paper\nPlease stop the bus mister driver, wait up we got...\nRock fights where the dead end meets\nThe stop lights is out so it's dead in the streets\nThe countyline look long, but I'm kinda hungry\nSo I pack a sack lunch, and got on\nLate for class again, it's half past 10\nAnd moms gonna whoop ma ass again\nNow and then I get the feelin that the world is mine\nI start sittin back watchin time fly by\nBut uh, I'm so proud to say\nThat the ghetto is the reason that I'm loud today\nAnd you come get a glimpse of what's happenin\nSee for yourself how it is where I live at\n\n[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\n\n[Verse 2]\nIt shouldn't take long to see, the place that belongs to me\nIt's all good, ain't nothin like home to me\nNo Diplomas but I, got some knowledge out of\nMy other partners that made it up outta here\nAnd now not a whole lot of us get rich\nBut like the old saying goes \"Ain't life a bitch?\"\nAh shit, the Landlord just raised the rent, fuck that!\nDem old days that came and went like this\nThere's more ways you can use your time instead of\nLooking for shit that you used to find\nBy the age of 16 ya finally come to grips\nLivin life like this and nothin else mean shit\nLooking for a smooth getaway\nCool, cuz soon I'll see a better day\nAnd if not - then I gots to deal with it\nI ain't makin this, up hell naw it's real nigga\n\n[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\n\n[Verse 3]\nNo more suprises hopin I can open your eyes\nAnd so I'm trying, instead of lookin up in the sky\nI'm in the fast lane speed dreaming\nNappin on cruise control please believe it!\nIn my city when you see it at night, look different than it does in the day\nAin't no tellin what'd happen if it wasn't this way\nI ain't trippin off of shit it's a good thing\nI made a name off the local neighborhood gang\nAnd at that time I started rhyming\nAnd, set up a hill without help to start climbing\nAnd I've been around this for a minute\nYou gotta get your own mix and get wit it\nI made myself, learn to pay myself\nNigga the game don't wait so I'ma stay myself\nAnd now you can go and tell another nigga\nOn how the real ones is livin in the ghetto\n\n[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?", "[Hook: Nate Dogg]\nMake love to you, tonight\nTouch you, feel you, tonight\nIn the midnight hour\nIn the midnight hour\nI wanna make love to you, in the midnight hour\n\n[Verse 1: Warren G]\nAnother late night, yeah, usual, locked in the studio\nThinking 'bout when I leave, what I'm gon' do to you\nTalking dirty all night while I'm mixing records\nIt's 11:30, don't worry, I'll be there in seconds\nForget getting pretty, baby, just get naked\nPut on some old school grooves, a Marvin Gaye record\nTeddy P. , close the door; a love T.K.O\nPlay The Whispers and The O'Jays, it's on fo' sho'\nI remember when I used to be a youngin\nFirst time I heard Barry White it made me feel something\nTonight's the night, let's do what you like\nSip some Dom Pérignon, a little candlelight\nI got the whip cream and strawberries, take a bite\nGon' have to call in sick cause this gon' take all night\nThen early in the morning I'mma tap it right\nYou make me wanna get married, I'm just playin', syke!\n\n[Hook]\nIn the midnight hour\nIn the midnight hour\nI wanna make love to you, in the midnight hour\n\n[Verse 2: Warren G]\nGrab your lover or your friend and just step together\nIt's just a moment in time, make it last forever\nBarbecues, house parties, skating breaks, whatever\nWith someone special in your life it don't get no better\nSo even when the rainfall changes the weather\nWe could do like Al Green baby, Stay Together\nGirl I love it when we almost break up\nFight and fuss, kiss and hug, then we make up\nMake love all night then we wake up\nEarly morning, sunshine through them bedroom blinds\nFolks smile cause I'm yours and you still mine\nCause real talk everyday ain't valentine\nSomehow some way we do just fine\nSo remember when I'm gone out there on the grind\nAnd you at home all alone with me on your mind\nI'm just a call away\n\n[Hook]\nIn the midnight hour\nIn the midnight hour\nI wanna make love to you, in the midnight hour\nTouch you, hold you, feel you, make love to you\nIn the midnight hour\nIn the midnight hour\nIn the midnight hour\nIn the midnight hour\nIn the midnight hour\nI wanna make love, in the midnight", "[Lil' Flip]\nHeh, yeah this time around you gotta feel me\nCause I got my mind right\nAnd now I got my money right\n\n[Chorus: Flip + Redd]\nI got my mind on my money, money on my mind\n(Maaan Flip what you doin?), I'm grinding!\nI got my mind on my money, money on my mind\nMy watch ain't tickin it's winding!\nI got my mind on my money, money on my mind\nI'm standin on the cut(*sirens)nigga fuck!\nI got my mind on my money, money on my mind\nWatchin out for feds in them undercover trucks\n\n[Lil' Flip]\nLike 2Pac I got the Juice\nWrite another book like Dr. Seuss\nSittin sideways and my choppas blue\nSouthside roll on choppas smooth\nI'm doin this for Dj Screw (Screw)and I gotta make that cash\nAnd I hate that slow money cause I gotta make it fast\nMan I gotta make it last cause I'm a hust-a-la\nA syrup sippin, bird flippin, money dou-b-ler\nSo holla at me if you niggas wanna re-up\nI'm like the head coach I gotta keep my D up\nMy jewerly freezed up, mybad it's froze up\nI'm pullin up in a Lam' with the do's up\nSo get ya cash right don't get a bad wife\nMake sure she ain't that chick I hit last night\n\n[Chorus: Flip + Redd]\nI got my mind on my money, money on my mind\n(Maaan Flip what you doin?), I'm grinding!\nI got my mind on my money, money on my mind\nMy watch ain't tickin it's winding!\nI got my mind on my money, money on my mind\nI'm standin on the cut(*sirens)nigga fuck!\nI got my mind on my money, money on my mind\nWatchin out for feds in them undercover trucks\n\n[Lil' Flip]\nI'm spectacular bite ya neck like Dracula\nFlippin in my Acura you know I'm still a bachelor\nWe smokin on turantula with a fine ass hoe named Tamera\nWith a cousin named Angela who pose for my camera\nI'm young but I got stamina and I'll wreck you're hoe\nAnd just like Nike nigga I'll check you're hoe\nSo let's make this dough and get the hell out the game\nCause after this shit I ain't slangin no more caine(whaaaat!)\n\n[Chorus: Flip + Redd]\nI got my mind on my money, money on my mind\n(Maaan Flip what you doin?), I'm grinding!\nI got my mind on my money, money on my mind\nMy watch ain't tickin it's winding!\nI got my mind on my money, money on my mind\nI'm standin on the cut(*sirens)nigga fuck!\nI got my mind on my money, money on my mind\nWatchin out for feds in them undercover trucks\n\n[Lil' Flip]\nYeah all I'm doin is just representin for the hustlers\nYou know my niggas in Little Rock Knahimsayin they gettin they paper\nMy niggas in Kansas they gettin they paper\nKnahimsayin my niggas in Chicago gettin they paper\nMy niggas in Louieville gettin they mothafuckin money\nNiggas in Detroit, my nigga E-Dub he gettin his money\nI just got niggas everywhere ya Knahimsayin\nIf you hustler you gotta feel me, if you a pimp you gotta feel me\nYa Knahimsayin if you a hater you gotta kill me\nYeah we out this bitch!", "Warren G: This song is dedicated to all my people who's (that was) caught up in hurricane Katrina. Louisiana, Mississippi, Alabama. We Ridin' Wit'ch Y'all. U Know what I'm sayin'. I feel your pain, we gonna make it through this y'all. Yeah. Come on\n\nWe here today then gone tomorrow's got me singin' a Marvin Gaye song and make me want to holla so I hop in my Impala just to cruise, shake my blues off, hard to follow, hard to swallow what they sayin' on the news. Good lord, it's a crazy world, watchin' cops puttin' cuffs on a fie (five) year old girl. Racism, Racism got our babies in the system, Mom and Daddy's in the prison, that's intentional division. They don't want to saw you now they keep the family divided. Keep it gangsta keep it real, that's all I hear, but I don't buy. When it's revolution time, all these fools will keep quiet like \"Shhh!\" You can you can hear a pen drop. Can go to one tent cuz I might get popped, people shootin' on the freeway, when will it stop? But stay strong cuz the rain don't last and push the … price of gas\n\nChorus: Don't let no one, no one get U down. Cuz if they do, if they do, I'll be around\n\nChorus: Don't let no one, no one get U down. Cuz if they do, if they do, I'll be around\nB-Real: What's really good? Wus really hood? Wus really goin' on? Open your eyes and ears wide. Wipin' all your tears from all the lies and fears. People get blinded here, let me define it clear. You gotta cross the bad. Tell us the thoughts and prayers someone you getting lost … homie the cost ain't fair…\n\nSnoop Dogg: I try to do right, I don't wanna do wrong I'm doing better things I wanna live long. Ain't there too many fools out there harder than me, I love football so much man I started a league. Oh what a pity, it's made for the inner-city; it used to be dark, but now the parks real pretty. Little boys outside throwing footballs, in tha hood y'all. Hey Snoop Dogg, how could y'all; Let 'em pass instead of blast the foot ball field is a class, and I'm the teacher, teachin' my lesson, shotgun information no smith and no Wesson. The haters keep stressin', and everybody wanna ask me the question. Hey Boss Dogg, how u feel now, u helping out the kids and they still hatin' on you, wow!\n\nOutro (Warren G): U know what I am sayin'? There a lot going on this world. But we gotta keep pushin', and movin' improvin'. Yeah. Even though we got these hard times, we still gotta keep in steady u know, keep pushin'. So I want y'all tah ride wit' me and cha cha tah this, Come on. Dedicated to my people out there strugglin'. Single parents, 9 to 5, steady hustlin', college students workin' hard to be somethin', anybody makin' somethin' outta nothin', dedicated tah my people on lock-down, to everybody lost somebody wish they still around, to all the solders fightin' for us on foreign ground. To one and all, turn the frowns upside-down!\n\nChorus: Don't let no one, no one get U down. Cuz if they do, if they do, I'll be around. (fades out)", "[Verse 1 - Warren G]\nPut it together from the start with the homie\nCouldn't picture ever having to part with the homie\nAnd even though you're still here in the flesh\nIt's different on the West, your voice is truly missed\nThe missing piece, I'm saying it ain't the same\nNever leave you alone, praying for one more day\nWho these niggas come and get their hooks from\nWhen they need their radio shit spun? Nate number 1!\nA true artist indeed, you made your own lane\nAll these albums we drop will never be the same\nWithout your voice on them. I'm thinking that's the key\nChoked up, smoked out, riding to these melodies\nReminiscing memories, on my way to visit you in therapy\nHoping God make it clear to me on what the plan is\nThis dirty game is hella-scandalous, so this right here\nIs dedicated to Nate\n\n[Hook]\nThis is dedicated to you\nIt's really something special\nMaking dreams come true\nSeems hard to figure out\nBut that's what it's all about\nThis is dedicated\nThis is dedicated to you\n\n[Verse 2 - Warren G]\nFrom the dope spots, to popping on the charts\nGrinding in the beach to make it on the streets\nTouring overseas, submitting legacies\nWriting history with every song you sing\nRegulating the era, staying side-by-side\nAnd we gamble whatever. was the days of the past\nNow I'm looking to the future like\nI don't even wanna do music!\nBut I gotta keep it crackin\nIt's a challenge when your homie's talent\nHanging in the balance and life is such a trip\nI know the world is full of maddness\nLearning how to walk and talk again? I can't imagine..\nWhat that rehabilitation is like\nWhen that doc said that you couldn't sing on the mic\nWhat the Hell is going on?\nHe's been writing songs\nHell no, that ain't Nate Dogg!\n\n[Hook]\nThis is dedicated to you\nIt's really something special\nMaking dreams come true\nSeems hard to figure out\nBut that's what it's all about\nThis is dedicated\nThis is dedicated to you", "Ladies and gentlemen, pimps, playaz and hustlahs, welcome to the 1994 hooooooo\nDraft.yeah, yeah what's up what's up cause what's up yeah oh and I could tell you\nToday that fellas that we got a very very good draft fo ya all we got ah ladies\nLike kim the keeper straight from south gate we got ah tammy she too young\nRight now but thats alright the bitch still got some good pussy oh yes she do\nOkay also we got vivian the video hoes thats been in everybodies videos ya know\nWhat I'm sayin (she ain't got paid yet) ain't never gonna get paid either that\nBitch also we got ah aimee ah that jawjackin bitch from the west side long\nBeach ya know what I mean that bitch just be talkin like a mutha funker dont\nShe? okay then also we got melanie ah from the north side a.k.a yeast, or\nWonder bread, or ah flame on her junior high name, (burn baby burn) and she has halitosi", "Do you, wanna\nSmoke with me tonight\nI just wanna smoke\nLet’s get high, put it in the air\n‘Scuse me, may I have a match or light\nI just wanna smoke, let’s get high\nI’m on cloud 9 smokin’ on the good green\nIt ain't’ no secret now you can smell the reefer now\nAnd I’m higher than a mutha fucker 365 I’m higher than a muthafucka\nO.G, granddaddy what’s the newest name?\nDo Purple kush and indo still smoke the same?\nDo you like it in a bong, paper or a blunt\nCuz I get high on bongs paper and blunts\nBut not the flavored ones only like originals\nSwisher sweet or backwoods, or I smoke originals\nWhite papers zig zags for the chronic smoke\nAnd if you can’t grow, shit you just wait to smoke\nLet’s get high do you have a match or a lighter?\nNewborn Cali weed boy and its fire\nStrike a lighter lets get high put it in the air\nIts 4:20 everywhere with the chronic in the air\nDo you wanna smoke with me\nDo you wanna choke with me?\nDo you got that indo smoke? well you could loke with me\nRenew, revitalize, rejuvenate, accountability, stability, bomb tranquility\nYou trippin’ cause I’m usin’ big words\nMixin’ words verbs, pronouns and herbs\nWe heading back to the ghetto now\nJust bought a Cadillac ey you got a 20 sac?\nLet me get a couple what you do for 300?\nYeah I got some zig zags can you put some trees on it?\nHm, so I can get a piece of mind in this cold cold world that’s hard to define\nAnd uh it’s a miracle but smoking weed is spiritual\nWe all need high learning so I keep the fire burning\nHeeeey now you know, inhale exhale with my flow\nSo roll antother blunt\nI killed my high tryin’ go\nNigga played a smoka- a lot\nSo they call me broken stove\nSince a tiny G I been off the reefer leaf\nChoking off the sess weed\nNow its kusha keef\nThat light green is some good green\nBut that dark is the creeper, ya boy know its reefer\nRoll it in a zig zag fat like your finger\nAnd be careful with it, ya boy blow ether\nThe marijuana will keep your eyes low\nAnd make you lean in your seat, glide in your ‘64\nIm so cool plus high in the ’64, im old school\nWhite paper wrapped around the smoke\nI just wanna smoke\nSomebody roll a blunt\nSomebody fill the bong, somebody roll a joint\nStrike a lighter lets get high put it in the air\nIt’s 4:20 everywhere with chronic in the air", "[Verse 1: Warren G]\nIts that nigga Geezy Weezy\nBack for the 9-c\nI ex sippin on the yak so people wanna know whats next\nAin't nuthin changed, another day a new time\nWith this uptempo beat with the G-Funk rhyme\nRegulatin state to state, coast to coast\nIts all about the call of greens, yak, lets toast\nCuz its a ballin society\nI try to be the dopest I can be in this industry\nBut you dont hear me\nI think ya betta, I think ya betta\nCuz when I, get it goin on I ain't gonna let up\nI set up, the g-funk family and we\nFunkin up the industry until eternity\nIts alright with you if its alright with me\nWe'll get down to the sounds of the LBC\n\n[Chorus: Reel Tight + Warren G] x2\nRelax your mind, your mind, your mind\nRelax your mind and let your conscious be free\nGet down to the sounds of the Warren G\n\n[Verse 2: Warren G]\nIt ain't easy bein Geezy\nBut the lifestyle I chose, the status to which I rose\nThe doors, I open, I'm loccin, I'm scopin\nThrough the eyes of the G Child\nI see many try to duplicate the LBC style\nBut it ain't even happenin like that\nI was time I had to make a comeback\nAnd get mine, you know I'm genuine\nBeen in motion with the potion with Snoop since 89\nDevotion is the key for me so\nRelax your mind and let your conscious be free\nThe homey just touched down, foolin wit a pound\nPut yo gun down, so you can walk a safe ground\n\n[Chorus: Reel Tight + Warren G] x2\nRelax your mind, your mind, your mind\nRelax your mind and let your conscious be free\nGet down to the sounds of the Warren G\n\n[Verse 3: Warren G]\nI know it's been hard on you for about two, so\nI had to relax your mind, I thought you knew\nAin't nothin but a Long Beach party\nWith yo hands in the air, with the twist of Coke and Bacardi\nAll the homeys around and the slingshot t-shirts\nSkirts wit the baby fat it'll work\nPass me the indosmoke and get locced\nFrom the beach to the bay, makin them sway\nLike the ocean in motion, we coastin\nRelax your mind and keep floatin (floatin, floatin, floatin)\nAnd walk a safe ground\n\n[Chorus: Reel Tight + Warren G] x6\nRelax your mind, your mind, your mind\nRelax your mind and let your conscious be free\nGet down to the sounds of the Warren G", "[Warren G]\nI'm the illest, what?\nI'm the illest, Warren G, uh yeah\nI'm the illest, the illest you've ever seen\nHaha check this shit out do'\nPeep game, look, hmm\n\nShe used to tell me that she loved me all the time\nI turned to her, and say that I'm\nInfatuated, concentrated on cuttin it up\nBody bustin out your blouse, don't button it up\nMe and you could make a getaway, up in the cut\nI'm just a squirrel in your world, bustin a nut\nSlide in the passenger side and creep to the tilt\nAnd maybe you could get a chance to sleep on my silk\nBecause you come with, that A-1 shit\nThe kind I wouldn't mind havin a 20-year run with\nI'm done with these games, played by these dames\nI could exit the drama the same way that I came\nCos I gotta put it down for my sons\nSo you, skanless scuds gets none of my funds\nCos I can't be in love with my pockets on fee\nGet the money, the power and the rest come for free, you know\n\nChorus: El DeBarge, (Val Young)\n\nI let you hang\t\t(I let you hang around)\nSo you could see\t(so that you, could see)\nYou tried to switch\t(Understand, tryin to switch)\nThe fool out of me\t(and make a fool, of me)\nI meant\t\t\t(So I guess I'll have to let you be)\nBaby\t\t\t(Baby baby baby baby you know)\n*repeat*\n\n[Warren G]\nNow baby, look at the time\nWe gotta do what we gotta do\nThe club's about to close, don't you wanna ride\nIn a Rolls, Royce? Make it real moist\nTake the Rolls to the jet, take the jet to my yacht\nLetcha kick it for a week in my Carribbean spot\nCoconut milk bath (bath), private beach, first class (class)\nWater clear like glass (glass), waves ticklin your ass\nCut the act baby, you need a change of pace\nI deliver you a whole new world of taste\nGuaranteed to put a different timid look on your face\nPut the arch in your back when I'm grippin your waist\nWarren G keep flippin the bass on key\nCos you rollin with a G when you're rollin with me\nEasily I spit game to make it hot\nHeaded straight for the motherfuckin G-Spot, you know\n\nChorus\n\n[Warren G talking]\nSee now look at the picture\nYou got a lotta women out there preaching about\nHow they ain't a bitch or a ho but now\nIf you carry yourself in a fashionable matter\nGame can be matched both ways by a player\nNot a player hater, please believe it\nIt's told not to be sold by me\nYou know what, it ain't my fault\n\n*Val Young crooning*\nI let you, hang around, so that you, can see\n\nChorus (x1 1/2)\n\n*Warren G and Eve phone conversation*", "[Intro: Slick Rick]\nWell...\nKinda hungry\nHave you eaten?\nHardly any\nWalking down sunset boulevardnelly\nI had this miner on the lock\nShe said\nThat mutha fucker look finer\nThan a fuck\nBut he's an eastcoast cat\nPure jelly ass\nNigga kick a rap that can impress\nMy L.A. ass\nDisrespect\nWhen I didn't deserve it\nHey you acting like earning the\nBest rapper walk the earth yet (no)\nI guess some big tymer tapping her\nI huff, and puff\nBlew her fat rat ass off\nBlaze her\nShit, in the face\nThe most rapper\nWhy she acting like it didn't know\nWhile I pulls up on her Rolls\nI gets in it\nI'm like bitch it's\nBest you write down your number this minute\nCatching her going\nJust sparking off\nAnd she came to her sister\nBefore the car took off\n\n[Chorus]\nWe know what to do\nIf we give you the chance\nYou'll fall in love\nAnd all the time won't remain\nThe way you look\nYour touch is fine\nBut I won't let you blow my mind\n\n[Verse 1: Warren G]\nLodi Dodi\nWe like to party\nMy nigga slick rick\nCan still rock a party\nIt was 12:15 when I hit the scene\nFresh out from L.A\nTouching J.F.K\nI was on my way\nTo go get my bays\nI'm a real one from L.A\nSo I gots to say\nI hit my nigga slick rick\nAnd said I'm in town\nGet some puerto rican freaks\nCause it's got to go down\nSo we hit every girl in the N-Y-C\nI'm rush associated\nSo what's up with me\nWe fucked and flee off the hennesy\nGirl just for me\nHit'em all for free\nBeyatch!\n\n[Chorus]\nWe know what to do\nIf we give you the chance\nYou'll fall in love\nAnd all the time won't remain\nThe way you look\nYour touch is fine\nBut I won't let you blow my mind\n\n[Verse 2: Phats Bossi]\nWhat?\nFast as suave-a\nBoss will flip the script\nThe number one draft pick\nSo the G's is thick\nRoll with Rick\nNigga that'll roll with me\nEvery man feel free\nWhen he making a G\nIs money constant?\nAnd money all that I see?\nI'ma breath this shit\nMoney coming with me\nWhat you want with it\nThe boss stay committed\nTo drunk trying to pive it\nStill I bust the sickest\nCheck it\nWreckless major carrots\nIn my necklace\nBlack lence and go kill'em with ??? shit\nPerfect it now the game's obtain\nAnd this don pieces eyes\nPeel jocking the ring\nTrade the sex face\nBaby keep the pace\nLots to do\nLittle time\nAnd is love to make\nPromise you my pearl\nBaby this my world\nAnd even broke without a dime\nYou still be my girl\nWhat!\n\n[Chorus]\nWe know what to do\nIf we give you the chance\nYou'll fall in love\nAnd all the time won't remain\nThe way you look\nYour touch is fine\nBut I won't let you blow my mind", "{*gun shot*}\n\n[Hook]\nI saw paper dancing in the streets\nIn the streets of a Long Beach City\nListen to the beat\nMy people stroke their feet on the funky concrete streets of...\nStreets of a Long Beach City\n\n[Warren G]\nSome niggas quick to get it confused\nThis is where it's cracking at (wassup my man?)\nBig city of music, we more than half of that\nWhat happens after midnight goes unspoke of\nCause broke niggas where I'm at, they don't show love\nAnd I done witnessed the concrete junglin\nWatch the nigga turn soft and leave humblin\nSince I was young, I hung out, hard knock\nPlayed my hand when they dealt my cards\nNow check it out, what's real is what's happenin\nNow this is what I deal with and where I live at\nNot too many of us make it\nTo see the day that we able to make a statement\nThe ways of the world has gone crazy\nTwo things never change\nThat's the music and what the rules of the game is\nNow everybody knows yo name\nIt ain't no other place to turn\nBut I yearn to get a hold on this street shit, I learnt it\n\n[Hook]\nI saw paper dancing in the streets\nIn the streets of a Long Beach City\nListen to the beat\nMy people stroke their feet on the funky concrete streets of...\nStreets of a Long Beach City\n\n[Warren G]\nTake it back when I ain't had much\nA little bad nigga scrappin over bad much (gimme that fool)\nBut I was born with a hunch for this shit\nMy nigga did beats, still I hustled a bit\nHelpin my mother's ends meet\nIt's hard, is God watchin?\nNon stop while the cops keep rollin by on my block\nI see paper dancin in the streets\nSo what's the chance I can make the money work for me?\nBut it hurts to see ya niggas doin dirt\nFor a livin so I put in work with this gift I was given\nNow might I mention I been blessed by God\nAnd I'm down with anything to make life less hard\nNo matter where you are, it can happen to anybody\nThat's how it was where I came up and now I talk about it\nLBC, city of music\nG-funk you tell me, we do's it\n\n[Hook]\nI saw paper dancing in the streets\nIn the streets of a Long Beach City\nListen to the beat\nMy people stroke their feet on the funky concrete streets of...\nStreets of a Long Beach City\n\n[Warren G]\nIs you forgettin 213? (Warren, Snoop and Nate)\nYou must be trippin and forgot that it was me nigga\nWell check it out, you remember DRE\nIf you ain't know, well listen here, that nigga's kin of me\nAnd I don't know, but maybe you can sense this\nSnoop and Nate, them niggas I been friends with\nAnd I'm a frontline soldier to the fullest (fullest)\nMy punchline burns hotter than bullets (bullets)\nBut the way I play this game\nDisplays too many ways to get paid\nNow I ain't trippin of shit, not one of ya'll say (I ain't trippin)\nCause ain't nothin like the spot I'm from, and not\nToo many niggas walk the block I'm from, it's 2-1\n\n[Hook]\nI saw paper dancing in the streets\nIn the streets of a Long Beach City\nListen to the beat\nMy people stroke their feet on the funky concrete streets of...\nStreets of a Long Beach City\nI saw paper dancing in the streets\nIn the streets of a Long Beach City\nListen to the beat\nMy people stroke their feet on the funky concrete streets of...\nStreets of a Long Beach City", "[KRS-One]\nYeah Ungh Yeah Ungh!\nYeah Yeah Yeah!\n\nWe bout to do it like this\nWord up all the way from the Bronx\nLBC what's up?\nWooo Let's do this\n\nChorus 2X:\nIt's a movement\n(Let's go, here we go!)\nI'mma prove it\n(Let's go, here we go!)\nKRS-One\n(Let's go, here we go!)\nWarren G, Lil' AI\n(Let's go, here we go!)\n\n[KRS-One]\nRadio waves making you behave like a slave\nSo many ways to enhance what you crave\nMicrochips and optic clips have you licking your lips\nWith your eyes fixed on tits and fast whips\nIt's funny how we call cars whips\nWe slave for it\nHow many times were you beaten by they tricks\nYou looking at an eclipse\nFaded dark spot in front of the light\nShut your eyes quick\nInternational KRS passing through\nWhen you spell Hip-Hop the H is always capital\nHere's what we have to do\nIt ain't hard to see\nKRS, Lil' AI, Warren G\nThat's the power\nAin't no calming me\nAn open hour\nThey see the god in me\nPardon me\nIn hip-hop, your heart is free\nWhat you telling me, KRS, LBC?\n\nChorus (2x)\n\n[Warren G]\nSouth Bronx, South Side Bronx\nBoogie Down to my G-Funk Productions\nMic check, one two\nMove a little somethin\nSomething with my peeps\nHip-hop declaration of peace\nStreet movement (let's go, here we go!)\nLet's keep it music (let's go, here we go!)\nI'mma prove it (let's go, here we go!)\nIf you've got beef with Hip-Hop (let's go, here we go!)\nInternational incomes so we're in the suite\nWatching Ichiro hit in runs, life is sweet\nI take it back where I'm from\nKnowledge rules supreme over nearly everyone hmph\nIt's a shame how we caught up in the material lifestyle\nAnd our next generation living wild\nIt's time for discipline time for listening\nTo this declaration of Hip-Hop christening\n\nChorus 2X\n\n[Lil' AI]\nMy name is L-I-L AI, I'm Lil' AI, yo\n(raps in Japanese rest of verse)\n\nChorus 2X", "(Chorus x2)\nI need a dope beat, a dope beat\nJust holler at your boy named Warren G(I wanna)\nA dope beat(with my), a dope beat\nJust holler at your boy named Warren G\n\nY'all know me, the G from the 213\nLBC, Regulatin, skatin' on all them Dayton's\nBankin' back on them singles\nWith the Henney's and the Jimmy's\nLike I'm all tall, short, and like dark, thick and skinny\nI'm a ladies' man, Mercedes and\nProper ice, livin' nice, as far as gravy stands\nAin't nuttin' changed, me and Snoop's still the same\nPlus Nate droppin' weight with the classic thang\nNow I remember way back, at the bachelor set\nSlip my brother, Dre, Snoopa tape it, put it in the deck\nThe party started bangin' and they both shook hands\nAnd made it legitimate for the G-Funk Fans\nNow after that, they hit the top when The Chronic dropped\nRemember 187 on the motherfuckin' cop(I wanna)\nIt's Still A G Thang (with my), where we hang and claim\nEast Side 'til I die, or I rise to fame\n\n(Chorus x2)\nI need a dope beat, a dope beat\nJust holler at your boy named Warren G(I wanna)\nA dope beat(with my), a dope beat\nJust holler at your boy named Warren G\n\nI got my own style, I got my own pal\nIf you don't know now, then nigga, you better slow down\nSpendin bills, bendin' wheels, people think I steal\nPuttin' cameras in my grill everywhere I chill\nKick back, I spit facts, and twist our tracks\nDrank gin with The Twinz, see a bitch I mack\nCuz if I ain't in the studio, I'm deep in the hood\nAnyway gettin' paid like Warren should\nDre teachin' me to work a beat, now I'm bangin'\nAnd I been with platinum, now my album slangin' (I wanna)\nHangin' with my G's (with my) from the LBC\nWith the homies that I know will put it down for me\nWell known, keep my chrome, and I hold my own\nBut I'd rather roll and flow and be holdin' the shows\nWith the G-Funk Family earnin' a Grammy\nYou can't see what I see, and don't understand me\n\n(Chorus x2)\nI need a dope beat, a dope beat\nJust holler at your boy named Warren G(I wanna)\nA dope beat(with my), a dope beat\nJust holler at your boy named Warren G\n\nI'm on my way to the studio, beatin and thumpin\nScoop D from Long Beach got some heat from Compton\nHit the Eastside manages to see whats crackin\nGot some MGD, just watching for jackin\nIts a hard knock life, ya heard Jay-Z featuring Annie\nNo Limit like Snoop, thats when the grammy\nHit the Beach in the Long gray and black caddy\nReminiscing on my great escapes through the alley\nDamn I done grew up and things done changed\nJust shakin my head, trippin off the game\nIts so much you gotta do to keep it real out here\nBut ain't nothing guaranteed cuz ain't nothing goin' give\n\n(Chorus x3 to fade)\nI need a dope beat, a dope beat\nJust holler at your boy named Warren G\nA dope beat, a dope beat\nJust holler at your boy named Warren G", "[Verse 1]\nMusic open up your arms, take a brother in\nBass take me to a place I ain’t never been\nMy ink pen touch pace, take my pain away\nSongs, take away my wrong, make it right again\nI know we’ve been through some bad shits\nA lot of ups and downs, just me and my bitch\nBut every defeat only made me stronger\nI rose to my feet and I stood up taller\nFor you at the end of the day\nWhen I say I'm gon' stop this shit, turn around and walk away\nI can't, ‘cause that bitch pay a nigga so good\nI wouldn’t do it different if I could\n‘cause it’s me for you and you for me\nAnd all I see is you and me\nBaby, I’m\n\n[Hook]\nStill in love\nSho' 'nuff in love with you, hey\nStill in love\nSho' 'nuff in love with you, hey\nStill in love\nSho' 'nuff in love with you, hey\nStill in love\nSho' 'nuff in love with you, hey\n\n[Verse 2]\nIt feels like we’ve been together for so long\nMe and my two turntables and a microphone\nHold on tight, I can’t let you go\nBringing Snoop to Dre? That was a stripper’s stool\nBuilding blocks, west coast infrastructure\nFrom hip hop to the whole gangster rap culture\nFirst California nigga on Def Jam\nNowadays niggers getting signed out of webcams\nLook at some of these damn labels I grew up with\nThey got rich and switched up on some other shit\nWe millionaires, damn near billionaires\nI’m like damn, I helped all these fools get there\nBut now niggas only call when they need something\nI’m in the lab, puttin' to Al Green\nBaby, I’m\n\n[Hook]\n\n[Verse 3]\nI ain’t write this for nobody, I ain’t trying diss nobody I’m just being real\nUp and down since training wheels\nAnd I’m fly, no co-pilot\nNow what you know about it?\nMe, my stuff and I, respect my rep\nWest up, chest up, vest up\nRecognize the real lies, who’s next up?\nIf you ain’t ready for a ride, don’t step up\nI’m OG’ing the lane, gotti in the league\nSo how the fuck you gonna coach me in your league?\nPut the wrong out fire for another kush tree\nHaven’t seen more dollars that you ever could see\nSum it all, rap it ain’t nothing but love\nI’m just saying what’s on my mind\nBaby, I’m\n\n[Hook]", "[Intro: Warren G]\n(Whats up Warren G?)\nWhats happenin? I'm just chillin, you know\nCheckin my game you dig, you know\nTrippin off these fools around this situation here, you know its like that\n\n[Verse 1: Mr. Malik]\nI went from hustlin and slangin' to bustin and bangin\nI got to keep it real, so fuck not cursin when I'm sangin'\nNow let me tell y'all about this shit, went down the other night\nMe and the doggs see some niggas, just caught up in the hype\nTryin to ride and get by like the FBI\nCause we know bout them hk's, they right outside\nBut we never knew y'all had a clue bout what we go through\nSo tell how the fuck could you speak on my crew\n\n[Verse 2: Bad Azz]\nI went from dirt to large work like boatloads of keys\nIt's hard work and it hurts to live life on ya knees\nSo God please have a lil' mercy on my soul\nWhat my eyes see, my mind think, my hand should hold\nThe outcome of these actions warm hearts turn cold\nLil' snake tryin' to blast me with the gun he stole\nWe hang out, banged out, same route as the day before\nBlessed with perception, but don't know how my days a go\nCould see my nigga hittin' with some pay, a few days ago\n\n[Verse 3: Perfec]\nBlaze up a flow, sit watch my paper grow\nCautious, in case niggas wanna cross this\nBut they can't cross me, I'm way too flossy\nOut here making millions\nAll in with the villians\nLet's turn these millions to trillions\nI've seen it all pop slow unfold, and go\nNow it's time to get mo' dough, ya know\nI play under the wrath of thunder\nElectric shocks hot as the summer\nMore foul than funner, gun ya\nIn the open range, man it seems strange\nEven sometimes deranged inside my brain\nI hold the key, identify then flee\nEvery MC close to me\nCause I'm supposed to be all in with my chips (nigga)\nI'm all in with the crips and bloods\nGrips for thugs, I nudge\nThe homie on his shoulder, cause every day I'm getting older\nAs the world turns and gets colder\nLaid back I shot me sumpin', Perfec from dynamic, banging G-Funk\n\n[Verse 4: Warren G]\nWell I moved from the East to the West\nWord on the street, niggas wanna test\nBut these MC's, is scared to buck\nPlus they talk too much and smoke too many blunts\nYou fucking rookies\nSweet as Mr. Smith's cookies\nYa hate me one minute and the next ya wanna buck me\nHe sent a ho, in the back seat of my fo'\nWhile ya Going Back To Cali, watch how you flow\nNow ya know, about this Warren G Era\nG-Funk terror, look into the mirror\nAnd what you see is the don of the company\nThat nigga, (Warren, Warren, Warren to the G)\nDo you still see, what I see\nAll of the homies in the LB\nSittin back, and we makin the cash\nWarren G, Perfec, Hershey Locc and Bad Azz\n\n[Chorus: Warren G and Mr. Malik] x2\nAnd we never knew you had clue of what we go through\nSo how in the fuck could y'all speak of our crew\nYa thought this, ya thought that, we thought y'all should laid back\nYeah it's like that, homie it's like that\nSittin back, and we makin the cash\nIt's Warren, Perfec, Hershey Loc and Bad Azz\nSittin back, and we makin the cash\nIt's Warren, Perfec, Hershey Loc and Bad Azz\n\n[Outro: Warren G]\nYa know what I'm sayin Warren G\nWith my homeboy from the pound Hershey Locc\nAnd the homie Perfec, ya know what I'm saying and Mr. Bad Azz\nThat's how we doing it fool, yeah\nWe ain't bangin on wacks nigga\nYeah we doing it like we should be fool, yeah", "[Kurupt talking]\nY'all don't know nothin about this HEE-ARE\nHahahahahahaha, yeah! It's Kurupt Young Gotti\nHehaha, sup Warren G? It's my homeboy, huh?\nWith my niggas Crucial Conflict, huh?\nChillin, huh? Bumpin, puffin on a little bit of that Hay\n*TOKE* Aaaaaaaaaaaaaaah\n\n[Warren G]\nDollars make sense, it's all incorporated\nI'ma get it all, since a BG I done did it all, was in it all\nWhen I first thought I was in the wrong\nCouple tokes, alcohol\nGot everything I need, Hennessey and weed\nSince my arrival, based on this modern-day survival\nEvrything is technicality, everything based on reality\nSo how do I get paid, all these licks nowadays\nThey want me laid, dropped and plagued, AK mouth is sprayed\nIt's like I'm blind, and I just can't see\nWarren G, I'ma holler at the homey Shorty B\n\"Shorty B IT'S ME!\", G Dove, I'm out to make a grip\nSo call Crucial Conflict and let's make us some bomb shit\n\n[Wildstyle]\nLook at me on the M-I-C\nTryin to stack my tips, comin in a big ole ride\nWith all that bumpin side, livin up in your eyes, surprise\nHangin on the corners where the young brothers be comin up\nThe gangbangers be gunnin up, the type of brothers that roll with us\nHigh tech with much respect, with all that G's swarmin\nLike G-Funk in your eyes and make you see we about that cashflow\nPut em in a lasso, don't try to sweat, no joke\nWe illa your side, in the back we get hot, trade bump and hit em up\nWith the jigs up\nFreaks from the West to the east to the South where they chief\nKurupt in the mind, Young Gotti down with the raw dog Flict\nI ain't no tricks, nigga Wildstyle, enemies get closed down\nWe rock the shows, slammin do's, Cali to Chi-town\n\n[Coldhard]\nSo chop it up, I'm gonna kick some shit about what's goin on\nHave to get my loot up so I suit up\nLooked in the mirror said to myself \"It's gon' be gone\"\nI'm sick of goin thru the things that I have to do do\nCops are happy to jack fools, I'm strictly ever gon' gank move\nI hate to be the one that have to take it\nBut you best believe I'd die to make it\nAnywhere in the world I'm standin with my pockets naked\nSet it out set it out, that's what I'ma holler\nOn some slick, tryin to come up quick, witta trusty ole dollar\nWatchin you watchin me, hope I slip and bust my knees\nI'ma have to greet you at the pond, you should just be thinkin C's\nComin out at ease, no matter what I'm still hard to please\nFlap flappin sky, be real til the day I leave so sneeze", "Chorus: Reel Tight\n\nTalin bout that money, dollar\nGettin that money, gettin paid\n*repeat x3*\n\n[Never]\nWe, smackin and stackin, packin, strappin, what's happenin? Rollin\nCruise-controllin, the fo' and Daynes swell up\nGet the hell up, trump-tight click just in case I'm lavish\nTryin ta fade me, you crazy ladies, babies created\nMen are shady, straight make me drink til my thoughts get swavy\nI think, maybe if I blink things will get back gravy\nBut loccs in the hood they lord be makin it hard so lately\nBut I gotta stay at the table, cos that raw dope is that will pay me\nWestside of California, on these corners pimpin daily\nRetire out on the lakefront, smokin blunts\nTakin the sale G, trap me like the male be\nTo the Westside I'm a mental, all the regulators trail me\n\n[Kilo]\nDon't kick it out, let's do this\nComin out the do', we down to wall\nGotta get in the business\nTell me waht's the call, we to the fall to ball\nWe can't just fold up\nGotta whole bunch of homies dependin on this, sho'nuff\nThis only hustle is for brothers\nFeel to bring the business so slow up\nAnd we still up on a mini gold rush\nReady to make the world go down\nBound to get it cos I'm down wit it\nNow shitty the city, Conflict's causin critics to bite tongues\nAin't the one, with the shotgun, showdown\nMy town to your town on the rebound for them papers\n\n[Warren G]\nIt's like brother brother brother how you make em get down?\nFrom the LBC to the Chi-town, Westside straight gettin down\nHittin switches and we checkin all snitches\nGettin all riches, and flossin in our pictures\nIt's time for some new hits, one of us\nYou know I spit some coast to coast love from your homey G Dove\n\nChorus (x7)", "[Intro: DJ EZ Dick]\nHey this is radio station Shake That Ass\nAnd I wanna see that ass shakin\nToppin the charts today we got a world a premiere from DJ Warren G\nHey DJ\n\n[Verse 1: Mr. Malik]\nI never crash and wreck\nYeah best I smash on that\nWit my apparatus in these sacks\nWe bring the cash in these checks\nGz its easy can you feel me\nI thought you needs for she Z\nThey never kill me, but at will see\nI grip the illy with the really\nAnd MCs could never twist me unless I was in their Phillys\nCome on really, I turn silly on billys\nTo big willys like Tommy Willis\nUnderstand the last man standin like Bruce Willis\n\n[Chorus: Arnita Porter & Dorinda Roberts] x2\nHey DJ lets play that song keep me dancin all night\n\n[Verse 2: Warren G]\nDon't let it end till you let it begin\nWe want yo hands in the air cuz we back again\nWith Hershey L-O double C doe, funk by the kilo\nAnd we know, how to keep it on the G Low\nIncognito, from the Beach to Puerto Rico\nI rolls the dice and my nigga plays C-Low\nWarren G doe, search the lethal like chico\nAnd nowadays with the Ways like Carlito\nFunk to Kito, my weapons too lethal\nI'm checkin on my Mic there's no equal to my sequel\nOkay party people to the people the people the people the people in the place\n\n[Chorus: Arnita Porter, & Dorinda Roberts] x2\nHey DJ lets play that song keep me dancin all night\n\n[Verse 3: Mr. Malik]\nFrom night to day, day to night it stay on\nWe holla Hey DJ now won't you play that song\nLike Teddy oh nah he ain't dead\nWe gots tah gots tah wake everybody sleepin in bed\nCuz if you sleep, you slippin, you creep you creppin\nAs we sweep you get swept if you ask whats next\nYou know how my coke in my hindu, you at the venue\nTo be continued, you know we first up on this menu\n\n[Chorus: Arnita Porter, & Dorinda Roberts] x2\nHey DJ lets play that song keep me dancin all night\n\n[Verse 4: Warren G]\nNow as my pen, begin to let loose again\nThe bullets like duck, duck, goose, stuck\nIn the middle of a frame, buck, wit a little bit a game, stuck\nAnd its a muthafuckin shame\nBut I'm still here to maintain and run thangs\nAs the day gets clearer, I'm lookin in my rear view mirror\nAnd I hear a, nigga that I used be down with\nA nigga that I used to clown with\nAnd get around with, fuck the pound shit\nThey dont make niggas like they used to\nI remember Marley in the Juice Crew\nThats why I stay down with LBC days\nIt ain't easy\nOkay party people to the people the people the people the people and the place\n\n[Chorus: Arnita Porter, & Dorinda Roberts] x4\nHey DJ lets play that song keep me dancin all night\n\n[Outro: Arnita Porter, & Dorinda Roberts]\nHey DJ lets play that song keep me dancin all night\nHey DJ lets play that song keep me dancin all night", "(Intro, RBX)\nOnce again\nThe circle\nContinue to hit'chu with these massive hits\nYa know\nWe gon' do it somethin like this\nFor all them busters out there\nCheck this out\n\n(Hook x2, RBX)\nHey\nWe came here to ride\nFalling back to ready\nAnd set to collide\nNiggas you won't know the death you died\nSuicide, it's a suicide\n\n(Verse 1, Warren G)\nI'm deadly as ever\nReady for whatever\nTryin'a keep my pockets heavy on the cheddar\nGot nothin to prove, just really expressin myself\nWhile y'all niggas in the studio stressin yaself\nYa got to do it, so why not do it big?\nDrop the music, and spit fluid to they wig\nUnder dig, I'mma split the game in half\nAnd leave 'em all mad, like Warren what'chu done did?\nHey, we came here to ride\nNever slippin, Beretta sittin on my side\nBlaze up, cause I'm tryin'a raise up, and flow\nI came up, from broke, to papered up\nDon't test me, I bust like a twelve-gauge sawed-off\nAnd hoes jump on stage and rip they drawers off\nAnd I see through, all that's see through\nMake up a weave in ya head this evening, but hey\n\n(Hook)\n\n(Verse 2, Warren G)\nSworn to the streets\nBorn in the beach\nArmed with the heat\nMourning my peeps\nMakin niggas respect mine\nI came to collect mine\nComin through with the Tech-9\nLettin my neck shine\nMight let a nigga slide with a pass\nBut next time, I might disconnect his neck from his spine\nRun up and catch him from behind and stretch him\nWe squeeze triggas like ketchup\nWet'cha whole stretch up\nScared of the truth\nYou fear it, don't wanna hear it\nTil' the Smithsons bust\nThen you listen up\nCause I'mma tell it like it is\nLike it was, or like it always will be\nGive a fuck if you feel me\n\n(Hook)\n\n(Verse 3, Warren G)\nWho am I?\nW-A, double R, E-N to the motherfuckin G\nSuicide, niggas hang they self\nMight as well bend over, and finger-bang they self\nSell they soul for the fame and wealth\nAnd end up broke and lonely\nNobody to blame but'cha self\nBut me, I keep it all business\nCause this is business, can I get a witness?\nSee I been chillin like a villain\nWith a million and my children\nPlottin on revealin what the game been concealin\nI got a little older and learned a bit\nApplied the effort, and earned a grip\nNow I notice it's a hater, in every circle\nAs I roll another Vega, heavy with purple\nTake a puff and inhale\nAnd hold it til' it gets stale\nIn my chest, exhale my stress\nMy nigga R-B-X\n\n(Hook)", "Mount up", "(Butch Cassidy talking)\n\n[Warren G]\nTake notes young locs, I advise y'all to slow down\nGlocks, K's, and Eagles trying to put a murder down\nWatching fools servin' clowns\nWith your eyes on the prize, hitting switches\nAnd getting bitches with plenty riches\nAnd if you bang homie, do that\nBut when your ass gets slapped with that 25, handle that\nAnd all you see is the glamor and gold\nDon't know the other side of the game is where it's scandalous and cold\nYour destiny is in your hands, you got control\nWasting time with your life until your ass is old\nTrying to be bold, a hog and a pimp\nEighteen years old, HIV and a limp\n\n[Hook: Butch Cassidy]\nCareful of what you ask for\nSometimes you just should let go\nGet what you need and not want\nSome folks believe and some don't\nThese are the ones that don't last\nHard head makes a soft ass\nBut it was something that I had to have\nI just had to have\n\n[WC]\nWhats crackin' youngsta\nLittle OG sick with it\nBangin loose Dickies sagging, house shoe kicking it\nBlaze with me, nigga let me swing with you\nHop in the cut dog, and spit this game to ya\nI see them niggas have got you tatted and caught in a pattern\nOf clutching a Glock, and banging on niggas at the bus stop\nPutting in work, in your Pro Club white shirt\nDoing dirt trying to gain stripes for the turf\nBut loc, what up, shit I knew your brother\nUsed to bang with him, when you was a little motherfucker\nUntil they amputated both of my legs, circled the block\nCaught your brother slippin' and filled him with lead\nThe retaliation was swift, furious, and just know this hood shit is serious\nAnd for the sake of his memories, see about your paper\nAnd remember locs, success is the best revenge on these haters, nigga\n\n[Hook]\n\n[WC]\nMurder, murder, murder\n\n[Warren G]\nI don't wanna die\nI'm trying to live, trying to survive\nMurder, murder, murder\n\n[WC]\nI don't wanna die\nI'm trying to live, trying to survive\nNiggas have got the game twisted\nYet if these busters pump 'em up\nAnd distort their vision, fool listen\nLife is like a crap shot\nYou can either hit the jackpot\nStack a knot and get your cap shot\n\n[Warren G]\nLive you life homie, do that\nBut don't get pumped up to dump and get cracked\nAnd moms put a block on the phone\nYou's a hard motherfucker, now you all alone\n\n[WC]\nAll alone in the streets it was on\nBut keep the leather for penitentiary friends gone\nYour on your own\n\n[Warren G]\nAnd to the youth, I spit to you\nThey call me G Dub and I spit the truth\n\n[Hook]\n\n(Butch Cassidy talking to end)", "(INTRO)\nHe he ha\nI'm serious nigga one of ya'll niggas got some bad mothafuckin\nBreath up here hey baby hey baby hay baby gimme some\nBubble gum in this mothafucka somethin man lets gone\nAnd get somethin to eat study long study wrong nigga\n\nWith so much drama in the LBC\nIt's kinda hard bein' Snoop D-O double G\nBut I somehow, some way, keep comin'\nUp with funky-ass shit like every single day\nMay I kick a little somethin' for the G's and make a few ends as I\nBreeze through two in tha mornin and the party's still jumpin\nCause my mama ain't home\n\nI got bitches in the livin' room gettin' it on\nAnd they ain't leavin' till 6 in the morning (six in tha mornin)\nSo whatcha wanna do?\nShit, I got a pocket full of rubbers and my home boys do too\nSo turn off the lights and close the door\nBut for what--we don't love dem hoes\nYeahhh so we gonna smoke an ounce to this\nG's up hoes down while ya motherfuckas bounce to this\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nLaid back--with my mind on my money and my money on my mind\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nLaid back--with my mind on my money and my money on my mind\n\nNow that I got me some Seagram's gin\nEverybody's got their cups but the ain't chipped in\nNow this types of shit happens all the time\nYou gotta get yours but fool I gotta get mine\nEverything is fine when you're listening to the D O G\nI got to cultivatin the music that be captivating he\nWho listens to the words that I speak\nAs I take me a drink to the middle of the street\nAnd to mackin' this bitch named Sadie (Sadie?)\nShe used to be the home boys' lady (Oh that bitch)\n80 degress when I tell that bitch please\nRaise up off these N.U.T's\nCould you get some of these at ease\nAs I rhyme with the dog pound feel the breeze\nBiyatch I'm just\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nLaid back--with my mind on my money and my money on my mind\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nLaid back--with my mind on my money and my money on my mind\n\nLater on that day my homey Dr. Dre\nCame through with a gang of Tanqueray\nAnd a fat-ass J of some bubonic chronic that made me choke\nShit--this ain't no joke-- I have to back up\nOff of it and sit my cup down\nTanqueray and chronic, yeah I'm fucked up now\nBut it ain't no stoppin' I'm still poppin'\nDre gots the bitches from the city of Compton\nTo serve me--not with a cherry on top\n'Cause when I bust my nutt\nI'm raisin up out the cock\n\nDon't get upset girl that's just how it goes\nI don't love you hoes--I'm out the door\nAnd I'll be...\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nLaid back--with my mind on my money and my money on my mind\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nLaid back--with my mind on my money and my money on my mind\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nBiyatch--with my mind on my money and my money on my mind\n\nRollin' down the street smokin' endoe sippin' on gin n juice\nBiyatch--with my mind on my money and my money on my mind", "(Snoop)\nGot a little something for the summertime\nWhile you on the grind\nGetting yours\nHell yeah! I'm getting mine\nI take trips and dips just to recline\nI blaze up the orange weed\nTo relax my mind\nSpend time with my kids on the weekdays\nAnd I holla at my momma and my\nGrandma on the threeway\nShe say, If you do right\nBaby boy I promise you live\nA long life\nI can't argue\nI try hard to\nNot blast niggas\nI walk past niggas\nWith my head up to the skedai(sky)\nNigga tried to pull a fast one\nOn Snoop Dogg\nTo get some shut eye\nWhat I do to him I can't speak\nYou know the episode\nAnd the code on the street\nI keep it all the scriffin' y'all\nBut real street for y'all\nCause you never know\nWhen you're gonna go, no\n\n(Chorus)\nYou never know where this road's gonna take you\nGot to be strong\nYou got to hold on\nCause you never know, where\nThis life's gonna lead you\nJust Hold on\nYou never know\n\n(Warren G)\n]From the killing\nThe robbing\nThe squabbing\nAnd jacking\nCar jacks to kidnaps\nWhat? Niggas be acting a fool\nTrying to set me up at the park\nBut I'm cool\nAct a fool\nMy daddy said throw them thangs\nAnd stay strong\nMy momma got sick\nSo I'ma keep it strong\nAs long as I got my feet in the game\nAnd make this beats\nAnd bring heat to the game\nFuck the fame\nI got a little boy to see through\nAnd him without me\nIs like me without you\nKeep it true\nAnd stay down for your grips\nHomies and licks staying tight\nLike this\nYou never know\n\n(Chorus)\n\n(Phats Bossi)\nYou niggas never know\nWhich man are blasted for\nNever know which man to kill\nJust to settle the score\nIt wasn't long ago\nI had this partner of mine\nKnew him just a short time\nBut he's stuck in my mind\nMy nigga lived perfect\nSaid the streets wasn't worth it\nIf you don't die rich in the game\nThen what's the purpose for this struggle?\nWe stay piece to puzzle\nInvest half the wealth\nAnd pray to god it double\nWe just in this\nTrying to get rich at the interest\nKeep it pimping\nStay with niggas that's relentless\nSmoke dough\nJust because I say so\nMoney pronto\nAnd niggas never would know\nThey never know nigga\n\n(Chorus til fades)", "[Verse 1: Warren G]\nLBC D-E-F-G\nI'm H-I off J's bellin in a T-shirt and blue jeans\nWell few dreams ever come true\nWell some do, so nigga say (I'm from the beach too)\nLong Beach City G's Funkin\nAnd its a pity who many we's punk and drunk\nIn a hotel lobby at a town near you\nHousekeeper's high, and drinkin beer too\nCleared through the nite\nMy niggas movin with the skirts\nIn the boxes, houseshoes, and slingshot t-shirts\nIts gettin late, I'm runnin out of gas\nSo Warren G tryin to see whats up on some ass\nReally doe, y'all enjoyed the show, good\nBut what you know about these Long Beach boys in the hood\nShould anything go wrong and niggas act shitty\nRemember fool this is Long Beach city, punk\n\n[Chorus: Nanci Fletcher]\nCan you feel it\nCan you feel it\nCan you feel it\nCan you feel it\n\n[Verse 2: Warren G]\nWell it was boring until Warren G came on the scene\nPut the G-Funk with the gangsta lean\nIts been about 2, is he comin through?\nI dropped this one just to show you I'm true\nPeople say Warren where'd you get that speech\nIn the sandy city right down by the beach\nSpeak, dont speak on, if you wanna speak on\nIf you wanna get yo groove on, LOC on\nTo the fullest, bounce rock skate\nA new time, a new rhyme, legislate\nThats how we do it in the S-I-X\nLBC, 213, and we straight shit at the next\nSo lets party hearty like Lodi Dodi\nWe punkin yo city you betta ask somebody\nCuz if you dont, we ain't showin no pity\nMore bounce to the ounce and we rockin yo city\n\n[Chorus: Nanci Fletcher]\nCan you feel it\nCan you feel it\nCan you feel it\nCan you feel it\n\n[Verse 3: Warren G]\nFrom city to city and state to state\nThis DJ gonna regulate\nSo playa hate if you want to, I dont give a fuck\nI'm still G-dubb and I'm subbin in my truck so good luck\nAnd have a nice trip\nWe got y'all town locked down like a vice grip\nI'm on the dice tip, shootin C-notes\nA dollar and the bones hollerin G-oats\nCuz we quotes, them gangsta raps\nThat ya'll paid for, and we banks the snaps\nWe perhaps, if you could see what I see\nThen you might be gettin paid like this nigga Warren G\nSo fee, fie, foe, I'm from, the LB to the C nigga dont act dumb\nOutta site, outta mind, so where y'all gonna put us\nWarren G and the Twinz and my girls Five Footaz\n\n[Chorus: Nanci Fletcher] x2\nCan you feel it\nCan you feel it\nCan you feel it\nCan you feel it", "[Daz whispering]\nThis nigga to give it all to me with the cut\n*door knocking*\n\n[Kurupt]\nGet the door\n\n[Daz Dillinger]\nYo wassup? What you need?\nHmm? Yeah\nI'm out\n\nHop in the '6-3 Chevy, countin boutin the heat\nScapin thru the streets with my niggas bumpin hellafied beats\nSee us, niggas play for keeps, kill the strong and the weak\n]From the Eastside of Long Beach, that's 2-1 Street\nSee we, live and die by the gun and the knife\nAnd I, high as a kite, corrallin thru the night\nHaha, stackin hundreds, we kept the drugs and hoes comin (Come on)\nYoung gunnin, tortured, no need to be punished (Yeah)\nAll we have of the system is big cabbage\nLifestyles is lavish, livin my life from Dallas\nIt was a challenge, livin my life like a savage\nTo have or to not to have it or nobody can have it\nUn-touch-able, inde-struct-able\nGet in my way and we're dustin you\nAs a kid this the type of shit that we dreamed of\nMoney, cars, bitches and drugs\nI prevail, the crack sales then got in jail\nCouldn't post bail now my home is livin in a cell\nThirty years with no parole as I grow old\nYou won't see me on the streets til I'm 60 years old\n\nChorus: Daz singing\n\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live", "[Warren G]\nIt's the A, Team, operation regime\nMoney and dreams got me hooked with schemes\n]From the Time Square walk to America's best\nLong Beach is the spot, got a lot of respect\nCos I'm a vet, regulate and never hesitate\nI stay hungry so fill my plate\nI'm just a young black nigga tryin to flip an end\nFive year probation, nigga fuck the pen\nWhattup, Uncle Kev doin eight upstate\nI heard you're benchin ten plates, knockin out inmates\nIt's just a way of life, nigga shootin the dice\nNow you hit all craps, now you payin the price\nLivin the thuggish life\n\nChorus:\n\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live, we live, we live\n\n[Kurupt]\nG, Dove, we, mob\nKillin all y'all, that is our job\nAnd if you thought it was The Gang then you hit it on the knob\nSlide and flip like cocoa bricks, takin your 6\nAnd leavin it on the side of the freeway on bricks\nSchitzomanic, automatic, schizophrenic, six\nIt's just a psychosomatic, original\nDogg Pound criminal, ya ever heard of me?\nKurupt, Young Gotti, motherfucker D-P\nWhy is life fucked up? Toe-up\nScrapin from the flo' up to the ceilin, the fo's bust\nFor my children to grow\nWe live to let go, nigga\n\nChorus/Outro:\n\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live\n\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live\nWhy oh why, why oh why, why oh why\n[Snoop] It's only for the money\nDo we live in dangerous lives?\n[Snoop] It's only for the money\nIt's just the gangsta life we live, we live, we live", "[Warren G]\nI make music for block pushers and go-getters\nFrom gators, to house slippers, and Mo' sippers\nThe old, and new school, the hard hitters\nAnd fuck whoever that don't roll with us\nThis here is international player\nFuck the Senator's daughter and have lunch with the Mayor\nI'm in a league all by myself\nEverything I done I did for me - by myself\nWalked away from bullshit and called the inner circle\nHad to get my head right (fuck Universal)\nI took the time to be free again - grinding\nI finally feel like me again\n\n[Raphael Saadiq - Hook]\nI gotta walk these streets again\nI'm gonna roll on with my friends\nI'll talke my time, I'll read the signs, I'll be just fine\nMo sipping with my chicks\nSo hold my telephone cards\nI'ma just keep doing my thing, stocking this game, stacking my change\n\n[Warren G]\nA range meeting with lawyers and stock brokers\nThen back to the block pouring liquor with shirt soakers\nWhen it come to the dough, I'm about my cheddar\n50 Cent ain't the first off to pop Berattas\nI'ma walk this road and G here forever\nBorn and raised, addicted to this Cali weather\nIt feels good to be me right about now\nIf my moms could see me now she'd be proud\n\n[Raphael Saadiq - Hook]\n\n[Warren G]\nAll across the globe they know me\nI regulate, international G\nIt ain't nobody as fly as, fly as who\nWarren G and Raphael Saadiq, stop acting all edgy\nMentally it's cut already\nBet you won't bet me that your pussy ain't ready\nI'm on track on my back, the monkey ain't heavy\nRock on with the mic gangsta beat rock steady\nIf music should die before I wake I pray the lord my soul to take\nDedicated to hits, and that's showbizz\nCan't eat, can't live, can't no busters alive fuck with this\nI ain't gone miss, I'm gone ride, put it down that's on my kids\n\n[Raphael Saadiq - Hook]\n\n[Rapheal Saadiq]\nWalk these cold streets again\nWalk these cold streets agaaaain\nWalk these streets again\n\n[Rapheal Saadiq - Hook 2x]", "[Hook: Warren G - repeat 4X]\nIt ain't nuttin wrong with you\nMe and you (we do it nasty, nasty)\n\n[Warren G]\nI once knew a girl named LaShonda\nShort little cute thing\nWith a pinky diamond ring\nShe was iceless\nMy game was so priceless\nGivin her a facial\nI was G'd up\nFrom the feed up\nPushin the bent\nWith the midnight tint\nHuh, heaven sent\n\n[Mista Grimm]\nI once met a girl in the valley and\nHalf black half Italian\nAss like a stalian\nCoke bottles shake\nAs she likes to watch herself on tape\nBreakin nuts shake, but wait there's more\nShe keeps my nuts in her mouth like a squirrel\nPranksta with a pearl\nHeld my balls so long\nI call trouble when I'm with my girl\n\n[Warren G]\nThere's a law for that\nWe ain't trippin, we hogs for that\nUh\n\n[Hook: Warren G and LaToiya - repeat 4X]\nIt ain't nuttin wrong with you\nMe and you\n(we do it nasty, nasty)\n\n[Damone]\nI met this Puerto Rican named Sehonnie\nShe was as bad as Carmen\nChillin in New York and I cracked her in Spanish Harlem\nStraight dime\nBody bangin like a baseline\nAnd the face fine\nI had to spit dip waste time\nMr. Passionate\nEverything her body was immaculin\nThe presence like a gift to men and got packaged\n\n[Boss Hogg]\nFuckin fabolous\nShe say \"damn he fat\"\nThen I still fuck the ass (how you do that)\nPush up on 'em till they fall to the plot, damn it\nUh, hog 'em while they fuckin roll, goddamn it\nCall me fat boy with a fat dick to mash\nTo lick me baby and I might lick you back\n\n[Damone]\nLickin you back\nShe's gaggin with a dick in her trap\nAnd stickin is fat\nI'll pull it out and tickle your cat\n\n[previous Hook]\n\n[Warren G]\nI put the smash on her like Shaq\nShe want the cash on her\nI ain't havin that\nYou need to check yo' trap\nI got rose cap\nG'd up, 213, please believe that\n\n[Mista Grimm]\nI stay pimpin in a bubble I Benz\nWith hoes stubbled up and cuddled in the back with my friends\nI slide up on 'em like a cross fader\nThe hook up later\nAnd serve this dick like a waitor\nI ain't tryna date her\n\n[Damone]\nWhen it comes to bitches\nI got more game than the olympics\nI get up in their mind and analyze and twist this, psychology\nFor no reason I'm recievin apologies\nBreak her down mentally\nHave her stockin and follow me\n\n[Boss Hogg]\nTrick be swallowin me\nFor a nine on the vein\nCuz I'm the fuckin boss, she's my employee\nI ain't hatin, I appreciate you freaky ass style\nYo nasty ass ?, eat a dick and smile\n\n[previous Hook] - 2X", "[Intro:]\n(Now, now go)\nYou got me fucked up\n(Why?)\nCuz I'm a bad muthafucka and you can't understand me\n\n[Chorus: K-9]\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon\n\n[Verse 1: P-C]\nNigga back up, see I came to stack up\nBodies like hits, whats that\nYou wanted to act up, and diss the click\nA sister, put my niggas up wetted the grave\nYou wanted to get richer, so offer your beats that made by fade\nCascade, because yo ass is soapy\nMr. Locc you wanna be Mr. low key\nWhen yo ass used to be low key\nYou know me so act like you know my click\nAnd I'm an assist to kick the shit that you and MD could never get with\nAnd speakin of MD, another nigga that used to be from my click\nAct like he double to down, but when it go down, go down he splits\nThis is strictly for all of y'all niggas that diss me\nY'all think y'all skills is up to par well stars come out and get me\nNow we got these niggas out on the streets, and a place to lay my gun?\nI guess you could say that I got hostess, in more ways than one\nY'all keep clickin and clickin, my chips continue to stack up?\nBut while you dissin and dissin I'm a tell you niggas to back up cuz", "[Chorus: K-9] x2\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon\n\n[Verse 2: K-9]\n(Hey K-9 what about Mad Dog)\nWell let that nigga loose\nNo better yet just let the dog loose\nSo he could fetch, goin to Vegas to see what he catch\nAin't gonna be no cases\nJust tell him what he faces and watch him snitch\nWhile I lay up in Vegas\nIts either the Raiders or the switch so he did\nSwitched over like electric shocks\nMoms got on pregnant static\nSo they suspected pops\nDid they know about me\nMr. K-9 see, clicksta in deep, in your Mama's panties\nDid they know that I was bangin it\nWhere at, oh your Daddy's bread be back\nNow she's pregnant and I ain't claimin it\nYour husband's cryin cuz he feels like a chump\nWhat, your son is fit to die and he ain't nuthin but a punk huh\nShe can't sayin nuthin cuz she needs my support?\nBut not for the child see the hooker's tryin to take him to court\nAnd I'm a body like Jah\nBut accept with mo mil\nWe probably wasmeant for each other\nCuz we two niggas they gave us both jams\n\n[Chorus: K-9] x2\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon\n\n[Bridge: P.C. + (K-9)]\nSo when the east is in the(when the north is in the house)\nBack up, back up\nSo when the west is in the(when the south is in the house)\nBack up, back up\nSo when the east is in the(when the north is in the house)\nBack up, back up\nSo when the west is in the(when the south is in the house)\nBack up, back up\nSo my click is in the (when da click is in the house)\nBack up, back up\nSo when K-9 is in the (when K-9 is in the house)\nBack up, back up\nSo when P-C is in the (when P-C is in the house)\nBack up, back up\nWhen Warren G is in the (when Warren G is in the house)\nBack up, back up\n\n[Chorus: K-9] x4\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon", "[Intro:]\nMicrophone check one two uh\nAnd you don't stop\nMicrophone check one two uh\nAnd ya don't quit\n\n[Verse 1:]\nMicrophone check one two one two\nLet me clear my throat so I can do what I gotta do\nIt's expresso, mandle that I'm stacked\nNiggas, tryin to corner the market but I'm back\nBang to the boogie, and boogie to the bang\nIt's G-Funk for life sewing up everything\nLittle locs, pay attention\nDo I or should I have to mention\n44 ways where the grass is greener\nFrom OG to BG is a misdemeanor\nSt. Mary's Hospital, 10:20 AM\nOn the street called Atlantic is where I began\nOla May, uh, thats my lady, she made me\nOn a street under the bridge called hill, thats where she raised me\n\n[Chorus:] x4\nTransformers, busters in disguise\n\n[Verse 2:]\nI say chitty chitty bang bang\nBrothers wanna gang bang\nTryin to represent but dont know about the gang thang\n21st where it all begun\nBegun us on the corner with the homies havin fun\nI was a youngsta, peepin from the other corner\nSeeing sets in the air with big arms now I wanna\nBe like them, and act like them\nAnd stack like them and try to mack like them\nShit, its hard being Warren G from the LB\nAnd like the G's before, you know me\nSo I'm a stay down, for the eastside\nNot like you busters, transformers in disguise\n\n[Chorus:] x4\nTransformers, busters in disguise\n\n[Verse 3:]\nOne to twenty-one, and you know I ain't gonna stall\nI gotta give it up with the homie roll call\nOG cry baby, and the homie big roc\nMooch on the side with the stockin can ride\nBig sugar mama, flee bag and\nLady roe guard and marathon they OG see\nSalt Lake crew got little shorty Charlotte\nBut back to Louis with T-Bone is where I started\nLivin in the back in a little pink shack\nIf you know like I know then bounce to this track\nCerritos bounce to this\n21st bounce to this\nI said Lewis bounce to this\nSalt Lake bounce to this\nUnder the bridge bounce to this\nElm St. bounce to this\n710 bounce to this\nP-A-C's bounce to this\nMLK bounce to this\nLocc St. bounce to this\n1-9 bounce to this\n20th bounce to this\nLemon bounce to this\n(fades)", "(Hook, Frank Lee White)\nWe just, tryin'a find a place where\nWe can smoke our, weeeeed\n(Warren G)\nWit' out nobody fuckin' wit' us at all\nWalk wit' me now\n(F.L.W)\nWe just, tryin'a find a place where\nWe can do our, thiiiiing\n(Warren G)\nWit' out nobody fuckin' wit' us at all\nWalk wit' me now\n\n(Verse 1, Warren G)\nWell it's Frank, the bank, roll a tank\nRoll the white, dolomite, takin' over the mic'\nI like, what I'm feelin' here\nSee me man, standin' here, puffin' on that hemisphere\nCome a little closer girl, I think I see a blemish there\nAnyway, let's get back to the program\nGet a strawberry Swisher, let's smoke man\nLong as I'm wit'chu, we gon' be up in the clouds\nHigh as a kite, and I ain't comin' down\n(Down South) We be on them peach White Owl's\nFrank Lee White, bout to smoke another ounce\nI heard in Cali, they got that purp\nTryin'a figure out a way to cop that work\nSoooooooo, bless me\nWith another blunt of 'Droooooooo\nMy chest feel like the shit about to blow\nThe whole world's spinnin'\nGimme a couple zones, and room full of women\nAnd I'm straight\n\n(Hook, Frank Lee White)\nWe just, tryin'a find a place where\nWe can smoke our, weeeeed\n(Warren G)\nWit' out nobody fuckin' wit' us at all\nWalk wit' me now\n(F.L.W.)\nWe just, tryin'a find a place where\nWe can do our, thiiiiing\n(Warren G)\nWit' out nobody fuckin' wit' us at all\nWalk wit' me now\n\n(F.L.W.)\nWe just, tryin'a find a place where\nWe can smoke our, weeeeed\n(Warren G)\nWit' out nobody fuckin' wit' us at all\nWalk wit' me now\n(F.L.W)\nWe just, tryin'a find a place where\nWe can do our, thiiiiing", "[Chorus]\nI don't know why they mad at me\nThey can't catch me but still they after me\nWhen we deal face to face, its a tragedy\nYou ask why I got my gun they might blast at me\nReal niggas, real shit, reality\nWho gives a fuck if you niggas is mad at me\nFuck around with Warren G its a tragedy\nReal niggas, real shit, reality\n\n[Verse 1]\nWarren G top dog\nPatrollin' the beach\nNiggas say they as hard as bitch\nBut they're as soft as a peach\nClaiming the G of all G's\nPlease\nI come blowin' through like the breeze\nSittin' on threes\nPost it\nCoastin' mashing down Pacific Coastin'\nThe bomb chrome rims black on black Yukon\nWith nuts hangin' from the city\nWhere the bangers be banging\nIt don't seem like shit is changing\nI holla'd at the homey the other day\nG'ded up at the park sippin alize\nOne of the homies took a beating\nSo now we spend at being a gang\nOf checking at the meetin' like cycles repeatin'\nIt's just another sunset fall in sea\nI can hear the homies in the past callin' me\nAnd you know what I discovered\nWhat they keep saying\nKeep your mind on your money\nMuthafucker's and shake busters\n\n[Chorus]\nI don't know why they mad at me\nThey can't catch me but still they after me\nWhen we deal face to face, its a tragedy\nYou ask why I got my gun they might blast at me\nReal niggas, real shit, reality\nWho gives a fuck if you niggas is mad at me\nFuck around with Warren G its a tragedy\nReal niggas, real shit, reality\n\n[Verse 2]\nHave you ever sold millions\nBut yet you niggas persist to talk shit\nGet off my dick\nYou never catch me slipping\nRollin' with the heat\nSlap the clip in\nI never thought the world would start trippin'\nMy life is a trip, though\nHit the crip though\nBlow the whistle\nThey think I banged\nSo I packed a pistol\nWarren to tha G is a G\nI don't fuck with you nigga\nSo don't fuck with me\nLet's ride to the east side\nSlide like a fo\nI packs a fo-fo\nWhen I'm steppin' out doors\nTo the bang to the boogy\nIf I speak then I spoke\nWarren G do it every time to you Locc\nGet the party beat like blaze and smoke\nThe east side and the beach\nWest side of the coast\nYou know the niggas that I ride with\nHogs, attack dogs\nThe same niggas I'm down to die with muthafucka\n\n[Chorus]\nI don't know why they mad at me\nThey can't catch me but still they after me\nWhen we deal face to face, its a tragedy\nYou ask why I got my gun they might blast at me\nReal niggas, real shit, reality\nWho gives a fuck if you niggas is mad at me\nFuck around with Warren G its a tragedy\nReal niggas, real shit, reality\n\n[Verse 3]\nWho's the man\nI've been from London to Japan\nStomp land to land\nTo the Egyptian sands\nYou can't check me\nDis-respect me\nOr mop me up\nWith the base bumpin' out my truck\nAnd all these police trying to lock me up\nMoney rules the world\nAnd I made the loot\nSo don't make me shoot\nCuz trying to mash\nWill get you done every time\nI ain't trying to hurt nobody\nBut I'm down for mine\n\n[Chorus] x2\nI don't know why they mad at me\nThey can't catch me but still they after me\nWhen we deal face to face, its a tragedy\nYou ask why I got my gun they might blast at me\nReal niggas, real shit, reality\nWho gives a fuck if you niggas is mad at me\nFuck around with Warren G its a tragedy\nReal niggas, real shit, reality", "[Warren Verse 1:]\nPut it together from the start with the homie\nCouldn't picture ever having to part with the homie\nAnd even though you're still here in the flesh\nIt's different on the West\nYou're voice is truly missed\n\nThe missing piece, I'm saying it ain't the same\nNever leave you alone praying for one more day\nWho'd these niggas come and get their hooks from\nWhen they needed their radio shit spun\nNate Number One\n\nA true artist indeed, you made your own lane\nAll these albums we drop will never be the same\nWithout your voice on em\nI'm thinkin that's the key\nChoked up, smoked out, riding to these melodies\nReminiscing memories\nOn my way to visit you in therapy\nHoping God make it clear to me\nOn what the plan is\nThis dirty game is hella scandalous\nSo this right here, is dedicated to Nate!\n\n[Hook:]\nThis is dedicated to you...\nIt's really something special\nMaking dreams come true\nSeems hard to figure out\nWhat this world is all about\nThis is dedicated\nThis is dedicated to you\n\n[Warren Verse 2:]\nFrom the dope spots\nTo popping on the charts\nGrinding in the beach\nTo make it on the streets\nTouring overseas\nSubmitting legacy\nWriting history\nWith every song you sing\n\nUh Regulatin the era\nStanding side by side, man we down for whatever\nWas the days of the past, now I'm looking to the future like\nI don't even want to do music\n\nBut, I gotta keep it crackin\nIt's a challenge when your homie's talent hanging in the balance and\nLife is such a trip, I know the world is full of madness\nRelearning learn how to walk and talk again, I can't imagine\nWhat that rehabilitation is like\nWhen the Doc said that you couldn't sing on the mic\nWhat the hell is going on\nHe's been writing songs\nHell No that ain't Nate Dogg\n\n[Hook: X3]\nThis is dedicated to you\nReally something special\nMaking dreams come true\nSeems hard to figure out\nWhat this world is all about\nThis is dedicated to you\nYou, You, Oh You", "[Warren G]\nWaiting around a crew of thugs\nThat parade in blue, and yelling cuz (whats up cuz)\nAte by selling drugs\n'38 snub in the waist, in case fools lose love\nThese days still the same\nI concealed the flame, eyes kill with the pain\nSo I advise y'all to chill with the games\nEntertain for the cheddar and the change\nSo fuck whoever, in the fame, forever remain\nAround my dogs, banging the pound, swanging the town\nHow we choose, now I'm aggravated and assault is my next move\nSuccess means issues, so I guess it's time for me to disclude\nHandle mines, we use pistols\nG's move with the conscience\nWhen we disapprove of that nonsense\nEx-cons with that gangsta gangsta gangsta shit\nHere come another hit\n\n[Hook: Nate Dogg]\nI think it's time we do it, they said it couldn't be done\nStill we making paper, still we having fun\nI hope by now it's proven, Nate and Warren G\nTightest combination, in the industry\nHere comes another one\n\n[Mista Grimm]\nI can see us smashing up the shore past laws thats lost\n2000 Ucon Excel, duel exhaust\nTV screen, DVD, E-mail\nPassenger, bad female, what the hell\nStash spot, with the hollow head shell\nNiggas start trippin, I'm on the next tail\nHands free, callin' up my nigga Warren G\nI pull strings, like Meyer Lansky\nBulletproof, limo tint you can't see\nMr. G rollin' up weed, afghany sensee\nBad MC, Mike Fiend, you the know spinage\nLike winter green mint, talk shit\nSleep with the fish, you cement\nNew residence, with no hesitance\nIt gets tints on the floor\nStaple center chick, next to Denzel and Nicholsen\nPhil Jackson whistlin'\n\n[Hook]\n\n[Warren G]\nMean mugs in the club, mean nothing to us\nIn South scene, me and the team trying to fuck us some sluts\nDying to fuck, I chuck us when we step through\nPoppin' our collars, with our nephews\nNext to you, you got millionaires moving\nHitting the dance floor, stealing their groovin'\nDoing they damn thing, and ain't worried about a damn thing\nBut man, thats the celebrity ways\nPoppin' a litty got some rappers scared of these days\nIndustry ways, thats how Hollywood pays\nUh, top dollar when I dip my Impala\nIn front of the club, make your woman wanna holla (holla)\nAt a playa though, what's your dude yo\nI keep it gangsta, I ain't trying to be rude ho\nOh, you know how that shit go\nOr give when cats get fed off the four or fifths\n\n[Hook]", "[Warren G]\nOoooo weee\nSee y'all lost confidence\nTalkin with that nonsense keepin comets\nThis is compliments\nFrom me to the industry\nThe ?locest? G when you see one\nWhen them G's come from where I'm from it's unspoken\nDoggin' and locin', squabbin', jaw broken\nWe ain't hopin', we wish to tear this bitch\nI ain't scared of shit I'm swift with the Smiff\nAnd that motherfuckin Wessun\nDroppin dope on fools with no questions\nAnd thats a fact when I bust you ho's guessin'\nTrue confessions\nAnd many lessons get dealt with\nFrom coast to coast and loc to loc\nI won't go broke and smoke that smoke\nThat you choke *echoes*\n\n[Bridge] *caughin'*\nIs he allright?\nIs he allright?\nIs he allright?\n\n[Hook: Butch Cassidy]\nThey lovin me now\nI get my way now, make 'em say \"hey now\"\nLook and brake my pay down\nOr I make my move on you\nNo other you foul\nCan mess with my sound, ???? up in your town\nLaughin as we smike ponds\nAin't no stoppin me 'til I ?????\n\n[Boss Hogg]\nY'all don't wanna see the great game\nWith the way down\nBitch y'all take a change in the gate now\nOne: ?Dear Sabrine?\nCame right back\nWhere the fuckin monster on the team, like that\nOur way ???? our ???? back boy\n?????, ?????, E-dub and fat boy\nThe realest, fuck the McCoy\nGo get us\nWhy the fuck you think the gangsters in the game roll with us\nLong as ??? ritches when I ain't backslapin'\nCheckin this bitches, that include bitch niggas too\nLet me holla after slugin you\nSuck dick, show dollar motherfucker you\nStart speakin on me wrong\nIf you mouth gotta move\nBitch I got the perfect thing to put your mouth on\nMy own like it should\nDon't worry about what Boss do\nObviously doin good\n\n[Warren G]\nNow it's a tip how they treat us Boss\nBut I ain't trippin it's a trip how we beat 'em Boss\nAnd now we dippin'\n64, Lac's, Bently's on D's\nHittin hood's and blocks climbin in the ??????\nIndustry suckers and fake companies\nAll Y'all can eat on this\nFor not believein' in me, for trippin on me\nYou better check them stats while you hayin on me\nI'ma 10 year motherfuckin vet'\nFrom 2pac to Snoop and Dre I get my respect\nWarren G, the Long Beach imperial\nThey lovin me now nigga and ain't nobody feelin you\n\n[Hook]\n\nI'm so dope\nMan I ain't no joke\nYou see me comin in a crowd and smoke\n?So baby why you take the toke?\nWhy you hang with loc's\nKeep it real\nAnd tell me how you feel\nMess with my money and it's time to kill\nCause I'm out to make a mill\nI got to pay my bills\nAaa-aaa-aaaaaaa\nDon't make you hit you off in the jaw\nOoo-ooo-ooooooo\nAin't no tellin what the hell I do\nHee-eee-eeeeyyy\nMan I'm comin' in the darkes way\nEee-eee-eeeeeee\nIt's the dopest in the industry\nIndustry\n\n[Hook]\n\nThey lovin me now\nI get my way now, make 'em say \"hey now\"\nLook and brake my pay down\nOr I make my move on you\nNo other you foul\nCan mess with my sound, ???? up in your town\nLaughin as we smike ponds\nAin't no stoppin me 'til I ?????", "1, 2, 1, 2, yeah\nAll yeah, we doing it like that\nWe flip that, uh\nMore in the crib\nDru, yeah, D-Funk allstars\nThats how we do it, G-Funk, yeah\n\n[Warren G]\nWhat's y'all thought, I wasn't gonna return with a hit\nToo much smokin' that Sherman shit\nI learned this from the best, and got y'all sprung\nThe, the doctor, Andre Young\nCompton, LB, ain't nothing y'all can tell me\nGoing hard on the yard, 'till me dogs bailed me\nThey tells me, I can't precede with it\nI came back and got ole G'd with it\nWe get crunk, spit it when we drunk\nCommited to that shit, that makes the gangstas stump\nChumps can try, if they choose to to\nWith these locs love my dogs like the Blues Clues\nSo excuse you, I'm the reason for the fame\nAnd all of a sudden, you ain't believing in the name\nWhat? Butch Cassidy, show 'em what we working with\n\n[Hook: Butch Cassidy]\nThis gangsta shit is too much\nDon't be suckas, can't touch\nIt's working in the LBC, nonstop to the NYC\nWarren G, with the gangsta three's, oooh wee!\n\n[Warren G]\nAnd the win, on the 7-10 southbound\nDuece and gin, getting guzzled down by the mouth now\nSmashing a hundred in the car pool\nThats the type of thing that hogs do\nMy concern ain't the fame, I hope you know that\nStatus: millionaire, still don't show that\nGo back to where I was raised\nOn the porch is where they got braids, never not afraid\nTo test my shot, drop a hundred dollar fade\nHolla, don't be a major see me in the hood\nOff TV, totally un-Hollywood\nStill to the good and you know that\nStill with me, still when you show that\nAnd Big Snoop Dogg we gonna blow that\nStill with it, we all say that we real with it\nUntil bustas reveal, how we really did it\n\n[Hook: Butch Cassidy]\n\n[Warren G]\nSo what's crackin' now\nGot these haters actin' now\nBackin' down to this gangsta sound\nWestcoast circus clowns\nIt's on purpose how I spit rounds\nYou trying to get down\nAbnorm with the form, swarming heated\nHitting fools Glocks like we got cheated\nRepeated simotaneously\nI'm bringing bangers with me\nSo hopefully, moves can be made\nWe can all get paid, relax in the shade\nSun, snow, it really don't matter\nWe can all make dough\nEastcoast, westcoast, midwest, dirty south\nAnd big heads, is what I'm all about\nAnd big heads, is what I'm all about\nAnd big heads, is what I'm all about, fool\n\n[Hook: Butch Cassidy]", "(Warren G)\nMic check, time for me to make that connect\nWith the so so def so I can make my collect\nPrivate jet in motion, over the ocean\nTouch down jungle air strip, CD's to flip\nFeds having a cow\nGotta stay on the down low for now\nAm I living foul?\nFuck that I'm living fat, I got the track\nDon Chi Chi and Nate they got my back\nAnd it's like that\n\n(Jermaine Dupri)\nY'all the type of niggas to blink and to come up all assed out\nI'm the type to say fuck that and go cash out\nAll glassed out with the count of the bitch\nScreaming nigga I ain't having that shit\nI represent niggas that love to ball, and still be trappin'\nAnd only drink outta the bottle with the gold wrappin'\nIf it's gon happen I'm the one that make it go down\nCool JD how you like me now?\nI keep...\n\n(Chorus x2)\nHavin' things\n(We havin' things, havin' things)\nHavin' things (yeah)\n(We havin' things, havin' things)\n\n(Warren G)\nI reminisce when it's like this\nReal niggas get together they don't like this\nSo I'mma spice this\nATL, Long Beach to Cada\nWe been doing this for years for you paper haters\nWhen the beach turned out fresh dress in eighty fo'\nWhen JD was poppin' in houdinni's videos\nMe and Nate was serving on the east side fo' sho\nAnd in a game fo' a minute got a minute to go\nWhat?\n\n(Nate Dogg)\nThey should know now\n(We havin' thangs, havin' thangs)\nDon't sell your soul now\n(To have things, have things)\nDo what you feel now\n(If you want things, want things)\nKeep it real\n(Keep it real y'all)\n\n(Chorus x2)\nHavin' things\n(We havin' things, havin' things)\nHavin' things (yeah)\n(We havin' things, havin' things)\n\n(Nate Dogg)\nCome on out to my castle lady\nSee you thangs on your mind\nGo on up to my bedroom baby\nTonight everything is just fine (all right)\nStay with me just little while longer\nIt's only a quarter to five\nI can stay up late\nDon't work in the morning\nHavin' things is just fine\n\n(Jermaine Dupri)\nI'm a south coast nigga so fuck y'all niggas\nWith hate, Me and G V.I.P. at the gate with Nate\nBringing bitches to the table with they belly out\nFine as fuck, but steady trying to tell me how\nThey got a man but still wanna get they drink on\nI'm lookin at this hoes like \"You ain't heard this song?\"\nIf you drink this shit, it's time to leave\nFo' shi's\nFo' c's\nIt's 12:18\nAnd we be...\n\n(Chorus x3)\nHavin' things\n(We havin' things, havin' things)\nHavin' things (yeah)\n(We havin' things, havin' things)", "Its that nigga Gz WheeZ\nBack for the 9-c\nI ex sippin on the yak so people wanna know whats next\nAin't nuthin changed, another day a new time\nWith this uptempo beat with the G-Funk rhyme\nRegulatin state to state, coast to coast\nIts all about the call of greens, yak, lets toast\nCuz its a ballin society\nI try to be the dopest I can be in this industry\nBut you dont hear me\nI think ya betta, I think ya betta\nCuz when I, get it goin on I ain't gonna let up\nI set up, the g-funk family and we\nFunkin up the industry until eternity\nIts alright with you if its alright with me\nWe'll get down to the sounds of the LBC\n\nChorus: repeat 2X\nRelax your mind, your mind, your mind\nRelax your mind and let your conscious be freein you down\nTo the sounds of the Warren G\n\nIt ain't easy bein Gz\nBut the lifestyle I chose, the status to which I rose\nThe doors, I open, I'm loccin, I'm scopin\nThrough the eyes of the G Child\nI see many try to duplicate the LBC style\nBut it ain't even happenin like that\nI was time I had to make a comeback\nAnd get mine, you know I'm genuine\nBeen in motion with the potion with Snoop since 89\nDevotion is the key for me so\nRelax your mind and let your conscious be free\nThe homey just touched down, foolin wit a pound\nPut yo gun down, so you can walk a safe ground\n\nChorus: repeat 2X\nI know it's been hard on you for about two, so\nI had to relax your mind, I thought you knew\nAin't nothin but a Long Beach party\nWith yo hands in the air, with the twist of Coke and Bacardi\nAll the homeys around and the slingshot t-shirts\nSkirts wit the baby fat it'll work\nPass me the indosmoke and get locced\nFrom the beach to the bay, makin them sway\nLike the ocean in motion, we coastin\nRelax your mind and keep floatin (floatin, floatin, floatin)\nAnd walk a safe ground\n\nChorus: repeat 6X", "Nate Dogg]\nFriends, how many of us have them\nFriends, how many of us have them\nFriends, how many of us have them\nFriends, how many of us have them\n\n[Snoop Doggy Dogg]\nEvery since I could remember\nI had friends I could depend on\nClothes to lend 'em\nBut as time went by\nMy life got a little strange\nAnd the rules of the game seem to change\nTrust, honesty and devotion\nAnd money, money, money is the poison potion\nThere's no way that I can even say\nThat this game has been good to me\nOr even bad to me it had to be\nCause tragically the way this shit\nCracked off for Doggy Dogg was magically\nAnd now I'm gettin' everything I'm supposed to get\nBut my friendship with niggas always ends up as bulshit\nI listen to my momma though\nShe always tried to prepare me\nByt how could she do what I\nI mean I'm do or die\nBut my life on the streets\nThat shit is suicide\nSo to cope I got a dogg and a locc\nAnd keep my heat close in case these jokes go for broke\nI'm mashin' with the click 2-1-3 that is\nThey my homeboys ever since kids-\nReal friends to the end\n\n[Chorus (Nate Dogg):]\nHangin' out with my homies and I'm feelin' just fine\nI've been ponderin' lately\nA lot of different things on my mind\nIt seems lately my friends list\nDone took a slight decline\nAnd if you wanna know the trith man, man\nThem wasn't no friends of mine\n\n[Warren G]\nYou jackin' me up, you takin' my cash\nAll my life L-B-C, for my city I mash\nAll those OGs and BGs and wannabies and L-O-Cs\nThe only friends I got is my 2-1-3s\nThat's my nigga Snoop D Woop and my nigga N-A-T-E\nI can't forget about my nigga H to the Deezy\nPressure and strikes\nDon't wann take no lives\nBut these jaws, cracks and hood cracks\nWill make you break bizacks\nWhussup homie, can I borrow some cash?\nLast week I agve you 500, so kiss my ass\nI got a baby to feed\nA familly to see through\nAnd shake busta snitches tweekin' like you\nHomies and friends that's what they for\nStayin' tight and money right\nAnd bustin' with a 44\n\n[Chorus (x2)]", "Artist: Warren G\nAlbum:  Good Burger soundtrack\nSong:   Friends\n\nDo you know where you goin to?\nDo you like the things Warren G has showed you... you\nDo you know where you goin to?\nDo you like the things Warren G has showed you...you\n\nG and Snoop, homeys from the jump and the get go\nDevoted and quoted back in 84\nGrowin up in the LBC\nPlatinum city, where the big gamers be\nInvolved in everythang from Pop Warner\nTo whats poppin on every corner\nFind a skirt if you wanna\nTryin to come up in this world\nWhere everything is drama\nBeverly was like my mama\nW-A-double R-E-N\nTryin to get in where I can fit in\nCatchin a bus with a homey I can trust\n3 homeys from the hood straight kickin up dust\nEnjoyin my days and everythang is fine\n15 years old Snoop d whoop on the grind\nTryin to find ways to make it, dice shake it\nYoung, havin fun, like me Snoop and Nate did\n\nChorus\nWe be havin fun, no one could do the things that we do\nWe be havin fun, no one could do the things that we do\n\nI remember all the scams we been through, together\nNobody does it better on which you do the weather\nThe days we used to call first year playin get like me\nGettin in fo of zines, I loved em\nLong Beach was the hometown\nAnd every spot that we rocked, you know we got down\nOutside at the club just spittin raps\nAnd every busta that ran up was gettin cracked\nUnderground tapes used to be the claim to fame\nLong Beach Was A Mutha was a classic mane\nTellin tales about how we was strugglin\nAnd surrounded wit tha homeys that was all clubbin\nTryin to make it in this music\nQuick fast, quick cash, and hittin on the quick dash\nWe in this game to make hits\nAnd make everybody respect the G-Funk click\n\nChorus\nWe be havin fun, no one could do the things that we do\nWe be havin fun, no one could do the things that we do\n\nWe went from young G's\nTo sellin million overseas\nRollin Dees\nAnd makin money by the trees\nTo killer Bees, evading all enemies\nCatastrophies, young GFC's\nWe made it now, livin good wit no hassles\nBut still a lot of problems dealin wit shady acts doe\nIts all a part of makin hits doe\nSee our careers take off like a US missle\nBreak out the crystal\nI spitted it, and now its g funked out, transmitted it\nSo you can call it what you want\nWe still goin bring the funk\nG's up put it down, and ya weed to float\n\nChorus x3", "[Hook: George Clinton]\nSpeed Dreamin'\nSnoozin' in the fast lane\nSpeed Dreamin'\nNow I'm in overdrive\nSpeed Dreamin'\nNappin' in cruise control\nTrying to get back to where I should have been by now\nCadillacs stand in the tree line\nI'm making them be like\nSwerving to the curb\nTires squealing, rubber peeling\nPull up to a halt\nBut then we're thinking someone ought\n[To talk in line the freeway of the mind?]\n\n[Warren G]\nI got funk for all yall from me to the bid dogs\nGet your asses up pass the blunt\nSmoke som', after this go and poke som'\n[Mista Grimm]\nUm, excuse me Warren I got something about substance abuse\nRoll a half ounce up jump in my shit\nHit a switch watch it bounce up (GOOD GRIEF)\nMeet me in the Elco with gold leaf (WHO)\nGrimm big pimpin' like Filmore Slim\n[Warren G]\nTilted brim Mista Grimm rollin' shotgun hop one\nDrop one, nigga hit 'em with the Bop Gun\n[Mista Grimm]\nYeah I got the chronic its ferocious\nYou can feel it in your bones like osteoporosis\nWest coast shit, Im grabbin my gonads\nAnd slangin' gangsta vocabs straight of the notepad\n[Warren G]\nAft the dope sack quote that gangsta funk\nWarren G, what y'all thought?\nBringing the funk\n\n[Hook (1/2)]\n\n[Mista Grimm]\nYou listening to G rhymes and I'm here to drop lines\nI got that funky fly shit that you wanna hear all the time\nAll in your system like menthol, yes y'all\nJust remove cd from package then install\nIn your stereo here you go\nNew material grand imperial\nEat your Mista Grimm cereal\nHit the floor whats rough rugged, twenty four karat nugget like the microphones I carry in my Gucci luggage\nI'm Thuggish Ruggish\nTo the bone marrow and soak in linen apparel talkin the double barrel\nBlack super hero rhymin'\nRappin sittin busting like its nothing still puffin' coughin chokin\nWild up in the fan's in Oakland floatin\nSwerving, taking the dirty version between Persians\nSippin burbon brand new Excursion\nMessage: Salt kills snails (Saaaaalt)\nNah playas its that West Covina rhyme sayer, yeah\n\n[Hook (order of lyrics switches)]\n\n[Warren G]\nMista G.R.I.M.M. we done dropped one\nWith my Uncle George we done lock one\nAtomic Dog, Knee Deep, in the fast lane\n[Mista Grimm]\nWith the 454 engine block burnin' rubber for a block\nPsycho like a Hictchcock flick\nTrick, sinister thoughts streamin' while let'n out shots adrenaline pumpin'\nG Dub say somethin'\n[Warren G]\nSupercalifragilocus you could quote this off that purple\nYou can blow this\nLight up pass it around\nWe make the world go round like the G Funk sound\n[Mista Grimm]\nI keep the pedal to the medal\nSpeed dreamin', slidin', dip n glidin'\nChocolate Thai high\nCome on, jump in, let's ride, hop in the Mothership\nAnd dip with Mista Grimm and Warren G\nWe got that shiznit\n\n[Hook (1/2)]\n\n[George Clinton]\nHeres to that someone who can't take the pressure\nMercy for that poor fool who made the news\nWho feel pissed on that insist on killing all men\nCan't take the sorrow of the horrors of his abuse\nIt ain't worth the sorrows to cause the death ......all men\nHe's a disgrace to the species in to his face with some feces\nBig nose mothafucka got it comin'\nHow many licks does it take to get to the center of a sucker?\nHow late do you have to be before you get absent?\nWarren G with the P you beta step aside, I'll stick my foot so far up in your ass\nThe water his knee will rise above your head and drown before you get your ass kickin'\nStop stepin' in footsteps hard to keep up with\nWarren G stepin' hard but it ain't as hard as it gon' get", "Intro* Ooh yeah, yeah, What's\nLove got to do Warren\nG rap, for me yeah-eah, yeah, mm, mm Verse\n\n* 1 When G-dog the, hog come, up in the place There's\nDollar signs in your eyes and a smile in your face You\nWanna live fat all, for my sack You\nGot more drag than a low lo-do cut, the act 'Cause\nBack before '92 and '93 You\nDidn't give a damn about Warren G But\nNow that I'm slingin' platinum lp's All\nOf a sudden you, on my N You. T's. Ain't\nNothin' you can do to make it stop 'Cause\nMoney makes the world go 'round and the panties drop I\nAin't in love though I, don't need the pressure I\nJust wanna dig it like I'm diggin' for treasure Some\nOf y'all had a good thing that you couldn't keep Thought\nYou was tlc you, had to creep You\nSay you had love I, said you need to quit It's\nAll about the dough so, what's love got to do with it Chorus?\n\n* What's love got to do got, to do with it (that's right) What's?\nLove if you don't respect the game (uh-huh) What's?\nLove got to do got, to do with it If?\nYou lack in this game it's, a shame you, won't make it Verse\n\n* 2 Now I'm, the type of brother that's down for mines Before\nI made beats I, was down to grind Back\nThen every, single homey had my back Now\nThey're peepin' my stack and they're talkin' bout jack But\nI'm the same brother day in and day out And\nI'm-a stay that way until the day I lay out in a casket It's\nDrastic 'cause, homies is plastic Break\n'em off some bread they, want the whole damn basket If\nYou's a true homey you, would wish me well Not\nPlot to see a brother fell jealous, as hell We\nUsed to get the same riches Now\nYour trigger-finger got the itches schemin', on my riches Which\nIs not a suprise my, eyes peep game 211's\n187's, it's all the same It's\nAll a shame homies'd, jack you for your grip Ain't\nNo love involved because, it's all about the chips Repeat\n\n* chorus Verse\n\n* 3 Now for these labels tellin' fables Makin'\nThe messed-up deals under the tables You\nThink that you smart but, fool, I'm, the smartest You\nCan't make no money if you can't keep an artist Sign\nThe dotted line put, 'em on the shelf Break\n'em off some crumbs keep, the rest for yourself I\nKnow how it goes treat, an artist like you know Fly\nCars gold, clothes, but, no dough Since\nIt's all business I'm-a, handle mine Keep\nTrack of my stack down to the very last dime 'Cause\nIn this rap game it's, all about the buck You\nBend over for the label and you will get bucked Like\nHow we run up in the skirt and, then you're through The\nRecord label do the same thing to you 90%\nBusiness 10%, show Ain't\nNo love in this game 'cause, it's all about the dough", "(Chorus)\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark\n\nNow I can take you on a maze of thangs but all I know is street life\n20 some years and all I lived was the urban life\nShootin dice smokin weed gettin my hustle on\nMakin anybody raise up that try to do me wrong\nMe and the homeys on the move tryin to make a grip\nBumpin OGs in zone when we dip\nNot to trip, unless you trip\nAutomatic will release\nDangled as peace\nI'm stayin soldier to the streets\n\nSo tell me how do you feel cuz I can't deal wit the anger\nYou niggas be givin I'm keepin one in the chamber\nThe pressure is thick so I dont quit shootin game\nAnd peepin our enemies violatin in my range\nThey say it dont change and heres a fact you should know\nThat niggas dont hustle no matter where yo ass go\nSo when you think wrong\nI'm thinkin right, are you prepared to meet\nGotta be wise cuz everythang ain't what it seems to be\n\n(Chorus)\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark\n\nWarren G-\nIn 6 before out shacks, cruisin each block\nI'm lookin for a space with my 40 Glock cocked\nTemple, Salt lake, 21st Lewis\nI hits MLK cuz I know I gots to do this\nSome people say Warren would you please stick to rappin\nBut this fool's pressin me so I gotta start capping\n187 now I'm stuck out of luck\nIn the high powered module lookin crazy as fuck\nLBCing to the fullest 21, dominoes\nBuck wheats, french braids and naked four doors\nIts my city, my city's all good\nWarren G kickin back with the Twinz in the hood\n\n(Chorus)\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark\n\nTripp Locc-\nPress up if you want to, believe that you'll get your feelings hurt\nAll you hear is the chirp, along with my wheels as I skirt\nYou shouldn't of tried to fade the Locc there ain't no get back\nI meant that, get ready for combat its like that\nPrayin that my homeys dont flip as I elevate\nBringin nothing but heat stayin away from the weak links\nBe your own man survive\nMake that money grow\nWhether it comes fast or it comes slow\n\nWayniac-\nEither way it goes we step so I stick and move\nRefuse to lose I choose to get the blues\nPaid dues for years, but where were you niggas then\nOut flossin the boulevard being hard wit your friends\nWhile I was at home puttin in work\nYou think you goin jerk\nAnd take whats mine get me twisted with a skirt\nI notice the difference cuz I been back\nOn niggas they true\nBut now I see it and its on since its like that\n\n(Chorus)\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark\nYou can never fade thee G they're so crazy\nWhen they start to blaze after dark", "[Intro: G-Child]\nPlayaz, playettes, macks, trues, wannabes\nAll you muthafuckaz, we gonna kick it like this\nFor the trues\n\n[Verse 1: Jah Skills]\nYeah this crew was tight, went from planning dreams\nNow we rockin mics, gettin shit right, stayin on beat\nAnd servin this heat, through yo streets, jealous hoes peep\nBut me, I dont sleep\nSo you know I catch you watchin\nWhile they comin with drama, I'm blockin and steady knockin\nThe post is won out the box, it dont stop, hittin our areas and shakin up spots\n\n[Verse 2: Warren G]\nI'm bakin blocks in four wheel motion\nEverywhere I look I see 21 ones floatin (21st Street!)\nThen I made a stop at the P-A-C's\nWassup y'all? You seen Tripp L-O double C, now\nI'm headin to the back where the homeys is posted\nNiggas on gat in case plat wanna get roasted\nBut you know how that go, in the city of snakes, fakes, hmm and bitch brakes\nI shakes, back to the topic called heat\nMy beat, your treat, can't nobody fuck wit me\nCuz I'm known from Cali to Rome\nWe brings heat, so now its on\n\n[Chorus: K-Bar] x2\nBring heat to the table and play your cards right\nMy crew got heat we got game air tight\n\n[Verse 3: Knee-Hi]\nThrough thick and thin, see we like kin\nAnd it won't stop no matter what happens\nMan you not knowin, who's tops they be blowin\nI brings heat, independant and I will release\nThe ultraviolet, bangin beats for the pilot\nGot the sky lit now who really wanna try it\nIts warm when we swarm, your area gonna get torn\nAnd a job that work g funk in the purest form\nFor what its worth, I'm a let you know\nI'm hyperactive for those who react too slow, all alone\nMy fleets movin fast,  hand in hand with the aftermath\nMy skills was built to last\n\n[Verse 4: Wayniac]\nForever in a day, but some days we gotta trip\nThrowin lics for grits, steady stackin our chips\nThe money clips dont fit, now is it the way we dip on\nThese and those, mo Gs and hoes, I assumes on a mission, (on a mission)\nConditions ain't the same got the average nigga wishin, but still missin\nThe simple facts it ain't like that\nTurn the tables when the label dont react, its Wayniac\n\n[Chorus: K-Bar] x2\nBring heat to the table and play your cards right\nMy crew got heat we got game air tight\n\n[Verse 6: Jah Skillz]\nToo much clout I'm havin so niggas be grabbin at my wealth\nAt test a math, set them back on the shelf\nThey say we love your skills, I'm good for your health,,\nMy lifeline droppin the dime on them like a stealth bomb\nWill calm a nigga down with my one round\nSuppose they act up, my back up's involved now\nGFCs included, my crew is undisputed\nHeavyweight champs, known for blowin out yo amps\n\n[Verse 7: Trip Locc]\nI had patience but now I'm anxious\nLurkin like a cat on the deal with my sack\nI know somebody watchin the Locc\nCan't stop cuz it just start poppin please\nI gots tah have it like Mickey D's\nOver 60 billion served rollin on the daily\nCan't tell me shit put it in and I won't notice\nMe and my niggas nothin but that top notch\nLong Beach postin up the road blocks\nYou can't go through, or around, you gotta turn back\nI'm gettin turned back, ridahs and killaz that dont play that\nKnown to bring it on when it pop, missions to clock\nStages to rock, when I'm done lounge at the spot\n\nChorus repeats to fade", "Yo I wanna take this time out to dedicate this song\nTo one of the most beautiful ladies in the world\nCould never imagine\nYeah, Ole Mae, that's my momma, y'know\nTo one of the most beautifulest ladies in the world\nI love ya momma, keep it strong for ya\n\nChorus: repeat 2X\n\nMy momma, used to tell me quit smoking weed\nMy momma, gave me everthing I need\nMy momma, said keep faith in God\nMy momma, momma, momma, momma, momma\n\n[Warren G]\nFrom the beginning, soon as my feet touched the earth\nFor what it's worth, she loved the boy from birth\nKept me fed, combed my head\nAnd tapped that tail when I didn't do what she said\nThrough the years comin up momma always provided\nAnd when the times got rough momma always tried to hide it\nDivide it among us, but pardon the youngsters\nTold us never to lie, smoke dope, and cuss\nShe stood tall and proud like a supermodel on a catwalk\nAnd momma didn't take no back talk\nShe's the main reason why I roll today\nThat's why I dedicate this to Ole Mae\nThat's my momma\n\nChorus\n\n[Warren G]\nAs a young teenager I started to clown\nMy momma did all she could to try to slow me down\nTired of her son be brought by the cops\nSent to go stay with my pops\nHe taught me to be my own man, and when I disrespected\nHe put me out on the streets to find my own land\nNow I'm servin on the urban street corner\nSmokin bud, sippin Coronas in Long Beach, California\nBut I promised my momma I would make it to the top\nAnd use this rap to put her in the drop\nShe the main reason why I roll today\nThat's why I dedicate this here to my Ole Mae\n\nChorus\n\n[Warren G]\nAs I grew up, blew up in the G-Funk Era\nI see my momma everytime I take a look in the mirror\nI'm thankful she gotta chance to see me shine\nMy momma's in my heart and my soul and mind\nControllin mine, so I can stand strong\nFor ya grandkids to let em know that ya spirit lives on\nI really miss you, but I know ya looking over\nLead me on the right track, the angel's on my shoulder\n\nChorus\n\n[Warren G]\nSo I want y'all to treasure ya mom\nYa know, so if y'all got a bad relationship\nOr y'all on bad terms, patch it up\nAin't nothing wrong with that\nThats a precious jew-el\nRemember that, we all gotta go through it\nSo stay strong, down dis, dis road, ya know\nBut I can't forget about all the poeple\nOut there that I love, and got my back\nSo I'm gonna go ahead and im gonna shoot a shout out\nMy daddy, my sistas, my brothers, my girl, my kids\nMy cousins, my aunties, my uncles, my grandmomma\nMy granddaddy, all my homeboys, all my homegirls\nAnd everybody out there that got love, knowwhatI'msaying?\nWe gotta keep it like that, we gotta keep it groovin", "[Warren G]\nSometimes I sit back and think about how it was\nWhen I was young, I used to think it was you I couldn't live without\nSomehow, life took a sad route\nSometimes the wind blows bad enough to take a plane down\nYour straight bullets killed children on playgrounds\nBullshit got me about to smoke a whole pound\nMeanwhile, I smile, hoping I can rebound\nSomehow the LBC streets ain't the same now, without you\nThings ain't been the same since you ain't around\nBut I stay strong game tight, hold it down\nWarren G, I never played a blackground\nThis song is fucked up, because you gone\n\n[Hook: El DeBarge]\nOooh, I see ya standing there\nWith the moonlight shining in your hair\nOooh, It makes me reminsce\nOver and over, again and again\n\n[Warren G]\nNothing means more to me, than family\nWhen one lost, its sad to see, damn its me\nA friend you will always be\nAbove all things, you taught me to persue my dreams\nWith joy it brings, at times when I sit and think\nI know inside you smiled down, proud at me\nI just need one more drink, damn\nAt night I can't sleep, I admit that its hard to eat\nIt's all good, I ain't trippin'\nTried to show me the right laws and guidelines\nBut I ain't listen, I'm sitting here lavishing and living\nAnd I'd give it all back because you still missing\n\n[Hook: El DeBarge]\n\n[Warren G]\nLord please hear me, ease my soul\nI woke up one day and my mom was gone\nI'm in the zone wishing I could call your home\nSing your song, tell ya that I'm out on tour\nAll alone, I just needed to hear your voice on the phone\nMother and son, though I'm grown\nLife moves on, I need you mom, a quiet storm\nDifferences and right and wrong\nAs I move on, since Warren G ain't gone\nThe stitch is on, set the tone, the page I'm on\nIs having fun, having a ball, living life\nI'm still here, wishing you was home\n\n[Hook: El DeBarge]\nOver, over, over, over, over\nAgain, again, I miss you\nOhhh mama, don't know, don't care\nHow I keep it strong, keep moving on\nKeepin' it strong, keep movin' it on\nKeepin' it strong, keep movin' it on\nKeepin' it strong, keep movin' it on\nKeepin' it strong, keep movin' it on, mama", "[Drag-On] (Warren G)\nC'mon (The Ruff Ryders)\nFlame on (Double R, baby)\nFlame on, c'mon, c'mon, c'mon, c'mon\n\n[Drag-On]\nAiyyo, y'all niggas take too long wrapping them up in duct tape\nMe, I just make sure they stomp like crush grapes\nI make the hardest shed a tear\nGive 'em a gun, if I had two right here\nTwo over there, fuck playin' fair!\nY'all niggas like loose-leaf paper, easy to tear\nDrag just burn that up and get it outta here\nY'all think y'all goin' from heaven to hell?\nY'all ain't goin' nowhere\nBut in the same town on the same dirty ground\nAnd I don't care how you livin' it up\nI even got dead niggas shiverin' up\nYou can bet I come diggin' you up\nThem niggas bust guns just to make niggas run by\nMe? I squeeze mine with one eye and one closed and focus\nThe one open is at the tip of the nose\nWhen it blows, y'all so-called-pimps die hoes\nDon't bite rhymes or flows, just air mark\nSnap with a finger, have y'all wanted in dead park\n\n[Eve]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne\n\n[Shadow]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne\n\n[Eve]\nYo, yo, aiyyo, who the fuck you think spit mean?\nSame bitch that tried to put Irv Gotti teams\nSince I had a snotty scream\nWas taught to die in a red beam\nNever ask when I need cash\nI'm a customer, I snatch your cream\nSoldier, cross-over, knock on my door\nWit' Jahovah, huh, know the population's over\nI'm causing early retirements\nCuz you blast last when I'm firing\nDyin' in the blood you lyin' in\nWent from the full house to the raw house\nTo niggas tryin' to rip my draws out\nTry it now, nigga, blow your jaw out\nYou don't want my gun to go pow-pow\nWell, I'mma have your face the same color\nAs a tongue of a chow-chow, nigga\nThese ain't water pistols- they shoot many missles\nAnd when I set 'em off, they scar your bones to the grissle\nOnly I knew how it was gonna come\nPut up in your baby-mom, for your only son\nI'm takin' e'eryone\n\n[Shadow]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne", "[Eve]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne\n\n[Shadow]\nUh, I'm psychologically fucked up, know the truth\nSee, I's sick, throwin' up Henny and ?Gook?\nPOOF! Me gone, I pray for the death of my mother\nUntil I woked up and hugged her, and told her that I loved her\nSick sin, my ink pen stay in the ring\nCrown me king, I spit through the eyes of a fiend\nGolden ice, I stole for the love of my wife\nThen she ran out and dumped me, and po-po pump me\nCame home, of course as the king of my throne\nBack to Roley's, back to smokin' bones with coley\nMy demo was better than a lot of y'all records\nBed rocked your ass, calm down, so let the gun go\nI murdered some quick for dough\nHit 'em up fast, watched them die extra slow\nI lock shop when I come through with the blue tops\nSmokin' a oo-whop, with all Glocks cocked\n\n[Eve]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne\n\n[Shadow]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne\n\n[Eve]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne\n\n[Shadow]\nAnything that's dealin' with dough, we got that\nCock back, hold in position for combat\nStand clear, all y'all cowards have been warned\nDuck, nigga, run for your life, we airborne\n\n[Warren G]\nSee now, there it go\nY'all got it\nThe East Coast West Coast collabo\nWarren G doin' it with my niggas from The Ruff Ryders\nEve, my nigga Drag-On\nYeah, that's how we doin' it, like that for y'all\nIn the '99", "Yo I wanna take this time out to dedicate this song\nTo one of the most beautiful ladies in the world\nCould never imagine\nYeah, Ole Mae, that's my momma, y'know\nTo one of the most beautifulest ladies in the world\nI love ya momma, keep it strong for ya\n\n[Chorus: repeat 2X]\nMy momma, used to tell me quit smoking weed\nMy momma, gave me everthing I need\nMy momma, said keep faith in God\nMy momma, momma, momma, momma, momma\n\n[Warren G]\nFrom the beginning, soon as my feet touched the earth\nFor what it's worth, she loved the boy from birth\nKept me fed, combed my head\nAnd tapped that tail when I didn't do what she said\nThrough the years comin up momma always provided\nAnd when the times got rough momma always tried to hide it\nDivide it among us, but pardon the youngsters\nTold us never to lie, smoke dope, and cuss\nShe stood tall and proud like a supermodel on a catwalk\nAnd momma didn't take no back talk\nShe's the main reason why I roll today\nThat's why I dedicate this to Ole Mae\nThat's my momma\n\n[Chorus:]\n[Warren G]\nAs a young teenager I started to clown\nMy momma did all she could to try to slow me down\nTired of her son be brought by the cops\nSent to go stay with my pops\nHe taught me to be my own man, and when I disrespected\nHe put me out on the streets to find my own land\nNow I'm servin on the urban street corner\nSmokin bud, sippin Coronas in Long Beach, California\nBut I promised my momma I would make it to the top\nAnd use this rap to put her in the drop\nShe the main reason why I roll today\nThat's why I dedicate this here to my Ole Mae\n\n[Chorus:]\n[Warren G]\nAs I grew up, blew up in the G-Funk Era\nI see my momma everytime I take a look in the mirror\nI'm thankful she gotta chance to see me shine\nMy momma's in my heart and my soul and mind\nControllin mine, so I can stand strong\nFor ya grandkids to let em know that ya spirit lives on\nI really miss you, but I know ya looking over\nLead me on the right track, the angel's on my shoulder\n\n[Chorus:]\n[Warren G]\nSo I want y'all to treasure ya mom\nYa know, so if y'all got a bad relationship\nOr y'all on bad terms, patch it up\nAin't nothing wrong with that\nThat's a precious jew-el\nRemember that, we all gotta go through it\nSo stay strong, down this, this road, ya know\nBut I can't forget about all the poeple\nOut there that I love, and got my back\nSo I'm gonna go ahead and I'm gonna shoot a shout out\nMy daddy, my sistas, my brothers, my girl, my kids\nMy cousins, my aunties, my uncles, my grandmomma\nMy granddaddy, all my homeboys, all my homegirls\nAnd everybody out there that got love, knowwhati'msaying?\nWe gotta keep it like that, we gotta keep it groovin", "[Intro: Warren G]\nHe young, he young, he young, he young\nShe young, she young, she young, she young\nHe young, he young, he young, he young\nShe young, she young, she young, she young\n\n[Verse 1: Warren G]\nI hit the 21 blocks each and every day\nNiggas peepin they shoulders in each and every way\nNo sweat, cuz if I sweat it\nI stay true to the game, so I'm not gonna let it\nTake control of me, fool you can roll with me\nFrom OG to OG you can reminisce with me\nAbout the hutch, about the milk bowl\nTwo dee took a bank left knockin fools out on\nIt was me baby boppa and the homey tic\nAll my folks locked down, gotta make it legit\nSo I'm a spit, and keep my spittin straight real\nI know that you can feel penetentiary steel\nLocked down all around for the homies touchin down\nWhen my rags get out you walk a safe ground (walk a safe ground)\nCuz I'm a let them ride killah\nYou betta stay inside and keep yo shit on yo side nigga\nSet trippin wit me\nBecause what I see is greenery, and thats all I see\nAs the day gets older, dont tweak, take a look over your shoulder\n\n[Chorus: Warren G] x2\nYoung, dumb, full of fun\nDum diddy dum diddy you'll get done\n\n[Verse 2: Knee-Hi]\nLivin this life\nI can't help but diss my dream\nMaybe since West anthems I want to roll a beam\nClean, but only had to be a mex\nNow hopefully that 850 lookin spiffy, will come next\nI bounced to 120 and Figueroa\nYeah, my house posted across from the store\nJust like that hit by the drive way and park in the back\n1986 fools is known to jack\nAround this click of the hood you found no punks\nMany gang bangers, dope fiends and drunks\nI learned, bunny hops, still rocks and cops\nI ran out of boys with toys\nAnd nights sees on hot days\nJust apple sticks on death\nRC cola to break a sweat\nNow I bet that everybody's comin up\nIf you turnin the wrong street\nLie you bout to get stuck\nNow what\n\n[Chorus: Warren G] x2\nYoung, dumb, full of fun\nDum diddy dum diddy you'll get done\n\n[Verse 3: Jayo Felony]\nI ain't no muthaufuckin murdera (nigga) I'm a killah\nCuz murderers get life nigga and killaz keep killin\nI'd ratha die with my eyes open\nSo I can see how these muthafuckaz wanna do me\nThey set me free bullet loco head with the beat what\nAnd these niggas know they have to retreat when I speak\nThe younger dumb wanna have some fun\nAnd drinkin liqour way before the age of 21\nSo how you figure that'll never put in work for that hood he love\nYou never paid him no attention so who should he love\nAnd to keep a strap on him or a phat sack on him\nAnd some bomb but be patrollin the hood\nRan a ho's name through the mud\nAnd these crooked's stick a strap in your mouth, without a doubt\nThats the reason got lost and turned out\nHe shoulda keep patient\nBut you was still money chasin\nA double life is what that young nigga facin\nAnd all because he was\n\n[Chorus: Warren G] x6 *fades*\nYoung, dumb, full of fun\nDum diddy dum diddy you'll get done", "Hey you gon miss up on the g-funk era\nYa know we said things won for warren g, and soon turned superstar\n11-10-7 D that was my intro\nAnd now I'm makin dough, I'm rollin a 64\nWell things get shady when the grass is greener\nBrothas throwin up sets in hoods like ya neva seen a\nYoung mac daddy do his thing 'cause I pack right\nI got 44 ways to make you act right\nAnd it's a shame how the game must be played\nIt was told never fold by the brothas you can't fade\nSo raise up on this young hog\n'Cause I heard you punkin some but you can't punk me dogg\nI got my own thang 'cause I let my beats swing\nIt ya wanna bring it bring it on no pain to gain\nSo as I creep can you peep what I speak\nTechniques unique, so what you sayin is obsolete\nSo there it is as I go about my days\nI can only bring it to you like this in so many ways\nHey, hey, hey this is Warren G you know\nAnd I was in Baghdad\nBefore these lil youngstaz was in they Daddy bag\nYa know, yeah, they in violation Wayniac so hound em\nI'm bein true ain't no fakin wit me\nBrovas plottin on me trynna test if they can see\nBut I'm peepin out the sain for the peeps who gimme props\nFor stayin out that madness you know it ain't gon stop\nIn so many ways I let 'em know\nIn so many way I let it flow\nBut you still don't hear me though\nSo I'm gon break it down 'cause it's quite elementary\nThis is for da homies in da penetentary\nAb baby papa\nBig rotch from the block\nAnd the homey j dogg down 'cause you'ze a hoe\nI got plenty love, and homey love stays\nI can only bring it to ya like this, in so many ways\nHey, hey, hey this is Warren G you know\nAnd I was in Baghdad\nBefore these lil youngstaz was in they Daddy bag\nYa know, yeah, they in violation Wayniac so hound em\nI stay true to the game\nBut some stay blind to the fact\nThat if I don't look good, you don't look good\nSo please rearrange and change the things you doin\nYou playin yourself 'cause you the one gettin screwed\nAs i, ease on down the rick road\nAs I shift from first to second, cruise control\nSo spark up the doujer\n'Cause I got the drink, and don't think that\nWe don't roll without a full tank\nOf that bomb that we called the funk\n'Cause I am the g and the funk is what you want\nNow lets take a trip to the other side of town\nBrothas flip flop and they neva stay down\nWanna be all they can be, but gettin held back\nTryin to take what is mine what type of lick is that\nSo this is for the homies stay down for your pay\nI can't only bring it to you like this in so many ways\nHey, hey, hey this is Warren G you know\nAnd I was in Baghdad\nBefore these lil youngstaz was in they Daddy bag\nYa know, yeah, they in violation Wayniac so hound em", "Nobody does it better, nobody does it better\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nI'm sittin' here trippin', my mind is blocked\nNate Dogg just spit it so it's time to cock\nNo one can do it better like this 2 man crew\nThey say we're one hit it quitters, now what cha'll gonna do?\nAlways into somethin', that's my name\nOnly out for money, hey 'cause that's the game\nPeople always ask me why I'm out for scratch\nHe who has the most is he who won the match\nStrike one, me and Nate Dogg is a match\nStrike two, leave 'em standing still in their tracks\nStrike three, you can call us 2-1-3\nIt's the L and the B that makes me act like a G\nMy exhibition started back in '93\nNo one, nobody listenin' but Warren and me\nTo all the nonbelievers, now I bet you see\nNobody does it better than me\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nThey call me DJ, the spark plug, keepin' it licked\nThere is no accident for these platinum hits\nSo when we make it to show love, bangin' in your club\nHangin' with your thugs, givin' up G love\nDo you remember back on the East Side?\nWhen all of us niggas used to love to ride\nWe didn't care what we did\nTime was nothing to us, we were just kids\nTimes are different now but you still get stuck\nI'm not a kid no more, I just don't give a fuck\nSo if you think you really wanna step to me\nKeep this is mind, nobody does it better than me\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nWow, make you say go now\nHot rap singles on the charts now\nGot a baby, so I'm breakin' hearts now\nOn your mark, get set, it starts now\nAll you pimp playin' hustlers, now you know\nYou can't keep me out once you crack the door\nEither join a team or it's best you flee\nNobody does it better than me\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nNobody does it better\nNobody does it better", "[Warren G]\nWhat's happening?\nYeah, this that thing\nYeah my dog, this that thing right here\nYa know what I'm sayin' man\nYeah, we gon keep it moving like that\nYeah, some of that, that ghetto, rats and roaches funk\n(CPT, LBC, G-Funk here tonight, oh yeah)\nSome of that, that..that incredible funk (funk)\nSome of that some ol' time P-Funk\n(Some of that, some of that funk)\nYeah, and most of all, it's that G-Funk\n(G-Funk, G-Funk baby)\nYeah, yeah, so ah, we gon' keep this thing grooving\n(G-Funk here tonight)\nI want you to sit back, screw ya wig on tight\nGrab yourself, a blunt or a joint or whatever you do\n(Roll with me, ride with me, G-Funk here tonight)\nAnd get ready to take that ride, if you wanna ride (ah yeah)\n(G-Funk here tonight)\nKeep it like that\nYeah, so check this out, while I'm in the mood right now\nIma go ahead and let one of my little young scions\nShow y'all what time it is, that's how we doing it\n(G-Funk here tonight, that's how we rollin' man)\nG-Funk, so Damone, let 'em know homie\n\n[Damone]\nYeah, this is something to ride to, slide through\nHeat G-Funk prvide you, turn it up, blow ya speakers out\nNigga like I do, my nigga on some other shit like Erika Badu\nWarren you killing 'em ever since 94 yo I been filling 'em\nWait for the rhythm and the new millennium\nWatch this, drop enough controlable hot shit\nRipping the lock kid, controling the market\nNigga fuck what they tell y'all, thought a nigga fell off, nigga hell nah\nNigga, we ripping the shit, pimping, get ridiculous chips\nI'm sick of this shit, y'all niggas put a dick in ya lips\nI'm tired of it, resign from rap but die from it\nOrgasmic niggas gone through the way that I'm coming\nNo holding me back, let 'Mone exploring the track\nThe soldier is back and everything is caught in this fact\nIt's getting critical, you finna twist this game something pitiful\nYa have niggas getting blackballed rap execs get rid of you\nNobody's feeling you, quit wasting ya time\nKeep waiting in line, muthafucka you ain't getting signed\n\nThere you have it, Damone, yeah, put that down G-Funk\nHa ha, yeah, so we gon, gon ride this out\nFlight C-17, bud, pipe, damn\n\n(Na na na na na, roll with me with G-Funk riding tonight)", "Back up, back up 'cause it's on\nCan you do, what we do when we sippin' on the brew?\nBack up, back up 'cause it's on\nCan you do, what we do when we sippin' on the brew?\n\nConjunction, junction what's my assumption?\nI'm sipping on the St. Ides Brew\nThat's my function\nOne for the money\nTwo for the Brew\nIt's the L.B. to the C. with the G-Funk crew\nOoh\nWhat would you do when we do\nWhat we do when we sipping on the brew\nGrab the deuce deuce or a forty-ounce\nDipping through the hood bumping more bounce\nI see some P's on they knees\nSo I turn around on threes\nJumps my ride, checks my Dz\nDz on down to the spot where my knots made\n'Cause I don't like to dream about getting paid\nFade in the wind\nNow it's on again\nHeads to the side\nScooped the twinz\nEverything is smooth on the east side\nParty on deck I'm drinking St. Ides\nYeah", "Your musical evolution has ended. We control the sound\nIts time we all got down. We bring you electrofonic funk funk funk funk\n\nChorus\nWe want yo hands in the air with yo mouth shut\nWith Hershey Locc on the mic and Warren G is on the cut\nWe make your heart beat, with Hershey Locc and Warren G\n\nMr. Malik-\nWe make yo heart beat like the beat of a heart\nWith these rhymes I release busta B plays his part\nGet it start, get it set, I bet we goin\nG Funk plus timer the energize bunny still goin\nAin't you knowin, I'm so seasick and tired of these niggas\nTryin to get us all start up, cuz they got caught up by trickaz now\nLock down to all blood clots, Malik and Warren G and we shakin up\nSpots\n\nWarren G-\nPlots, when we got work to do\nFrom Atlanta GA to the beach with the Long Beach Crew\nOoh, what would you do what we do, what we do when we comin after\nYou\n\nMr. Malik-\nThey say that drama for they Mama, no we can't talk like Tevyn\nWonder why they families cried and died before 97\nThem and they sins burn to heavy make it all the way to heaven\nAnd we keep bellin, yo G Z it ain't easy tell em\n\nWarren G-\nIts the second time arizzound\nYou know we gotta clizzown\nYoung GFC and Hershey Locc from the pizzound\nFrom OG to BG, from BG to OG\nMy sounds thump pump pump and you know me\n\nChorus x2\nWe want yo hands in the air with yo mouth shut\nWith Hershey Locc on the mic and Warren G in the cut\nWe make your heart beat, with Hershey Locc and Warren G\n\nMr Malik-\nNow he's solo while we roll up on yo block like the kesops\nMakin everybody drop stop and stand it one spizzop\nWe have it locked, to the tic toc it dont stop\nFrom our block to his block, it is that world bombs a lot\nEverybody got Glocks, but let him learn about\nHow them worms rock to the worms drop\nYeah you heard we rock, microphones by the masses\nYou never smash it, I get C-Notes diggin for the casket\nIt gets drastic, no need to ask if, we straight up mashin\nIf we dont start up all y'all to ball cashin\nThe throat locc apparatus when\nFront to back again, what you want we back again\nNow if a spliff did lyrically gifted, time to rap it then\nSo everybody throw your muthafunkin hands up in the wind\nLa la la la la , dee dee da dee dee da dee da\n\nChorus x2\n\nWarren G-\nI got brew D like brady more like trump\nLike the homey Tracy D who the quick to dunk\nFollow me, back to the situation at hand\nWe make your heartbeat bounce, wit ya hands on your chest and your\nPecs\nOpen I'm scopin, the homey straight loccin, break we go for broken\nWhat you smokin? the bomb blueberry\nG Z Whee Z's back and its scary\nTo each and everyone of you wannabes\nYou wants none of these we rap catastrophies\nMake ya heart beat ooh, ahh, dee dee da dee dee da dee dee da dee da\n\nChorus x4", "Definitely On The G Funk Vibe\n\nThis rap shit got my own cactuses\nLike we never slept on the same mattresses\nYoung age football practices\nBiscuit shine, Five of the ones on the waistline\nI ain't worried about no platinum change\nI'll give ya a 59 with a batman ass go range\n(mumbled speech)\nOk, musta being the zodiac\nV.I.P I really don't let this shit get to me\nI just flip tracks, spit facts\nGet relaxed, with G Funk laxed in the back\nWe stay in the ghetto, havin a tap with rugrats\nCats, and taps, with flaps\nFoul language, old english it's dangerous\nIt stays the same and never changes\n(Crumbling cries)\nG Funk is here to stay\nI pop a cap\nDomino's and spades\nWith a bag of gange and smoke it all day\nThere's a staircase, its a true 21\nHere's a toast to the thugs\nHigh drop 4 sheezy, drinkin' ma bud\nI still love n-a-t-e\nRollin from the sheezys\nWith a dress code like dubsy and a circle arse\nG-Funk is here to stay", "(Chorus x2)\nIf you wanna dip with me, trip with me, get rich with me\nThen you a world wide rider (rider)\nYou a world wide rider (rider)\n\n[Warren G]\nAnother day on the grind, it ain't much to do\nFuck with some bitches, hit a couple switches\nThis nigga's talkin shit I had to bomb on him\nHad to get checked, niggas best respect\nEveryday you see me on the paper chase\nI'm G, Warren to the G you know me\nThrow your hands high, where all my G's at?\nThey all comin, to where Warren G's at\nI keep my game tight, money and money and mo money\nAnd ain't a damn thing funny\nHow could I live like that, I just can\nAnd when it comes to this game, I'm just too far advanced\nI'll leave you waiting, homey whats crackulating\nIs it cracking or not?\nIn the back of the lot?\nBut this is all I got, I thought it was known\nWarren G, Neb Luv, K-Bar and its on\n\n(Chorus x2 - K-Bar)\nIf you wanna dip with me, trip with me, get rich with me\nThen you a world wide rider (rider)\nYou a world wide rider (rider)\n\n[Neb Luv]\nRide with Nine Inch Nails last night and shit\nI'm on some more rock'n'roll hip hop shit\nKeepin it locked like my zip drive\nWe goin stay high\nOut for the Motza, get you strung out like pasta\nAll into the roster lady, baby\nI'll drive ya crazy, pull your car for the diamonds\nI'm gettin shady, swayzie in the plush\nToo quick to be touched, give you the head rush\nTo the front of the stage, like you bout to get paid\nI'm lights, camera, watch you blow like grenades\nI never serenade, I just party\nMarinate, get your cash everybody\nCome on and ride with me, dip with me\nGet rich with me, sip some hennessey\nIf you's a, rider, a world wide, rider\n\n(Chorus x2)\nIf you wanna dip with me, trip with me, get rich with me\nThen you a world wide rider (rider)\nYou a world wide rider (rider)\n\n[K-Bar]\nBig bank tank little bank, nigga what you think\nI'm a pass on this million dollar hustle you a fool now\nGive me some portraits of some dead niggas\nTake two shots of the best made nigga\nThese niggas, talkin too much, they flossin too much\nInstead of makin they bucks, bank account runnin out of luck\nNow you stuck, do deals fulfill your dreams make cream\nKeep my pockets long like streams, no strings\nAttached, attack any nigga plottin on my stack\nMo bounce to this, smoke an ounce to this\nMake more gold than fish, one wish\nLive on top of the world\nAnd better livin for ghetto boys and girls\nPeanuts is for the squirrels\nNeb Luv, Warren G and me\nTalkin bout thick wallets and livin lavishly\nMash on thee enemy\n\n(Chorus x4)\nIf you wanna dip with me, trip with me, get rich with me\nThen you a world wide rider (rider)\nYou a world wide rider (rider)", "Take your time\nLook arround\nWhen your chips are on the line", "[Ricky Harris:]\nSay man, how many lumps do you want?\n\n[Gangster:]\nWhatchou mean how many lumps I want?\n\n[G-Child:]\nSay man, I'm gonna lump you right upside your funk.  Man!\n\n[Ricky Harris:]\nYou lump me, I'ma lump yo ass right back\n\n[G-Child]\nMan, well you better do yo thing then, cause I'm bringin' the real", "[RBX]\nOnce again, the circle, hehe\nContinues to hit you with these masses hits\nY'know, but we gone do it something like this\nFor all them bustaz out here\nCheck this out\n\n[RBX - Chorus (2x)]\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)\n\n[Warren G]\nI'm deadly as ever\nReady fo' whatever\nTryna to keep my pockets heavy on the cheddar\nGot nothing to prove, just really expressing myself\nWhy y'all niggas in the studio stressing yourself\nYa got to do it\nSo why not do it big\nDrop the music, and spit fluid to they wig\nUnderdig\nI'm a split the game in half\nAnd leave 'em all mad like Warren you do done did\nHey, we came here to ride\nNever slippin', but rather sippin' on my side\nBlaze up\nCuz I'm tryin' ta raise up\nAnd flow I came up, from broke to paper'd up\nDon't test me\nI bust like a 12 gauge sort of\nAnd hoes jump on stage and rip they draws off\nAnd I see through all that see-through\nMake up and weave in ya hair these ignit\nBut, hey\n\n[RBX - Chorus (2x)]\n\n[Warren G]\nSworing to the streets\nBorn in the Beach\nArmed with the heat\nMourning my peeps\nMakin' niggas respect mine, I came to collect mine\nComin' through with a Tech 9, lettin' my neck shine\nI let a nigga slide with a pass but next time\nI might disconnect his neck from his spine\nRun up and catch 'em from behind and stretch 'em\nWe squeez triggers like ketchup, wet ya whole stretch up\nScared of the truth, you fear it, don't wanna hear it\n'till the Smith's bust, then you listen up\nCuz I'm a tell it like it is, like it was or like it always will be\nGive a fuck if you feel me\n\n[RBX - Chorus (2x)]\n\n[Warren G]\nWho am I?\nW-A double R E-N to the mothafuckin' G\nSuicide\nNiggas hang theyself\nMight as well bend over, and fingerbang theyself\nSell they soul for the faim and wealth\nAnd end up broke and lonely\nNobody to blaim but yourself\nBut me, I keep it all business\nCuz this is business, can I get a witness\nSee I been chillin' like a villain\nWith a million and my children\nPlottin' or revealin' what the game been conceilin'\nI got a little older and learned a bit\nA plot the effort and earned a grip\nNow I know there is a hater in every circle\nAs I roll another vega heavy with purple\nTake a puff and inhale and hold it 'till it get stale\nIn my chest exhale my stress\nMy nigga R-B-X\n\n[RBX - Chorus (2x)]", "[DJ Eazy Dick:]\nGood evening, morning, afternoon, wherever, whosenever\nWhatsenever, we wouldn't give a damn\nWe want to welcome you back into the house of G-Funk\nHmm? That's right\nSince we last left ya, we had went international\nAnd one thing we noticed about everywhere we went\nIt's a whole lotta folk funkin'\nAnd don't know what the funk they funkin' wit\nHuh?\nLook out there now. We came to bring it", "*Beeping of alert signal*\n[Ensign:]\nCaptain, the transporter's ready\n[Captain]\nThat's hip.  Lieutenant Marvin, what is the condition\nOf the planets surface?\n[Marvin:]\nIt is difficult to be precise.  However, my instruments\nIndicate a condition of extreme rigor mortis, spreading rapidly\nThroughout the population.  Highly illogical, Captain\n[Captain:]\nA bunch of stiffs, huh?  Well, set coordinates for, ah\nChocolate City, and have a landing party of nine men beam down\nImmiediately, with phasers set on funk-funk!", "Once again, the circle, hehe\nContinues to hit you with these masses hits\nYou know, but we gone do it something like this\nFor all them bustaz out here\nCheck this out\n\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)\n\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)\n\nI'm deadly as ever\nReady fo' whatever\nTryna to keep my pockets heavy on the cheddar\nGot nothing to prove, just really expressing myself\nWhy y'all niggas in the studio stressing yourself\nYa got to do it\nSo why not do it big\nDrop the music, and spit fluid to they wig\nUnderdig\nI'm a split the game in half\nAnd leave 'em all mad like Warren you do done did\nHey, we came here to ride\nNever slippin', but rather sippin' on my side\nBlaze up\nCuz I'm tryin' ta raise up\nAnd flow I came up, from broke to paper'd up\nDon't test me\nI bust like a 12 gauge sort of\nAnd hoes jump on stage and rip they draws off\nAnd I see through all that see-through\nMake up and weave in ya hair these ignit\nBut, hey\n\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)", "Hey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)\n\nSworing to the streets\nBorn in the Beach\nArmed with the heat\nMourning my peeps\nMakin' niggas respect mine, I came to collect mine\nComin' through with a Tech 9, lettin' my neck shine\nI let a nigga slide with a pass but next time\nI might disconnect his neck from his spine\nRun up and catch 'em from behind and stretch 'em\nWe squeez triggers like ketchup, wet ya whole stretch up\nScared of the truth, you fear it, don't wanna hear it\n'till the Smith's bust, then you listen up\nCuz I'm a tell it like it is, like it was or like it always will be\nGive a fuck if you feel me\n\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)\n\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)\n\nWho am I?\nW-A double R E-N to the mothafuckin' G\nSuicide\nNiggas hang theyself\nMight as well bend over, and fingerbang theyself\nSell they soul for the faim and wealth\nAnd end up broke and lonely\nNobody to blaim but yourself\nBut me, I keep it all business\nCuz this is business, can I get a witness\nSee I been chillin' like a villain\nWith a million and my children\nPlottin' or revealin' what the game been conceilin'\nI got a little older and learned a bit\nA plot the effort and earned a grip\nNow I know there is a hater in every circle\nAs I roll another vega heavy with purple\nTake a puff and inhale and hold it 'till it get stale\nIn my chest exhale my stress\nMy nigga R-B-X\n\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)\n\nHey, we came here to ride (don't do it)\nForty battle ready and set to collide (don't do it)\nNiggas you won't know the death you die (don't do it)\nSuicide is a suicide (don't do it)", "[Verse one: Halla]\nHalla, listen\n\nMy cousin got 15, he was only 18\nCops hopping out like they the A-Team\nChilly in the projects, picturing that rock\nSame old old head sitting on the block\nI was wild as a ghetto child\nMean mugging out, used to had a kool-aid smile\nTuesday night, we came up to the ring with the heaters\nFight broke out they let it out on tweeters\nSo momma say, Halla, take care of your kids\nAnd never do dirt and business where you live\nStress give niggers more reasons to get high\nAnd hit the thing once and swear to god they could fly, bye\nI'm off to the turf if they let me\nHe game bring the hood like the set going to accept me\nIt's all in the day of the life from where I'm from\nI'm not a statistic, cause I made twenty-one\n\n[Hook]\nWhat's wrong, What's wrong\nWhat's wrong, What's wrong\nI think I need to ask somebody\nI need to ask my uncle Marvin\nWhat's wrong, What's wrong\nWhat's wrong, What's wrong\nI need to ask somebody\n\n[Verse two: Black Nicc]\nLet's speak for the hood, baby\nHomies are out here crying\n\nMy granny telling me I need to go to church\nThe homies in the hood telling me to do dirt\nIt ain't shit changed, yo, we in the same game\nIt's hard to get a job when you live with cocaine\nMy brother is a gangster, my uncle is a banger\nLiving in the projects, looking out for danger\nCrookedwith a hanger you can see it locking up\nYeah, the fierce on my ass they don't want to see me up\nI hear the streets talking, we all need help\nKeep some real niggers with you cause it's hard by yourself\nI'm speaking for the hood, yeah, I'm straight off the block\nWhere it's hard to get sleep, you hear them gun shots\nIn the studio apartment, your baby's still starving\nWhat the fuck is going on, ask uncle Marvin\nThe homies in the hood telling me to do dirt\nBut my granny telling me, you should go to church\n(church)\n\n[Hook]\n\n[Verse three: Warren G]\nWe used to steal fifths, put on our big brother clothes\nSlide up to king park and try to mack some hoes\nTook one to knew us, yeah that was my home\nWhen the sheriff killed my home boy, t-bone, Tyrone\nHanging with the D boys, chilling with the crooks\nKilling the game with ? and Ronnie Brooks\nWe used to run shit up under that bridge\nSmoking coochy and brig, that's how we lived\nMe fruity baby pop, rowdy little kids\nThings changed nowadays you're some rowdy little kids\nUp about the park when we heard that lit (pop pop pop)\nAnd the next thing you know, Louis lost his leg\nNow we ducking the police and dodging the feds\nFuck hustling, I'd rather get a job instead\nFuck struggling, I can make money, doing these songs\nCause your closest home boy, would do you wrong\n\n[Hook]", "West west y'all\n\nRay j chorus:\nOh baby, dont u rush, dont u crush\nWe gotta just take our time\nHush, girl just hush\nDont say a word, i know what you like\nUs, its just us\nTurnin off my phone tonite girl\nCrush, on you, crushin you tonite\n\nWarren g verse 1:\nEvery now and then i feel a little about it\nThe VIP get a little crowded\nYou should see the piece with the diamonds inside it\nIts so vibrant, platinum all around it\nWhen i take flight, how can i stay grounded\nGot the 2 6 pep boys been around it\nShawty wanna shake the spot like right now\n5 cut a cranberry saturn right now\nMama got back, pretty little thang\nKicked in the door with bullied out the game\nPYT, pretty young thang\nI told her cross over stop messin with the lames\nSwitchin 4 lanes like money ain't a thang\nI got on 4 chains like money ain't a thang\nYeah girl this is us tonight\nTake her back to the crib we gon crush tonight\nRight?\n\nRay j chorus:\nOh baby, dont u rush, dont u crush\nWe gotta just take our time\nHush, girl just hush\nDont say a word, i know what you like\nUs, its just us\nTurnin off my phone tonite girl\nCrush, on you, crushin you tonite\n\nWarren g verse 2:\nSo now we in the coup, starin through the roof\nYour face like a model your body through the roof\nChampagne by the bottle, now we in the loop\nIm g'd up, with doc i be swimmin thru the loot\nAnything for my boo, from fashion to asprin\nI told pops u the one u could ask me\nFlashin the necklace, the ring like a fitty\nWe can leave the country have sex in the city\nAny soakin the till takin shots like biggie\nI realised i got my own style like diddy\nBb and carrots baby girl be shinin\nOld man ain't the only one throwin up diamonds\nThrowin up dollars yeah i gotta have it\n\nLaughin at the girls on the floor tryin to grab it\nI ain't spike lee but ma i gotta have it\nDont blush baby girl just crush\n\nRay j chorus:\nOh baby, dont u rush, dont u crush\nWe gotta just take our time\nHush, girl just hush\nDont say a word, i know what you like\nUs, its just us\nTurnin off my phone tonite girl\nCrush, on you, crushin you tonite\n\nRay j bridge:\nThese 4 walls can't contain my love\nGirl can we take this to the balcony\nThis lil bed just ain't large enough\nFor the two of us\nGirl i hope your feelin me\nOh girl\n\nVerse 3 warren g:\nAnd girl its just us so just hush\nYou might get outta line the nine is gon bust\nYou see the crushed, ice in your face\nHit the cush, now u in space\nDont fuss we seein eye to eye\nI push the 6 and pass by ur 5\nAnd rush hour in ya ride\nYour girl by my side\nWe gon crush tonight right?\n\nRay j chorus:\nOh baby, dont u rush, dont u crush\nWe gotta just take our time\nHush, girl just hush\nDont say a word, i know what you like\nUs, its just us\nTurnin off my phone tonite girl\nCrush, on you, crushin you tonite\n\nCheck this out this your homeboy ODLB\nAnd what\nYall thought i wasn't comin back?\nHa ain't that a blip\nYeah\nWarren g and ray j puttin it down for yall like that\nLBC style\nThis your homeboy LB yeah!", "[Warren G]\nSuckas be hatin when they know we makin cash\nI don't give a fuck I'm still down and ready to smash\nHaters be sayin Warren G fell off\nHow is that when I put the beach and Snoop on the map\nThe only way they comin to jack you\nYou better come right to save case and Glocks on site\nAin't know body I know checkin for you\nI got gold platinum look at my wrist fool\nIt's a million and one ways to what people say\nThey gone say what they say but they fail to display\nWhere I went wrong, can't I do right\nIn the city I face snitches, with no britches\nQuick to judge and hold a grudge\nAnd all this time I showed them love\n\nHook: [Warren G]\nThis is somthing fo you to bounce to\nIt's for the summer time I'm a hit switches for you\nThis is somthing for you to bounce to\nThis is somthing for you to bounce to\nThis is somthing for you to bounce to\nThis is somthing for you to bounce to\n\n(Soopafly)\nIt's them niggas from the LBC\nAnd we back with the stone cold mack\nCuz the summer time bout to crack\nBud and the bitches come free\nIt's so lovely dippin wit the Dub G G'd up blazin weed up\nRollin wit a shooby doo\nA nine at least let alone die in peace on the eastside\nThese niggas really keepin' it G\nIf they don't then they wount, fuck a hater nigga I keep a heat\nI am P Soopafly bond to go double plat\nFuck a rat I'm a show you where the trouble at\nStep to close I let the duce go strut off wit two hoes\nLook how the jucie flows\nIt's a party and the eyes on me\nAs I fall in with a small grin, talkin with the tall kain in my hand\nI'm so cool, I swear I'm do that damn thang\nSo vicious with my champain bitches\n\nHook: [Warren G]\n\n[Warren G]\nG'd dub what's really crackin with you\nI just signed with universal this game so persal\nWhat's up with you and your boy Snoop\nThat's my dogg for life how you figure we ain't tight\nWhat's up with 2-1-3\nIt's comin so start your tape that's runnin\nThey wanna know is you keepin it G'd\nAs big Lou Dogg from 21st street\nIt's amazin how time flys\nSome time I sit back and wonder why\nMost people don't keep it tight\nAnd most G'z don't G it right\nAnd me I always bounce it right\nMake you wiggle that ass till you get it right\nBaby what you perkin for\nMo' bounce to the ounce if you wan't some more\n\nHook: [Warren G]", "Been such a long time since I held you\nAll the while you used to talk to me\nAll the things you said made me so strong\nYou know what, I would say I would keep movin' on\nSometimes I sit back and think about how it was\nWhen I was young, I used to think it was you I couldn't live without\nSomehow, life took a sad route\nSometimes the wind blows bad enough to take a plane down\nYour straight bullets killed children on playgrounds\nBullshit got me about to smoke a whole pound\nMeanwhile, I smile, hoping I can rebound\nSomehow the LBC streets ain't the same now, without you\nThings ain't been the same since you ain't around\nBut I stay strong game tight, hold it down\nWarren G, I never played a blackground\nThis song is fucked up, because you gone\nOoh, I see ya standing there\nWith the moonlight shining in your hair\nHow it makes me reminisce\nOver and over, again and again\nOoh, I see ya standing there\nWith the moonlight shining in your hair\nHow it makes me reminisce\nOver and over, again and again\nNothing means more to me, than family\nWhen one lost, it's sad to see, damn it's me\nA friend you will always be\nAbove all things, you taught me to pursue my dreams\nWith joy it brings, at times when I sit and think\nI know inside you smiled down, proud at me\nI just need one more drink, damn\nAt night I can't sleep, I admit that its hard to eat\nIt's all good, I ain't trippin'\nTried to show me the right laws and guidelines\nBut I ain't listen, I'm sitting here lavishing and living\nAnd I'd give it all back because you still missing\nOoh, I see ya standing there\nWith the moonlight shining in your hair\nHow it makes me reminisce\nOver and over, again and again\nOoh, I see ya standing there\nWith the moonlight shining in your hair\nHow it makes me reminisce\nOver and over, again and again\nLord please hear me, ease my soul\nI woke up one day and my mom was gone\nI'm in the zone wishing I could call your home\nSing your song, tell ya that I'm out on tour\nAll alone, I just needed to hear your voice on the phone\nMother and son, though I'm grown\nLife moves on, I need you Mom, a quiet storm\nDifferences and right and wrong\nAs I move on, since Warren G ain't gone\nThe stitch is on, set the tone, the page I'm on\nIs having fun, having a ball, living life\nI'm still here, wishing you was home\nOoh, I see ya standing there\nWith the moonlight shining in your hair\nHow it makes me reminisce\nOver and over, again and again\nI still see you standing there\nWith the moonlight shining in your hair\nHow it makes me reminisce\nOver and over, over, over, over\nAgain, again, I miss you\nOhh Mama, don't know, Mama, don't know\nHow I keep it strong, keep moving on\nKeep it strong, movin' it on\nKeepin' it strong, movin' it on\nKeepin' it strong, movin' it on\nKeepin' it, oh Mama, keepin', oh Mama\nThe things she told me\nI promise I'll be the same to your grand children\nWhat you worded me\nDon't worry\nI still feel you mama\nThe things you say\nI feel your arms around me everyday\nOh, Mama, oh I know, I know, I know\nI know, I know, I know, I know\nI know, know, know\nI know you're there\nSmiling down at me", "(Whats up Warren G?)\nWhats happenin? I'm just chillin, you know\nCheckin my game you dig, you know\nTrippin off these fools around the situation, you know its like that\n\n[Mr. Malik]\nI went from hustlin and slangin to bustin and bangin\nI got to keep it real, so fuck not cursin when I'm sangin\nNow let me tell y'all about this shit, went down the other nite\nMe and the doggs see some niggas, just caught up in tha hype\nTryin to ride and get by like tha FBI\nCause we know bout them hk's, they right outside\nBut we never knew y'all had a clue bout what we go through\nSo tell how the fuck could you speak on my crew\n\n[Badass]\nI went from dirt to large work like boatloads of keys\nIt's hard work and it hurts to live life on ya knees\nSo God please have a lil mercy on my soul\nWhat my eyes see my mind think my hand should hold\nThe outcome of these actions warm hearts turn cold\nLil snake tryin to blast me wit the gun he stole\nWe hang out, banged out, same route as the day before\nBlessed wit perception, but don't know how my days a go\nCould see my nigga hittin wit some pay, a few days ago\n\n[Daz]\nNow we back in the mix with some more clips and paper though\nI can't do nothing but enjoy myself\nGotta do it myself, got a gang of wealth\nIts bloodclottin muthafuckaz seem like they want it all\nBut they can't, trying to fake on me and my doggs\nIf I fall I fail, gotta retrace my trail\nCross C's to clock G's I bell with bell\nI keep the throw downs for mine\nWarren G, Dogg Pound clockin the doves and come\nServe your whole fuckin hood with some bud and rhymes\n\n[Kurupt]\nPlus you niggas dont mash like mine, throw em 17 times\nMoney like a muthafucka, homey give me mines\nPaid, I come stomping like a parade, the escapades\nPsychoatic analysis, as I consume, always cartin the mushrooms\nWith clear sight, the daylight's like the night\nA closet full of Franklins, a G's paradise\nA nice 40 ounce a O.E. on ice\nPrecise poetic performing nice on mics\n\n[Warren G]\nWell I flew from the East to the West\nWord on the street, niggas wanna test\nBut these MC's, is scared to buck\nPlus they talk too much and smoke too many blunts\nYou fuckin rookies\nSweet as Mr. Smith's cookies\nYa hate me one minute and tha next ya wanna buck me\nHe sent a ho, in the back seat of my fo'\nWhile ya Goin Back To Cali, watch how you flow\nNow ya know, about this Warren G Era\nG-Funk terror, look into tha mirror\nAnd what you see is the don of the company, that nigga\n(Warren G, Warren, Warren, Warren's to tha G)\nYou still see, what I see\nAll of the homies in the LB\nSittin back, and we makin the cash\nWarren G, Kurupt, Hershey, Daz and Badass\n\n(Chorus) x2\nAnd we never knew you had clue of what we go through\nSo how in tha fuck could y'all speak of our crew\nYa thought this, ya thought that, we thought y'all should laid back\nYeah it's like that,for me it's like that\n\nSittin back,and we makin the cash\nIt's Warren G, Kurupt, Hershey, Daz and Badass\nSittin back,and we makin the cash\nIt's Warren G, Kurupt, Hershey, Daz and Badass\n\nThats right\nYa know what I'm sayin Warren G\nWith my homeboys from the pound Daz Dillinger, Kurupt the Kingpin\nAnd the homey Malik, ya know what I'm sayin and Mr. Badass\nAnd thats how we doin it fool, yeah\nWe ain't bangin on wacks nigga, we doin it like we should be fool\nYeah", "(feat. Nate Dogg, Snoop Dogg)\nWe'll like to welcome y'all back to the club\nI'm your host this evening, Mr. Tadah!\nYa dig, club Toe Jam, is once again off the hook\nFor ladies night, ya dig, everynight\nRight now, we would like to bring something very special for you\nCheck it out\n[Nate Dogg]\nOooooooooooooooh\nI like them girls with the tight black skin, dark and fine\nThat's the kind of girl I wanna play with tonight\nI wanna do some nasty thangs, wanna make her scream my name\nI like the girls that don't say, \"what?,\" know that she fine\nAlways knows her line, because she knows she's a dime\nPut her on platinum chains, got her own cash and things\nI like them girls, their sassy ways, sassy ways\nOh I like them girls, man I could stay there for days\nOoooooooooooooooh\n[Snoop Dogg]\nWhy you so cute, why you so big\nWhy you bullshitin', come and deal with a pimp\nPut your bags in the trunk, holla at your boy\nYou can spend the night, we at the Elroy\nDoing things that we shouldn't, couldn't\nGirl you got that good chocolate pudding\nThe best in hood, what's goodin'\nShe got the wizard of west wood, like old John Wooding\nBut how could I need that\nI'm looking for feedback, because I can't believe that\nI fell into a little tree sap\nI got a woman at home, ain't fell in love where the weeds at\nStarted off with a dime, but by the time I was thug\nShe was less than a duece, I'm telling the truth\nConfessing with you, I'm just messing with you\nBecause on the real baby girl, you put in the S in Snoop\n[Warren G]\nSee I rock baby, nonstop baby\nWarren G baby, shake that thang lady\nI see you picky lady, you be tweaking l", "Paroles de la chanson Something To Bounce To :\n(feat. Soopafly)\n[Warren G]\nSuckas be hatin when they know we makin cash\nI don't give a fuck I'm still down and ready to smash\nHaters be sayin Warren G fell off\nHow is that when I put the beach and Snoop on the map\nThe only way they comin to jack you\nYou better come right to save case and Glocks on site\nAin't know body I know checkin for you\nI got gold platinum look at my wrist fool\nIt's a million and one ways to what people say\nThey gone say what they say but they fail to display\nWhere I went wrong, can't I do right\nIn the city I face snitches, with no britches\nQuick to judge and hold a grudge\nAnd all this time I showed them love\n\n[Hook: Warren G]\nThis is somthing fo you to bounce to\nIt's for the summer time I'm a hit switches for you\nThis is somthing for you to bounce to\nThis is somthing for you to bounce to\nThis is somthing for you to bounce to\nThis is somthing for you to bounce to\n[Soopafly]\nIt's them niggas from the LBC\nAnd we back with the stone cold mack\nCuz the summer time bout to crack\nBud and the bitches come free\nIt's so lovely dippin wit the Dub G G'd up blazin weed up\nRollin wit a shooby doo\nA nine at least let alone die in peace on the eastside\nThese niggas really keepin' it G\nIf they don't then they wount, fuck a hater nigga I keep a heat\nI am P Soopafly bond to go double plat\nFuck a rat I'm a show you where the trouble at\nStep to close I let the duce go strut off wit two hoes\nLook how the jucie flows\nIt's a party and the eyes on me\nAs I fall in with a small grin, talkin with the tall kain in my hand\nI'm so cool, I swear I'm do that damn thang\nSo vicious with my champain bitches\n\n[Hook: Warren G]\n[Warren G]\nG'd dub what's really crackin with you\nI just signed with universal this game so persal\nWhat's up with you and your boy Snoop\nThat's my dogg for life how you figure we ain't tight\nWhat's up with 2-1-3\nIt's comin so start your tape that's runnin\nThey wanna know is you keepin it G'd\nAs big Lou Dogg from 21st street\nIt's amazin how time flys\nSome time I sit back and wonder why\nMost people don't keep it tight\nAnd most G'z don't G it right\nAnd me I always bounce it right\nMake you wiggle that ass till you get it right\nBaby what you perkin for\nMo' bounce to the ounce if you wan't some more\n\n[Hook: Warren G]", "*The group Reel Tight in background*\n\n[Warren G:]\nCheck this out, this is\nWarren G, chillin' wit' my homeboys\nReel Tight\nThat's how we doin' it all night\nSo, screw your wig on tight\nSmoke a joint\nTake a shit\nCause we gonna rock this\nMotherfucker tonight\n\n(Laughs)\n\n[Warren G:]\nBe-itch (Echoes)", "Hey you gon miss up on the g-funk era\nYa know we said things won for warren g, and soon turned superstar\n11-10-7 D that was my intro\nAnd now I'm makin dough, I'm rollin a 64\nWell things get shady when the grass is greener\nBrothas throwin up sets in hoods like ya neva seen a\nYoung mac daddy do his thing 'cause I pack right\nI got 44 ways to make you act right\nAnd it's a shame how the game must be played\nIt was told never fold by the brothas you can't fade\nSo raise up on this young hog\n'Cause I heard you punkin some but you can't punk me dogg\nI got my own thang 'cause I let my beats swing\nIt ya wanna bring it bring it on no pain to gain\nSo as I creep can you peep what I speak\nTechniques unique, so what you sayin is obsolete\nSo there it is as I go about my days\nI can only bring it to you like this in so many ways\nHey, hey, hey this is Warren G you know\nAnd I was in Baghdad\nBefore these lil youngstaz was in they Daddy bag\nYa know, yeah, they in violation Wayniac so hound em\nI'm bein true ain't no fakin wit me\nBrovas plottin on me trynna test if they can see\nBut I'm peepin out the sain for the peeps who gimme props\nFor stayin out that madness you know it ain't gon stop\nIn so many ways I let 'em know\nIn so many way I let it flow\nBut you still don't hear me though\nSo I'm gon break it down 'cause it's quite elementary\nThis is for da homies in da penetentary\nAb baby papa\nBig rotch from the block\nAnd the homey j dogg down 'cause you'ze a hoe\nI got plenty love, and homey love stays\nI can only bring it to ya like this, in so many ways\nHey, hey, hey this is Warren G you know\nAnd I was in Baghdad\nBefore these lil youngstaz was in they Daddy bag\nYa know, yeah, they in violation Wayniac so hound em\nI stay true to the game\nBut some stay blind to the fact\nThat if I don't look good, you don't look good\nSo please rearrange and change the things you doin\nYou playin yourself 'cause you the one gettin screwed\nAs i, ease on down the rick road\nAs I shift from first to second, cruise control\nSo spark up the doujer\n'Cause I got the drink, and don't think that\nWe don't roll without a full tank\nOf that bomb that we called the funk\n'Cause I am the g and the funk is what you want\nNow lets take a trip to the other side of town\nBrothas flip flop and they neva stay down\nWanna be all they can be, but gettin held back\nTryin to take what is mine what type of lick is that\nSo this is for the homies stay down for your pay\nI can't only bring it to you like this in so many ways\nHey, hey, hey this is Warren G you know\nAnd I was in Baghdad\nBefore these lil youngstaz was in they Daddy bag\nYa know, yeah, they in violation Wayniac so hound em", "[Ricky Harris AKA Reverend TaaaDow]\nOur musicians have been playing very lovely don't you agree? Amen, amen!\n(Yes, yes amen)\nNow ya’ll know what time it is!\nGo to the book of seventh letter and it says its time once again to regulate! Regulate! You can instagram it, you can tweet about it. You can put it all on ya app Siri. Its time to Regulate! Amen! Touch your neighbor right now and say \"Regulate\"! Touch your neighbor right now and say \"Regulate\"! Touch your neighbor right now and say its time \"Regulate\"!\n\n[Warren G]\nWatch out now there Reverend watch out now!", "Swagger Rich", "Shhhhh!\nThank you", "[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Verse 1: Warren G]\nCan I get in where I fit in? Sit in, listen (uh-huh)\nLet me conversate better yet Regulate\nShake the spot with my knot, may fade\n'Cause I don't like to dream about gettin' paid\nI played ball through the halls of CIS\nWith Snoop Dogg's big brother, call him Dirty Left\nRack 'em up, crack 'em up, stack 'em up against the gate\nThe homies tryin' ta catch me but they cain't, wait\nDamn, the street lights just came on!\nAnd my momma's in the streets tellin' me to come home\nI hit the gate and I hops on my Schwinn\nAnd I tell the homies, \"Aight then,\" yeah\n\n[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Verse 2: Warren G]\nVerse two (uh-huh), now what the fuck I do?\nCatch the bus to Cal State, or chill with the Voltron crew?\nAnd make a few ends on the side\nHere comes a baby blue van, time to ride\nSo I hops in the van with my nigga Tick\nAnd Baby Poppa back then, that was my clique\nWe groovin' to Santa Ana\nAnd we plan-on makin' hellafied mount of money (hell yeah)\nAnd what I did for extra fees\nWas break niggas after work playin' get like me\nI was fourteen years old, havin' a sack\nJust a young motherfucker eatin' ValuPaks\nShootin' dice in the halls of the public schools\nAnd I used to gangbang, but now it's a G thang\nAnd I still know how to make those ends\nYou don't believe me? go ask The Twinz, motherfucker\n\n[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Outro: O.G.L.B]\nYeah, check dis out, this is I'm O.G.L.B\nKnowhatI'msayin'? I'm on my little O.G. Warren G\nAnd he just droppin' this to let you BG's know\nWhat's happen, y'all got to recognize\nCause this is y'know a Long Beach thang\n21st Street, but check this out\nG gonna go out there, yaknowhatI'msayin'?\nAnd handle that shit y'now? Yeah\n\n[Hook: Warren G]\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\nIt's kind of easy when you listen to the G'd-up sound\nPioneer speakers bumpin' as I smoke on a pound\nI got the sound fo' yo' ass and it's easy to see\nThat this D.J. be Warren G\n\n[Outro]\nHey Greg, I hope you was tapin' that shit!", "Its that nigga gz wheez\nBack for the 9-c\nI ex sippin on the yak so people wanna know whats next\nAin't nuthin changed, another day a new time\nWith this uptempo beat with the g-funk rhyme\nRegulatin state to state, coast to coast\nIts all about the call of greens, yak, lets toast\nCuz its a ballin society\nI try to be the dopest i can be in this industry\nBut you dont hear me\nI think ya betta, i think ya betta\nCuz when i, get it goin on i ain't gonna let up\nI set up, the g-funk family and we\nFunkin up the industry until eternity\nIts alright with you if its alright with me\nWe'll get down to the sounds of the lbc\n\nChorus: repeat 2x\nRelax your mind, your mind, your mind\nRelax your mind and let your conscious be freein you down\nTo the sounds of the warren g\nIt ain't easy bein gz\nBut the lifestyle i chose, the status to which i rose\nThe doors, i open, i'm loccin, i'm scopin\nThrough the eyes of the g child\nI see many try to duplicate the lbc style\nBut it ain't even happenin like that\nI was time i had to make a comeback\nAnd get mine, you know i'm genuine\nBeen in motion with the potion with snoop since 89\nDevotion is the key for me so\nRelax your mind and let your conscious be free\nThe homey just touched down, foolin wit a pound\nPut yo gun down, so you can walk a safe ground\n\nChorus: repeat 2x\nI know it's been hard on you for about two, so\nI had to relax your mind, i thought you knew\nAin't nothin but a long beach party\nWith yo hands in the air, with the twist of coke and bacardi\nAll the homeys around and the slingshot t-shirts\nSkirts wit the baby fat it'll work\nPass me the indosmoke and get locced-a", "Nobody does it better, nobody does it better\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nI'm sittin' here trippin', my mind is blocked\nNate Dogg just spit it so it's time to cock\nNo one can do it better like this 2 man crew\nThey say we're one hit it quitters, now what cha'll gonna do?\nAlways into somethin', that's my name\nOnly out for money, hey 'cause that's the game\nPeople always ask me why I'm out for scratch\nHe who has the most is he who won the match\nStrike one, me and Nate Dogg is a match\nStrike two, leave 'em standing still in their tracks\nStrike three, you can call us 2-1-3\nIt's the L and the B that makes me act like a G\nMy exhibition started back in '93\nNo one, nobody listenin' but Warren and me\nTo all the nonbelievers, now I bet you see\nNobody does it better than me\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nThey call me DJ, the spark plug, keepin' it licked\nThere is no accident for these platinum hits\nSo when we make it to show love, bangin' in your club\nHangin' with your thugs, givin' up G love\nDo you remember back on the East Side?\nWhen all of us niggas used to love to ride\nWe didn't care what we did\nTime was nothing to us, we were just kids\nTimes are different now but you still get stuck\nI'm not a kid no more, I just don't give a fuck\nSo if you think you really wanna step to me\nKeep this is mind, nobody does it better than me\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nWow, make you say go now\nHot rap singles on the charts now\nGot a baby, so I'm breakin' hearts now\nOn your mark, get set, it starts now\nAll you pimp playin' hustlers, now you know\nYou can't keep me out once you crack the door\nEither join a team or it's best you flee\nNobody does it better than me\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah, yeah\nWe just tryin' make you see, nobody does it better\nNobody does it better\nNobody does it better", "Hi, I'm Joey Viera. No doubt if you're getting into this album for the first time, you're already familiar with the introductions on volumes one and two. Well, volume three offers you some interesting rhymes for rock, jazz fusion. With the evergrowing exceptions of crossovers artists that can sell millions of albums, playing advanced chords and leads, drum drops promises to keep recording those new styles that are introduced and are accepted on the commercial charts. Again, with the exciting playing of G4, let's get in to what the professional album is all about\n\nYou didn't think we could do it again. G4. The new millenial, fool"]}