{"Dax": ["[Intro]\nI just want to make this clear (Listen)\nI am a believer\nBut sometimes it gets hard (Listen)\nMy name is Dax (Dear God)\n\n[Verse 1]\nDear God\nThere’s a lot of questions that I have about the past (Can you hear me?)\nAnd I don’t want hear it from a human you made it so you’re the last person that I’m ever gonna ask\nTell me what’s real, tell me what’s fake\nWhy is everything about you a debate? (Why?)\nWhat’s the point of love?\nEvery time I’ve showed it I was broken and it’s forced me just to only wanna hate\nWhy’s there only one you but multiple religions? (Why?)\nWhy does every conversation end in a division? (Why?)\nWhy does everybody want to tell us how to live but they won’t listen to the same damn message that they giving? (Fuck them!)\nTell me how to feel, tell me what’s wrong\nI tried to call, pick up the phone (Pick up!)\nI’m on my own\nEverybody says you’re coming back, then man why the hell's it taking so long?\nWhy do I hurt? (Why?)\nWhy is there pain?\nWhy does everything good always have to change? (Why!)\nWhy does everybody try to profit off another man's work then destroy it just for monetary gain?\nTell me are you black or are you white?\nI don’t even really care I just really want to know what’s right (I don't care)\nThey been saying one thing but I’ve been looking in the book\nAnd it seems like they’ve been lying for my whole damn life\nTell me where I’m going (Where?)\nIs it heaven or hell?\nI just hope this message greets you well\nI had a dream that I was walking with the devil\nDon’t remember how it feels but I swear that I remember the smell\nLooked me right into my eyes and told me everything I wanted could be mine if I gave up and decided to sell\nBut I said I’d rather die then get mine now I’m here no fear one man with a story to tell\n\n[Verse 2]\nDear God\nWhere were you when I needed it?\nWhen I fucked up and repeated it?\nWhen they set the bar and I exceeded it? (Where were you??)\nMy life is like a book that they’ve been judging by a cover but have never took the time to fucking read the shit (Fuck!)\nI remember telling you my goals and my dreams but you didn’t even answer so I guess you didn’t believe in it\nI remember sitting with a gun to my head trying to ask you for some help but I guess you didn’t believe in it!\nI don’t want religion I need that spirituality\nI don’t want a church I need people to call a family\nI don’t wanna tell my sins to another sinner just because he’s got a robe and he went to some academy\nI don't wanna read it in a book, I wanna hear it from you\nDon’t wanna learn it in my school because they’re hiding the truth (Swear..)\nDon’t wanna talk about it to another fucking human being and that's only reason that I even stepped in this booth\n\n[Verse 3]\nDear God\nHow do I take this darkness and turn it into light? (Talk to me)\nHow do believe in a concept where I speak to a man I’ve never seen with my own two eyes? (How?)\nHow do I know that religion wasn’t made just to separate the world and create a whole disguise just to keep us in these chains while the rich get richer and the poor pray to you and perpetuate a lie?\nHow do I know this ain't some big joke? (How?)\nHow can I have faith when there is no hope?\nHow the hell does one man have 100 billion dollars and we still have people on the street that are broke?\nThere's a lot of things I wanna talk about and get off my chest\nI can’t sleep 'cause the devil won’t let me rest\nI used to know a fucking pastor in a church and I can still hear the screams of the kids he would fucking molest\n\n[Verse 4]\nDear God\nDo you hear me? (Do you hear me??)\nI’m supposed to fear you but you ain’t said shit so maybe it's you who actually fears me?\nI don’t know the answer I just want to see it clearly\nSo many lies there’s a 1000 different theories\nAll I want to know is who really made religion because I know it wasn’t you but don’t nobody believes me\nNo more lies, no more death\nBring back King, bring back X\nPlease dear God let their souls rest\nProtect who’s left and watch their steps\nDear God (Dear god)\nI don’t want to have to ask you again\nI just hope that you know that I’m still a believer so I’ll end this all by saying amen\nIt's Dax", "[Intro]\nTo be honest I didn’t even want to make this\nI knew the topic I would talk about was frowned upon and heavily debated\nEverybody thinks I’m happy but I’m not and this here is my confession\nHow I let a girl destroy me and then push me to the point of this depression\nLexNour\n\n[Verse]\nYeah I’m talking about that do or die (yeah)\nYeah I’m talking bout that suicide (yeah suicide)\nGot all these cars man but who gon' ride?\nFucked my friend a couple times\nTold me all those fucking lies\nSo I wrote a song so you could find out how I felt inside\nI swear to God I almost shot myself a couple times\nI should be dead\nSo I had a talk with God and he told me it’d be hard so I asked if I could stay and he could take you instead (amen)\nRemember all the shit that you was telling me?\nHow you loved me and want nobody above me\nNow it’s funny all the shit that you promised is just a memory (fucking lie)\nYou gave me something to believe in\nThen you broke me into pieces and it’s fucking with me mentally\n(I can't think straight)\nAnd I can’t trust no other bitch because I’m starting to see women as the enemy (I swear)\nI saw you texting with the dude and it was cool because you told me you and him were just friends\nThen I caught you in the bed, let it slide, took you back, and then you went and fucked the same dumb nigga again\nWhat the fuck bitch? I gave my all to you\nThere’s a kid that no ones knows about and me and you both know I am the father to\nThat means I am a part of you, you went and broke my heart in two\nThen stabbed me in the back and watched me bleed and pulled an audible\nFuck! How you think this gon' end?\nCause I been dealing with depression, social media attention\nThey expect me to be happy but I’m fucking depressed\nI swear I’m fucking depressed\nAll the money in the world don’t mean a thing if you can’t share it with somebody that you love and that you fucking respect (Dax)\nDo you know how it feels to be awake\nBut all you want to do is go back to sleep? (do you?)\nBecause reality is suffocating pushing on your chest so all you want to do is go and live your life in your dreams? (can you relate?)\nDo you know how it feels when the person that you love doesn’t love you back?\nWhen they say the right things but their actions are the opposite of everything they tell you everyday to relax? (I need help)\nBitch I would've killed for you! (Yeah)\nMan fuck all of this music shit I’d pass up on a deal for you! (Uh, Yeah)\nOther niggas tried to fuck, I swear I only saw the real in you!\nYou cheated twice and now I can’t deal with you!\nIt’s Dax\n\n[Prayer]\nDear God\nI ask that you give me the strength, to trust again\nPlease help me relieve this burden from my heart\nI know time heals all wounds and some just take longer than others\nSo I'm going to trust you with this process\nAmen\n\n[Outro]\nEverybody put your hands up if you can relate\nWe all been there, this is for you", "[Intro]\nWhat would your last words be?\nIf someone put a gun to your head\nAnd said you had two minutes before they shoot\nHere are mine\n\n[Verse 1]\nWish I can go and revisit the evil I did through the course of my life (I wish)\nWish I could go back in time take the wrongs that I did and reverse them to right (Fuck)\nWish I can take all the pain, the hurt, the struggle and keep 'em inside (Damn)\nWish I can say that I'm sorry to people I broke here before that I die (What)\n\n[Chorus]\nWish I can go back in time to my father, I didn't really mean it\nWish I can go tell my mom that I loved her, and all of this money I got I don't need it\nWish I could go to the church and I talked the Lord in an effort to conquer my demons\nI'm beggin' and pleadin', I'm down on my knees and he's ready to shoot and I'm practically bleedin'\nSo this is my destiny, I finna get death to the G\nSomebody please help me, yeah\nThese are my last words\nIt's Dax!\n\n[Verse 2]\nWish I can go back in time and revisit myself just to make me believe\nI had these goals and these dreams in my mind that were mine that I'll never achieve\nAll of these gifts and these talents were given by God I was blessed to receive\nI was too busy worry 'bout bitches and money and all of this shit that you people would think\nNeeded help with depression, all of my passive aggressions I should've confessed them\nI learned my lesson, I didn't get nothin' but sadness that fucked over all of my blessings\nFucking perfection\nI shoulda walked on my own and I traveled the common direction, just to be trending\nJust to be trending!\nWish I woulda not held back\nWish I woulda not felt bad\nWish I woulda hugged my dad\nWish I woulda fucked that bitch when I had that chance\nWish I woulda sold my soul\nJust to get fame and all\nShoulda played basketball\nNigga was masterful\nWait!\nWish I would have never put my time into those people who never tried to give it to me back\nWish I would have never put my heart into a woman that will break it than allow it just to have a second chance\nWish I would have let 'em see what I was really dealing with, instead of tryna hide it on a motherfuckin' track\nI blow a milli just to prove that I'm a legend in the makin' just to show them what it looks like when I get it right back\nThese are my last, my last words\n\n[Verse 3]\nDear God\nI'm not gonna lie, I'ma need your forgiveness\nI knew that no one was watching but in my last minutes\nI now know that you were a witness\nSo I'm repentant\nNow that's it's sinnin'\nWhy? Because I need to make it to heaven\nBorn as a sinner, die as a winner\nPeriod just like the end of a sentence\nI swear the devil is watching me\nHe tried to make me his prodigy\nThis is my fucking apology\nI don't want nothin' but honesty\nHeaven to hell was just callin' me\n30 seconds left\nThese are my last words\nAnd to the bitch that broke my heart\nI just hope that you can sleep\nKnowing every single man you'll meet will never be like me\nYou can run, you can hide\nBut you will see me in your dreams\nOn TV\nIt's Dax!\n\n[Chorus]\nWish I can go back in time to my father, I didn't really mean it\nWish I can go tell my mom that I loved her, and all of this money I got I don't need it\nWish I could go to the church and I talked to the Lord in an effort to conquer my demons\nI'm beggin' and pleadin', I'm down on my knees and he's ready to shoot and I'm practically bleedin'\nSo this is my destiny, I finna get death to the G\nSomebody please help me, yeah\nThese are my last words\nIt's Dax!", "[Intro]\nYeah, get down nigga!\nI said get down!\nWhat you gotta say now?\nPussy\nMy name is Dax, and I just committed murder\nYeah\n\n[Verse]\nWhy everybody askin' me if I’m a rapper? I'm an artist\nI just rap for fun but still do it the hardest\nHow I started was a baby given birth to by the Carters\n2Pac, Biggie, Nas, Rakim my grandfathers\nBeen rappin' for two years and probably done been the farthest\nHad to spark it made a name by manipulatin’ the market\nHow'd I start it? Put it in drive and I never parked it\nThis a message to the dearly and departed\nThis a motherfuckin' killshot\nAimin' my scope at the fucking industry\nHalf of these niggas rappin' is trash and it's fucking killin' me\nI made a name for myself by doing it differently\nI started writing poetry then I had an epiphany\nAnd instantly started meshin' words into a symphony\nAnd calculatin’ patterns and delivering them brilliantly\nTo go into your mind so I could paint a vivid imagery\nAnd save you from the trash that you’ve been listenin' to literally\nNah, this is not a game, this is not a test\nWhat’s the point of rappin' if I ain't tryna be the fuckin' best\nDroppin’ songs faster than a virgin when the pussy wet\nTo swim into the mainstream with the sharks so I can come up next\nEminem done paved the path\nPAC saw me in a dream\nMe and Drake from Canada\nFuck you think that all mean\nIn my opinion, I think that means that I'm the next best thing eating beasting\nNow I'm motherfuckin' top shit\nFuck niggas don't wanna problem when I pop shit\nGas niggas like I'm in a chamber this is Auschwitz\nAll drip my bars coming out a faucet, faucet\nThe crazy thing about this rap is 'bout the recognition\nUnderrated is an understatement and I'm the definition\nContemplated if I should kill 'em, I had a premonition\nRonald Reagan the whole game and cause a demolition\nNiggas finna nut like Dontai, ooh\nBrought my skill to Cali like Lebron James, ooh\nKnow she wanna fuck and her friend do too\nKSI a bitch, get mentioned, views\nNah but real shit lil' nigga don't you ever try to diss me or I'll come for ya neck\nI'll be damned if an Uncle Tom corny ass nigga making vlogs try to talk if he ain't showin' respect\nSo let me break it down for you how I live out the rest of my whole career\nI promise I'ma be one of the biggest in about a year\nI promise I'll be the one to convince you that thing fear\nIs a concoction by the devil to make the good disappear\nI promise I'll win a Grammy, I promise I'll win an Oscar\nI promise the rap game won't turn me into a monster\nAnd force the people who love me to treat me like I'm a sponsor\nAnd pray for my death for money and not for a life longer\nAnd that's facts (That's facts)\nManifested all this shit through rap (Through rap)\nSpoke my life into existence, I was workin' in the trenches\nSwear to God that I ain't ever going back\nOT 613 put it on the map\nTreat a beat like 50 had to get the strap\nKSI wanna beat me, nigga you can CC the fee fee is 10k if you want a track\nSo you gon' watch me on the tv, nigga\nI swear to God they gon' keep this shit on repeat, nigga\nLike four, five, six times, best believe me, nigga\nI'm gon' thrive 'cause the boy be a cheat sheet, nigga\nThey gon' ride ri-r-r-ri-\nNiggas talk shit, they gon' die-\nIf I ain't the best then that's a lie-\nYou can peep the drip, I'm not dry-\nNow ya boy be the topic\nJoyner Lucas gotta hit me, we can rock shit\nTory Lanez, you a singer. just stop it\nI'ma triple threat nigga on God shit, on God shit, God shit, yeah\n\n[Outro]\nThat's right I can do that too\nThis is shit is easy for a nigga like 2x2\n4 mill on Rap God, that was just last week\nEminem, let me hop on a beat\nIt's Dax\nK-K-K-K-K-Killswitch\nThese pussy niggas gon' feel this\nThen they know that I'm the realest", "[Verse]\nGive me the beat and a mic\nGive me the freedom to write\nGive me the vision to see my demons and beat 'em at night\nGive me the pen and the pad\nGive me a couple of stans\nGave you a percentage but I'm taking home all of the bag\nGive me definitive and unlimited amounts of people loving me and\nCall upon everybody who came before me and tell them to come and inject me with whatever they're smoking man\nI'm sick!\nBut I think you know that already\nYou call me evil but how would you know it unless you live it already?\nYou think you’re better right?\nCause nobody's seen what you’ve done in the dark but if I put your life in this light you would crumble and fight to survive or die but bitch I fucking knew that already\nI ain't special\nBut I specialize in making you feel especially stupid for judging a human\nWhile you sit at home and the whole world can't watch what you're doing or follow and hate all your movements\nI ain't complaining but I know the people who do it are sicker than me and I'm sick enough I just might lose it\nYa, you think you know me 'cause you double tap on a picture\nI hate the fact that you judge me it’s driving me crazy so when it’s too deep I say fuck it and drown in some liquor\nI write these verses in blood I got chapters for days 'cause my heart is a biblical scripture\nAnd I ain't a prophet but I can predict that you’ll never catch happiness till you're the pitcher\nSo please continue to laugh, if I’m a clown you're a circus act\nWhen I rap it’s in a surgeon's mask\nCause I place every syllable in a deliverable fashion from first to last\nThen cut back with a message that’s hidden in melody making them think and ask\nIf I was the one on the table pushing, giving birth to rap\nMaybe it was me\nMaybe you like all my music but don’t really actually love me\nMaybe you just want a picture\nMaybe you just want to see me 'cause you need some money\nMaybe you think that I’m happy\nMaybe you think in reality liking my post is repairing a hole when it’s actually shaking and cutting the soul right out of me\nI think I’m sick\nI feel a rush of emotion whenever I post up a pic\nI got a problem\nI’m in the studio rapping while this girl is sucking my dick\nShe cut a hole in my heart now I fill it with women who love me 'cause they think I’m rich\nAnd if I be honest I just told a bitch that I care but I really do not give a shit\nSo what’s your excuse?\nWhat helps you sleep?\nYou leave a negative comment not knowing what you sow you will reap\nI bet you smile when you post, thinking you're hurting me, but you see the way the brain works you become what you speak\nI need peace!\nBut y’all can’t offer that (you can't!)\nI held my ground, I didn’t sell my soul\nI said fuck the fame, y’all can take that offer back\nFuck a shelf you can't take me off the rack\nAll the fame is not worth the heart attack\nYou're insane, you're in pain, I can tell by what you're saying, but\nMy bad, I forgot you were fragile\nI forgot someone who doesn't even know me told you I'm an asshole\nI forgot that I’m the villain\nI forgot that I’ve always spread positivity, but you think I didn't\nI forgot that hatred stems from people who hate their own existence\nI forgot I’m better off alone\nI forgot I care for everyone's happiness, but forget about my own\nI forgot I spend every waken second on my phone, *hahahaha*\nCome and join my circus, I’m recruiting\nI’m taking everyone who passes judgement bitch, that’s including\nEveryone who thinks it’s so amusing\nTo put me down while I’m pursuing\nThe keyboard warriors that live online behind a screen that's just an illusion\nCome, come, come, come join my circus\nYou fucking pricks\nI’ll fuck you till you love me then pay you to do some tricks\nI don’t need a doctor I need a bag of nails and bricks to lay down on the floor so if you fail to land a flip you can feel what I felt when you tried to come sink my ship\nLet me explain, you all help me financially gain\nBut I spend my money on mental health books and read them just to control all my pain\nI don’t wear clothes, but bought this chain and just like you this chain is fake\nI wear it to distract you from the blatant sadness written on my fucking face\nWhat'd you expect?\nDid you think I was immune to what you were saying and didn’t see all of the disrespect?\nDo you think I’m not human, have no feelings, or maybe you think I’m fucking weak and now I’m pleading\nMaybe you think I’m just too good and that I’m fucking cheating?\nOr maybe, just maybe\nYou're blind and the hate inside your heart clouds your eyes and your mind and your ears when I rhyme\nEven though we all know I’m one of the best of all time\nOr maybe you're just a fucking bitch and I can't-\nStop comparing me to people who are not in my league\nStop saying I don’t believe in God just because you can’t read\nStop making fake profiles so you can spam my feed\nI'm not alone, I know there's millions out there just like me", "[Intro]\nI can't sleep\nI keep thinking about this\nWhat if, with everything that's going on, the world really is coming to an end?\nThen what?\n\n[Verse 1]\nWhat if it isn't a lie? (What if?)\nWhat if we make it to heaven and don't get inside? (What if?)\nWhat if we get to the gates and see God on the other side and he looks us in our face and says our whole lives we've wasted time?\nWhat if we can't go back? (What if?)\nWhat if we can't redo this life and get one second chance?\nWhat if our future happiness is memories of our past (God)\nWhile we burn forever haunted by the devil's laughs? (Hahahaha)\nWhy?\nWhy do we push them away? (Why?)\nAnd why do the ones we work to keep never actually stay? (Why?)\nWhy do we focus on tomorrow and forget about today (Why?)\nAnd smile in everybody's face and try and act like we're okay?\nWhy do we live this way?\nWhy do we hate?\nWhy do we fight?\nWhy do we act like there's time and got more than one life?\nWhy? (Answer me)\nWhy? WHY!? Why? Why?\n\n[Verse 2]\nI'm older and looking for truth\nI'm holding my faith in my hand but the pain in this world has been shaking it loose\nI used to have so much to gain\nNow I have so much to lose\nThey say I'm crazy for looking for answers\nI say they crazy for not giving proof\nVision is blurred, I'm over concerned\nI'm looking at God to see if life with him is something I've earned\nThe devil's been watching he's tryna recruit he's been waiting at every turn\nI'm driving this life on the highway to hell but I won't burn, fuck!\nWe know the difference\nWe know what is wrong and we know what is right\nBut Satan is strong, God, and most of your people are losing the fight (We try)\nSo what if we fail?\nWhat if we can't escape his lies? (What if?)\nWhat if we can't change, what if he still controls our minds?\nWhere do we run?\nWhere do we go?\nWho do we talk to?\nWe look around and everyone we see is lost too (Fuck)\nWhat if life was just some test that we all do? (What if?)\nWhat if you were busy when we called you?\n\n[Verse 3]\nWhat if hell's on earth?\nWhat if being born is dying, and dying's birth?\nWould that mean life's not God's gift but the devil's curse?\nAnd to live was to be evil 'cause it's words reversed?\nWhat if the devil entered a pastor and he led a church?\nWhat if we looked for the truth, but didn't know where to search? (Where?)\nWhat if the books they said to read had never been your words? (What if?)\nWhat if we chose to follow you but we still had that urge?\nWill you forgive us for our sins and let us in your world?\nGod we at the gates (What if?)\nWe couldn't see, hear, or touch you, but we had faith\nWe know we messed up, we human and we make mistakes\nSo we just begging we get in and that you'll have grace (Please)\nGod!\nWhat if we didn't mean it?\nWhat if the place we grew up forgot to teach it?\nWhat if we never even got the chance to go and seek it?\nThen what, then what? (Then what?)\n\n[Outro]\nDear Family\nWe're in scary times\nNobody has the answers\nJust make sure we spread love\nAnd believe\nMy name is Dax", "[Intro]\nYeah, I tell you what\nThis rap shit's a sport\nIt's competition\nIt's Dax!\nFuck ass nigga\n\n[Verse]\nI’m sick of the bullshit\nI should be on top, but I’m riding the bench\nNiggas are blowin' for less, I've been killin' these beats and they don’t wanna show me respect (fuck that)\nHopped off the porch from the north, ya I came here to kill so I’m aiming these bars at their neck\nGod to these niggas I took them to church cause these pussy ass niggas gon' have to repent\nAsk any rapper 'bout Dax, and I promise that nigga gon' say they don’t know me\nI meet 'em in person, they say they the homie, then I got the word that the nigga a phony\nHalf of these rappers was made with Adobe\nCopy and paste, they just rap 'bout a roley\nCutting up rappers like barbers, 'cause I got the edge now I’m up so I fade em like Kobe\nAll black be the fit because I’m finna murder niggas here today\nI was a janitor back in December then I took my shit and I moved to LA\nUsed to be broke, I was cleaning the floors it was overnight shifts everyday (Facts)\nNow when I rap on an instrumental, you can guarantee my ass gettin' paid, uh\nEminem, come find me\nDr Dre, come sign me\nProps to my nigga Travis Scott, 'cause he put a baby up in Kylie\nI ain’t taking disses lightly, if you gon' talk you gon' have to fight me\nNo I ain't Kanye you won’t getaway if you try to mention on my wifey\nWhat you thought this was joke?\nPeep the drip nigga need a coat\nThought I would lay down\nCouldn’t stay down, man Dax never lost hope\nNow when I move they treat me like the pope\nRappin' a year but treat me like the GOAT\nWave making people drown now I got niggas hoppin' on the boat\nHoppin' on the boat and trying to hit a lick, only fuck wit me now a nigga rich\nAin’t about that gold digging, fucking shit\nMan I need a Jada Pinket fucking Smith (Will)\nNigga, I’m Jordan so I need a pip\nNigga, I’m harden so I need a Chris\nNigga, I’m balling gimme the assist\nNigga, I’m shooting if you want a chip\nReal freestyle shit you thought wrong, I’m just blessed\nThis here chess, 2 moves up, I’m what’s on and what’s next\nFake rap I can’t connect\nNo WiFi that’s collect\n25 for a call that’s why they make no sense\nI was in the back row chillin'\nNow I’m in front row chillin'\nMan I used to walk to the studio and now I got a car so I’m riding in a Rav 4 wheelin'\nAny other rapper vs me gon kill 'em\nI be on my King Kong shit gorillam\n21 plus if a bitch trying to fuck I ain't tryna go to jail so I ain't gon' deal 'em\nSo I went to rolling loud, made a couple K and a fucked a bad bitch from my fan base\nThen I doubled back made her ass clap and fuck another girl off a fan page, on a rampage\nDax, ya this a campaign\nI ain’t goin' back to being broke and I ain't fucking with you if you damn lame (facts)", "[Intro]\nLexnour\nYou can't expect nobody to believe in your dream\nIt wasn’t theirs in the first place\nThis is Self Proclaimed 3\nIt's Dax\n\n[Verse]\nI told them I would make this happen\nI told them I didn’t need a genie, fuck wishing I'ma work\nThis ain't no Aladdin\nI told them everything was all imagined\nAnd that my mind was just a weapon that I metaled in to make magnets\nTold them I would win\nI would never stop\nTold them I would make it\nTold them I would fucking climb up to the top\nHow I did it? Climbed mountains, wasn’t afraid of the drop\nPut my city on the map with a bucket and a mop\nWhat you thought?\nThat I would pack up and quit?\nMy mom would slap me in the face say she ain't raise no bitch\n3rd chapter of the story now that broke boy rich\nBut his mentality ain't gon switch, fuck\nI guess I’m on now I put my life into this music manifested what you see through all these songs now\nI cannot calm down\nThey tried to rain on my parade it's a brigade\nIt’s like I’m walking through a storm now\nFuck what you gotta say, fuck mediocrity\n100 niggas tried not one is ever stopping me\nSpeak it to existence, yes, that is my philosophy\nI was born broke but refuse to die in poverty\nSee it’s the law of attraction\nIf you think it you can have it\nIf you see it you can grab it\nIf you speak it then you put in the time, you build habits\nFuck average\nConvince yourself you can be the best fucker on the planet\nAnd you know this\nYou have to stay focused\nAnything could happen you could die at this moment\nYou only get one life to live so take it and own it\nYour biggest threat is yourself\nYou your biggest opponent\nThey gon' lie to your face and try to tell you you’re broken\nDon’t listen, God got you if your born you’re chosen\nGet your life in motion\nStop dreaming, stop wishing, stop crying\nStart praying, start living, stop hoping\nYou remember me?\nThe one you picked last\nThe one that that you clowned\nSaid he was trash\nI took all of your comments then I put them in a bag\nThen I went and bought a bat and started beating on my craft\nI don’t need no introduction\nMe losings out of discussion\nGet that stuck in your head just like concussions\nMy dreams chase me\nI woke up and stopped running\nLooked 'em dead in the eye\nYou should've knew that I was coming\nI ain't special if I can do it you can do it\nThis ain't mainstream rap, this is motivational music\nYou have talent please use it\nIt’s yours just choose it\nStop sitting on the bench\nSub in and go stupid\nThen don’t look back\nThis life is yours you must drive it you can’t afford to crash\nYour futures brights you must light it\nYou must learn from your past\nIt goes by super fast\nForget a handout you don’t need it get yo own back\nForget approval you don’t need it you yo own man\nGo tell the world that you’re the greatest then go own that\nTake yo soul back\nKeep yo head up in the rain\nSpeak yo life into existence become self proclaimed\n\n[Outro]\nIf you need it\nI will be here in yo head speaking words you’ll need if defeated\nYes, you can and you will, yes, just believe it\nYou great I swear I can see it\nIt's Dax\nGet up, and work\nCo-sign yourself", "[Intro]\nAin't no hard feelings my nigga\nWe gon' laugh about this one day\nThis was not murder, it was manslaughter\nYou brought it upon yourself\nFrom yours truly\nThe next upcoming Canadian hip hop artist\nDax\n\n[Verse 1]\nYeah, yeah\nYou said you was the best my nigga, what is the criteria?\nAll of that's subjective like the prices in Nigeria\nHow can you compare yourself to all of your superiors?\nA Jay, Kendrick, or Cole, my nigga you inferior\nAll for social media, you preachin' to the choir\nI was summoned by the greats, I'm here to force you to retire\nI am not a preacher, I am not a teacher\nI require only pens, pencils and pads to burn you in this fire\nThis is not a game, you are playin' checkers, I've been playin' chess\nYou might be what's on, but I'm what's up and I'm what's on next\nProdigy, that's why they had a ghost writer callin' me\nI kept it on the hush, that's a Canadian conglomarency\nHonestly I was taught to play fair\nI won't make a joke about your height or your new hair\nI won't talk about your sexuality I don't care\nDream doll addressed it, so I ain't finna go there\n\n[Verse 2]\nListen\nTory Lanez you better stay in your lane\nStick to rappin' 'bout the bitches, money, cars and cocaine\nI ain't hatin' 'cause I know you puttin' food on your plate\nBut if you have no substance, you can't be great\nYou got bars lil' nigga, but they hold no weight\nI move mountains with my ship, make the whole world shake\nI know you feel this shit in your soul\nWord on the street Lil' Tory love suckin' on toes\nI'm J. Cole the way I diss niggas\nFactual facts factually fictionalizing what niggas say in they raps\nI dissected every word that you had said in the past\nAnd I'm convinced the insecurity stems from a man who doesn't know\nSo I will educate and I will help you grow\nTo be the best is more than similes, metaphors, and flows\nIt's the ability to enter in a motherfucker's soul\nAnd then repair it and release it to the motherfuckin' globe\n\n[Verse 3]\nMan come on Tory\nWhy you lyin' to these niggas?\nWhy you claim you the best?\nWhat you hidin' from these niggas?\nGet that shit up off your chest and we'll still ride wit' you nigga\nBoy, you better show respect, 'Pac died for you nigga\nIn a different category, married to the game you now divorced and payin' alimony\nI am not a saint, this is not a holy matrimony\nI am not your peer, I was made inside a laboratory\nI'm from the same country this a family feud\nYa, I love you like a son and I know Drake does too\nThe bloods thicker than the water, so I'll tell you the truth\nYou will never be the best, you are not that dude\nBut don't worry you will still be rich\nFuck every girl and probably bang every bitch\nHave niggas down to ride, until the day you quit\nHave girls sing along with you to all your shit\nNow let me tell you why I'm qualified, my quality is quantified\nI'm greatness in the makin' but it's actually personified\nA mammoth feastin' through a rap game famine\nBars immigrated caught up like you 21 Savage\nI am not the other people you battled, I won't get personal\nI rap and sing just like you, but it's purposeful\nDon Q let you live, Joyner murdered you\nI cut you up limb by limb, this shit is surgical\nTo be the best, you have to speak on more topics than your riches\nI'm a rapper for the people, you a rapper for the bitches\nChangin' lives I will live and outlast\nBut as soon you stop rappin', you're a thing of the past\nJust another rapper waitin' on a check from a entity\nYou'll die and be forgotten, I will die and leave a legacy\nRap sing melodies, my cadence straight heavenly\nRap game savior, you infect it I'm the remedy\nThis out of reach I set the bar too high\nVertically challenged, you won't reach it even if you reply\nI got a fetish for dead bodies, I'll eat you alive\nTake your heart, drink your blood while I'm watchin' you die\nTory, this is tactical, highly mathematical\nDivided and subtracted you from thinkin' it was practical\nTo rap against a nigga who is versed and international\nAnd studied in the arts of killin' rappers who aren't rational\nSo what you gon' say to 'Pac when I send you up to meet him up in heaven?\nHow you gon' explain that you claim you the best but ain't got nothin' to show for it on your damn record?\nWe don't care 'bout cars\nWe don't care 'bout clothes\nWe don't care 'bout money\nTory Lanez nigga we don't care 'bout none of that shit\nYou a prime example of a nigga who got it\nOn the outside but inside you still ain't rich\nWe care 'bout impact\nNigga did you give back?\nEvery time you rap\nDon't nobody feel that\nNigga you a joke\nTo think that you can sit amongst the greats\nAll the ones who here now, and the ones who paved the way\nFuck\nMan that should be me\nI'm the one who should be sayin' I'm the best\nI'm the one rappin' savin' lives underpaid\nWho ain't even fuckin' worried 'bout a motherfuckin' check\nIt's Dax\n\n[Outro]\nDear Tory Lanez\nI love you dog\nWe from the same country\nI didn't mean to do this to you\nBut you asked for it\nAnd Dax always delivers\nThis is a sport\nIt's your move", "[Intro]\nHave you ever felt this way by any chance?\nThat makes you feel like you can't breathe?\nI have\nOh, god\n\n[Chorus 1]\nI can't breathe\nI'm struggling finding the balance between what I want and I need\nI've been playing with God but it feels like the devil's been coaching the team\nI got so much to say but anxiety whispers and tells me don't speak\nI've been living on earth but one day I wish I could go live in my dreams\n\n[Verse 1]\nI've been lost in my mind for a minute, I'm searching for somewhere to go (Somewhere to go)\nI look right at my mum and I cry 'cause I wish she didn't have to get old\nI got all of these people around me but why do I still feel alone?\nI got all this money, I just bought a house but with nobody in it it isn't a home\nAll of these contacts inside of my phone but I can't come in contact with someone to hold\nSometimes I sit in the shower and cry 'cause the water disguises my tears in the flow\nLook in the mirror I don't see a soul\nLooking for love but I'm on the road\nThis isn't a song, this is a poem, God\n\n[Chorus 2]\nI can't breathe\nI'm not even tired but I just want to sleep\nI'm drowning in pain, it's getting too deep\nThis weight is enormous, I'm crying for help, but don't nobody see\nI'm at war my head every day, I've been screaming and fighting for peace\n\n[Verse 2]\nI'm hurting, my heart's full of rage\nMy life is a book that they can't even read 'cause I'm bleeding on every page\nOur people are dying too young when we're tired of commenting all on their page\nWe just said a prayer for one and woke up and another was taken away\nLet me know if it's better in space\nI wanted the money, I got it and now that I'm rich I got nothing to chase (Chase)\nI'd rather be happy and broke than rich and with no one to love every day (Day)\nI know everybody relates (-lates)\nI hope that you're here while I pray (Pray)\nLet me say, God\n\n[Chorus 3]\nI can't breath (I can't)\nI'm on my knees (You see me)\nI'm begging you please (Please)\nYeah, they left me for dead, created a storm\nThey thought I would drown, but they didn't know that I am a seed\n\n[Verse 3]\nAnd yes I'm looking for help\nI wanted to love, but I couldn't love, 'cause I didn't love myself (Can't love myself)\nI done blaming everyone else\nNo more blaming everyone else\nFrom now on I'm blaming myself (Ooh)\n\n[Chorus 1]\nI can't breathe\nI'm struggling finding the balance between what I want and I need\nI've been playing with God but it feels like the devil's been coaching the team\nI got so much to say but anxiety whispers and tells me don't speak\nI've been living on earth but one day I wish I could go live in my dreams\nI can't breathe\nI'm struggling finding the balance between what I want and I need\nI've been playing with God but it feels like the devil's been coaching the team\nI got so much to say but anxiety whispers and tells me don't speak\nI've been living on earth but one day I wish I could go live in my dreams\n\n[Bridge]\nI can't breathe\nNot tired but I sleep\nI cry, yes I weep\nThey don't know what I need\n\n[Chorus 1]\nI can't breathe\nI'm struggling finding the balance between what I want and I need\nI've been playing with God but it feels like the devil's been coaching the team\nI got so much to say but anxiety whispers and tells me don't speak\nI've been living on earth but one day I wish I could go live in my dreams\n\n[Outro]\nI can't breathe\nI can't breathe\nI can't breathe\nI can't breathe\nI can't - breathe", "[Intro]\nLexnour\nRadical infliction\nWay I rap is an addiction\nPlacin' words onto this paper\nWas a tactical decision\nI was chosen by the Gods\nTo merge the worlds and heal the children\nWhile maintaining my humility\nAnd killin' off the image\n\n[Verse 1]\nOf a weak ass, punk ass‚ selfish ass\nRapper who ain't never gave a fuck about humanity\nEvery single nigga talkin' down on me has never put a second into treating any fan like they family\nIt's fucking up my sanity\nNiggas even had the audacity to speak on me and said I didn't defy gravity\nMerge two galaxies‚ could crack the whole code and turn the mainstream niggas into...\nIt's Dax\nThis rap shit is a religion\nYou get hated if you do somethin' different\nEverybody's faking personalities and differing capacities\nWhile Iying just to elevate an image\nIndividuality is actually a fallacy\nAnd niggas gettin' famous off these motherfuckin' gimmicks\nMeanwhile‚ I'm broke 'cause I talk about the shit people need that'll actually make a motherfuckin' difference\nSo I'm finna pivot, revisit, rethink my whole image\nBend time and defy all the physics\nNigga this is mainstream rap that is consciously invisible\nIndicative of ancient hieroglyphics\nNigga this is vivid‚ wicked, sick and prolific\nMy thoughts all belong in the clinic\nNext to the doctors prescribing you pills\nWho've been' sayin' you're sick when you're really just gifted\nI was inspired by the greats, illuminated by the hate\nI understand what is real and I can smell what is fake\nI cut the grass in my city when they said I wouldn't make it\nJust to witness their reactions and to see all of the snakes\nI bend‚ don't break, I'm 9.8\nOn the Richter, I can make the earth quake\nMy wrist's frozen, that's frosted, no flakes\nThat's great, go back, nah niggas too late\n\n[Chorus]\nSo this is a killshot, killshot, killshot, killshot\nEvery motherfucker gon' die\nI can rap circles 'round the whole rap industry\nWith two closed eyes, both hands hog tied\nI can turn a fat bitch skinny\nA broke nigga rich\nAnd give sight to a man that's blind\nMeanwhile, ask the most important question in the world\nAre you dying to live, or you living to die?\n\n[Verse 2]\nGod worked for six days and took a break on the seventh\nI added five more to it and still worked the eleventh\nAdam and Eve taught a nigga like me not to trust no bitch 'cause she might trick me right out of heaven\nI had dinner with the devil, went to lunch with a reverend\nFucked a stripper in an alley then I took her to breakfast\nJust to prove I was a savage and to show my ex bitch I ain't a pussy, hell yeah I had to teach her a lesson\nRealistically\nIt's about eight months till' your boy finna blow\nI just got off tour like 55 shows\nCome fall I'm about to do 55 more\nAnd typically\nI don't ever reply to a nigga that's broke\nPussy lil' niggas you don't want smoke\nIf you didn't know then now you know\nUh, facts with it, I'm mad gifted\nI'm going back to back, back with it, you half witted\nYou niggas sayin' I ain't mad wicked, you mad twisted\nI'm rapping words, I make em' mad vivid, just admit it\nI got a bunch of niggas mad livid, they addicted\nI hit rodeo and get mad fitted, get mad liquid, I hit-\nMan fuck it, don't even try to say I ain't the best\nI ain't phased by you niggas, got it tatted on my neck\n\n[Chorus]\nSo this a killshot, killshot, killshot, killshot\nEvery motherfucker gon' die\nI can rap circles 'round the whole rap industry\nWith two closed eyes, both hands hog tied\nI can turn a fat bitch skinny\nA broke nigga rich\nAnd give sight to a man that's blind\nMeanwhile, ask the most important question in the world\nAre you dying to live, or you living to die?\n\n[Outro]\nOr you living to die?\nOr you living to die?", "[Intro]\nLexNour\nIt's over for you niggas\nGood luck\nIt's Dax! (Uh!)\n\n[Verse 1]\nWack ass rappers like a bitch getting passed around\nI don't need yo co-sign, we ain't bros, this ain't no hand me down\nGraduated something like a scholar, peep the cap and gown\nStarted from the bottom, you ain't heard? Fucking ask around!\nKemba bars, yeah, they got the shimmy, leave you outta bounds\nYou ain't got no money, that’s the labels, sit your ass down\nSeven figures independent nigga, yeah, I’m cashing out\nAin't promoting shit, you gotta pay, ain't no handouts\nNo cap, I’m 'bout to blow like any fucking day now\nMy bars hitting every single state like a greyhound\nWack ass rappers call me corny 'cause I play around\nThen ask me for advice, I gotta charge, here’s my PayPal\nEpileptic flow, my bars'll give you fucking seizures\nNiggas hating, yeah, I see you you’ve been screaming from the bleachers\nHe's a preacher, I don’t like 'em, you too? Me neither\nWack rappers claiming I didn’t even try on they features\nLet me break it down for you wack rappers, this is simple math\nIf you paying half the cash, then you getting half the gas\nFreestyle verse sounding better than your written raps\nThen breastfeed you on your own track like it’s Similac\nDon’t get mad at a nigga like me 'cause the track you sent was trash\nI can’t put no v12 bars on no V6, that shit gon' crash\nGlobal warming, I recycled for the planet, not your ass\nThen gave your track the most views your wack ass ever had\nUngrateful, so shameful, wack rappers unfaithful\nI done started y’all careers, you niggas should be saying thank you\nTook the time to even help y’all write tracks 'cause I was begged to\nThen you blogging on channels crying acting like I raped you\nY’all funny, you ain't rappers, you comedians\nYou eating off my plate, because I got the right ingredients\nLying to the public saying I’m exuding greediness\nWhile telling half the story without showing all the previous, uh\nY’all niggas can’t do what I do, y’all mad y'all niggas can’t move how I move, uh\nI’m up, now nigga can’t lose, y’all used my name so you can get views, uh\nY’all tried to put Dax in the news, y’all lied, next time put Dax with truth\nY’all wack, can’t rap with Dax in the booth, that’s facts, try to match watch Dax 'bouta do\nLyrically, there’s no comparison, this isn't arrogance\nThis rap shit is in my blood, nigga, and my skeleton\nA specimen a lab rapper made by an experiment\nImperative, I end battles fueling my adrenaline\nY’all went and bit the hand that feeds you, lost all your inheritance\nNo medicine, my shit is fatal poisonous and venomous\nI ain't no Samaritan, heart blacker than my fucking melanin\nI put you niggas on, bought you light, Thomas Edison\nYou niggas walking, nigga, I be pedaling\nMy bars deadly, fill you with this lead like you zeppelin\nCrash dummies, cut your shit short like impediments\nI built my own land, you can’t steal it like Americans\n\n[Verse 2]\nDon’t get it “Scru’ed” up the fame I do not ”CHVSE”\nYour career's in a ”Crypt”, you still the same place\nMaking videos of Dax tryna do me like the feds\n'Cause they bars low quality, mine is in \"Hi-Rez\"\nWe not in the same league, don’t even act like we are\nYou will not beat Dax like a KSI spar\nNot lyrically, spiritually, physically or biblically\nY’all niggas made in China, I was made in fucking Italy\nI rap with an efficiency\nWhere every single word is placed careful and deliberately, in harmony with symmetry\nMetaphors that metamorph whores and these similes\nThat Dumbledore catapault dwarves to infinity\nI do this shit religiously, you youtube rappers can’t mimmick me\nMy speed and agility, my smarts and consistency\nMy heart and my energy\nStandstill very watch me dunk on the industry\nYou are now the enemy, how the fuck you try to put an end to me?\nDax, nigga, I’m my own entity\nY’all got fucked! Dax came and took all your virginities\nThen leaked the video for publicity, uh\n\n[Verse 3]\nBack at it, bad habit, my shit is illmatic\nMy bars is automatic, don’t reply if you can’t match it\nThese YouTube rappers really tried to act like I was average\nKill me in the public, watch me bleed and think that I would vanish\nNow, I got you niggas in a bind, now I got you niggas in a line\n*Several gunshots* Headshot every time\nDislocate, separate then reconfigure your whole spine\nFor thinking you could ever dim or stop or hault my God damn shine\n\n[Outro]\nHaha, y'all niggas really thought y'all had a chance?\nI do this shit in my sleep\nYou know who you are!\nHahahaha! Haha, uh\nIt's Dax!", "[Intro: Dax]\nAyee if no ones told you this today, I'ma tell ya!\nYou worth it!\nIt’s Dax\nYeah!\n\n[Verse 1: Dax]\nYou worth it, perfect, see through the surface\nA king or a queen be supreme is your purpose I'm certain!\nHuh, a don will be formed if you working, the pain is a burden\nI’m preaching a service\nLet me bring you back\nAnd they gon' tell you this, and they gon' tell you that\nThat you need to be rich, and you need to be black, huh\nBetter play a sport and if you can’t you better rap\nBut baby that’s trash, fuck Social media\nFuck a blue check and a page on Wikipedia\nI been disappointed 'cause society been teaching ya\nTo idolize these people, fuck 'em they ain't even feeding ya\nMan what about the janitors? What about the doctors?\nSingle moms working two jobs for they daughters?\nWhat about the garbage men and niggas on the bus?\nThey be fueling our society, but they ain't paid enough\nMan I’m fucking fed up with this shit, so I had to come and speak Took a dark ass topic, put it on a happy beat\nI know it's different not the average way you probably wanna listen\nThat's the reason why it's gonna make a difference, huh\n\n[Chorus: Dax]\nYou worth it, worth it (so worth it)\nSo ya perfect, perfect, yeah (so perfect)\nYou worth it, worth it (so worth it)\nSo damn perfect, perfect, yeah (so perfect)\n\n[Verse 2: Hopsin]\nYo, sometimes we don’t need the school system to help us (that right)\nAnd we don’t need to follow the rules like everyone else does (what)\nThey boxing us in, we should be aiming to breakthrough (yeah)\nBe yourself, let your imagination create you\nDon’t ever feel constricted, and don’t ever conform\nThey’ll step, or get charmed, disable it and sever your arm\nI'm writing heaven this poem, and I’m asking for more angels (please)\nTo be my guardian so the savages won’t break through (right)\nDon’t be scared of taking a leap, it’s okay to (yup)\nThey always gon' doubt when you’re doing shit that they can’t do (for real)\nThey ain't gonna understand all the shit that you been through (nope)\nOpen up your eyes and see all potential that’s in you (come on)\nYou can be a lot more than what you’ve been (yeah)\nStep up out of your comfort zone, and make some more new friends\nAnd you may need to cut them off, because they’re loose ends (true shit)\nDon’t ever be all talk, just prove it, go do shit\n\n[Chorus: Dax]\nYou worth it, worth it\nSo ya perfect, perfect, yeah\nYou worth it, worth it\nSo damn perfect, perfect, yeah\nYou worth it, worth it (so worth it)\nSo ya perfect, perfect, yeah (so perfect)\nYou worth it, worth it (so worth it)\nSo damn perfect, perfect, yeah (so perfect)\n\n[Verse 3: Dax & Hopsin]\nLet's make it happen, everybody take my hand\nBlack, white, gay, bi, boy, girl, every man\nPut the hatred to side, yeah it’s time to take a stand\nWhat you worth is what you give, not what you got in terms of bands\nLook! We gon' say fuck 'em if they don’t understand\nJust let your middle finger linger as you holding ya hands\nSome see they hoping to brand, just to keep us in their control\nFollow your heart and do what’s in your soul\nJust know that you worth it\n\n[Dax]\nSo worth it, yeah\nSo perfect\nSo worth it, yeah\nSo perfect\n\n[Chorus: Dax]\nYou worth it, worth it\nSo ya perfect, perfect, yeah\nYou worth it, worth it\nSo damn perfect, perfect, yeah\nYou worth it, worth it (so worth it)\nSo ya perfect, perfect, yeah (so perfect)\nYou worth it, worth it (so worth it)\nSo damn perfect, perfect, yeah (so perfect)\n\n[Outro: Dax]\nAnd don’t you ever forget it!\nAnd if they tell you otherwise, you know what you tell them?\nYou say \"fuck you\"\nHaha, it's Dax", "[Intro: Dax]\nStand up\nWe must fight\nIt's Dax Uh!\n\n[Verse 1: Dax]\nCouple niggas left me out to dry, I had to crucify\nStab me in my back, you ain't my dog, you getting euthanized\nLying on the gang and speaking down that shit is suicide\nBlack ain't no excuse, ain't getting off because we unified\n\n[Chorus: Dax]\nCame through faster\nYou move fast, yeah we move faster\nCan't stop till we beat you bastards\nFuck with me and meet your master\nWon't come last, we move right past ya\nDestroy then I eat you rappers\nYou move fast? Now we move fast\nIf you go fast, we must go fast, then even faster\nCame through faster\nYou move fast? yeah we move faster\nCan't stop till we beat you bastards\nFuck with me and meet your master\nWon't come last, we move right past ya\nDestroy then I eat you rappers\nYou move fast? Now we move fast\nIf you go fast, we must go fast, then even faster\n\n[Verse 2: Dax]\nYou niggas straight sick, that's pitiful\nKill beats, that is my ritual\nMy words do flips reciprocal\nCan't compete I mean that literal\nMy flow is unpredictable\nMoonwalk on beats smooth criminal\nCan't be copied, so original\nCannot stop me, I'm invincible\nFucking economy, niggas throwing money like it's fucking monopoly\nNiggas hating on me, I'm a fucking anomaly\nGonna have to give ya boy a fucking apology\nYou throw shade but follow me, follow me\nThat's a funny philosophy, people giving me clout the way I be using psychology\nI was down at the bottom but now they can't get on top of me\nI've be killin' the system and been abusing technology\nLike who that? Dax\nThat nigga go too fast (Fax!)\nThat nigga got two bags (Cash!)\nHis bitch got D-Cups (Racks)\nThat boy got supercalifragilistic\nExtra dirty so ballistic\nBars that make yo' shit yourself while pissing asking for forgiveness\n\n[Interlude: Dax]\nFaster than you, faster, faster, faster, faster, faster, faster\n\n[Chorus: Dax]\nUh Came through faster\nYou move fast, yeah we move faster\nCan't stop till we beat you bastards\nFuck with me and meet your master\nWon't come last, we move right past ya\nDestroy then I eat you rappers\nYou move fast? Now we move fast\nIf you go fast, we must go fast, then even faster\nCame through faster\nYou move fast? yeah we move faster\nCan't stop till we beat you bastards\nFuck with me and meet your master\nWon't come last, we move right past ya\nDestroy then I eat you rappers\nYou move fast? Now we move fast\nIf you go fast, we must go fast, then even faster\n\n[Verse 3: Tech N9ne]\nI'm the one, the N9ne's a wonder\nI'm the thunder, wanna father me and I'ma son ya\nFind the lungs to rhyme, it is crime upon ya\nI the gunna, got her sayin' \"¡Ay, caramba!\"\nElite when I get deep in a script\nOn a beat, I'ma get geek in the mix\nWant a piece? If he get beef in the lips\nI'ma get the heat and he be leaking a bit\nI hail from the middle of the west that's home\nNail every hit I get I guess that's blown\nThe hell with a little bit of sales, I'ma killa wit' a\nYell when I hit 'em with a TECH, I'm gone!\nPeople thinkin' my age'll mean that I'ma stop at this\nLike my legacy lie in necropolis\nAll of you take a dick in your esophagus!\nTo the people I'm a freak show\nBut I really will damage ya ego\nWhen the beat go, nigga finito\nFinna meet yo G.O.D. though\nGasser the master, you met up wit' a slasher\nThe massacre is comin' with a pastor to pass yer\nBody to the after but faster (Pyune!)\nYou heard me say \"Don't Nobody Want None\" (Don't Nobody Want None!)\nIn the midst of the fight, everybody want gun! So I go!\nAnd it been that way\nAnd within that spray a disaster\nWhen I rip and I flip on a bastard\nI'ma plaster when I go faster!\n\n[Chorus: Dax]\nCame through faster\nYou move fast? yeah we move faster\nCan't stop till we beat you bastards\nFuck with me and meet your master\nWon't come last, we move right past ya\nDestroy then I eat you rappers\nYou move fast? Now we move fast\nIf you go fast, we must go fast, then even faster\nCame through faster\nYou move fast? yeah we move faster\nCan't stop till we beat you bastards\nFuck with me and meet your master\nWon't come last, we move right past ya\nDestroy then I eat you rappers\nYou move fast? Now we move fast\nIf you go fast, we must go fast, then even faster", "[Verse]\nPut a couple bitch niggas on, now they talk back\nNow they pray on my fall, better fall back\nHit 'em whip 'em dismissing 'em all never call back\nStumble mumbling niggas with words what you call rap\nMan this shit is a catastrophe\nMy next bars coming up are an analogy of savagery\nThe blood straight thicker than water I'm going drrrrr for the family\nSo I hit 'em wit a semi automatic\nI'm running these niggas static\nThey bleeding I made it g-g-g-g-g-graphic\nI'm killing and wreaking havoc destroying every dynamic\nI'm putting niggas in plastic\nMy reach is fucking organic\nThey broken I'm the mechanic\nThey stole it I took it back then replaced it with something magic\nCompletely different and classic\nThe size of the fucking planet\nGigantic and so galactic volcanic and so sporadic\nThese niggas tried to put Dax to sleep\nI go hard 24/7 days a week\nI'm strong they weak\nI put you niggas on ya feet\nYou can't compete today, ye\nLet 'em have it, have it\nWant something you better go grab it, grab it\nAin't beefing with niggas they average, average\nVegetarian niggas you cabbage, cabbage\nWasn't even a friend\nThey hopping up on the trend\nThey tried to put me to bed no damage, damage\nNow I'm stacking the bands\nAnd living life on the edge\nThey jealous broke and depressed\nI'm lavish, lavish\nYa you niggas can't rap with me\nYou ass you cheeks\nYou living in a fantasy\nI tried to turn you into gold like it was alchemy\nYou passed on me\nAnd now you fucking after me\nSee I'm as good as good gets, you niggas good at best\nMy bests better than the best when my bests at rest\nI'm like zion when I'm rappin niggas can't contest\nMy bars dunking on yo head because you lack context\nYou the niggas in the gym who do nothing but flex\nWith no weight on the bar pushing off yo chest\nThen act like you stronger then that one huge nigga in the gym\nWho can curl your whole weight for reps\nYou crazy lazy your hate don't phase is pays me\n10x what you make daily\nWhat I made this year is equivalent to what you'll by the time your 80\nFucking wit the rhythm hit 'em with precision\nI don't ever miss 'em my bars like guns no safety\nPut 'em position, then I let 'em diss 'em\nThen I had to kill 'em you tried I applaud your bravery\nHow you try to play me like that\nI got the mop so it's impossible for me to be trash\nYou really thought that I would stop I'm putting niggas on blast\nUnleash the beast\nKamehameha on ya ass\nWhere you at I better see you react like Shaq\nNo homo I'm finna Dontai nut yo ass\nNo slow mo, I'm going so fast\nFucking a bag\nFuck it I'm mad\nFuck it you had\nI gave you a chance again\nJanitor janitor janitor another reference\nYou stupid if you think that silly word could diminish this mufukin' excellence\nThis is effortless, I shouldn't be so generous\nSwitched on niggas no Ellen DeGenerous\nSay my name like Destiny's Child\nYou say it only to get relevant\nYour irrelevant niggas can't grind how I grind\nShine how I shine\nRhyme how I rhyme\nYoutube rapper or mainstream rapper\nAfter I drop this nigga I'm top 5\nNiggas wanna bang on my line like a tuxedo like we all got ties\nNo beef five guys try to rap in this beat you'll drive get stopped like a DUI\nY'all lack originality the insecurities you tried to place upon me are what you have in actuality\nContinue the hate y'all focused on me I'm focused on me\nThats double my pay plus tip\nI just quadrupled my rate, then flip drop shipped in every state\nY'all hating on me I'm praying for you and that's the mufuking reason you can't be great\nThey crazy\nThese wack ass rappers gotta play me\nI am your father you're my babies\nThey bit my style now I got rabies\nWho get 'em moving like this\nWho gets 'em grooving like this\nNiggas be moving on my go\nNiggas been lying on him\nBitches been tryna' to get it\nWiggity wack and they all know\nNigga it's plain to see\nDax nigga I'm the one they pay to see\nFinish niggas finish like A to Z\nUh, fucking up a bag while I talk my shit\nI done made a couple million wit no radio hits\nThey say Dax can't rap, what the fuck this is\nHead bopping with a frown when they play my shit", "[Intro]\nLexNour\nMy heart hurts\nI gotta get this off my chest\n\n[Chorus]\nMy heart hurts in the worst possible way\nYou came first but now we have to go our separate ways\n\n[Verse 1]\nCame back from work on a Friday that shit was crazy\nLong distance FaceTiming with the lady\nPicked up the phone what's up, what's up?\nI'm good, you good? I'm good, not much\nBut I noticed something was wrong\nCan't even look me in the eyes\nGot a tracker on your phone, I know that you've been telling lies\nGot the passwords to your shit, I see you texting other guys\nI got all the proof I need so why even deny?\nWho'd you fuck?\nIt's on my head you have to tell me, I can't give it up, no\nI think about it every day, I cannot go to sleep\nI need to say\n\n[Chorus]\nMy heart hurts in the worst possible way\nYou came first but now we have to go our separate ways\n\n[Verse 2]\nAnd then I went and took you back\nMy boy said I was crazy that you'd do it again and that you'd manipulate me\nI didn't listen, thought that I knew better\nThought if I left that I could never do better\nFirst love, first time I'm sick, she got a spell on me\nThat girls a fucking witch, she casted hell on me\nI feel like I'm a bitch, this is a shell of me\nFool me once, shame on you\nYou fool me twice, now I'm looking like a fool\nMy head hurts and I don't know what to do\nI made this song to say\n\n[Chorus]\nMy heart hurts in the worst possible way\nYou came first but now we have to go our separate ways\n\n[Outro]\nI hope you hear this\nI hope you hear this\nI hope you hear this\nI hope you hear this\nI hope you hear this", "[Intro]\nI'll keep on saying I'm the greatest until we both believe it\nNothing's impossible\nIt's Dax\nHuh, you ready\n\n[Verse]\nI gave up hooping for these rapping ways (rapping ways)\nI told my momma we see better days (we see better days)\nI'm going hard like when I masturbate (C'mon)\nI guess I never passed that age (Fuck!)\nI remember days I didn't pray and now I'm on my knees that shit was just a phase\nI garnered fame but I ain't never changed\nThey say I'm humble but they didn't know I'm staring death right in the face\nForcing me to calculate\nThink 'bout every move I make\nThey could never take me, I'm a guardian of heaven's gate\nNow I'm here to captivate\nMoving at a rapid pace\nNothing into something now it's Dax the one they can't erase\nSeparating fame from actuality, I navigate\nWhile moving through a sea of pessimistic people that are fake\nImitate, innovate, educate, infiltrate, separate, segregate\nAll just to accelerate, a path that I was destined on to walk and I refuse to wait, for someone else to crown me so I name myself the heavyweight, champion\nIf I get knocked off I will be back again\nThose who didn't believe I closed my eyes and turned my back on them\nSpeaking mediocrity\nDon't understand like Mandarin\nSo if it ain't success man I ain't picking up or answering\nI'm the one who put myself here\nI'm the one who told the devil, fuck off, it's only God I fear\nI'm the one who put the stars into alignment\nHad a dream and then collided it would workin' and\nI named it perfect timing\nAnd I'm the one that fell down, bounced back, relapsed, got lapped, reclassed but never fell off track\nFighting demons in the evening overnight while I was cleaning\n7.25 an hour was the wage, no cap\nI am the definition\nI don't lack skill, I lack recognition\nI don't have dreams, I have premonitions\nEvery single word I spit is ammunition\nGassing on the competition\nNever break a sweat this shit is practice like an exhibition\nFuck permission I ain't never asking I don't need forgiveness that is weakness, only time I bow is when I'm meeting Jesus\nThat is genius\nLet a fuck nigga hate\nWent from nothing into something\nWatch a nigga go great\nSo what you gonna say\nWhat you gonna do\nHow are you gonna let a janitory nigga outperform you\nI came from the bottom and I swear I'm here to warn you\nThat everything I do is destiny cuz I was born to\nSeek and disarm you\nEat in regards to every other rapper verse me is just partial\nOn a fucking mission that's comparable to Marshall\nPac, Big, Cole, Jay, Nas\nFuck you, even if you wanna hate on me, I will still love you\nNiggas throwing dirt all on my name, I can't trust you\nClimbing to the top, yeah, something that I must do\nThat I must do\nIt's Dax\n\n[Outro]\nChase your dreams\nWhat people say about you, says more about them\nNever forget that", "[Intro]\nI don't think you ever fully recover from your first heartbreak\nYou sort of just learn to deal with it\n\n[Chorus]\nYeah, love hurts\nEspecially when the person that you love doesn't want to put you first\nIf I could go reverse\nI would pay attention to your actions\nAnd would never pay attention to your words\nBitch you was a curse\nTricked me into thinking that you love me then you cut me now I'm bleeding on this verse\nI need to go church\nI'm having conversations with the devil and I'm asking what is life really worth\nIt's Dax\n\n[Verse]\nYou fucked up my head\nAnd what's crazy is I'd probably do it all again\nAt night I sit on my bed\nStart praying while I'm looking up at God\nAnd I ask him when the hell is this pain gon' end\nHe acts deaf, been stressed, I remember the texts\nRemember the love, phone calls, I remember the sex\nI'm still haunted by the day that you left\nI wasn't good enough but fuck it, I still gave you my best\nNow I'm sick\nFuck\nAnd I don't know what to do\n7 billion but not one like you\nAin't it crazy how we built for two years but it took 10 seconds and a bad decision just to break the whole thing loose\nI can't sleep, I can't eat, my heart skips beats\nSocial media don't help, they'll think I'm weak\nI've been screaming that I'm cut but you just watch me bleed\nI can't love another woman 'cause the cycle repeats\nNo\nSo I just write these song\nYeah they help but they don't write wrongs\nMy life is a museum everybody shows up and buys tickets but they never wanna stay that long\nMan I can't move on\nHead spinning like a CD rom\nOnly woman I can trust is my mom\nAnd don't you fucking try to say you can relate unless you listen to these lyrics and cry while you singing along\nFuck, love hurts\nIn the worst way\nImagine catching someone cheating on your birthday\nAnd then they cry and say they love you while they're sitting on his dick\nThen bitch why'd the fuck you do it in the first place?\nDid you know you'd hurt me?\nFuck I was just another option on your survey\nI could get revenge but that wouldn't help my spirit so I have to make these songs and let these motherfucking words play\nFuck\nOh now I'm doing too much?\nI'm supposed to be a man so I'm supposed to act tough?\nI put all my fucking eggs in one basket\nYou were my plan A\nI didn't ever even think to have a backup\nNow I'm stuck\nI need a break but I'm in it again\nIt's all or nothing we can't just be friends\nFirst loves are the worst\nLove hurts and I'm stuck inside this cycle that's gonna end up with you cheating again, fuck\n\n[Chorus]\nLove hurts\nEspecially when the person that you love doesn't want to put you first\nIf I could go reverse\nI would pay attention to your actions\nAnd would never pay attention to your words\nBitch you was curse\nTricked me into thinking that you love me then you cut me now I'm bleeding on this verse\nI need to go church\nI'm having conversations with the devil and I'm asking what is life really worth\nIt's Dax\n\n[Outro]\nYour first love will fuck you up man\nWe've all been there\nLove hurts", "[Verse]\nLook at me, fuck with me\nWasn't there now you wanna be up with me, yeah\nWasn't there now you wanna make love to me, yeah\nShut it down, shut up and get the fuck from me, yeah\nHella cute personality, ugly\nYeah\nYou a gold-ass digga\nSo my pockets gettin' fat\nYou called it a love match to benefit straight cash get richer\nDax, yeah I mean that\nFake love Drake is how I seen that\nYou was a damn lie\nA cheat and so damn sly\nIt's no wonder I had to get that ring back\nYeah\nHuh, I had to call that back\nThat's ten stack that I spent on a goddamn rat\nThat's ten stacks that I spent that I can't get back\nThat's ten stacks, too much, I'm done for that\nListen, first to last\nTrick me again I'll make your life the past, ghost\nTurn you white like it's Casper past fold\nLike a tent when it's broken bad\nYou broke me bad, I turned like a straight to fag back\nNever that, quick to fast lack\nCollege, cheated on my nigga that's rich you lack knowledge\nLook at me, look at me, I said fucking look at me!\nNo respect when I talk through the hood in me\nNo respect when you walk wasn't good to me\nI'll find one who'll be who you couldn't be\nHuh, this ain't new to me\nNone of these bitches been true to me\nSo look at me, look at me, I said fucking look at me\nLook at me, fuck with me\nOther nigga you fucked is a son to me\nDumb to me, he can't run with me\nCouldn't even kill if he put a gun to me\nThis shit fun to me\nListen, didn't mean to expose you both\nHigh gsb retweet, show it on T.V\nY'all gonna need the holy ghost\nYou thought I was gonna let this go? No\nBrought you home to meet my folks and so\nI will let the whole world know that you\nCheated\nMisleaded\nNow mad 'cause yo' ass got deleted\nMad 'cause yo' ass got retweeted\nMad 'cause yo' money deleted\nDax with a dub\nDax was in love\nDax going back, yeah, straight to the club\nNah, to the church, find me a girl with the works\nPretty hair, pretty smile with no curse\nSomeone that won't get me hurt\nSo look at me, don't you fuck with me\nLook at me, don't you fuck with me\nLook at me, don't you fuck with me\nNigga you fucked was a son to me", "[Intro]\nI need a lot of things\nAt least I think I do\nMan\n\n[Chorus]\nI need someone to call my own\nHeart face emojis all in my phone\nSomeone who cares, and someone who'll listen\nThat I can talk to and I can live with\nI need a house somewhere on a beach\nA six figure job that pays every week\nNeed to see a dentist, whiten my teeth\nI wish they were laundry, I would use bleach\nI need a chain to make me feel rich\nA rolex watch with some grills that fit\nBalmain jeans for my self-esteem\n'Cause I need to live what I always dreamed\nMy life must look good on IG\n'Cause I need everyone to believe\nThat I'm some famous kid from OT\nI don't really care if that is not me, I\n\n[Verse 1]\nI need a lot of things\nWell, actually probably not\n'Cause the rich still want money, if they can't be happy, I think I'ma give it to God\nFrom the bottom to top\nI think that I need a change\nAnd focus on things that I have, instead of chasing the money, and women, and fame\nI know I'm not perfect\nBut not wrong for wanting the better\nBut I can't let it change me, 'cause life is a teacher and oh man she gon' test ya\nWith all of societies pressures\nI swear it won't go to my head\nI started of small and they slept, so I shook up the game now they out of their beds\nI can tell they just woke up\n'Cause some still won't answer my call\nI tell them I rap and their shocked, 'cause the boy that they knew was committed to ball\nI tell them no longer a boy\nThe one that you knew is a man\nAnd the path that I'm on was just given, it wasn't my choice it's according to plan\n\n[Chorus]\nI need someone to call my own\nHeart face emojis all in my phone\nSomeone who cares, and someone who'll listen\nThat I can talk to and I can live with\nI need a house somewhere on a beach\nA six figure job that pays every week\nNeed to see a dentist, whiten my teeth\nI wish they were laundry, I would use bleach\nI need a chain to make me feel rich\nA rolex watch with some grills that fit\nBalmain jeans for my self-esteem\n'Cause I need to live what I always dreamed\nMy life must look good on IG\n'Cause I need everyone to believe\nThat I'm some famous kid from OT\nI don't really care if that is not me, I\n\n[Verse 2]\nYou need a lot of things\nWell actually probably want\nYou write your own story in pencil not pen\nIf it's bad man you changing the font\nDid you hear what I said?\nThe worlds got it stuck in our heads\nWe think that we need when we don't\nIt's no wonder that most of us end up mislead\n\n[Bridge]\nI need someone to call my own\nHeart face emojis all in my phone\nSomeone who cares, and someone who'll listen\nThat I can talk to and I can live with\nI need a house somewhere on a beach\nA six figure job that pays every week\nNeed to see a dentist, whiten my teeth\nI wish they were laundry, I would use bleach\n\n[Verse 3]\nI need a, wait\nI don't need all those things\nAnd neither do you\nJust focus on love and the fam and if all that shit comes, it's ok man it's cool\nI'm not saying it's bad\nMatter fact you should probably enjoy\nJust don't let it drive you, 'cause if that's your purpose, I promise you'll end up destroyed\nHold up, breathe for a second\nLet me break it down, so you can understand\nWhat you need is indeed to believe, the material things are not the key to define as a man\nSo, how do we change\nWell, we got to move on\nSo change up the hook\nTake the word need\nAnd turn it into a want\n\n[Chorus]\nI want someone to call my own\nHeart face emojis all in my phone\nSomeone who cares, and someone who'll listen\nThat I can talk to and I can live with\nI want a house somewhere on a beach\nA six figure job that pays every week\nWant to see a dentist, whiten my teeth\nI wish they were laundry, I would use bleach\nI want a chain to make me feel rich\nA rolex watch with some grills that fit\nBalmain jeans for my self-esteem\n'Cause I want to live, what I always dreamed\nMy life will look good on IG\n'Cause I want everyone to believe\nThat I'm some famous kid from OT\nThis song is my promise that'll be me, I\n\n[Outro]\nI promise\nNo I really do though", "[Intro]\nHey! Bill do you hear, do you hear\nHey, there is this new black rapper Dax (damn)\nAnd he thinks he can rap with the best of them (haha)\nLike who the fuck does this guy think he is?\nHow dare he, think he can just hop on a beat like this - and rap\n\n[Verse 1]\nNiggas say I can’t rap rap\nI’m the new era nigga no snapback\nI carry the game like backpacks\nOld school, new school\nMeshed give a nigga straight flashbacks\nNo credit so niggas ain't getting cashback\nGet it, credit, can’t get cash back\nI use debit my nigga, discredit you niggas\nThen leave you broke pathetic to play with all of the Lab rats\nIt’s Dax\nYou a prototype\nGet it\nA pro at typing\nMike Tyson you’re biting\nHit songs you’re not writing\nHop on my wave but I’m not gay so no you're not riding\nKilling this game in my own lane no hands Tesla driving\nYou a Honda\nYou need a break like a comma\nDax skill could fit any genre\nLeave you in aw and Impair you like vodka\nNiggas be slimey and soft just like lasagna\nRap against me you will get smoked I’m marry to the game so you don’t juanna\nMarry wanna smoke but Joseph has said no you about to be a mama\nGet it?\n\n[Interlude]\nNo they don't fucking get it they don't think you can fucking rap Dax, remember?\n\n[Verse 2]\nFuck rap\nNiggas using abusing my name\nStruggling reaching for fame\nMaking up multiple claims\nFuck that\nI am logically logic so when I rap on a topic the complicated seems very mundane\nFucking the game\nI can’t abstain\nCan’t complain\nWhy? Cause I can’t explain my brain and how a black kid randomly went from basketball to most lyrical rapper in the game\nHaha\nI don’t even remember what had happend\nWoke up one day and started writing all this madness\nSkipped practice skipped classes\nNow I skip lines, grab fake titties and multiple fat asses\nYou cannot move at my speed your molasses\nI paid for all of this shit no advances\nI will Be here every year like your taxes\nVertical rise you can rap on my axis\nThis rap shit is just fun to me\nIt’s my money ain't nobody funding me\nTo see you rap ya that fun to C\nI feel bad though seconds to fun to b\nI started from the bottom like underneath and swam up up out the sea into this mainstream shit where the air is super thin and I can hardly breath\nSee I mix real rap with vocals\nI don't need a boost why I’m mobile\nWhen I sprint I hear crickets we don’t connect 'cause I’ve gone global\nYou cannot read me no Barnes and Noble\nI stay on point like the word focal\nMy fans love me because I actually respond back on all of my socials\nSocials, socials say it three times for good luck\nZeroes the amount of gives that I fuck\nDyslexic I meant fucks that I give\nUp give I won’t give up you get it ?\nBack and forth with my flows my bars are like tennis\nOn lock like Jamaican hair their dreaded\nCan’t buy my flow it’s to expensive\nYou cannot be the best if your flow is rented\nI’m Dax ya I’m finna pop shit, pop shit\nI’m fly nigga like a rocket, rocket\nOn go niggas can’t stop it, stop it\nGot the game on hold won’t drop it, drop it\nFinna gas niggas I’m toxic, toxic\nEminem be rapping with logic, logic\nLets make a track and make it the hottest, hottest\nI’m the rap games adopted son\nYou might not fuck with me but mom and dad said treat like I’m blood\nIf you throw dirt on my name it doesn’t matter because I got this right out of the mud\nOk bud\nFuck that nigga\nDax can’t rap, fuck that nigga\nDax can’t rap, fuck that nigga\nIf he says I can’t rap don’t trust that nigga\nNo homo get off of my nut sack nigga\nI’m yo daddy, I’m treating you like a rugrat nigga\nLoad a Tommy and aim it and watch me bus back nigga\nFuck that niggas dissing with these love taps nigga\nThen e-mailing me asking for a collab nigga\nNiggas need hang it up like coat rack nigga\nSee me in person they asking for a Kodak nigga\nTat his body he looking just like a road map nigga\nPut him to sleep sum like a snorlax nigga\nI don’t do karaoke I wrote that nigga\nSlave master on a beat I own that nigga\nI’m classic as something like a throw back nigga\n\n[Outro]\nHey Bill, did you hear that boy go?\nAww man, I underestimated this nigga here\nI think he proved himself, hahahaha\nAlright Dax, hahaha\nYou black motherfucker", "[Intro]\nHey Joyner\nHey Logic\nY'all forgot to hit me\nI came through though\n\n[Verse 1]\nFuck that singing shit it's back to my old ways\nIt's no games I ain't been to sleep in like four days\nNiggas gassed 'cause I’m spittin' this propane\nWas broke now a nigga fucking rapping in gold chains\nI ain't never waste a bar on a low lame\nI work to hard to boosting a no name\nI’m profane hit a nigga dome from close range I won’t change\nFuck ass niggas, yeah\n\n[Verse 2]\nKill a fucking beat like ISIS, nah\nI ain't tryna be no fucking terrorist\nEverybody's crying on the internet\n\"Dax is so mean,\" what the fuck nigga do you need a therapist?\nNigga you embarrassing\nDon’t you ever try to make comparisons\nI speak a different language like it’s Arabic\nAs-salamu alaykum I feel bad for yo ass so here’s some money just to go see yo mufukin specialist (It's Dax!)\nThis is perfect, exactly what I envisioned\nNiggas try put me down but can’t push me out of position\nLike I ain't perfect and fuck it you ain't different\nI’m a sinner, you a sinner we crafted in God's image\nLike who you kidding you drowning I been swimming God forgave I didn’t I pillage the whole village\nLike say your prayers I’m conquering like the British touch the sky been did it I fucking got no limits\nWhy everybody wanna hate Dax?\nAin't nobody want to state facts\nI been running shit count up my laps\nSet a world record no cap\nThree minute mile right on this track\nWhy would I look back?\nWhen I’m first and you last\nI’m the wolf, yeah leader of the pack\nI cannot relax\nPlease stand up and applaud or everybody in the room's getting clapped\n\n[Verse 3]\nThis shits hereditary I got the game in fucking missionary\nKnown to murder beats I write obituaries\nYes I am a visionary\nWhen I rap they think I’m cheating this is natural my brain is like a dictionary\nNot predictable I keep 'em guessing like it’s Pictionary\nI see you, haters, you can’t hide I got peripheries\nThis a warm-up, I see you sweating\nI ain't even break a sweat this fucking remix was preliminaries\nSee I’m the Jesus of this rap shit\nEverybody tried to crucify me in the fucking public\nJokes on you I resurrected now I’m headed to McDonald’s\n'Cause I’m god damn motherfucking loving it\nYou can’t out muscle him, you cannot muzzle him\nI think fast no food like Muslims\nThey call me Ireland 'cause I do the work of two people no clones they didn't ever have to Dublin\nWho you think you fucking with?\nYou don’t got the right to brag thats my swag\nYou cannot compute my flow 'cause you lag\nNiggas try to use my flow to grow kill my name I can’t stop 'cause I’m in my bag\nI will not fall like old titties sag\nI’m up you're down you zig while I zag\nNiggas try to hate on me like I'm trash\nYou must be confused like I’m dressed in drag\nPut them in a coffin sick I got 'em coughing\nYou should've known that I was coming just like me and Hopsin\nThough that shit was fucking Logic, Joyner our team or get NF like 5'9 on this rap game's best project\nGet it me and Em, Hop, Logic, Joyner, NF, Royce, all need to make a song\nShout out Tech N9ne he the goat rap legend underground king 55 shows trav put me on\nThat’s what you call spiritual lyrical miracle right?\nLike I ain't really saying shit\nYou just blinded by ya hate so when I’m saying it\nYou think I ain't saying shit so what the fucking point of even saying it, bitch?\nI can’t be broke in 'cause I’m rich\nRap game broken I must fix\nI need a token on my mix\nIf we made a song it would be a hit\nFuck you saying my shit is gon' hit platinum\nNo album rapping like muscles when they spasm\nHit 'em 22 times no Adam\nTake a beat Lil Tecca it’s ass and hold it for ransom\nMy mom says I’m handsome\nBikini Bottom drip like Plankton\nNiggas sitting because they can’t stand him\nPlease examine this rap game 'cause I just fucked raw, big dick, no magnum\n\n[Verse 4]\nDon’t play wit me rapping is what I do\nYou can try to separate us but we stuck like glue\nI will murder every beat and 'cause terror in these streets\nUntil they scream name and let me breakthrough\nI am not the average rapper nor average dude\nI speak life into existence and make it come true\nIf I’m cocky so be it don’t hate it use take it\nApply it and watch yo dreams find you\n\n[Outro]\nIt's Dax\nPut yo fucking hands up\nIf I ain't killed this shit you a fuckin' liar\nGo", "[Intro]\nH-H-Hey Santa, it's, it's Dax again (Hi)\nJust checking if you got my list (Oh)\n\n[Verse 1]\nDear Mr. Santa (Hello)\nMy name is Dax and I've been a good kid\nI made a list of the shit that I wanted this year\nDid you read it? I'm hoping you did (You did)\nI put my country, my state, my street, my chimney\nJust so you'd know where I live (Google maps)\nStopped watching porn, gave to the homeless (So like, damn dude)\nDon't be a bitch!\nYeah I want Cadillac color matte black (Skrr)\nYeah I want a thick bitch with a fat ass (Hm)\nYeah I want a crib to crash with a pool and a court and a golf course all in the back (Yah)\nYeah I want Gucci, Prada coupled with a million dollars\nInstagram a million followers\nTakeout food from Benihana's (Please)\nI need a follow back from Lele Pons (Where you at?)\nI need a Drake feature on a song (Go on then)\nI could probably do this shit myself and all\nBut I ain't really tryna wait that long (Facts)\nSo Santa this is my list and I'm confident in you that you'll complete it (I know you will)\nMe and your daughter are friends and if I don't get all of my shit I'ma Mike Jackson beat it\n\n[Interlude: Black Santa]\nDear Mr. Dax\nI took the time to go over your list\nAnd unfortunately I'm sorry to say\nYou have been a bad kid (Very naughty)\nI can get you some shit but not all those God damn gifts (Sorry)\nAnd as for my daughter young man\nThere ain't no way your fuckin' that bitch\n\n[Verse 2]\nMan, fuck you Santa\nI don't even want your gifts\nI don't even want that car\nI don't even want that bitch\nI don't even want that shit\nNow I want Mrs. Clause\nWant her saying hoe hoe hoe hoe\nWhile she's on my pole pole pole pole\nKeep my wrist froze froze froze froze\nWhen I play games with Rudolph\n\n[Bridge]\nYeah yeah yeah I'm crazy Santa\nGave her the dick, banana\nCame through with the heat, the jammers\nButt cheeks through the sheets, pajamas\n\n[Verse 3]\nSo what does that mean?\nI think it means that I win either way\nI'll leave you cookies and milk and a note on the table\nAnd here is what that shit's gonna say:\nMake sure you clean up the motherfuckin' chimney (I want it spotless)\nMake sure you turn off the lights when you done\n(Got bills to pay dude)\nMake sure you leave me a tip on the table (That's right for me)\nDon't eat two cookies your fat ass gets one (Go to a gym)\n\n[Verse 4]\nDon't forget to leave shit in my stocking yeah you know where it's at\nMilk chocolate, some henny and condoms with that\nXanax, weed to sell in the trap\nDon't lie Santa, boy I know that you're black\nDasher, Dancer, Prancer, and Vixen\nComet, Cupid, Donner, and Blitzen\nTalk shit they all go missing\nSanta nigga it's Merry Christmas\n(Merry Christmas)\n(I got all the loot)\n(Oh oh oh oh oh oh)\n\n[Outro]\nIt's Dax", "[Intro]\nI mean, me personally, I've never been about the internet beef. Hm, just not for me. Mhm\n\n[Hook]\nSee me in the street, aim 'bout action\nNigga won't beef, put it in a caption\nNigga won't tweet, never 'bout rapping, I bring heat\nNigga I'm blastin', every beat\nNigga I'm snapping, bars on fleek\nNigga Kardashian, no retweet\nNigga no passin', get no sleep\nYeah nigga no cappin', no cappin', no cappin', no cappin'\nYeah nigga no cappin', no cappin', no cappin', no cappin'\nSee me in the street, aim 'bout action\nNigga won't beef, put it in a caption\nNigga won't tweet, never 'bout rapping, I bring heat\nNigga I'm blastin', every beat\nNigga I'm snappin', bars on fleek\nNigga Kardashian, no retweet\nNigga no passin', get no sleep\nYeah nigga, no cappin'\n\n[Verse]\nEveryday I been on the road\nPromised to my mama I would never sell my soul\nTo my dying day, 'til the boy got old\nI don't give a fuck 'bout no silver or no gold\nI'ma go back, no more I won't roll back\nThese niggas know that, they don't wanted no cap\nI will not hold back, I been in my whole back\nThey made me so mad, fuckin' niggas so trash\nYeah, I been at you working, flippin' burgers\nMickey D's and Dollar Menu service\nNiggas used to flex on me, the same ones who be lurkin'\nCleaning up the game I changed the tide just like detergent\nTrigger fingers turn to Twitter fingers\nHow you getting bodied by a janitory cleaning nigga?\nShould be bigger, ain't no co-sign but I still be killin' niggas\nCheck the figures yeah, you can check the figures (Hm-hm)\n\n[Hook]\nSee me in the street, aim 'bout action\nNigga won't beef, put it in a caption\nNigga won't tweet, never 'bout rapping, I bring heat\nNigga I'm blastin', every beat\nNigga I'm snapping, bars on fleek\nNigga Kardashian, no retweet\nNigga no passin', get no sleep\nYeah nigga no cappin', no cappin', no cappin', no cappin'\nYeah nigga no cappin', no cappin', no cappin', no cappin'\nSee me in the street, aim 'bout action\nNigga won't beef, put it in a caption\nNigga won't tweet, never 'bout rapping, I bring heat\nNigga I'm blastin', every beat\nNigga I'm snapping, bars on fleek\nNigga Kardashian, no retweet\nNigga no passin', get no sleep\nYeah nigga no cappin', no cappin', no cappin', no cappin'\nYeah nigga no cappin', no cappin', no cappin', no cappin'\n\n[Outro]\nHoly shit bro, that was hard", "[Verse 1]\nI think that we’re headed down the wrong road (I swear)\nFake's real and they say real’s fake woke (You see this?)\nFalse prophets on these screens everywhere we go\nBut what did you expect when dumb people got smartphones\nMore memes cool make it all a big joke\nCrown your fake kings and let them sit up on your fake thrones\nYou’re young now but just wait until you grow old\nWhen life gets real you’ll remember all these words I wrote\nI went roaming walked multiple ways for 40 nights, 40 sleeps, yes multiple days (I tried)\nIn the desert no food water searching for the answers but you listen to these people who got nothing to say (You wouldn't listen)\nYou wouldn’t know real if it slapped you right in the face\nAin’t for the culture I can tell by the shit you embrace (I see it)\nI’m in Gotham but my minds in a different place\nSo fuck your cosigns, money, and your radio play\nI be shaking when I write my music\nI’ve been anti-violent but don't push me 'cause I just might do it (Don't push me)\nThey won’t give you no credit 'cause they know you’ll use it\nAnd that’s what happens when the master starts fearing the student (They learn)\nIn this city you’re a number they don’t see you as human (They don't see)\nJust a puppet they replace for their games and amusement\nIn a city full of angels with the biggest influence\nI see demons with a platform who just fucking abuse it\nIn Gotham everybody knows everybody (Everybody)\nIf you ain’t got a blue check, you ain’t anybody (Fuck)\nRedo, repeat, sleep, double tap, see copy\nLost souls unaware they’re turning into dead zombies (Zombies)\nEverywhere you look is plastic, all fabricated\nEverything you’ve seen on TV was exaggerated (It's so fake)\nDon’t nobody see you till you get a million followers\nAnd when you do they treat you like you’re someone and you’re validated\nWhat do you do? How much money you make?\nWho do you know? What do you drive? Where do you stay? (Where do you stay?)\nAnd while you’re answering those questions\nThey’ll be calculating how much of it they can see themselves trying to come in and take\nIf you’re fragile don’t you even try come to this place (Don't come here)\nThey gon' build you just to break you then rebuild you to break\nLet you reach your own limit then heroically save and that’s exactly how Gotham turns you into a slave\n\n[Chorus]\nIn Gotham\nEveryone goes and they lose their souls\n'Cause they can’t control in Gotham\nEveryone lies, it’s an eye for an eye\nYou will lose your minds in Gotham\nEveryone goes and they lose their souls\n'Cause they can’t control in Gotham\nLivin' in Gotham, livin' in Gotham\nLivin' in Gotham, livin' in Gotham\n\n[Verse 2]\nNobody's from here but everybody comes here\nWanting to be famous till they realize the price of fame\nBrings close everything that they once feared\nConsumed by the algorithm, it becomes clear\nLife’s a simulation all controlled by a puppeteer\nBlind people leading blind people driving cars\nTo a destination that is unclear while they can’t steer\nOne year, two years, three years, four\nDrugs, alcohol, addiction, morgue\nFake friends, women gold-digging as a sport\nWho convince you, you should live a whole life you can’t afford\nNobody sees you, you’re continuously ignored\nEverybody wants fame they don’t care what it’s for\nThey don’t wanna build theirs, they’re just try'na take yours\nThis is dog eat dog in this messed up world\nYou think you need this place but you don’t\nHappiness is not a physical place you call home\nDid you ever wonder why you feel like you feel\nWhen you take that time away from your phone\nFake shit goes viral we know this won’t\nThey’ll say they care but will never show\nGotham isn’t just a place it’s a mind state\nWatered by the thoughts that manifest what you grow\n\n[Chorus]\nIn Gotham\nEveryone goes and they lose their souls\n'Cause they can’t control in Gotham\nEveryone lies, it’s an eye for an eye\nYou will lose your minds in Gotham\nEveryone goes and they lose their souls\n'Cause they can’t control in Gotham\nLivin' in Gotham, livin' in Gotham\nLivin' in Gotham, livin' in Gotham\n\n[Bridge]\nDon’t tell them how you feel 'cause I promise they won’t call back\nEverybody's in it for money so it’s all bad\nKilling off my demons I’m rapping this in all black\nI ain’t gotta, I ain’t gotta, I ain’t gotta, I ain’t gotta—\n\n[Outro]\nProve nothing to Gotham\nThey ain’t done nothing for me\nFor me", "[Intro]\nMan I can’t believe I spent a whole year with this bitch man, she lied to my face for a year\nAs soon as she got the chance\nAnd I caught her bitch ass, no type of loyalty\n\n[Verse 1]\nTell me who you loyal to, its not Dax\nDumb bitch tried to play me I caught her its all facts\nTime wasted, so I gave her the whole track, whole stack, on crack if you wantin a call back\nYo ass is trash I smelt it, cheated on a nigga yea it hurt, I felt it\nPleaded with a nigga for a birth was hectic, now im all about my green, supreme, that’s celtic\nRide nigga, I feel alive nigga\nShe was holding me back and now you witnessing what is really inside nigga\nGreatness, hate dealing with fakeness\nKen with a Barbie, these niggas strippin to naked\nI was in the basement loyal like a dog would bark\nTurned to savage mode now I’m 21 no heart\nTake that shit up on my chest and replace the start\nHow you let them niggas drive and park\nA mistake? It can’t be\nSayin’ you was loyal and talking about a family\nFour seater car and safe you was talking Camry\nNigga got a call, I heard you was giving panties, probably using a Plan B, fuck it I’m chasing Grammy’s\nRode to the top, oh yea you was shit at the top\nThat’s all ima say, end of the day, bitch got no loyalty, loyalty, loyalty\nNever that, wish I was bitch if I was you was getting smacked\nWish I was a bitch if I was you was getting cracked\nDon’t god but thank god that my pops taught me better than that, facts\nGet her back with success, couple rap songs and numbers will do the rest\nCan’t believe that I almost got you tatted on my chest, yes indeed that’s a foul thank god I got a text\nYou feel me, a lie, a sneak, a snake, a cheat, I can’t believe I did not leave the first time\nBut never again, feel the same leave yo ass like im LeBron James\nMatter fact like im KD, leave get a chick and watch the radios play me\nI can't believe I almost gave you a baby, I can't believe I called you my fuckin lady, crazy\n\n[Interlude]\nIma repeat that shit, that bitch said “Hey boo, whats your number?” and she was at his house quicker than…\n\n[Hook]\nLoyalty, loyalty, loyalty\nLoyalty, loyalty, loyalty\nCareful, no switching sides, don’t call my phone\nNothin to say yo ass was wrong, and now you gone\nLoyalty, loyalty, loyalty\nLoyalty, loyalty, loyalty\n(Everybody listen to this message)\n\n[Verse 2]\nHere’s a message for the rest of you, never let a woman get the best of you\nKill you and rob you and take your health from you\nLie to you while she stressin you\nFuck you and take a check from you\nSame time she sexting and disrespecting you, negatively affecting you\nBut still expecting to bare the fruits of your labor\nBe at the table while you eating and just stackin the paper, my nigga mmm\nThere is no loyalty, loyalty, loyalty!\nThat’s some real shit, 2017 social media done killt it\nCheating ain’t a thing and they making you believe it\nLove is just a game double tap if you receive it\nUsed to be my main now yo ass got deleted\nThree speeding tickets trying to see me now you heated\nTook yo ass back then I caught you fucking cheating\nDumb bitch tried to lie but there ain’t no way that im believing, thot\nThe times different im grown now\nNeed another woman, my own now\nBlowing up my line im changing my phone now\nNever gonna see me im moving to So Cal\nCheated on a rich nigga, that’s so foul\nMad beef in the song my nigga that’s so cow\nMoo moooove, you lose\nI ain't trippin cuz I fucking know im that dude\nSwipe left match a bitch whenever im in the mood\nNo car don’t need it she driving to bring the food\nPromise got a clue, that’s to smash\n\n[Hook]\nLoyalty, loyalty, loyalty\nLoyalty, loyalty, loyalty\nCareful, no switching sides, don’t call my phone\nNothin to say yo ass was wrong, and now you gone\nLoyalty, loyalty, loyalty\nLoyalty, loyalty, loyalty", "[Intro]\nRound three\nFight, fight, fight!\nLet's get it\n\n[Verse]\nThey was in the attic tryna get it cracking\nWe was in the basement on ya playlist for like half the fraction\nMoney makin' we was cakin' cause of all the traction\nNow they got me playin' different places and I love the action\nGood reaction, fans clapping\nHear 'em whisper Dax's savage\nGot talent, not average\nReal simple, all practice\nNo Allen, all basket\nWhen they see me slicing through these rappers\nBig numbers, all traffic\nPure magic\nDisappear and then spin backwards\nMake 'em believe before they see\nSo Catholic, can't fathom, black power is so tragic\nFeed 'em all the madness and I don't care if it's too graphic\nSo panic, cause I'm spittin' the truth\nConfessions turn to lessons when I step in the booth\nConditioning black minds hooping tell them to shoot\nA-A-U stole 'em and distracting the youth\nI got through, change me and I wasn't the same\nCollege hooping on a budget, they was selling my name\nSo I change it to Dax, funny how they react\nWhen the name that you're selling is no longer on your back\nAnd a fact, it's a fact you can read the contract\nI was let go, didn't explode it's a bomb threat\nDidn't fall far back, ready for combat\nSo bold how I finish absorbing the contact\nNow I rap, for reasons that are different than most\nNot to flex for the 'gram every time that I post\nNot to flex with these bands that my company gross\nBut to stretch and demand that the country grows\nA different breed (breed)\nFlow sick rappers still educating, what we need (need)\nHold tight passes moving the masses, when he read (read)\nStage three master tellin' these children to believe\nThen receive everything that you dream\nI am, no idol at most was a fan, the best now my rivals\nEating when you can is weak, I'm straight primal\nDelete what you can, I'm here I went viral\nBest, that's my title, Grab it\nYou silly rabbit\nHollywood can't get to me man\nI'm built to withstand fate cause I'm not plastic\nHate cause I'm so maverick\nDifferent type tactics\nDax is so classic\n2-Pac would back it\nSaw him in the dream he said here my son have it\nPen in the Packet, Glints in the Glammy\nGripped and I grabbed then I started to imagine\nRocking the best fashion, livin' in Knights' mansion\nWoke up determined to chase what had just happened\nOne-Third the reason now that I'm here rappin'\nSecond is my fam providing what we lacking\nThird is my god to speak and push passion\n\n[Outro]\nRound three\nFight, fight, fight!", "[Intro]\nIt's Dax\nThe first, did first\nI fucking warned you man\nI told you I was gonna do this\n(Yeah!)\nStill laughing? (ready)\nIt's Dax (yeah!)\n\n[Hook]\nWhere I'm from they never did it, I did it first\nRap game wasn't shit, I gave it birth\nI told 'em niggas I would make it 'cause I wasn't stopping\nYeah they was laughing now I'm laughing 'cause I know they watchin'\nSee where I'm from they never did it, I did it first\nRap game wasn't shit, I gave it birth\nI told 'em niggas I would make it 'cause I wasn't stopping\nYeah they was laughing now I'm laughing 'cause I know they watchin'\nI know you watchin'\n\n[Verse 1]\nI know they watchin' me, in and out of poverty\nHit me tryna get it, the only reason they calling me\nSaying I got lucky, a guppy, I hit the lottery\nPottery, how I'm molding the game, my gift is an artistry\nFollow me nigga, that's what I told them to do\nYou started laughing, now it's funny 'cause the joke is on you\nNothin' funny, now I'm winning, I was talking the truth\nNothin' less, nothin' more when I step in the booth\nIt's a prediction, you just a witness\nI tried to tell them I was different, they wouldn't listen\nWhat they started, I'mma finish, I got a vision\nYou can stay or you can follow, you leave this prison\nWhen I had no pot to piss in, your ass was missin'\nNow you asking how I did it, it's repetition\nHope, belief, without an ending, it's a religion\nI told your ass that I would do it\nI fucking did it\n\n[Hook]\nWhere I'm from they never did it, I did it first\nRap game wasn't shit, I gave it birth\nI told 'em niggas I would make it 'cause I wasn't stopping\nYeah they was laughing now I'm laughing 'cause I know they watchin'\nSee where I'm from they never did it, I did it first\nRap game wasn't shit, I gave it birth\nI told 'em niggas I would make it cause I wasn't stopping\nYeah they was laughing now I'm laughing cause I know they watchin'\nI know you watchin'\n\n[Verse 2]\nThis is a story nigga\nHow I manage in Kansas to do the damage, now niggas can't even afford me nigga\nThese rappers bore me nigga\nLocal rappers and trappers be tryna shoot me\nThey be testing me like it's Maury nigga\nPouring up a 40 nigga, I'm getting drunk\nSpeeding, bobbing and weaving, I'm blasting it from the trunk\nWho'da thunk it be me, D-A-X on the TV, not you\nUsed to tell me I wouldn't make it and now I got it\nI predicted it would happen, I told you I was a prophet\nI knew it was out a pocket and I knew I needed to work\nThe fact that you picked me last, the reason you felt it first\nKnow it hurts nigga, you wanna know what's fucking worse nigga?\nThat I gave your ass a chance, tried to tell you in advance\nTried to give your ass a hand, now you tryna be my man\nFuck a fake nigga\nUhh, fuck a fake nigga, moving out the state nigga\nRappers want a feature, they ain't even tryna pay niggas\nDay to day they play nigga, shoot and try to slay niggas\nHad to make a way, California I fucking made nigga\nYeah, they be hating, I done heard it a lot\nSame ones talking shit, wishin' they had a spot\nI ain't even fucking phased 'cause I know what it's worth\nThey just mad 'cause your boy did it first\n\n[Hook]\nWhere I'm from they never did it, I did it first\nRap game wasn't shit, I gave it birth\nI told 'em niggas I would make it 'cause I wasn't stopping\nYeah they was laughing now I'm laughing 'cause I know they watchin'\nSee where I'm from they never did it, I did it first\nRap game wasn't shit, I gave it birth\nI told 'em niggas I would make it 'cause I wasn't stopping\nYeah they was laughing now I'm laughing 'cause I know they watchin'\nI know you watchin'\n\n[Outro]\nWhat doesn't kill us, only makes us stronger\nWe can't be beat\nWe can't be stopped\nYou can't beat someone who never quits\nIt's Dax (yeah!)", "[Intro]\nYeah, Yeah, Yeah, Yeah\nYeah, Yeah, Yeah, Yeah, Yeah, Yeah\nYeah, Yeah, Yeah, Yeah, Yeah. Yeah\nSo, dis' hilly term\n\n[Hook]\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\n\n[Verse 1]\nHilly hilly hilly Clinton\nDemocratic walking, wishing for da' numbers\nFour, five, six, ten votes wanted\nTried to buy em slick, still couldn’t stop em\nRappers talkin' shit, still couldn’t cop em\n4, 5, bricks the wall going to cost\nWe talk money, you know he got, you can't stop it\nIts stupid, its stupid, its stupid\nI thought this shit a movement\nWhere is the mail hilly prove it\nI fought for you now look stupid\nWhole country going through it (Git)\nDas' why I’m moving\nGuess that I’m moving\nGuess that’s the movement\n\n[Hook]\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\n\n[Verse 2]\nHilly\nHilly Clinton\nWhy didn’t you win\nI thought the dub was super predicted\nPolls in America all had you winning\nShocked when we got something totally different\nNow we moving talkin' all of our children\nRacial tension rising treated like pilgrims\nThis apprentice trump da' boss so we quit it\nYou get trump down make a decision\nStay and fight I know that leaving is tempting\nPray for the women\nPray for da' pigment\nPray for the children\n\n[Hook]\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\n\n[Beat Switch]\n\n[Hook]\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\nHilly hilly hilly Clinton…\nLost to trump and now we tripping\nThank god I got a passport\nCouple months I’m going missing\nRight back to Canada\nCause' its violent, looting and riots\nWhyling they whyling!\nDemocratic party crying\nAll the Republicans smiling\n\n(Git, Git, Grrrrrahhhh)", "[Intro]\nLexNour\nLove is a drug that I can't quit\nIt's destroying me\n\n[Chorus]\nI sit and cry in my room, my heart's been broken\nSuffocating, feels like I'm chokin'\nI don't know what to do\nI'm just prayin' that this pain goes away\nDrinkin', taking shots to the face\nHow you love me, if you always playin' games?\nWanna leave but I feel trapped inside a cage\nI just think I need a break, haa\n\n[Verse 1]\nHow'd you do this?\nWe were supposed to live in perfect harmony\nI got half of you, you got all of me\nMiscommunicating, girl, just talk to me\nAh, how you let you get to this?\nHow you let my friend hit?\nIf there's no loyalty, girl, there is no relationship\nYeah, so I think I'm gonna have to take a break\nSo I think I'm gonna have to\n\n[Chorus]\nI sit and cry in my room, my heart's been broken (Been broken)\nSuffocating, feels like I'm chokin' (I can't breath)\nI don't know what to do\nI'm just prayin' that this pain goes away (Goes away)\nDrinkin', taking shots to the face\nHow you love me, if you always playin' games? (Playin' games)\nWanna leave but I feel trapped inside a cage (Inside a cage)\nI just think I need a break, haa\n\n[Verse 2]\nThis is stupid, don't stop crying now, I feel you lose it\nHad my heart and then you abused it\nAll my scary dreams, I think I'm losin' (Uhm)\nMy heart is scattered in many pieces\nBroken I think it's bleedin'\nNow I have no feelings\n\n[Chorus]\nI sit and cry in my room, my heart's been broken (Been broken)\nSuffocating, feels like I'm chokin' (I can't breath)\nI don't know what to do\nI'm just prayin' that this pain goes away (Goes away)\nDrinkin', taking shots to the face\nHow you love me, if you always playin' games? (Playin' games)\nWanna leave but I feel trapped inside a cage (Inside a cage)\nI just think I need a break, haa\nI just think I need a break, haa\nI just think I need a break, haa\nI just think I need a break, haa\nI just think I need a break, haa\n\n[Outro]\nI sit and cry in my room, my heart's been broken\nSuffocating, feels like I'm chokin'\nI don't know what to do\nI'm just prayin' that this pain goes away\nYeah, it's Dax", "[Verse 1: Dax]\nPut my heart on the table, told them niggas I'm next\nAll the hurt wasn't fatal, I can tell I was blessed\nStopped my daddy from working, saved my momma from debt\nTold the devil to shut up, cause he was never a threat\nI put my people through school, I was tossing them rent\nSo how they hate on a nigga that never ask for a cent\nPut my life in a pen, I swear I would do it again\nThought you niggas was friends and still\n\n[Hook: Dax]\nThey ain't show me no respect yeah uh\nNo respect yeah uh, no respect yeah uh\nThese niggas talking while I'm talking, quit the talking\nThey ain't show me no respect yeah uh\nNo respect yeah uh, no respect yeah uh\nThey ain't show me no respect\n\n[Verse 2: Dax]\nWhen I started they hated, now is happy belated\nHow the fuck did I make it, kept my ass in the basement\nTurn my dreams to reality, told myself I would chase it\nI don't believe in no gravity, got it all calculated\nThese niggas trying my patience, I swear they testing my greatness\nUsed to say I was basic and now I'm rapping on stages\nTook the game yeah I raped it, play the fifty I faked it\nSwear to god there's no limits, I'm moving faster, I'm racing\nI pray to god\nYeah all my hands and my knees let a nigga go far\nYeah on the ground but I'm really out living in the stars\nYeah got a galaxy flow that's the reason why I'm finna stand  apart\nYeah I swear I'm finna go far but these niggas\n\n[Hook: Dax]\nThey ain't show me no respect yeah uh\nNo respect yeah uh, no respect yeah uh\nThese niggas talking while I'm talking, quit the talking\nThey ain't show me no respect yeah uh\nNo respect yeah uh, no respect yeah uh\nThey ain't show me no respect\n\n[Verse 3: Futuristic]\nYo, Mr. One Take I started a trend\nCame from a place where no one makes it, I ain't start with no friends\nI used to take the bus, I didn't start with a benz\nA couple cribs from the music 'cause I started a business, yo\nA couple million make 'em speak a little differently\nI been making hits since I was making hits in little league\nI been talking shit, started cursing in elementary\nI was writing raps while they were practice words for they spelling bee\nAll I wanted was to pop off and help\nI turned down a deal cause my homie was getting shelf\nI said that I'm the greatest, I'll always defend the belt\nThey hate me, they don't know me, they never met me they self\nThey call me corny 'cause I come with a cause\nAnd use my stage to flip a page and get the youngins involved\nI never signed a contract because they come with a clause\nEvery track is unprotected sex, I'm coming in raw\n\n[Hook: Dax]\nThey ain't show me no respect yeah uh\nNo respect yeah uh, no respect yeah uh\nThese niggas talking while I'm talking, quit the talking\nThey ain't show me no respect yeah uh\nNo respect yeah uh, no respect yeah uh\nThey ain't show me no respect", "[Hook]\nI don't get tired, no, no, no, I keep going like all night long\nNo I can't stop oh no, no, no, I keep going like all night long\nNow I'm on top and in my zone, I keep going like all night long\nLike all night long yeah yeah yeah\nI don't get tired, no, no, no, I keep going like all night long\nNo I can't stop oh no, no, no, I keep going like all night long\nNow I'm on top and in my zone, I keep going like all night long\nLike all night long, yeah, yeah, yeah\n\n[Verse 1]\nI don't got time for the sleep (Brr), no I do not get no rest (Rest)\nWord about flow on the streets, saying that Dax is the best\nNiggas do wanna lil' beef, I know that here 'bout the flex (Flex)\nMurda, I kill every beat, I swear to god that I'm next (Bah-bah-bah)\nNo cappin', niggas don't rap, real talk, better know that\nMurda, body bag with a toe tag\nNo cash, nah nigga, no collab\nMust kill, nah nigga, can't hold back, won't cole that\nY'all niggas better know that, y'all niggas better know that, yeah\nY'all niggas better know that, know that, ya know that\nSwear I won't stop, yeah I'm tryna be the best (Tryna be the best)\nDon't worry about 2020\nPut an S up on my chest, yeah, yeah, yeah, ooh\n\n[Hook]\nI don't get tired, no, no, no, I keep going like all night long\nNo I can't stop oh no, no, no, I keep going like all night long\nNow I'm on top and in my zone, I keep going like all night long\nLike all night long (Yeah, yeah, yeah)\nI don't get tired, no, no, no, I keep going like all night long\nNo I can't stop oh no, no, no, I keep going like all night long\nNow I'm on top and in my zone, I keep going like all night long\nLike all night long, yeah, yeah, yeah\n\n[Verse 2]\nI was broke they weren't talking to me\nAnd now I got my cash and where I wanted to be\nAnd sometimes I wish they would start a problem with me\nBecause I, because I started off as a janitor\nNow rapping on stage, got a manager\nBars high and you know they would damage ya\nHey Drake I'm the boy been a fan of ya\nCan I get you on a song off in canada\nTory Lanez in my line, you an animal\nEverything that I touch go flammable\nWe the beat like a freak. I'm a cannibal (Gang)\nWhoa, whoa, whoa, whoa, whoa\nYeah, yeah, yeah, yeah\n\n[Hook]\nI don't get tired, no, no, no, I keep going like all night long\nNo I can't stop oh no, no, no, I keep going like all night long\nNow I'm on top and in my zone, I keep going like all night long\nLike all night long (Yeah, yeah, yeah)\nI don't get tired, no, no, no, I keep going like all night long\nNo I can't stop oh no, no, no, I keep going like all night long\nNow I'm on top and in my zone, I keep going like all night long\nLike all night long, yeah, yeah, yeah\n\n[Outro]\nDon't you let them control your mind, you're a star\nYeah, yeah, yeah, like all night long, like all night long\nYeah, yeah, yeah\nYeah, like all night long\nYeah, like all night long", "[Intro]\nLexNour\nWhat would you do if you had a second chance at life\nWould you take advantage of it or let it slip through your fingers\nYou know they say the biggest pain in life is regret\nToday we change that\n\n[Chorus]\nThought those were my last words\nThis time yeah it's gon be different\nNo more hatred self inflicted\nNo more wasting time on women, yeah\nNo more building others visions\nThis time ya it's gon' be different\nNo more dying only living, yeah oh, my\nThought those were my last words, my, my\nThought those were my last words\n\n[Verse 1]\nI'm taking my fucking life back\nNo more regretting the shit that I've done and I cannot control from the past\nFuck if I fail I don't care if you judge me, I swear that I'm taking a chance\nYou only live once and I swear on my momma that I'm gonna fuck up a bag\nNo fear naw I ain't holding back\nDone with the lies\nSwear that I've heard all multiple times\nYou cannot win without multiple tries\nNiggas be fake I see it in there eyes, yeah\nGo chase your dreams son\nGo live your dreams son\nGo chase your dreams son\nI'm done with the fear, yeah I'm done being lazy, I'm done with the indecision\nI ain't letting opinions from people deter me or paint me a picture I don't envision\nIf I say I'ma do it\nI'ma do it regardless of how I'm feeling\nI'ma do it regardless how they feeling\nI'ma do it regardless of what you expect, end of the day\nI'm the one holding this feeling and weight and this pain of regret\nGet out my face, if you're not talking 'bout positive change that's involving success, fuck the fake\nI'm thanking God I'm seeing different\nI was busy dying, now I'm busy living\n\n[Chorus]\nThought those were my last words\nThis time yeah it's gon be different\nNo more hatred self inflicted\nNo more wasting time on women, yeah\nNo more building others visions\nThis time ya it's gon be different\nNo more dying only living, yeah oh, my\nThought those were my last words, my, my\nThought those were my last words\n\n[Verse 2]\n2020 is the year and the vision because all my goals are in sight\nI'm failing repeatedly fuck if they hate, you must fail before you get it right\nDon't give a fuck what they say, I'm climbing new heights\nFuck a hater, they can watch while I live my life\nYeah they watching everywhere we go, 'cause they know yeah\nYeah they watching everywhere we go, 'cause they know yeah\nYeah huh, know that I'm coming up next\nKnow that I'm coming for necks\nKnow that I'm fucking up bags\nMaking a difference and letting this positive energy stretch\nLife is test\nAnd I'm thanking God I'm seeing different\nI was busy dying, now I'm busy living\n\n[Chorus]\nThought those were my last words\nThis time yeah it's gon be different\nNo more hatred self inflicted\nNo more wasting time on women, yeah\nNo more building others visions\nThis time ya it's gon be different\nNo more dying only living, yeah oh, my\nThought those were my last words, my, my\nThought those were my last words", "[Verse 1]\nCash her outside how bout dah?\nDo she really wanna fight? Nah das wack\nWhat she finna do? Just talk smack\nTake the whole meme, turned it to a rap (Yup)\nWhat does that mean? What I just said\nAin't it funny how she took and she flipped it to bread\nCook fame overnight it could go to ya head\nIf what you dreaming you was sleeping is now outta the bed\nNow she laughing (Yup)\nGetting stopped when you see her out in traffic (Yup)\nGotta a genie with these wishes like Aladdin (Yup)\nHit stick on squish like its Madden (Yup)\nWhat does that mean?\nJust can't stop\nSearch merch for the low money flow can stop\nCalled 'em hoes on the show so her IG popped\nYoung mind but she old way she cook that pot\nNow she moving (Yup)\nHaters mad while she up they losing (Yup)\nOnline get love and views and (Yup)\nNo going back whole world staying tuned in (Yup)\nWhat does that mean, man shes dope\nGot the world on sway, she could change a vote\nWay she talk so cold she might need a coat\nGotta walk with a drip so her shoes is soaked\nCatch her outside, you ain't ready\nOne jab have you Jason, way your face is Freddy\nGot a hook so hot have you limp, spaghetti\nWhen it hit go pop, watch it burst confetti\nGot it locked in so the cops called in\nThe money balling the way that it falling\nWhole world on her tip, ya we all in\nAt 13 she crawling we installing\nAll the money that she getting boy you know that its good\nTook a flickture with a Kodak yeah she repping the hood\nThink it's funny better know that she just misunderstood\nBecause if Phil couldn't fix it boy then nobody could\nHow she get it, got it, know that you want it\nYou just mad cause she young and she fixing to flaunt it\nDon't play with lil' Shawty, you get hit for taunting\nBody guard by the way like she MJ Jordan\nBucket\nIf you mad you getting played like a puppet\nCause it's only 'bout the money why she causing the rukkus\nKik push grind on yo ass, way she popping and shoving\nHate on the shine, why you ask went from nothing to something\nWe gotta slow down let it marinate\nIf you hating understand you only elevate\nBhadbabie steady eating in the present date\nHad to make a song quick, get a piece up off the plate\n\n[Interlude]\nHad to eat, Danielle Bregoli\nWe lowkey got the same first name, it's all good\nLet's finish this off\nHold up for a second though\n\n[Verse 2]\n(Cash me outside) how bout dah?\nDo she really wanna fight? Nah das wack\nWhat she finna do? Just talk smack\nTake the whole meme, turned it to a rap (Yup)\nWhat does that mean? What I just said\nAin't it funny how she took and she flipped it to bread\nCook fame overnight it could go to ya head\nIf what you dreaming you was sleeping is now outta the bed\nNow she laughing (Yup)\nGetting stopped when you see her out in traffic (Yup)\nGotta a genie with these wishes like Aladdin (Yup)\nHit stick on squish like its \"Madden.\" (Yup)\nWhat does that mean?\nJust can't stop\nSearch merch for the low money flow can stop\nCalled em hoes on the show so her IG popped\nYoung mind but she old way she cook that pot", "[Intro]\nMan, if he snapping too much, you better watch out for him\nAnd if she snapping to much, boy you got a problem\nSnapchat, freaks at, damn, haha, listen\n\n[Hook]\nIt's on the Snapchat we get it cracking\nIf you ain't bout that action then stay away\nFrom the snapping on the snapchat\nYeah, its for the cheaters and\nIf she stay snapping\nI tell her I don't need her on the Snapchat\nYeah, we get it cracking on the Snapchat\nYeah, I told her meet me on the Snapchat\nYeah, I told her add me on the Snapchat\nYeah, I told her get me on the\n\n[Verse 1]\nSnapchat, yeah that's where they get it cracking\nTake a picture for the moment disappear it in a fraction (where you go)\nSneak dissing you could get a little action\nFew seconds all it takes it's gone it never happened (Yeah it's gone)\nSnapchat, yeah that's where the freaks at\nSend the picture, no receipt so your girl won't see that or read that\nAin't no way she could re-track Snapchat\nWhere it's at I'm starting to see that\n\n[Hook]\nIt's on the Snapchat, yeah, we get it cracking\nIf you ain't bout that action then stay away\nFrom the snapping\nOn the Snapchat, yeah, its for the cheaters\nIf she stay snapping\nI tell her I don't need her on the Snapchat\nYeah, we get it cracking on the Snapchat\nYeah, I told her meet me on the Snapchat\nYeah, I told her add me on the Snapchat\nYeah, keep this on the\n\nSnapchat yeah,  It's on the Snapchat we get it cracking\nIf you ain't bout that action then stay away\nFrom the snapping on the snapchat\nYeah, its for the cheaters and if she\nStay snapping I tell her I don't need her\nOn the Snapchat, yeah we get it cracking\nOn the Snapchat, yeah I told her meet me\nOn the Snapchat, yeah I told her add me\nOn the Snapchat, yeah I told her get me on the\n\n[Verse 2]\nIt don't matter if you ugly get a filter\nSnapchat will change your whole damn face and your whole figure, huh\nSwipe left the options are getting bigger\nTake a small lil booty and make it just look thicker\nI use to download it but you're boy got played\nThe Snapchat changed up, cuz the snap's can't save\nSnap delayed, send money snap getting payed\nSnap getting layed\nNow you're boy snap for days\n\n[Hook]\nIt's on the Snapchat we, yeah get it cracking\nIf you ain't bout that action then stay away\nFrom the snapping on the snapchat\nYeah, its for the cheaters and if she\nStay snapping I tell her I don't need her\nOn the Snapchat, yeah we get it cracking\nOn the Snapchat, yeah I told her meet me\nOn the Snapchat, yeah I told her add me\nOn the Snapchat, yeah I told her get me on the\n\n[Verse 3]\nSnapchat will turn your boy to a devil\nSnapchat will turn your girl to a rebel\nSnapchat will have em lyin' to your face, where they at time place straight screwin' with your mental\nSnapchat will make your boy go cheat\nSnapchat will make a girl go freak\nSnapchat will make your love go delete, I repeat\nSnapchat will put your ass on the street\n\n[Hook]\nIt's on the Snapchat we, yeah get it cracking\nIf you ain't bout that action then stay away\nFrom the snapping on the snapchat\nYeah, its for the cheaters and if she\nStay snapping I tell her I don't need her\nOn the Snapchat, yeah we get it cracking\nOn the Snapchat, yeah I told her meet me\nOn the Snapchat, yeah I told her add me\nOn the Snapchat, yeah I told her get me on the", "[Intro]\nDamn\nI can't believe it ended\nJust doesn't make sense\nBut you know what?\nThis is the last time I'm gonna try and get in contact with you\nAfter this I'm done\nDax\n\n[Verse 1]\nWe were so in love\nNever thought we'd get broken up\nTwenty-two one night first time I would date\nNever thought I would open up, so you were more than lust\nTwo hearts came together we was built on trust\nNow you gone, that's forever 'cause I messed it up\nSo stay strong, this is wack but I'm stressed enough\nSo come back, this is Dax, they was testing us\nI was in the field though\nYou was in your feels though\nI was chasing money to provide but you gone\nAnd it's funny how I feel broke (so)\nI had to write this song\nI tried to call, text, mail, but you switched your phone\nTried to knock, but I failed 'cause you left your home\nWon't stop and at worst I will find a clone\nI came up with a plan\nFind another girl\nSame hair, same eyes, same thighs, light skin and she gotta head of curls\nNo more, no less\nFive eleven she was standing with a strap like steph\nStrong will, sorta type make you call a tech\nAn IQ so high make you talk correct (Damn)\n\n[Chorus]\nThat's right, came up with a plan\nFind another girl to replace you if I can\nTake her 'round the world, overseas to Japan\nHave her all on TV, turn you into a fan\nGive her all the things that I wish you could have\nTell her all the jokes that I know make you laugh\nTake her to the beach, we could swim, we could splash\nTat my name on her ass, give her half of the cash\n\nThat's right, came up with a plan\nFind another girl to replace you if I can\nTake her 'round the world, overseas to Japan\nHave her all on TV, turn you into a fan\nGive her all the things that I wish you could have\nTell her all the jokes that I know make you laugh\nTake her to the beach, we could swim, we could splash\nTat my name on her ass, give her half of the cash\n\n[Verse 2]\nDidn't want to\nI was saving it all for you\nBut you was gone so fast, look back\nQuick as Steph Curry and his follow through\nYou hit your shot\nSo now I gotta settle for a girl that's not\nBut close, just enough to hush the thought\nOf me living life knowing you forgot\nWhat we used to be\nYou were used to me\nAnd truthfully\nI don't think she can do what you did for me\nSo I have to lie\nTo love I will not, but I will survive\nAnd pray that you don't find another guy\nAnd keep faith that you live out a lonely life\nI know it's bad\nBut I gotta say what's real\nYou broke mine and I'm hoping that the same you'll feel\nA big crack in your heart that you cannot seal\nIt's all gone like a stone but you cannot steal\nThis is the last we'll talk\nText, DM, the last I'll call\nNext, my rise, I hope you fall\nCause you lied, but your love couldn't conquer all (Damn)\n\n[Chorus]\nThat's right, came up with a plan\nFind another girl to replace you if I can\nTake her 'round the world, overseas to Japan\nHave her all on TV, turn you into a fan\nGive her all the things that I wish you could have\nTell her all the jokes that I know make you laugh\nTake her to the beach, we could swim, we could splash\nTat my name on her ass, give her half of the cash\n\nThat's right, came up with a plan\nFind another girl to replace you if I can\nTake her 'round the world, overseas to Japan\nHave her all on TV, turn you into a fan\nGive her all the things that I wish you could have\nTell her all the jokes that I know make you laugh\nTake her to the beach, we could swim, we could splash\nTat my name on her ass, give her half of the cash\n\nThat's right, came up with a plan\nFind another girl to replace you if I can\nTake her 'round the world, overseas to Japan\nHave her all on TV, turn you into a fan\nGive her all the things that I wish you could have\nTell her all the jokes that I know make you laugh\nTake her to the beach, we could swim, we could splash\nTat my name on her ass, give her half of the cash", "[Verse]\nHighest in the room\nI’m so fly like I’m riding on a broom\nI’m so fire even niggas on space can attest when I rap they can see my fumes\nMy shit boom\nThis beat food watch a nigga eat like I’m rapping with a spoon\nI can’t lose\n3 years in but I rap like I started way back in the womb\nI don’t pay to play\nGetting paid is my day to day\nWhippin up like it's Mayonnaisse\nStraight yoked like a pair of eggs\nNo gas you a Tesla aye\nBest out that’s paraphrase\nStrapped up like I’m Sarah J\nOn top like some tresume\nOh la la\nMy shit finna kill, call a coroner\nLike 9am they’ll be morning ya\nAin't it funny how them niggas was ignoring us\nNow they wanna take shots when I'm pouring up\nI just got head from a foreigner\nMade my kids disappear like a socerer\nYou don’t want war wit a warrior\nTake your ass back to the back of the corridor\nI don’t got time to hate, I always learn from my mistakes\nThey talk a lot of shit but wouldn’t say it to my face\nI get down on my knees and pray 5 to 10 times a day\nAnd ask that all this music shit don’t take my fucking soul away\nDeep end I’m diving off\nBill gates you might go soft\nThey think I got a clone I'm always going twice as hard\nTwice the bars\nHalf the clout but fuck it I’m still twice the star\nRich as fuck but still be riding round inside my beat up car\nNiggas tryna milk my fame they lactose\nSnap a nigga whole career like Thanos\nCan’t throw shade I'm not no shadow\nBlack Rap God with a fucked up afro\nPut me on LUPÉ like Fiasco\nNiggas getting smoked just like tobacco\nI got the sauce just like Tabasco\nPainting picture just like picasso\nI been on the road for the past 5 months and the past 5 goddamn days\nSould out shows with the fam gettin' lit\nTaking pics east, west, north, south, every state\nI wear a tank top and rip it every time I’m on that goddamn stage\nI need to get sponsored by that brand, where the fuck you at?Everybody tag Hanes\nPut me in the league with the top guys\nPunch lines got chicken like Popeyes\nThrow a jab I counter like clockwise\nYou couldn’t cross me if cross eyed\nCan’t catch my bars 'cause you offsides\nCall a nigga .com 'cause it’s on site\nI don’t need y'all's help like you ballside\nMy wrist on froze it got frost bite\nThey act like they hate me\nIn person they praise me\nI won’t get deflated my name ain't Tom Brady\nYou cannot replace me or break me or shake me\nIt took to much work just to make me, I made me\nThis shits is warm up\nI freestyled this shit on the tour bus\nI be making these hits with the bars and they don’t even need to be having a Chorus\nThis industry cannot ignore us\nIt's Dax\nI been spitting these facts\nSleep if you want you’ll get woke by the wave I'mma make try to swim and then drown and go back\n\n[Outro]\nHahahaha\nThis shit just the warm up baby\nI got something a lot bigger than this coming (Facts)\nTRRG", "[Intro]\nListen up son, there’s a lot of things about life I need to teach ya\nSo be quiet and listen, ok?\n\n[Verse 1]\nListen, live your life fast, don’t slow down for no one\nYou can still love ‘em even if you don’t post ‘em\nYou don’t have to take a pic, just to prove that you lived it\nForgive but don’t forget, because this life is unforgiving\nNothing’s written, you can write your own\nThe danger zone only approaches when you turn to a clone\nStay in your lane, cause it’ll set you apart\nTrying to merge is how you went and fuck the whole damn car\nYou fucking crazy, get back in it\nI know they said it’s cool man, but crashing it isn’t\nSo be yourself, cuz nobody do it better\nYou can try to be somebody but I promise they won’t let ya son\nBe yourself, I promise that you poppin’\nChasing someone else, I’ll promise ain’t an option\nSo be yourself, I promise that you poppin’\nCause chasing someone else, I’ll promise ain’t an option\n\n[Interlude]\nNow this is how you should think about yourself\n\n[Verse 2]\nBeing me, yes, that’s a fetish I will never be neglected\nLoving me, just like some sex, I will never cum protected\nI will never choose the lesser, never settled, chase the better\nTreat my life just like a bitch, when she see me she get wetter\nI'm the shit I fucking know and no mistake I fucking chose\nAnd ain't afraid to walk alone 'cause this mind could not be broken\nCan't be stored, before I had it, it was spoken they can close the door, I manifest the next in and it'll open\nI am the fucking greatest\nI'll say it ‘fore I make it\nThen prove it to these niggas just for fun like I was gaming\nPosted on IG because I'm all for making statements\nThen lock a load of comments cuz who cares what they is saying\n\n[Outro]\nYou heard me son?", "[Intro]\nI don't wanna die today\nI don't wanna die today\nI don't wanna fucking die\n\n[Chorus]\nI don't wanna die today\nTake my life away\nI might die today\nGot anxiety\nGet on my tidal wave\nTake you to a higher place\nI don't wanna die today\nI don't wanna die today\n\n[Verse 1]\nNiggas talked down when they see me\nNiggas talk down, wanna be me\nNiggas run around try'na heatseak\nCouple I knew tried to kill me\nCNN news on the TV\nCouldn't get through, I'm a species\nNiggas talk shit like feces\nHad to get clean like Febreze\nCannot take my soul\nGod's side, I will not fold\nI'm just try'na die old\nOutlive both of my folks, reach my dreams, achieve all my goals\nCan't leave before I get grown\nGotta' buy momma a home\nGotta' get papa chrome\n\n[Chorus]\nI don't wanna die today\nTake my life away\nI might die today\nGot anxiety\nGet on my tidal wave\nTake you to a higher place\nI don't wanna die today\nI don't wanna die today\nI don't wanna die today\nTake my life away\nI might die today\nGot anxiety\nGet on my tidal wave\nTake you to a higher place\nI don't wanna die today\nI don't wanna die today\n\n[Verse 2]\nNiggas talked down like they know me\nFade on a nigga like Kobe\nNiggas get left like Ginobili\nNigga was never my homie\nNo friends, nigga I'm lonely\nGot no bitch, no trophy\nCan't be saved, no goalie\nFuck the devil, I'm Holy (Holy)\nI don't wanna die, I just wanna live\n24 years old, so much left to give\nI ain't got no kids, I ain't start no biz\nI don't wanna die, that's just how it is\n\n[Chorus]\nI don't wanna die today\nTake my life away\nI might die today\nGot anxiety\nGet on my tidal wave\nTake you to a higher place\nI don't wanna die today\nI don't wanna die today\nI don't wanna die today\nTake my life away\nI might die today\nGot anxiety\nGet on my tidal wave\nTake you to a higher place\nI don't wanna die today\nI don't wanna die today\n\n[Outro]\nI just want to stay alive", "[Verse]\nI’m sick, but I already told you that once\nThat blood you saw last time wasn’t fake, it’s real, I do my own stunts\nThat gun had bullets, I just got lucky, I play Russian roulette for fun\nThat knife was trash, I got it replaced, it didn’t cut deep, it was too blunt\nThat girl's still here, she’s sucking my dick, I might of been wrong, she may be the one\nWe’re not in love, but in 2021 I’m going to let her have my son\nSo we can post and fake happy while our real lives come undone\nAnd stay home and watch re-runs\nBut I don’t want your sympathy\nFuck your help!\nEveryone’s an expert on everyone elsе except their fucking sеlves\nLast time that I made a song I left a lot of shit on that shelf\n'Cause I know you’re too weak to hear the truth or care about how I felt\nAnd oh, hi comment section!\nDid you know your words describe you and not me and bounce back 'cause in life we project our insecurities on people we wish we could be while blinded by the fact that we’re our own biggest and worst enemies\nYeah\nYou don’t know me, you knew me\nYou thought JOKER was a joke, that shits my life, this ain't no movie\nYou torment me and abuse me\nHaunt me, chase me, and amuse me\nI’m at war inside my mind my OPS are black, they hide at night like I’m playing Call Of Duty\nI’m depressed, but, cancel culture causes me to say that loosely\nWhy do you judge if you're not Judy?\nYou're not my friend, you’re dead to me after what you’ve done, I feel like uzi\nI’m done dealing with these groupies\nWhen they see me they see food, I feel like sushi\nOh, it’s funny right 'cause it’s not happening to you\nI wear a size 13 men’s, there’s no damn way you could walk in my shoes\nTake this pain and do what I do\nWhile making songs that people use\nTo get through shit I can’t get through\nWhile they laugh, hate, destroy, and constantly ridicule\nYou guys are pitiful\nYou take my words, and you twist them, that’s why I don’t want to do interviews\nI told my mom I was suicidal, and she cried and then screamed\n\"What the hell has got into you?\"\nI don’t know, mom\nMaybe those people who laugh, hate, spin the truth\nAnd pray you fail, and once you do\nHA HA HA HA HA\nThey start kicking you\nFUCK\nThey tried to put me in a hospital bed\nDiagnose me and stuff me with meds\nAll it ever did was fuck up my head\nThey anti-depress you until you’re depressed again\nAnd then you depend on the pills that made you independent\nWhat a shame\nI’m stuck in a cycle\nI’m the hero, villain, traitor, and somebody else’s idol\nI make songs about my broken heart and about the Bible\nIf you feel depressed or wanna kill yourself, I’m not liable\nLet me clarify and get this straight\nI make songs that no one else can make\nThat millions love 'cause they relate\nThen get half the recognition but twice the hate\nThen reinvest and do it all again\nAt a quicker speed than anyone driving in my lane\nThen I smile and wave\nWork and slave\nTalk to my fans every day\nWhile you troll and only take breaks to take a shit or masturbate\nThen claim my life's a piece of cake\nLike you could somehow do it, even though we know you wouldn’t 'cause you’re too goddamn afraid\nDon’t even join my circus this time, I’m not in the mood\nGo listen to that mainstream music or whatever your friends think is cool\nI’ll sit here and play the fool, while you drool\nAnd drown inside my tears that fill\nOlympic pools even Michael Phelps couldn’t endure\nFurthermore\nI’m tired of drinking and waking up on that floor\nTired of living a life I cannot afford\nTired of living my life for people who never saw me as equal who hate me and just try to ignore\nNo more\nIt’s war\nI’m evening this score\nKilling everyone that walks through that door\nAnd tells me I need wings to soar\nSo let me take that knife and gun and stop pointing them at myself\nI’ve hurt enough, it’s time for you to feel it along with everyone else\nSociety needs sobriety\nWe put people down for notoriety\nLove in public but destroy them privately\nAdding creating anxiety\nThen we want love and don’t get it, oh, the irony\nThis was a poem I wrote in my diary\nFighting demons deep inside of me\nI feel alone, yet I’m constantly fighting for privacy\nSeeking truth while everyone I know lies to me\nIt’s ironic 'cause the people who knew me the best didn’t support me\nUntil I finally made it, now they wanna fake it and act like they love me when I know they don’t even like me\nYou ain't slick\nI remember the day dude fucked my bitch\nI remember rejection after rejection and going home wanting to slit my wrists\nI remember that coach who said I wasn’t shit then took my fucking scholarship\nAnd all the kids who used to bully me just 'cause I didn’t fit in\nHow does it feel?\nWhen you see me now\nThey say if you’re alone and fall it doesn’t make a sound\nWhat goes up must come down\nUnless\nYou get a knife and cut a smile so you never frown\n\n[Outro]\n*Hysterical laughter*\n\nYou look nervous\nIs it the scars?\nYou wanna know how I got 'em?\nCome here, look at me\nI said look at me!\nGonna hurt you!\n(*Laughter continues*)", "[Intro]\nAye for the next two minutes and twenty five seconds\nI need you to take in every single word I say\nThis is No Government\nIt's Dax\n\n[Verse]\nI prayed to God one time, but he didn't talk back\nTook the words that I was praying and I put 'em in raps\nWrite a scripture with these words this shit a biblical pad\nThis is man made like the Bible I was reading in class\nThey told me stories 'bout the dude they said \"That nigga was white\"\nI did my research, found out that shit wasn't right\nAnd now I'm searching for the truth along with meaning of life\nPerpetuating on the darkness while I'm shedding the light\nThere's No Government\nIs this a reward or a punishment?\nSection eight housing, who's fundin' it?\nDemocratic nigga or Republican\nThat shit don't even matter 'cause the winners never even really runnin' it\nHow the country functioning?\nTSA lines with a gun in it\nI pray to touch down we ain't puntin' it\nNiggas choose sides, who you fucking with?\nShit a track meet and we about to see who you really running with\nIt's Dax!\nChoose\nYou with the people or the evil?\nDivided or the equal?\nBeginning or the sequel?\nIllegal or the legal?\nThe truth, the deceitful?\nThe war or the peaceful?\nWith the calm or the lethal?\nAll gas this is diesel\nI be spittin' the truth\nManifested education from the time of my youth\nGraduated from the basement I was living the proof\nMolesting beats like a reverend when he step in the school\nThe government\nMan made and self paid\nLand of the free, but the home of many slaves\nHealthcare for free\nNah nigga we second grade\nAnd watch our people die when the bills go unpaid\nIt's concave, not in goods hands\nNo Allstate\nMake us great again, that nigga threw that ball fame\nNow the shit in shambles, what the fuck do they all say?\nKick that nigga out, we've been saying that all day\nI heard the country at a raw spelt backwards\nMaybe it's a lie and they pay for google AdWords\nPaint the word division man that's gotta be the password\nDivided demographics deviated by our cash worth\nThank God the country face down they gonna hit the ass first\nNo condom beatin' up the country 'til her ass hurts (Stop)\nMaybe they should ask her\nInstead of trying to pass her\nHow to fix the problem and I killed that bitch faster\nListen, no government is soon to cause sufferin'\nI wrote this rap just double up the coverage\nThis shit ain't McDonalds you can't feed me all this bullshit then expect to me to start screamin' that I'm really fucking lovin' it\n'Cause if no one is governing while poverty is hovering\nIt's sure to cause a war, if when the country die stuttering\nI gave this shit a couple months before people get to shooting\nI stay loaded like a downloaded movie stay bufferin'\n\n[Outro]\nIt's Dax!\nThere's no government\nNo government\nThere's no government\nFacts", "[Chorus]\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\n[Verse 1]\nHilly hilly hilly Clinton\nDemocratic walking, wishing for the numbers\nFour five six 10 votes wanted\nTried to buy 'em slick, still couldn't stop 'em\nRappers talkin' shit, still couldn't cop 'em\n4, 5, bricks the wall going to cost\nWe talk money\nYou know he got\nYou can't stop it\nIt's stupid, it's stupid, it's stupid\nI thought this shit a movement\nWhere is the mail hilly prove it\nI fought for you now look stupid\nWhole country going through it\nDas why I'm moving\nGuess that I'm moving\nGuess that's the movement\n\n[Chorus]\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\n[Verse 2]\nHilly!\nHilly Clinton\nWhy didn't you win\nI thought the dub was super predicted\nPolls in America all had you winning\nShocked when we got something totally different\nNow we moving taking all of our children\nRacial tension rising treated like pilgrims\nThis apprentice Trump da boss so we quit it\nYou get Trump down make decision\nStay and fight I know that leaving is tempting\nPray for the women\nPray for da pigment\nPray for the children!\n\n[Chorus]\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\nHilly hilly hilly Clinton\nLost to Trump and now we trippin'\nThank God I got a passport\nCouple months I'm going missin'\nRight back to Canada\n'Cause it's violent, looting and riots, wilding they wilding\nDemocratic party crying\nAll the Republicans smiling\n\n[Outro]\nHilly hilly hilly Clinton\nHilly Clinton\nHilly Clinton", "[Intro]\nComo te amo, me amor, trapta, Dax\n\n[Chorus]\nI got it cracking on my own, I got it cracking on my own\nI got it cracking on my own, now these people call my phone\nI was down and needed help, went and got it by myself\nThis for anybody watching, I don't need nobody else\nAll you niggas didn't believe me, now you watch me on the TV\nI swear to god it wasn't easy, now we taking trips to Fiji\nI got it cracking on my own, I got it cracking on my own\nI got it cracking on my own, now these people call my phone\nI was down and needed help, went and got it by myself\nThis for anybody watching, I don't need nobody else\nAll you niggas didn't believe me, now you watch me on the TV\nI swear to god it wasn't easy, now we taking trips to Fiji\n\n[Verse 1]\nI'm in a trap, nigga you trash\nFuck on your bitch, fuck up a bag\nNigga be lit, nigga be wack\nDon't give a fuck, nigga I'm mad\nMumbling that way, couldn't beat me in on a bad day\nI was tryna get my ass paid, couldn't even get a track play\nNow they talk when I'm talking, holy walk when I'm walking\nAlways hit on my IG, pay see what I'm droppin\nDax sick they coughing, Dax rich I'm poppin\nI can't go home, I get no love that often\n\n[Hook]\nI got it cracking on my own, I got it cracking on my own\nI got it cracking on my own, now these people call my phone\nI was down and needed help, went and got it by myself\nThis for anybody watching, I don't need nobody else\nAll you niggas didn't believe me, now you watch me on the TV\nI swear to god it wasn't easy, now we taking trips to Fiji\n\n[Verse 2]\nI'm the topic, I swear that I called it\nNow I take my family to trips out and I drop this\nReal big ballin', can't nobody stop here\nI be fuckin' doin heat and no nobody poppin'\nNow I went and got it by myself\nAll the hatred doing bad for your health\n\n[Bridge]\nI got it cracking on my, I got it cracking on my\nI got it cracking on my own\nI got it cracking on my, I got it cracking on my\nI got it cracking on my own\nI don't need anybody's help, I did this all by myself\nWaoh waoh waoh waoh\n\n[Hook]\nI got it cracking on my own, I got it cracking on my own\nI got it cracking on my own, now these people call my phone\nI was down and needed help, went and got it by myself\nThis for anybody watching, I don't need nobody else\nAll you niggas didn't believe me, now you watch me on the TV\nI swear to god it wasn't easy, now we taking trips to Fiji", "[Intro: Dax]\nMy name is Dax\nYou  ready?\n\n[Verse 1: Dax]\nI  crossed seas to the check the temperature\nFound myself in India\nHollywood to Bollywood with bars from Nigeria\nPaused \nInspected  the criteria\nRealized the foreign ties are great if not superior\nI  been that\nFuck that shit Dax is going global\nI ain't never been the type to say I told you but I told you, yeah I told you\nThat I would graduate from local and evolve into a CEO millionaire mogul\nTook  time, crossed T’s, dotted I’s realized real eyes recognized real guys\nStopped wasting time\nTook a flight overseas got to work and started building foreign ties\nYeah, nigga I been that\nStudios at best I wasn’t first inside my class but I was first to get ahead\nTold my teacher I was dropping out of math cuz I didn’t need no dumb equation just to teach me how to calculate success\nAlgebraically though, I been the factor\nMultiplied my capacity from slave into master\nMultiplied my capacity from poet into rapper\nStopped asking niggas questions started giving niggas answers\nThat’s the truth\nThis is calculated murder when I step inside the booth\nPremeditated murder when I’m serving niggas truth\nThis is elevated thinking how I educate the youth\nTellin' niggas read a book instead of sitting in a school\nYe I been that\nThe prerequisite, adjective, synonym, verb predicate, bacholarte\nHad to talk to god 10 times before I mastered it\nLicensed it, trademarked fucked around and patented it\n\n[Chorus: Dax]\nI been that\nYeah, nigga I been that\nSwear to god on God motherfucker yeah yeah you know I been that\nYeah, nigga I been that\nIT'S DAX!\n\n[Verse 2: Emiway Bantai]\nHa mei waha tha\nJab views mere 2 the\nHa mei wahi tha\nSunane wale 100 the\nHa mei waha tha jab logo\nNe kaha ki teri boli nai chalega lekin\nAj dekho jaam hue\nWoohhhhhh\nAye chote\nDhyan de re flow pe\nApne gane pe nache bollywood ke pote\nMaje lele lala aja mere show pe\nKill karu beat pe jab milte mujhe moke\nMere gane mere asu ko poche\nUnderground yaha tk pohchega kya kabhi tum soche?\nIndependent scene baat kam shot zyada\nDur karne aya hu mei drame aur loche\nYe rapper atkele hai bech mei hi\nInka organic reach nai\nHahahaha\nAgar ede chale karega\nKahi pe mere bare mei toh\nTereko milega mere jaisa koi nech nai\nOut of reach pe ha beach pe hu mei\nUpar wale ke diye umar ki lease pe hu mei\nChakke marne ke liye khadela crease pe hu mei\nDaud lagane ke liye tayyar knees pe hu mei\nIncrease pe hu mei\nDecrease pe hai tu\nKhudko kam dena janta hu please bolu\nKyu\nKisi ko bhi\nKissie wissie lera maze mei hu buzy buzy\nPehle easy nai tha kuch bhi lekin take it easy\nKisi kisi se suna ke aise nai chalega kam tera\nZippy sabke muh pe zip lagaya kam mera recipe janna chahte hai pehle come and mess with me\nInke gane lagte jaise bol raha ho Mr. Bean go Rest in Peace\nKyu karu mei jo tu kare mei karu woh jo na kare tere sare pantar tera toh chod mera game change marunga hunter, jaunga bankar hero\nBero pe chupake rakha hai tereko therapy milegi gana sunega toh\nInhe nahi pata kitna sara mehnat lagta hai beta ek gana banane ko\nItem ko nai aata khaana banane ko rapper ko nai aata gana bananeko\nMei bhi ek rapper hu sunna chahte pareshaniya meri toh janedo\n\n[Chorus: Dax]\nI been that\nYeah, nigga I been that\nSwear to god on God motherfucker yeah yeah you know I been that\nYeah, nigga I been that\nIT'S DAX!", "[Intro]\nDr. Dre and Eminem y'all killed it\nNeed to get that collab\nCome on!\nHa, ha, ha!\nYa know what time it is, yeah?\nIt's Dax!\nOh my God, god, god\nAyy, yuh\n\n[Verse 1]\nPut yo thinking caps on, Dax rapping\nThis ain't gangsta music, don’t start shooting if I say start clapping\nNew era, too much hair so I’m not cappin'\nCaught lacking, now I roll with a team of deadly assassins (Uhh)\nI keep a cape inside my backpack\nThen Superman that ho! When they be talking out they ass crack\nThese niggas making memes but the memes making Dax cash\nKevin Hart a nigga, let 'em giggle, I get last laugh\nThat’s right it’s calculated, premature ejaculated\nDid it by myself, no help like I masturbated\nThey say I’m soft, well, fuck, I’ll get castrated\nSell my balls to one of you haters who can’t make house payments\nThey full blown AIDS, they killing the youth\nInfecting the hoods twisting and distorting the truth\nBlack on black crime I ain't talking a suit\nBoy it ain't cool to be a shooter unless it’s into a hoop\nSo lemme breakdown societal expectations\nThey say that I gotta be a nigga but don't tell me just in moderation\nNigga getting shot by the cops while cooperating\nWomen turning thots for some cock and an operation\nInauguration, I should be the second black president\nGet Monica Lewinsky here to get rid off the evidence\nTurn the whole White House black so the residence can say “my nigga” while I’m terminating terrorists\nSo who made this society?\nWhy I gotta wave a fuckin' gun for notoriety?\nWhy I gotta be a fucking nigga?\nWhen you diss me but you do real quietly and say it to yourself in ya head real privately\n\n[Chorus]\nNow I’m moving they got nothing to say\nI was broke down bad now I’m finding a way\nHit the lot with my team pull off in a raid\nIf I eat then we eat I ain't playing no games\nAyy\nThey don’t know what to do with a nigga\nThey been trying to act a fool with a nigga\nThey don’t know what to do with a nigga\nAyy, ayy, ayy\n\n[Verse 2]\nIn terms of battle rap boy, I’m batting a thousand\nMy career is like a hiker I’ve been climbing a mountain\n(Oh my God, you suck!)\nThey be screaming from the bottom I be waving from the top asking why are you shouting?\nSo I jump off, it’s a suicidal mission\nSkydiving into mainstream, juvenile divisions\nLook like a mumble rapper but I rap with the precision\nOf a stan who’s been listening to Eminem revisions\nBumpin' Dr. Dre beats with P. Diddy mannerisms\nR. Kelly to the game I put my key in its ignition\nOnly difference is I’m grown and I ain't playing, I ain't talking, I ain't beefin', I ain't fighting with you motherfuckin' children\nSo, will the real Dax please stand up?\nThen sit down again, and let the internet clown again\nKarma is a bitch and anything you put into the universe is going to go and come around again\nSo can I get an amen?\nSay that shit again man\nNiggas watching other niggas sorta like a gay man\nFacts, they 'bout to make me do time for this track go ahead bring that beat right back\nIt's Dax!\n\n[Chorus]\nNow I’m moving they got nothing to say\nI was broke down bad, now I’m finding a way\nHit the lot with my team pull off in a raid\nIf I eat then we eat I ain't playing no games\nAyy\nThey don’t know what to do with a nigga\nThey been trying to act a fool with a nigga\nThey don’t know what to do with a nigga\nAyy, ayy, ayy\n\n[Outro]\nAnd dear black community\nI ain't trynna don’t go to anymore of these black on black Instagram eulogies", "[Verse]\nFirst off fuck Santa Claus, he ain't never done shit for a nigga like me\nPeople been hating on me since I was like three\nJust because I was different and my skin was light green\nHating and spreading rumors all over IG\nIC them coming for everything that IB\nTrolling hard and making fun of my teeth, my skin, my hair, and the fucking way that I speak\nWas the night before Christmas, all through the house\nI sat in my room alone with no spouse scrolling my phone\nComparing myself to people who don’t put no food in my mouth\nLooking around jerking off to Bella Thornes OnlyFans account\nWhile scheming the system and faking depression so I can gеt rich just to double my clout\nI’m tired of Christmas, I don’t want a presеnt\nCan’t wait for the future, I’m done the past\nI’m fucking up Santa on sight if I see him, I’m punching his belly and kicking his ass\nRudolph can get it, that red on his nose a get put on his head if he’s talking that trash\nDöner and Blitzen then Prancer and Vixen\nAnd Comet and Cupid and Dasher and Dance\nSanta gon’ think I’m a psycho\nI’m dunking these cookies like Michael\nI’m fucking Ms. Claus then I’m posting the vid so your hoe, hoe, hoe is viral\nLife is a vicious cycle, karma comes around and bites you\nThis for everybody who was mean and bullied me down in Whoville back in highschool\nListen\nI’m not ugly it’s ACQUIRED TASTE\nMy hams greens with the eggs and steak\nI max out on my dog, I’m scamming unemployment out in several states\nI drive stick, I don’t need a sleigh\nNeed no hooks cause I’ve mastered bait\nI’m so good even Santa plays this song on Christmas\nI’m the Grinch\nNo hands when I’m taking a piss\nNo condom when I’m fucking ya bitch\nIn and out like the burger, I'm saucing the patty so buns on my dick a stick\nI don’t need fire to heat to my crib, you dumb fuck, I’m already lit\nAnd the only time you’ll ever rap better is when you're wrapping Christmas gifts\nI wanna know if you're naughty or nice\nI bet you pray on the downfall of others like me whenever you sleep at night\nFuck this society, everyone acts like they’re perfect while judging another’s life\nYou don’t qualify to judge on what is wrong from right\nYou're not God\nOh, my God\nI’m bout to throw massive fit\nA punch I don’t care if you’re a pacifist\nI’ll pass this fist like a perfect Steve Nash pass assist\nYou straight ass, all you pass is gas\nAnd if you do the math you’ll never be half of half what my active is\nI’m captaning you cap that's a asterisks to say you should never try to be an activist\nLet me explain my pain and why I’m going insane\nAnd why ya negative energy’s penetrating my brain I gotta fettish for dead ish I’ll JJ Reddish ya face for speaking PLETHORIC RHETORIC on a veterans name\nDon’t ever speak on my green unless its money I've made\nAnd if you do it a g g gain I'ma k k k k k k k k kick in ya face\nThen take my body builder body run and pick the pace back to my cave up the mountain where I’ll kick up legs\nI know you’re sick of how I innovate\nSanta has been jealous looking for ways to eliminate you can (S)UCK (T)HIS (D)ICK STD if you abbreviate deviate abracadabra you keep on talking you’ll disintegrate I’m dissing-the-great (dis-in-te-grate)\nChimney sliding milk cookie diving sleigh driving elf and high fiving jolly fat smiling guy that rides private without no license\nG-R-I-N-C-H, I’m all green, not clean, spray me with Lysol\nI’m depressed, that’s ok I take drugs to pick me up like ground balls\nYou can tell by my I eyeballs\nI self loath so much I might call\n1-800-got-junk and tell them I think I'm suicidal\nAnd if they don’t pick up I’ll kill myself and then I'll go viral\nThen tell God we need a Grinch chapter in next years new age Bible\nThen get spiteful, look at Earth and see all of my haters living life so seek revival and kill them and all their friends on my arrival...\nAnd once I arrive you should pray I decide not to come for your neck, do not be cordial and smile in face you’re a snake And I've heard all the lies that you’ve spread\nDo not say sorry or act like you made a mistake and pretend that you want to be friends 'cause now it’s too late and the words that you’ve said are words that have driven me over the edge\nNow I see red\nNow I see bullets in unison traveling straight to your head\nNow I see people in pain their emotions are withering hanging on just by a thread\nYou should of left me alone the unknown was the thrill you were searching for but now instead I’m lyrically piercing your flesh for that thrill and I’ll do it again and again and again\nLook in the mirror, there is no reflection cause you’re getting sick\nYou hate on everyone you selfish narcissistic fucking prick\nYou’ve destroyed me with your words, I might just cut off both your lips\nAnd then go trans and cut my shit if it means you’ll get off my dick\n\n[Outro]\nEven the nicest people have their limits..\nPlay stupid games..\nAnd win stupid prizes..\nMerry Christmas", "[Intro]\nAyeee Santa, Dax again\nI hope you're not gonna ignore my calls again this year\nI'm sorry about what happened last year I'm just really, really passionate about Christmas and...\nAnd you were being a Grinch\nAnd you know it\nOkay?\nSo listen\n\n[Pre-Verse]\nAye Santa last year you did a good job but this year we need to pick this shit up\nLast year I said a Cadillac color matte black\nBut this year I think I really want a Bentley truck\nI don't want to hear excuses last year you played me for a fool this year get yo fat ass up\nI don't mean to be a nuisance, Santa but after last year\nI don't give a fuck\n\n[Verse 1]\nI need two phones like I'm Kevin Gates\nI'm tryna get boo'd up like I'm Ella Mai\nLast year I got a Lele Pons follow back\nBut this year I'm tryna take Lele on a god damn date\nI want two homes, with two gnomes, in two states\nTwo thrones, gray poupon on two steaks\nA crib with a gate\nAnd some fish in a pond with a hot tub beside of a lake\nI need tube socks\nA feature from 2Pac\nA new season of Boondocks\nSome more ice 'cause I'm too hot\nAnd this year throw in a flesh light and a juke box\nI need closure\nI need more exposure\nA new diet preferably kosher\nGet me a virgin who's never even kissed a man so I can show her\nA billboard hit\nBalmain fit\nIced out watch\nExclusive kicks\nAnd some who's only  job is to wipe my ass every time I shit\nSanta\nI know you see me, don't try to play me just like you Stevie\nAnd have me wondering and looking so needy\nI'm not that greedy just let me get a couple more things and 60 inch TV\nA personal chef to help me cook\nAnd someone to read for me when I open up a book\nAnd let me get some booty\nLike captain hook\n\n[Break]\nDear Dax, uhhh it's not looking good this year, son\nMs. Clause is sick\nRudolph is in the hospital\nThe Popeyes chicken sandwich ran out\nI'm black\nUhh let me connect you with a friend\n\n[Verse 2]\nAgain Santa, two in years in row?\nNow I know what you mean when you always say ho\nI'ma huff puff come and blow down yo door\nTreat you just like a grudge I ain't letting you\nI'ma show you the meaning of pole (Do do do)\nAnd put yo head right in a scope\nPut a Red dot 'pon ya head top\nHave you looking like a real red nose\n\n[Outro]\n'Twas the night before Christmas\nAnd all through the house\nNot a creature was stirring not even a mouse\nIt was Dax and the Grinch\nBecause Santa's bitch\nSo we gon' break this shit down\nAnd we gon' do it like this", "[Intro]\nMan, I ain't gon' lie, y'all sorta forced this lifestyle on me\nI mean, I ain't complaining, though\n(It's Dax)\n\n[Chorus]\nIce water on my patek\nSee I ain't never used to have it\nNow I got it, man, I might as well rap it\nHow that nigga go from spitting conscious to this average\nI done moved out to LA, and they done turned me into a savage\nAll the shit I used to say, I couldn't ever cash it\nSo I rapped about some mainstream shit and started stacking, what happened?\nGraduated, moved up to the attic\nNow I can't fit all my money in the mattress (It's Dax!)\n\n[Verse 1]\nI see a couple niggas hatin', it's my life now\nBut I didn't choose it, them niggas gave me this lifestyle\nTried to give em' something to love em', they told me, \"Pipe down\"\nNow I rap about bitches and money, and they get hype now\nHalf you niggas gon' fade when the site down\nInstagram skit has niggas wearing nightgowns\nI've been doing this until the money come right now\nThen going back to conscious when label get me iced down\nI used to pay to play\nAnd now I got money I raised the rate\nUsed to be broke I'm rich\nAnd now I got chicken like raising canes\nYou is a Kobe fan I know ya shit gonna fade-away\nI'm on that curry clay I'm in a golden state\n\n[Chorus]\nIce water on my Patek\nSee I ain't never used to have it\nNow I got it, man, I might as well rap it\nHow that nigga go from spitting conscious to this average\nI done moved out to LA, and they done turned me into a savage\nAll the shit I used to say, I couldn't ever cash it\nSo I rapped about some mainstream shit and started stacking, what happened?\nGraduated, moved up to the attic\nNow I can't fit all my money in the mattress\n\n[Verse 2]\nYou see the cool is that I never was a follower\nThis game consumes niggas like a gold digging swallower\nYou really think she love you but you couldn't even borrow her\nYou hot for a minute then she fuck your nigga Oliver\nThe twist ya he tryna be a rapper too\nSo he done went copy all the things he seen them rappers do\nBought a chain, bought a belt and car without a roof\nAnd started slurring all his words when he rapping in the booth\nIt's a trick nigga\nAjdbjs jshdhdj\nThat don't mean shit nigga\nThat's a fake infatuation by a bitch nigga\nNot to be mistaken when you dealing with a real nigga\nWrite this down it's a prophecy\nAin't no way that they're stoppin' me\nThey'll be calling me corny but in a year they gonna copy me\nShit is a clearly a robbery\nThey'll infringe on my property\nThey know it's gift that it's like winnin' a lottery\nImagination was my maturation\nContemplated if I'd ever make it in and out the basement\nStarted making every single thing I did\nIs product was placement\nNever pacing, waiting on tomorrow\nI was never patient\nNow I'm taking every single thing\nThe chicken and the bacon back to conscious\n'Case I know you hooked and I'm now on ya playlist\nHad to fake it\nNow I'm mainstream and they gonna have to play it\nWhy?\n'Cause I'm the greatest fucking thing in the making\n\n[Outro]\nOh man, 2019 man\nDax year", "[Intro]\nWhat I said before\nThis is a sport\nOnly the strong survive\nMy name? ITS DAX!\nHahaha..\nYou know what time it is\nXXL, what's up?\nYeah, yeah, yeah\n\n[Verse 1]\nName a nigga who can do it better\nName a nigga rappin' in a Wife Beater\nInstead of a fucking Gucci sweater\nUK, gettin' double cheddar\nEverything is double measure\nEven when I'm ridin', it's in double-deckers\nLet down, but I won't let up\nYou must heard that I'm the best\nSo you stop, cause' you can't catch up\nNo choice bitch, you must let us\nThey say that pressure builds diamonds\nI guess that I'm applyin' pressure\nMy name's Dax bitch, three letters\nYou Peter Pan little nigga, why? You will never-\n-Land anywhere in my pedigree\nA hundred flows attached to me, they call me \"Centipede\"\nTryna' beat me is a stretch, just like a Limousine\nGot rid of all my dogs, cause' of bitch tendencies\nNiggas tryna' put out my flame, I'm spittin' kerosene\nBitches tryin' to lie bout' they age, I know you seventeen\nI'm done with it\nAll this rap shit, and what comes with it\nYou ain't got a job, can't come in it\nYou know what I'm comin' with\nRap hoop sing like I'm juggling\nI ain't fuckin' playing like a jungle gym\nNo, I ain't mumblin'\nConscious rapper actually bubblin'\nOwn my own masters and publishing\nI'm locked in like a baby in a car, I stay buckled in\nRappin' for three years so when they meet me, it's humblin'\nBBC, yeah, big black confident\nBBC, hunh, broke bitches commentin'\nI don't need you niggas, like most of these colleges\nBorn an MC, so I don't need your acknowledgment\nSacrifice my time for this shit, no offerin'\nEight figure deal if a label wanna offer him\nSay I ain't killin', check receipts, check documents\nSo many lines you could snort my accomplishments\nCocaine flow\nBrought it back, bitch nigga, this that\nRogaine flow\nI think fast, move fast, just like Usain Bolt\nNiggas thought this was a game\nConnect four to your chest, you talk shit, you get checked mate\nYou ain't check mate?\nI averaged twenty back in college\nLed the league, you wanna hoop? bet, checkmate\nYou'll get a twenty-piece, even on my worst day\nGet dunked and fried and I'll even get the check mate\nFuck ass like I ain't built this shit\nMy career ain't no virgin, one hit, bust quick\nWrist wet, like I'm rubbin' the clit\nIf I'm a clown you the cir--cus\nYou can't rap on my cir--cuit\nI pop up on google sear--ches\nWhen you ask who the best rapper on the earth is\nDAXOFFICIAL.COM is where my merch is\nGo buy a T-shirt right now, it's worth it\nSo make a pur--chase\nSupport a real nigga movin'\nYeah I knew I had the juice when my dreams turned lucid\nLess than four years in, I'm goin' loco\n4 Loko, pop out in Wife Beaters no Polo\nNiggas call me pussy? Nine lives, fuck yolo\n10k a post if you tryna' get promo\nGot my shit jumpin' like I'm rappin' on a pogo\nNiggas make excuses like a straight dude sayin' \"No homo\"\nI'm not nice\nThat's cause' my flow is mean\nHot fire, that's why nobody holdin' me\nGettin' head's the only time you'll take my soul from me\nIn my bag like some muhfuckin' groceries\nDon't cross me cause' I am not a rosary\nFuck rap, all my shit is like poetry\nOn top, where a young nigga supposed to be\nIT'S DAX! That's how know it's me\nWho do it better?\nBring rain durin' the May weather\nPunchlines knock you out, leave you asleep in the stretcher\nPussy tight, have to stretch her\nGet Rihanna's umbrella\nThis light, doin' curls with these bars to get a sweat up\nWhatchu' heard?\nSome shit up off the internet?\nBunch of niggas talkin' who have half of my intellect\nI'm playin' on the holy field\nI got God throwin' \"Hail Mary\"\nPasses the devil couldn't even intercept\nWatch how I misdirect\nMe and rap met for each other, if I die, she die\n\"Romeo and Juliet\"\nNiggas been super slept\nSayin' pipe down\nI'm bout' to unclog the game like a nose with some Mucinex\nBars like a dick in a pussy, yeah they do connect\nComin' for you just like your bills, yeah I do collect\nTryna' do me wrong is like an iPhone spellcheck\nI will not hesitate to auto, hit, click and correct\nEverybody gettin' sent\nFoldin' like a cheap tent\nI'll be here longer than a nun in a convent\nRaps missin' bars, skill and lacks content\nI mastered all three and dispersed them into concepts\nSimple and complex\nBlowin' like a bomb vest\nFiles too big, even Windows couldn't compress\nI be mad consistent like the periods you girls get\nSomething like commercials, how I'm comin, cause' I'm on next\nFlow ripper, and gorilla\nI keep goin', I got no fillers, and no filter\nThis ain't SnapChat\nRubber band bars how they bounce back\nI don't rap free, link below for the CashApp\nI don't just fast rap\nYou people gon' remember me like flashbacks\nFind another, I'm like a needle that's in a haystack\nYou kinda like a mumble rapper face tat\nFace facts\nQuick to react like my nigga, fuckin' Layedbak\nHunh, yeah, this how I'm comin' on 2020\nChasin' erythin', unless I'm drinkin' fuckin' straight Henny\nPoppin' out on niggas like confetti\nSpittin' bars in a mumble rapper era\nEven though it's not trendy\nI ain't scrapin' over motherfuckin' pennies\nEvery song I fuckin' touch\nIs gettin' strung out like some goddamn spaghetti\nI'ma go and buy that goddamn Bentley\nI don't care if I can't afford it, like that nigga name Henry\nThese bars heavy\nYou can get worked like massage envy\nTruck yo' fuckin' ass like a semi\nI'm proud of my work, no Fendi\nI'm Canadian my nigga, but do not get it twisted\nThat don't mean I'm friendly\nI'm gifted like lefties\nIf you try to steal my flow, you'll get sued like Betty\nThis is raw, not catchy\nShout out Puma cause' they give me free kicks like Messi\nOff top, yeah I'm comin' off my head like some Becky\nI don't miss this month, I'm 4 for 4 like some Wendy's\nTimes five for a feature if you want it that's twenty\nCan't dodge it, no Hemy\nCan't block me. no Jenny\nI just might be the hottest of the goddamn century\nYou fried if you say otherwise, you'll get flipped on your sunnyside\nJust like some eggs at a Denny's\nThat ain't wise, no penny\nUncivilized, I might just take a switchblade\nAnd cut off both of your testes\nI'm a, fuckin' monster when it comes to this shit\nYou a banana if you think I'll split\nWe don't go together like two dicks\nLike AIDS nigga, I'm too sick\nDon't need shit, but my talent to get all these clicks\nYa'll for kids with ya' goddamn tricks\nYou only fire if you rub two sticks\nI'm Doritos nigga, I got chips\nLebron James with this rap, if they draft, bitch nigga, I'm first pick\nYeah, at this point, you corny if you call me corny\nYou got a fucked up definition\nSee I'm the biggest Lil' rapper in the world\nBecause everybody knows just exactly what I'd do\nWith all the recognition\nMy IQ is the reason that my pen is different\nWords all colors, I can see 'em on a television\nWrite inside my mind, they get processed\nMade into these songs\nThat be solving world problems like they long division\nFuck! Gah!\nI just rapped longer than some niggas careers\nYou could say I got \"onion bars\"\nDon't believe me?\nGo and watch \"Dear God\" and it'll bring you to tears\nI go hard, fuck a resolution, I don't need a new goddamn year\nAll that fuckin' makeup, how the fuck you gonna face your fears?\nFake like a set of veneers\nHit me one mo' time baby just like Britney Spears\nThis ain't an airplane runway, you are not in the clear\nPuttin' pressure on you niggas like you one of my peers\nYou in the way, you gettin' hit, just like a deer\nI use Visine, cause' I'm in a different tier\nI'm a leader but I do not cheer\nI got drive but I do not steer\nI'll make you crash like a couple of beers\nI'm exclusive like a fuckin' premiere\nIT'S DAX! Haha..", "[Chorus]\nI ain't do a damn thing for the pussy\nI ain't taking no pain for the pussy\nNiggas steady spitting game ya u looking like a lame it a shame what they say for the pussy\nFuck niggas go and pay for the pussy\nNo hair rogaine for the pussy\nNo math spend cash instead making tracks whats is that u slave to the pussy\n\nNigga always go and pay for pussy pay for the pussy\nDying everyday for the pussy day for the pussy\nNiggas is a slave to the pussy, fuck nigga u a slave to the pussy\n\n[Verse 1]\nAll you talk about is pussy nigga whatchu doing go and get ya life right\nShit good but ain't that good take ya money spend on a flashlight\nDat flesh right, chasing pussy is swerve left\nNiggas talk about the pussy more then getting to money man they fucking need help\nDAX GOTCHA\nFocus on the fucking money pussy coming going every fucking day\nOnly real eyes realize the real lies saying it ain't bout getting paid\nYou is a slave, pussy a grave\nAdam and Eve she got trick by the snake, u is the same\nWeak nigga reason yo ass getting gamed\nGamed gamed gamed for the pussy\nHopping on planes for the pussy\nGeico making claims for the pussy\nPhyscho go insane for the pussy\nNigga you stupid\nIt's all lust don't you dare call it cupid\n\n[Chorus]\nI ain't do a damn thing for the pussy\nI ain't taking no pain for the pussy\nNiggas steady spitting game ya u looking like a lame it a shame what they say for the pussy\nFuck niggas go and pay for the pussy\nNo hair rogaine for the pussy\nNo math spend cash instead making tracks whats is that u slave to the pussy\n\nNigga always go and pay for pussy pay for the pussy\nDying everyday for the pussy day for the pussy\nNiggas is a slave to the pussy, fuck nigga u a slave to the pussy\n\n[Verse 2]\nI ain't only talking bout these niggas man, these women be doing it to\nSell ya soul for a dick, let a nigga hit den pissed, cuz he feeling\nYou\nYou is a fool get you edumacation and take yo dumb ass back to school\nCuz you will lose if you if you depend on a nigga to come and take care of just you, girl is you stupid why?\nHalf these niggas is faking and running around\nPosting these pics on the gram like they got it you meet em I person they really a clown\nClaiming they version is new and renound\nHard work built it straigth from the ground\nWon't cheat finna hold the shit down\nSall lies no weight like pound, bitch\nGlow up get on fleak, 7 days a fucking week\nYou dont need no nigga tell you when walk and when to to fucking speak\nTake that shit from fucking me, treat my bitches like they queens\nI ain't braggin baby if you want you can come test the D\n\n[Chorus]\nI ain't do a damn thing for the pussy\nI ain't taking no pain for the pussy\nNiggas steady spitting game ya u looking like a lame it a shame what they say for the pussy\nFuck niggas go and pay for the pussy\nNo hair rogaine for the pussy\nNo math spend cash instead making tracks whats is that u slave to the pussy\n\nNigga always go and pay for pussy pay for the pussy\nDying everyday for the pussy day for the pussy\nNiggas is a slave to the pussy, ya nigga u a slave to the pussy", "[Hook: Dax]\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nWent and did it, tricked and flipped it and now we bought a whip\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nWent and did it, tricked and flipped it and now we bought a whip\n\n[Verse 1: Dax]\nWoke up, went and got myself a bag\nMC on the label bunch of zeros on the tag\nSwear the boy was broke, I used to pull off in the cab\nUsed to clean the toilets now I'm drifting in a jag\nWoah, gimme that, if you got work nigga send me that\nGucci, Louie, Prada put it on my babymama then I wanna had to go and cap a fanny bag, money cap the fanny bag\nNiggas hella mad, why?\nBecause I came from the bottom\nNothing to something your nigga be stunting\nThey walking then running and now they can't stop 'em\n\n[Hook: Dax]\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nWent and did it, tricked and flipped it and now we bought a whip\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nWent and did it, tricked and flipped it and now we bought a whip\n\n[Verse 2: O.T. Genesis]\nWoke up in the morning brushed my teeth and scratched my ass\nBowl in the pack with them grams in a glass\nMoney mission had to put my pistol in a stash\nHeard my line beep threw my phone in the trash\nWrap it in plastic, make it flip like gymnastic\nD's is classic make it stretch, that's elastic\nAll these bands, play with drones, all these bands\nDo your top, I recycle all these cans\nTrash still booming, two three like reunion\nYou ain't got no word what the fuck is you doing\nScary money don't make money that's the topic\nFuck the feds but if it's right I'mma copy it\n\n[Hook: Dax]\nI woke up in the morning said I gotta get it (Yeah!)\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nWent and did it, tricked and flipped it and now we bought a whip\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nI woke up in the morning said I gotta get it\nWent and did it, tricked and flipped it and now we bought a whip", "[Intro]\nHey, you gotta stop waitin' on somebody else to do that shit for you\nGet the fuck up\nYou ain't weak\nYou a solider\nStand up\nIt's Dax!\n\n[Verse]\nSee every move that I make is in silence\nI be killing all these beats but I do not condone violence\nBrought the old school back I went and started a riot\nI mainstream with the look so I took off like a pilot\nMumble rap is the diet\nPronouncing words you should try it\nI’m going David on you niggas like you fucking Goliath\nMan this shit is a crisis\nI got it down to a science\nRap dead, Dax 'bout to revive it\nFuck ass niggas\nI told them niggas I would make it, yah I was a snitch\nNiggas didn’t believe they died young, nobody rich\nNow they looking sprung when I be pulling off the lock with it\nA two door coup peep the roof how it drop and shit\nOn my 2Pac and shit\nComplex God with it\nRose him from the dead, this is the fucking 2Pacalypse\nI ain't cocky, I’m just confident\nI Young Dro the beat the way I’m leaning while I'm rocking it\nYou know they ain't no stopping it\nThat’s preposterous\nI’m head above you niggas like a motherfucking ostrich\nOn and off and on again\nWho the fuck you rocking with\nDax lil nigga, I’m the hottest nigga popping shit\nI can’t be moved, I can't be stopped\nI can’t be bought, I can’t be rocked\nI’m hot nigga\nNiggas buying views off a motherfucking bot nigga\nRap hoop sing couldn’t put me in a box nigga\nWatch how I box niggas\nStep to me and you get dropped unarmed like a black by a cop nigga\nHot trigger\nI done made it off the block\nSo let me tell y'all niggas who y'all got haha\nI’m a young educated black\nDog made it out the trap\nOpen up the door type but still make a pussy clap\nOld school lab rat, handsome Ben Affleck\nMurder you on one track, then resurrect the body back\nThen have 'em make body bag on fleek\nHave you do the Macarena while you singing Cardi B\nNo limit, I be winning that's on fucking Master P\nTake yo bitch and bring her back and nigga that’s on me\nI’m a dog\nI went and got it out the gutter\nOn my mother and my father and my sisters and my brothers\nI don’t do it like no other\nWhen I rap take cover\nWhy?\nI'm from Canada\n'Bout a year ago I was a janitor\nWas hooping back in college you can tell by the stamina, animal\nEat a beat freak like a cannibal\nThat’s why my momma always used to call me lil Hannibal, factual\nStarted rapping nigga was a natural\nClocking 6 figures on a mufuking annual, tactical\nMan that's what y’all got\nDax here, I’ma save Hip-Hop\n\n[Outro]\nIt's Dax!\nY'all already know what fuckin' time it is mane\nGet up now, not tomorrow nigga, today!", "[Verse]\nI’m in my stride\nBhad Bhabie you can \"Cash Me Outside\"\nKartel I been fucking with vibes\nHome plate so you know I'ma slide\nDon’t even try getting this chicken I’m out in Kentucky like it’s getting fried\nThey see the tide\nNiggas is drowning I’m driving the boat with a bag in Dubai\nNigga I’m fly, like a bird\nI’m the shit like a Turd\nRunning fades like I'm Dirk\nTurn a niggas face blue like the Smurfs\nMatter fact turn it red like my shirt\nIn my bag, niggas in they purse\nWanna verse nigga go to church\nGot it out the mud made from the dirt\n613 left did it first\nIce on my wrist quench a niggas thirst\nStraight to the bank jus like a clerk\n9/5 with it how I put in work\nI got chicken but I ain't no jerk\nI got franklins but I ain't no Kirk\nSo fucking sick might need a nurse\nRIP beat put it in a hurse\nIt’s a bike how riding it\nYou hate me but you on my profile and shit\nTop 5 no denying it\nIf the game was a plane I’m flying it\nIf rap was a bitch I’m wifing it\nDon’t miss hit like I’m sniping it\nBring the pain you might need a vicodin\nCouldn't mimic my drive if you licensed it\nDon’t hate though\nNiggas soft like Play-Doh\nGetting cheese like it's queso\nRap God peap the halo\nIt's Dax!\nThey wanna fuck with me because I got the shine\nAll my numbers moving quick just like it's Amazon Prime\nI got bars like a prison swear a nigga doing time\nI’m Tony Hawk underground 'cause I be always on my grind\nI bring the heat like hibachi\nConcentration be just like a nazi\nDip dive dodge duck dip dodgeball when I'mma see paparazzi\n'Bout to wake niggas up like some coffee\nNot even a goalie could stop me\nLike the fugees I’m killing you softly\nI be cheffing these beats I be saucy\nAin't it funny corny niggas always laugh at me\nI run tracks like a mufuking athlete\nDo do do do do ya exactly\nRed dot on ya head like it's acne\nI just made 100k in a week spent a K on the sneaks so I know niggas mad at me\nAnd every single time I hop on the beat boy you better think twice you don’t want rap after me\nSo switch\nNiggas be hating me now that I’m rich\nPussy lil nigga get off of my dick\nCalling you nose because you getting picked\nLilo my nigga 'cause you getting stitched\nSchoop a nigga through a back door\nDax only spitting facts though\nNiggas don't know how to act though\n2020 I’m coming for necks\nI’m like Nike the way I be coming for checks\nI be right at your throat like some strep\nLike a staircase my nigga you best watch yo step\nNo gym but I'm finna flex\nKilling songs with my nigga Lex", "[Intro: Dax]\nI don't know how to tell you this but\nI can't do it anymore\nAnd I was too scared to tell it in your face so\nHere it is\n(Dax, Peep)\n\n[Chorus: Lil Peep]\nNot Tonight\nI don't wanna talk at all\nBaby, it was just not right\nAnd this town was way too small\n(town was way too small)\nMaybe we could work it out one day\n(work it out one day)\nBut I'ma need a whole new year on my own\n(whole new year on my own)\nBut I'on want to stop there\nLet me stay for this one last time\nAnd let me take you home\n(let me take you home)\n\n[Verse 1: Dax]\nLast time we talk it was trippin'\nNowx when we talk it's a fight\nI can do non' right\nI just might go missing\nMissing, what we used to be\nI was changing, you were used to me\nTold you I was tryna change the world\nAnd you would have to write a frickin' eulogy\nI got a bag on me and I prayed up\nWorking lots while you was laid up\nI was tryna move to California\nYou were tryna stay, I had to save up\nSo I saved up\nGot my stuff, now I'm on the way\nTold you that I wasn't playin' games\nListen close 'cause all I gotta say, yeah yeah\n\n[Chorus: Lil Peep]\nNot Tonight\nI don't wanna talk at all\nBaby, it was just not right\nAnd this town was way too small\n(town was way too small)\nMaybe we could work it out one day\n(work it out one day)\nBut I'ma need a whole new year on my own\n(whole new year on my own)\nBut I'on want to stop there\nLet me stay for this one last time\nAnd let me take you home\n(let me take you home)\n\n[Verse 2: Dax]\nI don't wanna talk, I don't wanna fight, I don't wanna stay\nI don't wanna, wanna, wanna, wanna hear what\nI could've done or what I should've said\nI don't wanna pick up all the pieces, tryna stop the bleeding\nTook my shir and now I'm leaving\nOn your knees, I see you pleading\nShoulda never stopped believing\nGirl You had one chance to get it\nGirlx you coulda had the Benz, the Bentley\nNew plans, the man, demand was plenty\nGirl you coulda had the fashion trendy\nGirl you had my heart, yeah\nBut you lied, you know I tried\nBut you lied\n\n[Chorus: Lil Peep]\nNot Tonight\nI don't wanna talk at all\nBaby, it was just not right\nAnd this town was way too small\n(town was way too small)\nMaybe we could work it out one day\n(work it out one day)\nBut I'ma need a whole new year on my own\n(whole new year on my own)\nBut I'on want to stop there\nLet me stay for this one last time\nAnd let me take you home\n(let me take you home\n\n[Verse 3: Lil Peep]\nIf I didn't hurt you, I would keep you\nI can't believe that I'm never gonna see you\nIf I didn't hurt you, I would keep you\nI can't believe that I'm never gonna see you\n\n[Outro: Dax]\nI wanna hurt you like you hurt me\nBut I know that's not gonna solve anything\nSo I lay here, alone (dax)", "[Intro]\nAlbum of the year on the way\nDax\n\n[Verse]\nAlbum of the year droppin'\nNo hate to J but I'm cold so I got it hot like the summertime out in pure Harlem\nRap but I'm still ballin'\nI'm givin' niggas the buckets, I'm bangin' bitches, I been the best but I ain't chartin'\nThey say a nigga got Kardashian flow\nBars thick, make these niggas throw they cash at the rope\nSmack, it's ten K and a laxative bro\n'Cause I been shittin' on you niggas since I passed in the door\nIt's crazy, the flow addictive like the crack in the eighties\nThey bitin' styles, rap infective like it's written in rabies\nI'm searchin' files, niggas fake and they was never the baby\n'Cause I'm the realest rapper poppin' out vaginas from shady\nCole, yeah you have to hear me\nThe way I'm rappin' got these niggas scared\nSo they call me God 'cause they have to fear me\nFuck it, just ask Siri\nShe'll tell you I already make double than what signed niggas make yearly\nAyy Siri, how much I make a year?\nDax makes more than 90% of signed rappers yearly\nBitch so clearly, I'ma have these niggas shook\nI went to college and I finished, man I could've wrote the book\nThat you was tellin' niggas pick up, but where we from, we can't bend our head\nWe might get shot when a nigga come for the stick up, so the\nVocabulary could probably be enhanced\nBut I ain't riskin' havin' niggas come watchin' out, understand\n'Cause what I'm rappin' so much deeper than provin' another man\nThe education I received was just first nad not second hand, so me\nGrab my gang, learn the ropes, feel like Pac and Biggie\nYeah I fuck with mumble rap 'cause mumble rap ain't fuckin' with me\nCall up 50, he'll say it ain't a lie\nHe'll call me pussy 'cause he know I got nine lives\nTimes five, eyes wide, yeah my shit cross eyes\nSo when I rap I can see both sides, they lie, they try\nTellin' me I couldn't be a maverick\nWas a janitor before I got established\nWanna know what happened, I got sick of the chains that they had me latched in\nSo I broke 'em, got myself in rappin'\nThey ain't with the action, applause if they clappin'\nOnly time they fire shots is if they throw 'em in the caption\nIf we really talkin' fabrics, I'm silk, they cotton\nNiggas always pickin' niggas at the bottom\nWhy? so when they blow they can remind 'em how they got 'em\nAnd that anything they started could be finished if they stop 'em\nSo Cole, I don't know if this'll reach you\nBut if it do, and you hungry, boy my bars finna feed you\nSo before your bars send 'em to hell\nLet my bars take these trash niggas, throw 'em in jail\nLet my bars cop a deal, let me sign to the 'Ville\nMan it used to be a dream but it's startin' to feel real\nHah, it's Dax", "[Intro]\nMan, last time 2Pac came to me in a dream\nI was living in Wichita, Kansas\nOnce I moved to LA, I think it was so many things being thrown at me and [?]\nBut I'm back now, and I think that [?] caused him to visit me in a dream again\nAnd then inspired me to write this\n\n[Verse]\nI've been tryna talk, nobody listens\nNow I’m famous niggas say I changed, totally different\nI’ve been looking up to Pac since I started this mission\nSo they denounce me, man, I feel like I'm a fucking religion\nDon’t you act like you know me\nI can’t bear some of you niggas like yogi\nPeople hate but they will follow you closely\nSocial media’s a circus full of miss guided people who equate a fucking post to a God damn trophy\nMan you must be lonely\nAt the crib sitting by yourself\nPointing the finger at somebody with 3 at yourself\nAll these people spread shit (sheet) this not Excel\nThey don’t hate you, son, they hate themselves\nYes\nThis world is full of sheep\nYou can count 'em you don’t even have to go sleep\nThese people shallow swear they woke but they fake deep\nWatch a nigga drown we gon' ride on our enemies\nAnd that a fact facts\nIt’s been a while since we talked Pac\nRemember hit 'em up that mumble rap it ain't stopped\nIt’s been 2 years since that dream and I ain't popped\nMaybe if I slur my fucking words I'mma get hot\nSo what’s the vibe if they sheep then we leading the blind\nIf ones lost should we waste time and even go find\nAt what cost do we give up on these human lives\nLet me die or will God charge us for that crime\nIt’s all questions\nI think it’s connected\nIt’s good over evil but the evil get selected\nReplenishes by natural selection\nThis world's coming to an end\nSpend time, not money, with your family and your friends\nPac what direction should I head in\nMainstream star or underground legend\nRapper for the system or rapper for the wretched\nSwear I almost lost myself but now I’m back and I’m invested\nSwear I almost got caught up in the lifestyle\nLA living was LA pimping and fucking on these LA bitches\nBut now I’m focused\nAnd I’m back on track\nIt’s not about the fucking fall\nIt’s how you bounce right back\nSo now what Pac I’m two years older\nThat first dream wasn’t a fluke I had to build my shoulders\nAlmost lost my damn mind and my heart got colder\nBut now I’m ready for the war you can deploy this soldier\nSo gimme the chance again\nNo, I will not stop\nI’ll spit real til' the fake have to leave their spot\nYe you know I was a janitor when we last talked\nAnd now I’m cleaning up the game with that same damn mop\nPac do you hear me dawg\nI’m trynna make a change\nBut I ain't gangsta enough so they call me lame\nFuck the money, fuck the bitches, fuck the fame\nI realized that all I have is my damn name\nSo from here on out the only time, you’ll hear Dax is when it’s out his mouth\nI'mma make a fucking change and I have no doubt\nSo stay tuned and you’ll see what I’m talking about\nIt's Dax\n\n[Outro]\nI've got a lot of stuff [?]\nWhatever I drop next is gonna make an impact\nIt's Dax", "[Hook]\nIf I tell you that I love you, promise that I really mean it\nAin't nobody else above you, I don't even know the meanin'\nYou the only one I'm dreamin', you the only one I'm fienin'\nI don't need nobody else so baby girl why is u leavin'?\nBaby girl why is u leavin'? Baby girl why is u leavin'?\nBaby girl why is u leavin'? Baby girl why is u leavin'?\nI don't want nobody else so baby girl why is u leavin'?\n\n[Verse 1]\nWhy you leaving me?\nBaby girl why did you have to change the scenery?\nWhy you mean to me?\nYou a bitch and you done treat me like a dog\nSo you gon' have to see the G in me, G in me, G-G-G in me\nA B C D E F G, I'm out for all that creatine\nI remember when you cheated man I seen it vividly\nI'm about to kill your shit, expose you on the TV screen\nI'm talking 'bout that TMZ, you gon' hate me\nCan't believe I used to put up with your crazy\nAlmost tricked me into have a couple baby\nJust so you could eat off of my money and go crazy-azy\nYou like Eminem shady (shady)\nYou were never my lady (my lady)\nI won't let that shit faze, won't faze me\n\n[Hook]\nIf I tell you that I love you, promise that I really mean it\nAin't nobody else above you, I don't even know the meanin'\nYou the only one I'm dreamin', you the only one I'm fienin'\nI don't need nobody else so baby girl why is u leavin'?\nBaby girl why is u leavin'? Baby girl why is u leavin'?\nBaby girl why is u leavin'? Baby girl why is u leavin'?\nI don't want nobody else so baby girl why is u leavin'?\n\n[Verse 2]\nWait, hold up quick, this right here is tragic\nSuicidal, I might swerve the lane in traffic\nAll this pain, swear it is too much\nNow I'm in my feelings, I be rapping it like Russ, sooo-o\nThat's my soul, I said no, please don't go\nPlease don't go away\nWe were supposed to be\nGoals for everything, friends and family\nGoogle maps, I be chilling on my trap phone\nTinder swiping, I be tryna find a bad hoe\nCP3 I fuck 'em once and then I pass those\nOhhh-oh-oh\n\n[Hook]\nIf I tell you that I love you, promise that I really mean it\nAin't nobody else above you, I don't even know the meanin'\nYou the only one I'm dreamin', you the only one I'm fienin'\nI don't need nobody else so baby girl why is u leavin'?\nBaby girl why is u leavin'? Baby girl why is u leavin'?\nBaby girl why is u leavin'? Baby girl why is u leavin'?\nI don't want nobody else so baby girl why is u leavin'?", "[Intro]\nHa ha, I'm back!\nThis shit like ridin' a bike baby\nHey, shout out to Fat Joe and Scott Storch\nIt's Dax!\nHa ha!\n\n[Verse]\nThey say I remix songs, cause I can't get on\nThey did wrong, more spins than a CD-ROM\nThe dick long, from a distance they can see me calm\nI'm headstrong, more influence than Lele Pons, Koran!\nAnd you can put that on the Bible\nIf I ain't a God to these niggas, then I'm a disciple\nEither way you flip it, I done turned into an idol\nSo the niggas I would listen to done turned into my rivals\nYeah I do this for survival, do this for respect\nLiving legend on my stomach, I predicted I was next\nUnfazed by the game, got it tatted on my neck\nSo I ain't listening to words unless they written on a check\nYeah you better come correct, if you try and call me corny\nYou would say it on the internet, in person you the homie\nI already know these stories, all guts no glory\nGive a fuck about a hater, 'cause I made my own trophy\nAnyways, I'm a straight raptor\nBlack man, a slave master\nI slit past ya, too smart for white pastors\nThat kidnap ya, rape kids, then bring back to the whole pastors\nSay they hate black rappers\nSee, that ain't prime time news\nCould rap real but my shit wouldn't get no views\nI need zeros on my check, just to feed my crew\nSo real rap, I look back when the world comes through\nYou see my niggas don't dance, they shoot guns\nSome go to school, some rap, some hoop some\nSome got a kid cause a condom was a loose one\nAnd had another kid, but was broke and had to choose one\nSome got a job at working 9 to 5, struggling to stay alive\nGet back home at 6 then leave at 8 to working overnight\nGet a car to work to hit a lick and then be down a ride\nAnd pull up on a nigga, shoot him quick and then be down and drive\nWhoa, it's a fucked up world (fucked up world)\nI can't even go church they tried to fuck my girl (fuck my girl)\nI said whoa, it's a fucked up life (fuck!)\nI can't make a new friend, they'll try and fuck my wife\nSo I stay down, 10 toes, all grip (all grip)\nDon't shoot guns, but the bodyguard got one on a hip\nReal shit, I don't carry cash, just plastic\nNiggas rob you then they'll try and stretch yo bank like elastic\nDo flips like gymnastics, my raps be the classic\nWhen I drive, don't stop, I can move through the traffic\nTry and put me in the casket, bounce back like the basket\nWhen I'm balling on these niggas, I'm LeBron with the passes\nYour career be molasses, you ain't moving, you static\nGot it started in the basement, now I'm living in the attic\nKnow it sound tragic, niggas think this is McDonalds's\nYou can't fuckin' want it how you have it\n\n[Outro]\nWhere you at!\nBack to back!\nKeep working!\nDon't let these niggas detour you\nWhat ever your dream is, go grab it!\nYou're already here first\nIt's Dax!", "[Intro]\nThe next week is going to be\nIs going to be a 9/11 moment\nIt's gonna be the hardest moment for many Americans in their entire life\n\n[Verse]\nThis quarantine is got me feeling like I’m locked in a prison\nI got coffins for these beats they better stay at a distance\nWent to Costco for some tissue, they said two was the limit\nI saw a granny try to grab 'em, I had to fight her to get it\nEverybody turning animalistic\nNo supplies, no food, next the worlds going cannibalistic\nGoing crazy we all stuck on our phones\nThe quarantine Macaulay Culkin, this a movie we all home alone\nWe got Bills Mr. Gates\nI wonder how the doctors feel\nThey gon' have to go see doctor Phil or Mr. Gates\nBy the way, if you've ever talked behind my back that shits ok\nI might get sick if you come say it to my face\nThis shits pandemic, certified crisis\nI remember when corona was beer and not a man made virus\nI remember getting sick wasn’t shit\nNow we panic when we cough, sneeze, or feel like we got any type of sinus\nWhat we do now?\nOnly option is to pray\nIf you don’t wanna be six feet under stay six away\nStay home, hide your kids, wash your hands, be safe\nIt’s like a greyhound bus and it’s stopping in every state\nAin't it funny?\nHow them kids think it's funny\nAnd they wanna go and play on Spring Break\nStupid kids they gon' sleep\nIn the bed that they made and then be mad\nWhen them same springs that they have break, can’t escape\nShit is viral\nI was on it way before it hit the news\nThis is man made, click baited, automated views\nThis is way more deadly than the flu\nWay stronger than the devil, even he couldn't empty the church pews\nYou a fool if you think it's fake\nOn set symptoms after 14 days, until your lungs fail and you suffocate\nAssisted respiration by a ventilate\nMass population declutiration a reason to eliminate\nFrom Africa to Italy\nNigeria to Sicily\nThis virus 5G and has global connectivity\nThieving in the night as it creeps in your vicinity\nAnd robs you of your basic motor function capabilities\nSo my task before the world panics and runs out of all the masks\nBefore discrimination of Asians becomes something we let pass\nForgetting that the problem stems from something we can’t grasp\nBefore you yell conspiracy\nBefore you tweet you at Donald like it’s really gonna fix the situation, but you have no validity\nBefore the stocks plummet\nBefore every industry realizes that’s it workers who slave actually run it\nBefore total lockdown and depression and anxiety\nAnd long nights alone and no with contact with society\nThe riots, the tanks, 90 days of sobriety\nAnd social validation off IG notoriety\nBefore you go crazy\nWay before you choose the worst time in mankind to have a unplanned baby\nJust know\nWe're all part of the remedy\nWe're on the same team\nAnd corona is the enemy\n\n[Outro]\nStay home\nBe Safe\nAnd look out for check", "[Intro]\nEy shoutout to Futuristic and the One Take Contest\nIts yo boi DAX\nMake sure you hit that website and you vote for yo boi\nIf you dont ill stil love you though...\n\nHaha\n\n[Verse 1]\nIm not the kid that you used to know\nHoop dreams turned to stupid flow\nUp now can't relax fall down I bounce back\nIts the Pats at the Super Bowl\nUp ahead and I can not rest\nTheres no breaks to relieve my stress\nIts like chess how I move calculated type dude\nYou can never get ahead cause im on whats next\nSo choose tails\nBorn to win I refuse to fail\nBuilt to kill yes I will prevail\nTo send chills down ya neck, I demand your respect\nHeavyweight with the cheques\nHow I tip the scale [oh, yea]\nHow I tip the scale\nSlip quick I will watch you fall\nBecause how my flow switch up, options to much\nLike you stressed trying to buy at a shopping mall\nSo save money, funny I cannot be beat\nThe one takes all I need to disperse this heat\nThe two times what theyll need just to make me sleep\nIll stay up through the night and I won't get weak\nI got skills for bills, But I ain't been payed\nHis will, yes I will be saved\nOwn book Ima write the page\n6 feet but im up how i dodge the grave\nSee, cuz Im the kid that they wanna be\nMade jokes about ya boy now the calling me\nGot hot bars, all clean so they follow me\nDidn't believe in the dream we was arguing\nMe myself was the team no sponsoring\nHigh school hall of fame now they honoring\nIm the greatest in da making no pondering\nHad to fake it till I make it now im conquering\nSee, cuz the kid that I used to be\nWasn't ready for the hate and the scrutiny\nWhole life on display it was nudity\nNew to me, lunacy, took my old name had eulogy musically\nNow i go by Dax\nI Rip tracks like its gas why they call me ass\nCuz im the shit how I stink and the smell won't pass\nSo dont miss you could blink how I blow up fast\nYa you did I can tell you missed it\nGonna Win I can tell cuz im futuristic\nAll in you can tell that im optimistic\nEgotistic feeding on the opposition\nMy ambition rare theres no competition\nFight fair with there bars thats a demolition\nRealistically, you cannot defeat him\nDisability how I cause em weakness\nSee, 3rd place where the squabbles be\n2nd place, good job Ali Tomineek\nAll love over here but man honestly\nYall Ain't messing with the Dax man, thats comedy\nSo promise me please that youll watch my rise\nNo space for you guys like some thick ass thighs\nWanna try get fried like some dope ass fries\nWanna cry get swatted like some dumb ass flies\nCut like i said\nNot the kid that you used to know\nHoop dreams now its stupid flow\nUp now can't relax fall down I bounce back\nIts the Pats at the Super Bowl\nUp ahead and I will not rest\nTheres no breaks to relieve my stress\nIts like chess how I move calculated type dude\nYou can never get ahead cause im on whats next\nSo choose tails", "[Intro]\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\n\n[Hook: Bizkit]\nShe got that body-ody to make every man go\nShe taste so sweet remind me of a mango\nDon't want no strings attached, no I am not a banjo\nShe be ridin' ridin' my stick, like a lambo\n\n[Verse 1: Dax]\nI got a baddy on me\nYou hoes can get up off me\nShe keep me up all through the night\nThat’s why I call her coffee\nYou sugar sweet like toffee\nI’m hooked, so please don’t call me\nI trust her with my life, I'd even let her shoot the tommy\nOn lock like Django, she sweet tastes just like a mango\nNo drum for the bango, take two who you for the tango\nWe go like a long away, we fix quick when we split call it andale\nWe spread love, [?]\nWe [?] drugs, pharmacy\nShe got a big brain, lips hit\nIn the school, no kids\nWork out, slim thick\nWith that medium hook, if you talk shit\nIn the bitch, she mad rough\nThat face down, that ass up\nShe scream out \"That's too much\"\nI yelled back \"Don't act up\"\n\n[Hook: Bizkit]\nShe got that body-ody to make every man go\nShe taste so sweet remind me of a mango\nDon't want no strings attached, no I am not a banjo\nShe be ridin' ridin' my stick, like a lambo\n\n[Post-Hook: Bizkit]\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\n\n[Verse 2: Dax]\nI told that girl she fine, thank god she fuckin' mine\nShe let me hit one from my favorite spot, it's from behind\nI let her call me daddy, she knew that she a baddy\nShe back it up just like a trip, that girl she got a fatty\nWoah, she natural God did the thing, she masterful\nGot brain like a [?]\nNo fear but the girl been a [?]\n[?]\nYou bad bad, you lyin' you a actor tho\nYou mad, cause you ain't smashin' bro\nYou mad? Cause i ain't passin' bro\nGot a cute face, nice smile\nCute toes, dope style\nGood teeth, clean sheath\nGood feet, she worth while\nStay up, that's folgers\nHold down, like [?]\nI fiend that, she like crack\nI snort that, I smoke it\n\n[Hook: Bizkit]\nShe got that body-ody to make every man go\nShe taste so sweet remind me of a mango\nDon't want no strings attached, no I am not a banjo\nShe be ridin' ridin' my stick, like a lambo\n\n[Post-Hook: Bizkit]\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\n\n[Verse 3 Bizkit]\nYou remind me no, it's up to you\nNo attitude, I fuck with you\nI want that booty for breakfast\nI need the titties for dinner\nWhen I smack down one two three, I'm a winner\nNo conversation, I love it\nShe rub my belly, I love it\nWhen I poke her, ruh ruh\nNow she want me to cuff it\nOh goddamn, guess I got it, thank her momma for that\nWhat she get, that's a killa, all I been in system\nShe know why, I love the way, shake I gotta get it\nApple pie taste so good, even know it's a sin\n\n[Hook: Bizkit]\nShe got that body-ody to make every man go\nShe taste so sweet remind me of a mango\nDon't want no strings attached, no I am not a banjo\nShe be ridin' ridin' my stick, like a lambo\n\n[Post-Hook: Bizkit]\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\n\n[Outro]\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\nBaby, baby, baby\nDo you wanna be my lady\nOh the way you shake that ass\nMake a nigga go crazy\nBaby, baby, baby", "[Intro]\nPewdiepie, go die\nPewdiepie, go die\nPewdiepie, go die\n\n[Verse]\nFirst diss was a teaser, now I'm coming for blood\nFirst Rice, now the leader, I'm the internet thug\nI ain't scared of you neither, 'cause a couple of subs\nYouTube still my jungle, and I do it for fun\nPewdiepie 'bout to die, started strong and now you wack\nOG in the game, but it's time to give me that\nI ain't doing it for fame, fans told me make a track\nLittle fans gonna hate, 'cause I'm finna flame yo' ass\nPewdiepie, go die\nVideos getting boring, time to find a new hobby\nSee yo' ass on the street, type of white boy, guess ya name was Bobby\nYa mom call me \"Papi,\" I'll beat you like Rocky\nPewdiepie, go die\nI'll beat you like Rocky, ain't no way you could stop me\nCaught your bitch at a party, she top me so sloppy\nMight be pregnant, no mommy\nPewdiepie\nWhere you at, where you at? Finna find yo' ass, wanna watch you cry\nTake the \"P\" out of \"Pie,\" switch to a \"D,\" Pewdie and go die\nVideos in a room, need to switch it up, going out of style\nRicegum, type of guy tried to get it popping, probably won't reply\nPrick, you a dick, you ain't gotta say I'm lit\nYou and Rice faked a fight, so I took you both, turnt you to my bitch\nThey gon' say I ride the wave, dropping niggas' names, flexing to be rich\nBut I ain't caring what they say, still spit flames and I'm still the shit\nPewdiepie, go die\nFuck you and ya fan base, one question: how my ass taste?\nThey gon' hate and say I'm mad fake, but I ain't human, I'm in outer space\nI ain't hear a single word they say, too high for those Pewdie lames\nPewdiepie go die\nPewdiepie go die\nPewdiepie go die, die die die die die die\nPewdie go die, die die die die die die\n\n[Outro]\nThis is for the rest of the world, here is my plan\nI'ma manifest my dreams and turn you into a fan\nNo matter what, I'll succeed, the decision is in my hands\nAnd I'm telling you in advance that Dax is gon' be the man\nFollow me or follow me\nChoices that you got in a world that's full of monopoly\nNo matter if you hate it or love it, ya boy is profiting\nCan't deny the quality\nSo haters, if you hating, I beg that you hate, honestly\nClickbait, I'ma keep on doing that shit till you think straight\nI don't care about the etiquette, the views great\nGot my pockets feeling heavy, bodybuilder weight\nAll you haters is supplying for my family\nI won't stop, you gon' have to kill me\nDax is spitting facts is how I know that you gon' feel me\nOnly rapper out who truly's acting like the real me\nConscious but my content isn't nonsense, straight filthy\nI don't feel guilty for killing these fucking YouTubers\nListen, I don't feel guilty for killing these fucking YouTubers", "[Intro: Therapist]\nDax, come in, have a seat\nWe don't usually meet for another week, but...\nYou told me something was bothering you\nSo talk to me\n\n[Chorus]\nI'm a problem to my own damn city (Why?)\nI made it look easy\nWhen I tell 'em half of the things I did to get in the game\nNone of these niggas even believe me\nGot lucky, they say I'm overachieving (Ha)\nYou a god damn liar\nI was working, you was sleeping, I was hungry, you was eating\nUp late and every god damn night\n\n[Interlude: Therapist]\nDax, I understand they did you wrong\nBut you guys are all in the same boat\nWhy not work together\n\n[Verse 1]\nDon't you ever put me in the same bracket\nI'm breaking the march madness\nI'm shooting rappers on god damn sight\nDon't you ever compare me to what's average\nI'm killing it straight savage\nDestroying niggas, my god damn right\nSee, we was not meant to be\nShare a table with you niggas, I'm the centerpiece\nOne hunni with these bars like a centipede\nTryna copy, but you're not me, you'll need a recipe\nI told 'em not to fuck with the flow\nBandwagon, had to go and buy a boat\nSame niggas in the DM rejecting\nYou never see 'em reality at your god damn throat\nMotivate your life and calling me a preacher\nSame niggas steady begging for a feature\nNot paying, I don't need ya, Call\nDelete ya main jokes, I ain't joking, that'll teach ya\n\n[Chorus]\nI'm a problem to my own damn city (Why?)\nI made it look easy\nWhen I tell 'em half of the things I did to get in the game\nNone of these niggas even believe me\nGot lucky, they say I'm overachieving (Ha)\nYou a god damn liar\nI was working, you was sleeping, I was hungry, you was eating\nUp late and every god damn night\n\n[Verse 2]\nI am the most wanted\nSee 'em in my dreams, remain the most haunted\nShark in the pond, a fish, a big target\nPond to a sea remained a small market\n3-1-6\nOther rapper that you know that finna eat like this\nOther rapper that you know that finna feast like this\nBeats like this\nWho put a degree like this\nDrop thirty in a game and plays beats like this, None\nI'm the youngest but they still my son\nBigger market, nigga here I come\n\n[Outro: Therapist]\nBigger market nigga, here you come\nBut Dax, where are you gonna go?", "[Intro]\nMan got me a, just went and bought me a fidget spinner man, got anxiety, got to get rid of that, who else you know can make a song about fidget, comon Dax\n\n[Hook]\nYa, Fidget spinners, ya everybody got one\nDax part of the crowd, was feeling left out\nStraight down so I went and fucking got some\nGreen favorite color ya I had to get it popping\nTook the money out my wallet bought it put it in my pocket\nDamn!\n\n[Interlude 1]\nAll the hardest niggas In my hood have a fidget spinner\n\n[Verse 1]\nFidget spinners, ya I had to go and cop one\nIf you eint got a fidget spinner better rock one\nIf you eint spinning you eint winning\nBitches love it when you fidget, get her digits\nIf you got it you gon get it\nSo clean had to cop that\nSpinner favorite color green so I rock that\nGreen what it cost, whole team got it all black\nFidget spinning in a league better fall back\nFiend like we on codeine man it's all crack\nPut it on TV, whole world gon see on me it's trend and is so wack\nYa it's a trend and it's so wack\n\n[Interlude 2]\nSo take your left or right hand.. place it on the figdet and spin her, then repeat\n1:05\n\n[Hook]\nFidget spinners, ya everybody got one\nDax part of the crowd, was feeling left out\nStraight down so I went and fucking got some\nGreen favorite color ya I had to get it popping\nTook the money out wallet bought it put it in my pocket\nDamn!\n\n[Interlude 3]\nNaw, for real though the hardest niggas really do have fidget spinners\n\n[Verse 2]\nWent to the station ya you know I had to cop it\nTrending topic fidget let me spin it put it in my pocket\nOut my wallet ya I had to get it everybody talking\nJust to fit in you a witness now you know that I be ballin\nLike damn what we come to\nEverybody trying to trend like they some trend trend like they some trend trend like the some new\nGot a fidget started spinning now I feel cool\nEverybody fucking got one at my damn school\nSpinning all damn day like damn fool\nLook like a damn fool, true but I do too\nFidget spinning is true but I do too\n\n\n[Interlude 4]\nSo you can actially take them and put them on different parts of your body and do tricks with them, its pretty dope, repeat\n\n[Hook]\nFidget spinners, ya everybody got one\nDax part of the crowd, was feeling left out\nStraight down so I went and fucking got some\nGreen favorite color ya I had to get it popping\nTook the money out wallet bought it put it in my pocket\nDamn!\n\n[Interlude 5]\nYou can't role with me if you eint got no fidget spinner dude\n\n[Hook]\nFidget spinners, ya everybody got one\nDax part of the crowd, was feeling left out\nStraight down so I went and fucking got some\nGreen favorite color ya I had to get it popping\nTook the money out wallet bought it put it in my pocket\nDamn!\n\n[Interlude 6]\nAll the hardest niggas in my hood have fidget spinners", "[Intro]\nYou know...\nI went all the way to Canada\nBut had to come back because Somebody told me their might be a round two in the election\nSo all I gotta say is\nIf they cheated boy we need a round two\n\nHey!\n\n[Hook]\nRain drop, drop top (drop top)\nTrump got the dub and my heart stopped (dub)\nRussia tried to help that's a plot plot (plot)\nCooking up votes in a foreign spot (spot)\nHe went from business to presidential (hey)\nTrump tower, white house now residential (white)\nCall up the Russians they'll come and get you (gang)\nPolitics tripping this is an issue (hey)\nMy president bad and boujee (bad)\nCooking up votes with Vlad Putin (blaow)\nThe Donald is savage ruthless (crazy) (hey)\nIf he cheated we need a round two (Rrrah)\nMy president bad and boujee (bad)\nCooking up votes with Vlad Putin (blaow)\nThe Donald is savage ruthless (crazy) (hey)\nIf he cheated we need a round two (grrah)\n\n[Verse 1]\nUpset, whoo, whoo, whoo, whoo, whoo!\nVoted, got mad, went to Canada, had to come back\nCause' I heard of round 2. (two)\nI had to see if true (true)\nBoy that’s some fraud, Proof (grrah)\nInvestigate get to the root (hey)\nIf it’s true then it’s back to the booth (skrt)\n\nI told my friends that this cannot be (cannot be)\nCheating to win is just blasphemy (hey)\nIf its true man this shit is a tragedy (tragedy)\nCuz hilly hilly was a masterpiece (beautiful)\n\nAy, hacking for votes (votes)\nYeah, he did the most, (woo)\nAy, I hope it’s a joke bruh (waaa)\nPraying I’m losing all hope bruh (glah)\nWatched the news I bet they fooled ya (fooled ya)\nPicking sides they never neutral (hey)\nWhat they feeding is us crucial (dang)\nAnd we eating on the usual (eating)\nForce fed like a bad kid (kid)\nBrainwashed like a student (yup)\nMy prezi bad and plus he boujee (hey)\nThe system April but can't fool me (grrah)\nHacking on hackings, the safety is lacking\nI bet that be making they brains ache (ayy)\nWell not if its part of a scheme ay (scheme)\nMaking us think ya that way (think)\nForeign ties tight like a shoelace (tight)\nLike Nikes on right during pregame (nikes)\nHop in the booth, have a new race (skrrrt)\nIf they cheated it has go that way (hey)\n\n[Hook]\nRain drop, drop top (drop top)\nTrump got the dub and my heart stopped (dub)\nRussia tried to help that's a plot plot (plot)\nCooking up votes in a foreign spot (spot)\nHe went from business to presidential (hey)\nTrump tower, white house now residential (white)\nCall up the Russians they'll come and get you (gang)\nPolitics tripping this is an issue (hey)\nMy president bad and boujee (bad)\nCooking up votes with Vlad Putin (blaow)\nThe Donald is savage ruthless (crazy) (hey)\nIf he cheated we need a round two (Rrrah)\nMy president bad and boujee (bad)\nCooking up votes with Vlad Putin (blaow)\nThe Donald is savage ruthless (crazy) (hey)\nIf he cheated we need a round two (grrah)\n\n\n[Verse 2]\nPour up for straight justice, politics, can't trust it\nIntroduce ya to a party democratic, republican\nBroke it all down, bout da money, why they acting funny\nDon't vote too fast, I might shoot ya (huh?)\nSuper bad and boujee (super)\nWhy can’t we all be just neutral (love)\nStead of fighting becoming secluded (alone)\nThey told me i'm living in wonderland, call me Nwosu in a movie\nTold me can’t happen I'm stupid (can’t happen)\nLaughed and I told I'm cupid (funny)\nChange on my mind it’s a movement (change)\nUniting people through this type of music\nI pull up, I pull up, I pull up, I hop out with all of the love they just mop up (skrt)\nI’m cooking, I’m cooking, I’m whipping, I’m whipping\nWon’t stop, till da' badies get locked up (lock up)\nI told em relax, I come with no violence, no need to call all the cops up (chill)\nThese people they lie, and they slick, and busting for money man getting caught up\nYa that way, swaying the votes like Beyoncé\nYa that way, Can’t even vote cause my birthplace\nYa that way, young man just trying to make headway\nYa that way, won't stop till I get the whole world say\n\n[Hook]\nRain drop, drop top (drop top)\nTrump got the dub and my heart stopped (dub)\nRussia tried to help that's a plot plot (plot)\nCooking up votes in a foreign spot (spot)\nHe went from business to presidential (hey)\nTrump tower, white house now residential (white)\nCall up the Russians they'll come and get you (gang)\nPolitics tripping this is an issue (hey)\nMy president bad and boujee (bad)\nCooking up votes with Vlad Putin (blaow)\nThe Donald is savage ruthless (crazy) (hey)\nIf he cheated we need a round two (Rrrah)\nMy president bad and boujee (bad)\nCooking up votes with Vlad Putin (blaow)\nThe Donald is savage ruthless (crazy) (hey)\nIf he cheated we need a round two (grrah)", "[Intro]\nYou know when... You let somebody borrow some money?\nAnd then you ask for it back, and they get mad?\nWhat the fuck!\nBro, I was nice enough to give you my money, and now you taking pics like you got it when you don't, and plus you don't want to pay me back?\nYou crazy!\n\n[Chorus]\nI've been having problems with police lately\nI've been having problems with my old lady\nI've been having problems, tryna sleep\nAll these niggas on the street owe me money but they never pay me\nI've been having problems with police lately\nI've been having problems with my old lady\nI've been having problems, tryna sleep\nAll these niggas on the street owe me money but they never pay me\n\n[Verse 1]\nI've been having problems tryna get it back (back)\nNiggas borrow money, ask for a whole stack (stack)\nNiggas wanna act like they ain't got it then you help 'em with the money they don't ever wanna pay it back (back)\nNiggas steady acting like they broke (hah)\nTalking like they want it but they don't (hah)\nSteady taking pictures for the gram but when I tell 'em get my money they be saying \"leaving me 'lone\"\nHow gonna take a pic and try to flex\nHow you spend it on that ice on your neck\nYou the reason that my ass goin' crazy\nYou the reason I've been having problems lately\n\n[Chorus]\nI've been having problems with police lately\nI've been having problems with my old lady\nI've been having problems, tryna sleep\nAll these niggas on the street owe me money but they never pay me\nI've been having problems with police lately\nI've been having problems with my old lady\nI've been having problems, tryna sleep\nAll these niggas on the street owe me money but they never pay me\n\n[Verse 2]\nIf you ain't pay me then run it back\nIf you ain't pay me then where you at\nIf you ain't pay me, you crazy, please don't play me I'm bringing Dax type niggas to get you back\nNeed my money to make a track\nNeed that money to make it smack\nNeed that money, not funny, now I gotta go funny to help me raise some money to rap\n\n[Outro]\nMan, just... Pay me my money man", "[Hook]\nI got a lot of things to get of my chest\nWhere was you at, when I was working the battle the best\nIn the back, sweaping, cleaning and stacking these checks\nTo take 'em and spend 'em back in what you hearing respect\n\n[Verse 1]\nInvest in something that I do and believe\nBecome the person I would see on the screen\nRealise that realise is what I used to dream\nIt was nothing but time wasted when I used to sleep\nI got a lot of things I wanna tell you in person\nHow I changed, rearanged and became a new version\nNew name, plus fame made a conversion\nTwo points, not one so the timing was perfect\nI always knew that you would come right back\nOut in the shadows, they patient till I blew like that\nI was nice, let you ride out was cool like that\nLet it slide but knew inside that you move like that\nA snake in the grass, you was ready to bite\nTalks smack behind my back but spend my money at night\nSwing miss, never here when we needed a fight\nBut quick hands when you was leaning tryna mixing a sprite\nA fake phony, used to call you a homie\nWhen I was in the basement you play like you didn't know me\nNow I'm in the attic and you say now one lonely\nYou be all about my bread, an edition below me\nFuck you! huh, for tryna eat my shit\nI should've never let you feast cause you didn't work like this\nNights shifts, mob shit, put in work like this\nWalk blocks, dodge cops, on a curbs like this\n\n[Hook]\nI got a lot of things to get of my chest\nWhere was you at, when I was working the battle the best\nIn the back, sweaping, cleaning and stacking these checks\nTo take 'em and spend 'em back in what you hearing respect\nI got a lot of things I gotta get of my chest\nWhere was you at, when I was working the battle the best\nIn the back, sweaping, cleaning and stacking these checks\nTo take 'em and spend 'em back in what you hearing respect\n\n[Verse 2]\nHa, it's your boy Dax, I had to let you go\nYou was steady throwing shades so how your plan won't grow\nYou was steady in the grey zone, see in the show\nCause you was never making plays, you was comfortable\nAnd that's something I can't have, something I can't stand\nSurround myself with people who grind and got big plans\nSteady chasing greatness, not in it for new fans\nPatience that erasing and flexing for new brands\nIt's a fact, I will never put myself in that position\nAnd friend of me ain't a friend of me, turnt in that opposition\nI know there's more coming, I just pray I keep 'em distance\nThis is a message for you fakes, huh\nListen\nFucking come around me, man\n\n[Hook]\nI got a lot of things to get of my chest\nWhere was you at, when I was working the battle the best\nIn the back, sweaping, cleaning and stacking these checks\nTo take 'em and spend 'em back in what you hearing respect", "[Intro]\nYa knooww...\nI went all the way to Canada\nBut had to come back because Somebody told me their might be a round two in the election\nSo all i gotta say is\nIf they cheated boy we need a round 2\nHey!\n\n[Chorus]\nRain drop,(drip) drop top(drop top)\nTrump got the dub and my heart stopped (dub)\nRussia tried to help thats a plot plot(plot)\nCooking up votes in a foreign spot (spot)\nHe went from business to presendential(hey)\nTrump tower, white house now residential(white)\nCall up the russians theyll come and get you (gang)\nPolitics tripping this is an issue(hey)\nMy president bad and bougee (bad)\nCooking up votes with vlad putin (bloaw)\nThe Donald is savage ruthless (craazy)(hey!)\nIf he cheated we need a round two x2(rrahh)\n\n[Verse 1]\nUpset Wo Wo Wo Wo Wo!\nVoted, got mad, went to Canada,(mad) had to come back cause I heard of round 2. (Two)\nI had to see if true, (true)\nBoy that’s some fraud, Proof (grhhh)\nInvestigate get to the root (hey)\nIf it’s true then it’s back to the booth (skrt)\nI told my friends that this cannot be (cannot be)\nCheating to win is just blasphemy (hey)\nIf its true man this shit is a tragedy (tragedy)\nCuz hilly hilly was a masterpiece (beautiful)\nAyyy hacking for votes (votes)\nYuh, he did the most, (woo)\nAy I hope it’s a joke bruh (waaa)\nPraying I’m losing all hope bruh ( glah)\nWatched the news I bet they fooled ya (fooled ya)\nPicking sides they never neutral (hey)\nWhat they feeding is us crucial (dang)\nAnd we eating on the usual (eating)\nForce fed like a bad kid (kid)\nBrainwashed like a student (yup)\nMy prezi bad and plus he boujee (hey)\nThe system April but can't fool me (rahhhh)\nHacking on hackings, the safety is lacking\nI bet that be making they brains ache (ayy)\nWell not if its part of a scheme ay (scheme)\nMaking us think ya that way (think)\nForeign ties tight like a shoelace (tight)\nLike Nikes on right during pregame (nikes)\nHop in the booth, have a new race (skrrrt)\nIf they cheated it has go that way (heyy)\n\n[Chorus]\nRain drop,(drip) drop top(drop top)\nTrump got the dub and my heart stopped (dub)\nRussia tried to help thats a plot plot(plot)\nCooking up votes in a foreign spot (spot)\nHe went from business to presendential(hey)\nTrump tower, white house now residential(white)\nCall up the russians theyll come and get you (gang)\nPolitics tripping this is an issue(hey)\nMy president bad and bougee (bad)\nCooking up votes with vlad putin (bloaw)\nThe Donald is savage ruthless (craazy)(hey!)\nIf he cheated we need a round two x2(rrahh)\n\n[Verse 2]\nPour up for straight justice, politics, can't trust it\nIntroduce ya to a party democratic, republican\nBroke it all down, bout da money, why they acting funny\nDon't vote too fast, I might shoot ya (huh?)\nSuper bad and boujee (super)\nWhy can’t we all be just neutral (love)\nStead of fighting becoming secluded (alone)\nThey told me im living in wonderland, call me Nwosu in a movie\nTold me can’t happen I'm stupid (can’t happen)\nLaughed and I told I'm cupid (funny)\nChange on my mind it’s a movement (change)\nUniting people through this type of music\nI pull up, I pull up, I pull up, I hop out with all of the love they just mop up (skrrt)\nI’m cooking, I’m cooking, I’m whipping, I’m whipping\nWon’t stop, till da badies get locked up (lock up)\nI told em relax, I come with no violence, no need to call all the cops up, (chill)\nThese people they lie, and they slick, and busting for money man getting caught up\nYa that way, swaying the votes like Beyoncé\nYa that way, Can’t even vote cause my birthplace\nYa that way, young man just trying to make headway\nYa that way, won't stop till I get the whole world say", "[Verse]\nOne life to live, there's no rehearsal\nBlack kid in America, dreams of going commercial\nOnly probably purpose, if you ain't shooting the ball or shooting them all\nYour whole life is considered worthless\nYeah, it sound elementary\nUntil you realise, that those are the only guys\nThat will get in the documentaries\nHoop in the penitentiary, the only available option\nThe lie that they feed to you like a picture after they crop it\nChange criminal, took the scene\nSpeaking but they don't mean it\nWe hurtin', we need a crutch shot, Terrence, I saw him bleeding\nMedia so misleading, they say our grass greener\nBut Eric was the gardener and I don't think that he's breathing\nThey shooting his hands up, it's clear the can't stand us\nWe started 2:0 down, they told us stand back up\nFor what? 'Cause we ain't standing for the same reasons\nThey say serve and protect but they actions is misleading\nThe promise is deceiving\nDefinitions of change, the quality rearrange\nNo longer the same meaning so\nI'm not gonna stand, speaking out is my plan\nDefining the lives of a black man, this real\nAnd if it don't sell all well\nI catch L's on the lose and score like Odell\nThat's one life to live no rehearsal\nAmerican and I'm black and don't care if I go commercial\nI'm certain, this is my purpose, if shooting the ball is all\nI take it and miss long and fear becoming worthless\nIt's Dax", "[Intro]\nEy fellas, it's 2018\nYou can't just approach a female no more and say \"Hey ma\"\nYou gotta approach her real smooth like\nAnd say what's hatnin? haha tya it's Dax\nCome on fellas, I'm bout to teach you this game\nMake sure you was real close, you feel me?\n\n[Hook: Dax]\nI say what's happening? What's happening?\nWhat's your name? What's your style? What's your fashion?\nI say what's happening? What's happening?\nWhere you from? What you do? What's the brag? yeah\nI say what's happening? What's happening?\nWhat's your name? What's your style? What's your fashion?\nI say what's happening? What's happening?\nWhere you from? What you do? What's the brag? yeah\n\n[Verse 1: Dax]\nI say what's hatnin baby?\nWhere you from, is you new?\nI ain't seen you in my hood, what's your name? What you do?\nDid you graduate from college? Did you focus on the school?\nIf I gave you all my money, will you spend it on some shoes?\nGirl you different, I can tell that you have it\nSee you pull up on the street, I'm finna toss you to check it\nMotivated if you want it, I can tell it but grab it\nYou got the body of a god, but you don't even flash it\nCrazy, never seen it before\nSee you walking in the building, have to open the door\nClean up the floor\nThankful you don't grind on the pole\nSee I ain't move unless you move and then you tell me to go\nWoah, so respectful, you a different type [?]\nCan I get your number please, I wanna text you\nI ain't sending no nudes, won't sext you\nGirl, swear I'm different from the rest\nIf you gave my ass a chance, I'll be better than your best\nI ain't even tryna flex, other niggas be a mess\nI just really fucking hope I'm up next, tja\n\n[Hook: Dax]\nI say what's happening? What's happening?\nWhat's your name? What's your style? What's your fashion?\nI say what's happening? What's happening?\nWhere you from? What you do? What's the brag? yeah\nI say what's happening? What's happening?\nWhat's your name? What's your style? What's your fashion?\nI say what's happening? What's happening?\nWhere you from? What you do? What's the brag? yeah\n\n[Verse 2: Viandra]\nHe say what's up little baby what's happening?\nWanna know if you can keep up with the fashion\nFirst day and ain't no way that nigga smashing\nNo games [?] for the bragging\nHey, boy I got my own flex and I got my own check\nI ain't wasting no time, I be on to the next\nTryna keep up with a chick\nThen you better come correct\nI ain't other like these [?]\nBoy you better show respect me\nI ain't messing with you if you text rude\nTry me once, I be on the next dude\nTryna friend, like a damn bless you\nDon't beg juice\nBoy ya, let me [?] like it's dictionary\n[?] like a memory\nI wonder if you really really into me\nAre you ready for commitment to [?]\nYeah, cause I'm wifey\nAnd can't nobody do it like me\nNeed you to love me\nAnd never put no one above me\n\n[Hook: Dax]\nI say what's happening? What's happening?\nWhat's your name? What's your style? What's your fashion?\nI say what's happening? What's happening?\nWhere you from? What you do? What's the brag? yeah\nI say what's happening? What's happening?\nWhat's your name? What's your style? What's your fashion?\nI say what's happening? What's happening?\nWhere you from? What you do? What's the brag? yeah", "[Intro]\nAyy I don't give a fuck what nobody says, this my beat\nI run it haha, it's Dax, real bars, yeah, no bullshit, you ready?\n\n[Verse]\nNigga on top I can't stop now\nNow when I ride, got the top down\nBest in the game with a hot sound\nNiggas compare me to Pac now\nRide on my wave and you might drown\nSwerve in the lane like a cop now\nBitches be wantin' the pipe now\nI gotta tell 'em to pipe down\nRapping like me is not likely\nGod on my side, watch him hype me\nYou niggas trash, a crisis\nDon't want no beef, you scared, so type me\nSee me in person, won't fight me\nCame in the game like some lighting\nYou niggas rapping 'bout shit\nTricking these kids, man it is frighting\nViolent, never be heightening\nLook around, all of the violence\nCrime in America pilin'\nNiggas be going to jail, they can't pay the bail, you niggas be lying\nHad to come here and enlighten\nHad to come give you the facts, trapping is wack\nYou might get a stack\nYour daughter at home, your mama still crying\nBlacks in America dying\nTrump in office, he wildin'\nDroppin these bars for fun, we going to war\nBut look at the timing, buying\nThey put me in chains, confined me\nI'm rapping the real but can't get a deal\nThese niggas is not replying\nWhy the system be falsifying?\nThey say that I might be crazy\nThey say that my shit too real\nThe reason that they cannot play me\nIndustry cannot detain me\nA cross of Pac and Baby\nI've been to hell and back, that's why they say they cannot save me\nAin't poppin' no pills, I stay in the field\nThese niggas is fakes, they mad that I'm real\nI see that you broke, don't know how that feel\nYou gave up your life by signin' a deal\nMight shout out to Kaep for taking a kneel\nMight shout out to Jag for rappin the real\nMy bars is guns, they can't conceal\nThese niggas dumb\nNot a rapper, I be in my own division\nSave the world by 2020, nigga I be on a mission\nI just started and I'm right exactly where I had envisioned\nNiggas blind, that's why I rap, to clear their motherfucking vision\nFucking on the game\nFucking on you bitches who've been fucking for the fame\nI've be getting rich and dodging niggas who ain't changed\nTried to tell my shooters, had to read [?] out the chain\nWith a bitty lil name, lil nigga you ain't gang\nYou not, circle small, like a dot\nKeep it tight 'cause people like to come and try and make you fall\nI've seen it all, it's fine\nThey'll try and stop your shine\nThey snakes, still smile up in your face but talk that shit behind, behind\n\n[Outro]\nI seen it all baby, watch out for these snakes in the grass\nThey sayin' just enough to your face to keep you happy\nThat way in case you do make it, they can say they been there\nAyy DJ cut the beat, cut the beat\nHip hop is not dead and never left\nIt's just a book collectin' dust I found on the shelf\nI don't care if you wanna read it or anybody else\n'Cause I'll turn myself to Jesus and resurrect it myself", "[Verse 1]\nIn 2018 was a warm-up year for a nigga\nHad to get a stretch better yet get a sweat\nNow I'm ready and I’m finna go to war with you niggas\nI was down 20 in the 4th tripled up now I'm really bout even up the score with you niggas\nI was chilling in the back\nNow I'm sitting in the front\nSo you gon have to open up the door for a nigga\n\nFACTS!\n\n[Verse 2]\n2019 your boy already made it\nSee the future for a nigga like mats on radar\nNiggas try to label on I’m a youtube rapper then he (?) got them chains cause niggas couldn't pay em\nHad a couple labels tryin tell he was wack said fuck you I wouldn't let the money change it\nBout to go ahead and put bars on a mat\nMumble rap, Fight back, even God couldn't save em\nCouple nig-gas saying they better then me bet, Nigga I don't give a fuck\nSee em at a party same ones talking shit be the ones on they knees snortin coke of a butt\nDrinkin lean outta a cup\n\nThat's a real ass story\n\n[Verse 3]\nListen, half you niggas jumpin shit like KD now I'm on so you wanna be on my team\nI'm a D wade nigga make a man like Lebron\nWanna leave home and play for the heat\nEducated nigga with a grind for the streets\nMade my own traction like Odell in some cleats\nBeen droppin bombs on you niggas like Osama I’m a terrorist whenever I be rapping on a beat\n\nMartin Luther King got a dream it was me nigga\n\nTHAT’S FACTS!\n\n[Verse 4]\nI don been to hell\nCame back\nRelapse\nWent back\nNo cap\nJust to resurrect rap\nNiggas straight lost\nGPS no bars\nMan they couldn't even find them if I put em on a map\nThat’s the nation be the studio\n20 white boys in a room with a tape just to write one track\n\nNigga you the lie, facts\nTwo face\nHop off your beat, back on blueface\nOG's greeted with the clout like it's kool-Aid\nTory lanez bout to have a toupee in a few days\nJust met Lebron and, Drake on Tuesday!\n\nThat's real shit\nReal story\nKeep it goin x5\n\n[Verse 5]\nTwo girls one cup nigga I’m the shit\nOne mil for a deal when they off with him\nI said nah take that\nRetractable\nBack at it with a couple more commas in\n90k for the wrist\nWhat the cost of them\nJust head T with the queen\nI been rockin em\nI get green like a Rastafarian\nAnd shit on niggas like Barian\n\n[Hook]\nI say four forty a four just forty forty dub\nI'm bout to sing all this shit\nNigga wait for it\nWhat he say what he\nI got a four forty a forty inches of vertical\nBad bitches, titties and a fuckin\n\nIT'S DAX!\n\n[Verse 6]\n1+2 is 3\n2+3 is 5\n3+4 is 7\nDax is a dog\nThat means Dax is goin to heaven\nI ain lie\nJust like a wedding\nGot it on lock\nJust like impression\nI'm in your head just like obsession\nI got a secret now I can tell em\nJust heard a nigga was talking that shit so I shot then I just went and compressed him\nThis ain't a school, class\nAw shit, Nah It's done", "[Intro]\nWhoa whoa\nCome on baby, stand up\nYou know how it is, It's ya boy dax\nWe back at like a bad hab, baby\nGet up off yo' feet, you feel me?\n\n[Chorus]\nSee, I'm a mover a shaker, I got, needed a baker\nI took my shit out to Cali, I could be hooping from Lakers\nI got a rep, I'ma play, I drink my liquor, no chaser\nI got a fetish for dentish\nI'm saving rap while I slay ya\nSee, I'm a mover a shaker, I got, needed a baker\nI took my shit out to Cali, I could be hooping from Lakers\nI got a rep, I'ma play, I drink my liquor, no chaser\nI got a fetish for dentish\nI'm saving rap while I slay ya\n\n[Verse 1]\nFucking niggas tried to get me\nBut I know you fakin'\nI'm graduated and took myself straight up out of the basement\nGot myself on the playlist, Spotify making payments\nBeen rapping less than a year, but anointing myself the greatest\nWho you know rap like this?\nUnderrated, ain't even up on the map like this\nWho could play the track like this?\nBrad, Back it up and fucking act like this\n\n[Chorus]\nSee, I'm a mover a shaker, I got, needed a baker\nI took my shit out to Cali, I could be hooping from Lakers\nI got a rep, I'ma play, I drink my liquor, no chaser\nI got a fetish for dentish\nI'm saving rap while I slay ya\nSee, I'm a mover a shaker, I got, needed a baker\nI took my shit out to Cali, I could be hooping from Lakers\nI got a rep, I'ma play, I drink my liquor, no chaser\nI got a fetish for dentish\nI'm saving rap while I slay ya\n\n[Verse 2]\nSee, I'm a-\nJust know that, better know dax\nWe taking over the game, It's a known fact\nI'm pushin' one whole back, I did this shit so fast\nGet classed, it ran track on them niggas and did laps\nBetter know this not a fantasy, you cannot damage me\nSounds me like a puppet conformed me and tried to manage me\nTake me off of this planet when I created the galaxy\nTook you, Put you in orbit and let you be in the family, uh\nNigga that's fucked up, Probably ain't gon' happen\nMy shooters is drug users, you playing we get dispatched\nNo twitter, finger, no captions, no talking behind your back\nWhen we pulling up on location, invading\nWe fucking blasting, blasting, blasting\n'Bout that action, we split you up, that's a fraction\nIf you talkin' out yo' ass then you bloody, call it new fashion\nBloody shoes be yo' feet, have you reppin' 'em like you caught it\nCut yo' dick and make you eat it and turn you into a Bobby\nHehe, we would turn you into a Bobby\nHave you pops and pills fucking up at a party\nHaha, puffin' up at a party\nListen, why?\n\n[Chorus]\nSee, I'm a mover a shaker, I got, needed a baker\nI took my shit out to Cali, I could be hooping from Lakers\nI got a rep, I'ma play, I drink my liquor, no chaser\nI got a fetish for dentish\nI'm saving rap while I slay ya\n\n[Verse 3]\nLet me tell you something\nI'm the baddest nigga in the fucking joke budden\nBeen a savage when they see me, niggas go runnin'\nYou frontin' if you say I ain't gon' beat nothing, sound bumpin'\nDrunked up, and good loving, no cuffing, dick stuffing, bad bitches\nBeen with it, whole story been written\nTaking over the nation\nThey won't give me the radio, so I'm taking the playlist\nWhy? 'Cause it's a new era, new king, the name dax\nTo see kill, shoot, beats, and blazed tracks\nYou must eat, real feast, and break backs\nI can't stop, my fam broke I need cash\nThrowing the brake, foot on the gas\nFoot in they mouth, foot up they ass\nGive me the beat, give me the bag\nBeatin' it up, givin' it back\nNiggas is trash, cannot relate\nNigga the man, cannot debate\nCannot create, can I delay?\nBeen in the game, here is some change\nHuh huh\n\n\n[Outro]\nYou can't even talk but if you wanted too\nI swagged it", "[Chorus: Dax]\nThis is all we got\nA dollar and a dream, this is all we bought\nTo pop, pop with the team after all we cop\nThe 4 5 is the dream and we dream a lot\nSo talk shit nigga\nThis is all we got\nA dollar and a dream, this is all we bought\nTo pop, pop with the team after all we cop\nThe 4 5 is the dream and we dream a lot\nSo talk shit nigga\n\n[Verse 1: Dax]\nThis is all we got, no plan B you will C\nHow I seek destroy, yes all D's\nKill every beat pop pop, it's all E's\nGet a \"A\", no F, remain a straight G\nI'm the alpha, bet\nBeat is like a bitch when I fuck wet no sweat, break her back\nBend her over, slap her ass, pull her weave, take her tracks, ya\nShe fucking like it like that\nSo I'mma lean with it, rock with it\nOnly option, we are not kidding\nJust started, all in it, we will not finish\nKeep grinding, all dubs till we all winning\nMe and K.A.A.N in it, spread to every continent\nNot cocky nigga, confident\nNo nigga not consciousness\nI'm speaking like I got a doctorate\nSo let a nigga try to doctor it\nHe can't, it's mine, it's mine\nBetter with age so we stage like the finest wine\n'Cause I could fade off a play in a hoopers prime\nI'm up next, all net, deserve to shine\nI'm braggadocious, far but the closest\nSplit with the game but claim just like I'm Moses\nChillin' with my main, my side don't get posted\nGhost with the fame, you lames was not chosen\nYou frozen stop holding, ketchup\nIt must hurt you, must heard that I'm on top and you playing backup\nClearly never a matchup\nMe and K.A.A.N is shooting, they saying master\nPreaching, they screaming pastor\nScheming and moving faster\nYou still reading, we on to the next chapter\nListen, sorta crazy but we hear it a lot\nIt's just normal to a nigga 'cause it's all that we got\n\n[Chorus: Dax]\nThis is all we got\nA dollar and a dream, this is all we bought\nTo pop, pop with the team after all we cop\nThe 4 5 is the dream and we dream a lot\nSo talk shit nigga\nThis is all we got\nA dollar and a dream, this is all we bought\nTo pop, pop with the team after all we cop\nThe 4 5 is the dream and we dream a lot\nSo talk shit nigga\n\n[Verse 2: K.A.A.N]\nAnd we've been, dreaming since some adolescent youngins\nBack when they told us we wasn't nothing\nBack when there wasn't an opportunity to change my reality\nEvery effort given was lost within futility\nI couldn't tell you what it means to be free\nI've been working like a slave trying to master the beats\nThe roots is too deep, my black thoughts they're setting\nOn a quest for love like Illadelphia Legends\nI Kick, Push like Lupe, no skateboard\nHeating up like butane, you lukewarm\nKick shit like Liu Kang, you've been warned\nThere's two sides to everybody, I've been torn\nThe positive and the negative, hope I find peace\nThe middle ground is the balance, that's what I really need\nThey speak upon it daily but they never pay attention\nLearn a valuable lesson from being something that I'm not\nThat's closed off and cold with no contact (contact)\nI rose from the ground, but I bounce back (bounce back)\nI rose but I grew from the concrete with a crooked stem and pedals that don't sit right\nLiving life to the fullest\n'Cause it can end quicker than a blink of an eye\nAnd you reflect upon it all, then realize that you are wasting your time\nCan't get that back and that's frustrating\nDon't worry about it, it's all love baby\nYou can be anything you wanna be, believe\nNever fallin' for the fake shit I see\nIt's all sick like used needles and I.V's\nClear view like Visine, my mind been moving at a pace most can't keep up with\nPeace to the next, with all due respect\nI just vent upon these records 'bout things that I can't accept, lawd\n\n[Chorus: Dax]\nThis is all we got\nA dollar and a dream, this is all we bought\nTo pop, pop with the team after all we cop\nThe 4 5 is the dream and we dream a lot\nSo talk shit nigga\nThis is all we got\nA dollar and a dream, this is all we bought\nTo pop, pop with the team after all we cop\nThe 4 5 is the dream and we dream a lot\nSo talk shit nigga", "[Intro Round 1]\nYeah yeah\nThis one's like an open diary\nGet in my feelings for this one\nFire in the booth\nYah listen\n\n[Round 1]\nI noticed that you didn't notice\nI was focussed when you didn't focus\nI ain't married but I'm still a Joseph\nHad to part ways with my bitch cuz she cheated\nSo I pulled the Moses\nSeperated sanity from psychosis\nDiagnosis, heartbroken story of a dying poet\nTransgressions from my past agressions\nI learned a lesson and Imma add a lesson\nNot to trust a bitch or my dog if there was a difference (yeah uh)\nAnger inside, where it always resides\nCharlie Sloth let me cry on this mic\nDying to live or living to die?\nTwo questions that I ask myself before I fall asleep at night\nI'm an artist so my pain is a prosperity for others\nSo I'm forced to turn this darkness into people's light\nBut the weight is getting heavy and at this rate (uh)\nIt has me contemplating suicide\nSo it's a\nDifferent day, same book, different page, different people I don't even know they names\nIn a different city, on a different stage, rapping words that I used to write when I was underpaid\nYeah I'm getting old but I'm stuck in my old ways\nRunning from the cops\nGoing back to my old days\nTry to cut me off, back on my road rage\nThese people ain't loyal\nSo who am I trying to impress?\nHow can I love somebody else if I don't love myself\nHow can I sign if I'm trying to save lifes and all the label wants to do is take my shit and put it on that shelf\nWhy don't depression have an off switch?\nWhy can't I find a bitch to ball with?\nWhy everybody wanna talk shit?\nSmiled in my face, stabbed me in the back\nDo whatever it takes to put me in the coffin, and often\nI think about the consequences, are they real or are they comprehensive?\nWill I ever make it into heaven?\nWill my music turn into a weapon?\nWill I ever get an answer to a fucking question?\nWill I ever finish first to have to settle second?\nWill I ever be blessed or will I be the blessing?\nDo I have to sell my soul just to have a presence?\nIf I die right now will I be remembered?\nSo I take a sip, pop a perc\nWhy? because they help me work\nHaving conversations with the devil never ease the hurt\nHaving trouble calculating, finding what I'm really worth\nPost a pic, 50K likes if I don't got a shirt\nBitches in the DM, I don't see 'em unless they finna twerk\nBring 'em to the crib, dick 'em down, pussy in the hearse\nAll this fucking fame but it really feels like a curse\nI don't even know\nSo let me finish my diary off strong\nCouple minutes I hope it ain't too long\nOnly way I know to deal with the pain is to take it and disperse into songs\nMan I really fucking hope that I can write my raws\nMan I hope fire in the booth puts me on\nMan I feel so weak but this shit makes me strong\nIt's Dax\n\n[Intercourse]\n\n[Intro Round 2]\nThis is for everybody out there who has a dream man\nIt's dax\n\n[Round 2]\nI gave up hooping for these rapping ways\nI told my momma we’d see better days\nI’m going hard like when I masturbate\nI guess I never passed the age\nI remember days I didn’t pray and now I’m on my knees that shit was just a phase\nI garnered fame but I ain't never changed\nThey say I’m humble but they didn’t know I’m staring death right in the face\nForcing me to calculate think bout every move I make\nThey could never take me I’m a guardian of heavens gate\nNow I’m here captivate\nMoving at a rapid pace\nNothing into something now it’s Dax the one they can’t erase\nSeperating fame from actuality I navigate while moving through a see pessimistic people that are fake\nImitate, innovate, educate, infiltrate\nSeparate, segregate, all just to accelerate\nA path that I was destined on to walk and I refuse to wait\nFor someone else to crown so I named myself the heavyweight champion\nIf I get knocked off I will be back again\nThose who didn’t believe I closed my eyes and turned my back on them\nSpeaking mediocrity don’t understand like Manderin\nSo if it ain't success man I ain't picking up or answering\nI'm the one who put myself here\nI’m the one who told the devil fuck off it’s only God I fear\nI’m one who put the stars into alignment\nHad a Dream and then collided it with work and then I named it perfect timing\nI’m the one that fell down, bounced back, relapsed, got lapped, reclassed but never fell off track\nFighting demons in the evening overnight while I was sleeping $7.25 an hour was the wage no cap\nI am definition I don’t lack skill I lack recognition\nI don’t have dreams I have premonitions\nEvery single word I spit is ammunition\nGassing on the competition\nNever break a sweat this shit is practice like an exhibition\nFuck permission I ain't never asking I don't need forgiveness\nThat is weakness\nOnly time I bow is when I'm meeting Jesus\nThat is genius\nSo what you gonna say\nWhat you gonna do\nHow are you gonna let a janitor nigga outperform you\nI came from the bottom and I swear I'm here to warn you\nNot everything I do is destiny cause I was born to\nSeek and disarm you\nEat in regards to every single rapper verse meet the straight partial\nOn the fucking mission that's comparable to Marshall\nIt's Dax", "[Verse 1]\nSee, it's a murder when I slide out\nI ain't tryna hit the studio with niggas just to smoke so we can vibe out\nI put the studio in my house\nYou want a feature?\nYou can pull up to the crib, I'm holding tryouts\nFuck ass, I be coaching these niggas\nJust bought a pack of cigarettes cuz I be smokin' these niggas\nNo Lil Nas X but I be choking these niggas\nThat's a metaphor, I'm really just joking with niggas\nMy money make 'em do dances, they ain't keepin' up\nThis ain't Kardashian, my life is your caption, your dreams are my passion\nWhen I touch a mic I go Jackson, then moonwalk on niggas, I'm not from this planet (uh)\nNeeda cool off\nI've been known to fuck a groupie with my shoes on\nI've been known to take an IG model out to eat and make 'em pay for the bill knowing god damn well I got a coupon\nI'm nasty\nBars all supreme no patty\nMake a nigga see double just like Mary Kate Nashy\nChristmas presents is the only time a nigga outwraps me\nPresently the future, you ain't puttin' nothing past me\nI'm an Uber, you a taxi, I can not give you a lift\nI'm rich, but we ain't never talk like Maggie, no Homer\nImma hit you and release a whole family\nFuck Marge and sell Bart for couple lil' xannies\nSee, my niggas don't dance, we rap\nA white girl had dated a nigga and then think she's black\nNiggas broke, no cheese unless they eatin' some Mac\nMy punchlines got punchlines so when I hit the beat it snaps\nI'm not Jack\nYou can't put me in a box\nI'm In 'N Out real quick like a routine stop\nUnless you black getting frist by the cops\nI went to jail for a fucking parking ticket, now I feel like Pac\nThat's right\nI done learned from the greats\nStudied videos of 2Pac way before I was eight\nIf you slept, too late, me and Scott leave you storched\nYou need sunscreen or your ass gettin' baked\nI don't fuck with the fake\nWhen I rap it's one take\nCanadas' taking over, man, shoutout to Drake\nAll love, no hate\nNow hit your boy with a feature\nFun fact, y'all didn't know I go to church with Justin Bieber\nI be ridin' on the beat\nI be slidin' on the beat\nPeek-a-boo with the bars, you can't find me on the beat\nPikachu with the bars, it's like lightning when I speak\nAnd I don't ask niggas questions, why? Cuz I teach\nT.D. Jakes with the bars how I preach\nMill in the bank, shoutout to Meek\nCouple niggas hatin', sending in the nose bleeds\nBut they on my newsfeed and follow me on IG\nIf you tryna fuck baby, Imma need an ID\nSo sick with the flow, I need an IV\nCan't see me John Cena like a nigga chinese\nTwo bitches on go and they twin siamese\nBars fat, obese, I'm Asgard, lowkey\nTim Westwood Freestyle, my CTV\nIn the UK with it, yeah I traveled overseas\nBig black confident, I'm a BBC\n\n[Outro]\nThat's it\nIt's Dax baby\nHahah", "[Hook]\nI can tell that you ain't speaking my language\nIn english and spanish, my nigga that's the gang shit\nThe gang shit, the gang shit, the gang shit, the gang shit\nTell your niggas that we all about the gang shit\nType of niggas shoot your eyes close no aim\nAin't no snitching if you in game no lame\nPull up on you (skrrt) bang bang get the name\n\n[Verse 1]\nGang enormous, [?] that's [?]\nSell your soul yeah that's a [?]\nF-F-Four I get a porsche\nWith a corner, ahh, nigga need a donut\nSnitching you get [?] the shit ain't hard boy that's a boner\nUse a condom for your boner\nYeah the girls sway\nBest believe she do cause she been fucking with a gang gang gang\nNo stop [?] like the [?]\n[?] we ain't worried by a thot thot thot\n\n[Hook]\nI can tell that you ain't speaking my language\nIn english and spanish, my nigga that's the gang shit\nThe gang shit, the gang shit, the gang shit, the gang shit\nTell your niggas that we all about the gang shit\nType of niggas shoot your eyes close no aim\nAin't no snitching if you in game no lame\nPull up on you (skrrt) bang bang get the name\n\n[Verse 2]\nYou a..", "[Intro]\nIf drake can go from the greatest, to one of the greatest rappers out\nAnd Hannah Montana can go from that show, to where she at now?\nI can go from mu'fucking YouTube and diss tracks, to one of the greatest ever(LA here I come)\nPut your?\nShout out to Lil Pump for the beat Esketit!\n\n\nWho da man, Who da man, Who da man, Who da man, Who da man, Who da man\nDax is, see you hating but you still a fan\nAny rapper get to thinking, imma kill em then(Kill em then)\nDumb niggas you be dreaming like you peter pan, I Stevie Wonder niggas when I'm rapping I don't see em then\nI got it crackin in the middle of the map\nI know you wonder how it happened\nI peter pipad ya bitch again\n\n\nThe best rapper yeah you know that I'm hot\nIf you coming back at me you really dissing a god\nI don't know if imma make but I'm taking a shot\nI'll be a top 10 rapper when the mixtape drop\nMixtape hit, Diss God you a YouTube bitch\nYou let RiceGum fuck now he YouTube rich\nWrote his shit, probably went and rode his dick\nNigga how the fuck it feel to be a YouTube clit\nLemme warn you boy you dealing with a monster\nOwn shit, I got it cracking no sponsor\nJake Paul, PewDiePie, RiceGum, Team 10, you next all dead\nI'm Cancer\nYou the type to go and rock a male romper\nKiss Pontiac, bend him over, let him pop ya\nSaid you was on top, that's why I went ahead and dropped ya\nThe real king the Dax the throne imma conquer\n\n\nPontiac, Pontiac, KSI, KSI, KSI, next\nKnow that I'm the best , but they ain't showing no respect\nSo I done went ahead and gripped it started shooting at they neck\nNo shirt on cuz I'm all about the flex\nStill in school nigga who the fuck they gonna test\nNiggas don't respond it ain't a problem God told me that's what happens when these niggas fucking know that you is blessed\n\n\nWho da man, Who da man, Who da man, Who da man, Who da man, Who da man\nDax is, see you hating but you still a fan\nAny rapper get to thinking, imma kill em then(Kill em then)\nDumb niggas you be dreaming like you peter pan, I Stevie Wonder niggas when I'm rapping I don't see em then\nI got it crackin in the middle of the map\nI know you wonder how it happened\nI peter pipad ya bitch again\n\n\nWarning for you niggas prolly shouldn't respond\nI'm the king of diss tracks man, that's word to Lebron\nI ain't even fucking trying boy I did this for fun\nIf you come back at me imma fuck on yo mom, fuck yo girl, fuck on yo sis, fuck on yo wife\nLil niggas didn't know it's Daxnation for life\nEverybody keeps on telling me I'm wasting my time\nThey don't realize I've only been at it for 9\n\n[Outro]\nMonths that is man\nOne of the greatest rappers to ever do it already, check my discography nigga\nDiss God where you at?\nPontiac you next\nKSI...\nLUNCHMEAT!", "No official release date has been posted for this track by Dax. Lyrics will be put on this page once the song is released", "[Verse 1]\nDiss Tracks sorta stupid now, think it's time I fucking graduate\nYoutube on my dick now, think I'd rather fucking masterbate\nPewdiepie said a nigga nice take a real nigga to congrajulate\nFuck a ricegum, fuck a Jake Paul, niggas won't reply cause they scared of me\nFuck a team 10 nigga ASAP, shitty rappers this is real rap\nFlow nice, and the voice tight so can't waste my time of fucking diss tracks\nAll love over here dough, Dax finna be ya hero\nHow that nigga get a sub count when them shoutouts was on zero\nThere was no help, there was no team, it was all Dax nigga all dream\nNigga no green in my waist though, shit only move when I say so, I'm bout pesos\nNow I'm paid though, my flow wet barbados\nI get cheese, they lactose, they chip dipped I'm queso, nigga\nHow they feeling cuz I'm finna be the best dough\nReal rap shit I eint fucking wit the rest thogh\nReal rap hits make u choke take a breath dough\nReal fast shit I'm the goat u can take notes\nAll day, dunk on you das ball game\nStarting rapping 10 months boiii and I'm straight ready for the hall of fame\nNo talking no parlaying, crossed over dey all sprained\nOwn lane they crashed in it no geico they false claims\nNigga all blame is on me and I'm taking it\nLil tess gotta booty and I'm spanking it\nHere Dax on track they crakin it\nTurn hater to a fan you can bank on it\nBest youtube rapper they thanking him\nWhere he at been hiding they been saving him\nBut he back name Dax they praising him\nTell flight to react stop playing wit him\n\n[Hook]\nReal rap, you all wack\nCan't see me, that boi Dax\nDon't play dat, just say that\nNo more time for disstracks\nReal rap, you all wack\nCan't see me, that boi Dax\nDon't play dat, just say that\nNo more time for disstracks\n\n[Verse 2]\nI hate to graduate, I know it's finna be the saddest day\nLogan Paul eint get a disstrack so I know my fan base finna be mad at me\nBut gradually, you will laugh with me\nWasn't wasting my talent, now I'm on and found me someone to manage\nNathan James I found me someone plan it\nYear from now I'll be the best on the planet\nThe realest nigga ever did it\nOnly getting started nigga you witness\nI been in the kitchen cooking like a chemist\nWay I'm spitting fire nigga need a dentist\nOnly getting higher trumping like apprentice\nPercentage nigga nigga\nTeam 10 that shit wack this my last disstrack\nNo break no kit kat, I'm done now just real rap\nLike EP's, and mixtapes, albums and tour dates\nStrippers with real cake, like real chains and gold plates\nReal bars no jake, if u didn't know now you dough\nNiggas be amateur but I'm pro dough\nGot more subs but still want a photo\nTalk that shit get Miguel cottod\nMove to fast dem niggas niggas on slow dough\nTo much cash I don't even show dough\nFucked yo bitch man am she a hoe dough\n\n[Hook]\nReal rap, you all wack\nCan't see me, that boi Dax\nDon't play dat, just say that\nNo more time for disstracks\nReal rap, you all wack\nCan't see me, that boi Dax\nDon't play dat, just say that\nNo more time for disstracks\n\n[Bridge]\nYa I'm going back to back to back back to back to back back to back to back back\nNigga tryna do a track they wack but still flight reacts\nNiggas won't react to dat Dax\nI ain't even tripping niggas just straight wild\nYou ain't even know this shit was a freestyle\nAll head, bad bitch, what am I, 23 - 2 savage\n\n[Hook]\nReal rap, you all wack\nCan't see me, that boi Dax\nDon't play dat, just say that\nNo more time for disstracks\nReal rap, you all wack\nCan't see me, that boi Dax\nDon't play dat, just say that\nNo more time for disstracks\n\n[Verse 3]\nBaddest nigga in my city now\nHottest in the town hol it down\nWomen know I lay the pipe too cause I built this shit up\nStraight up from da ground, with a different sound\n180 pounds, stay ripped yes a nigga hooper too\nHow he freestyle like he wrote it down word to zias nigga blou\nDidn't wanna rap the whole track, but ya boi gotta disstraced\nI'ma keep it going moving and flowing knowing nigga showing the whole package\nRap game ain't ready for a type of nigga doing this type of damage\nI ain't fucking scared to fucking say it\nNo the shits belated, I'm the best on the planet", "[Chorus]\nFuck all the money, ain't tryna dance with the devil\nSaw his ass in a dream and I told him get up on my level\nAll the money and power recondition is some special\nBut fuck a check cause I never finna settle\nFuck all the money, ain't tryna dance with the devil\nNah, I ain't tryna dance with the devil\nFuck all the money, ain't tryna dance with the devil\nTold that little ass nigga he couldn't get up on my level\n\n[Verse 1]\nFuck all the money, ain't tryna dance with the devil\nStop, scheme get the head in plot, just to make my music pop\nTold that nigga pass the rock, tryna get some shine\n[?] on the line, fine\nWhat's the deal? 20 bad bitches, a mansion, a couple mill?\nFor real tho, had to pass, nigga wanted a field goal\nThis is for real tho\n\n[Chorus]\nFuck all the money, ain't tryna dance with the devil\nSaw his ass in a dream and I told him get up on my level\nAll the money and power recondition is some special\nBut fuck a check cause I never finna settle\nFuck all the money, ain't tryna dance with the devil\nNah, I ain't tryna dance with the devil\nFuck all the money, ain't tryna dance with the devil\nTold that little ass nigga he couldn't get up on my level\n\n[Verse 2]\nWoke up, put on my draws, time to get paid, janitor\nLifestyle, I'm working and getting place\nHoe stack, but dream I'm wishing that I could make\nAll [?] spending back in a recouped in a couple days\nRelapse, repeat, but spend it in different ways\nCash rule the world, it's heavyweight cash play\nRIP, Pac all eyez on me\nDevil wanted me to sign to the industrie\nCould get me, money, power, respect\nHoes, house with a deck, friends faking the gat\nEverything that I [?], checks, cars, clothes\nYou can and you will guarantee play multiple shows\nIs what he said, sat me down and pack me on the head\nWent and then he smiled and said \"We finna stack this bread\nYoung man, we finna stack this bread\"\nAnd this this is what he said\n\n[Interlude: Devil]\nListen son\n\n[Verse 3]\nFuck all the money, ain't tryna dance with the devil\nHe got a mean too step, put a milli on the table\nHe said:\" Here's what you net\"\nSix months assuming that there is no death, death\nWhat you mean, what you mean, death?\nWell, you know, wait, we talk about it later\nJust sign that goddamn paper Dax\nFuck, goddammit, ironic huh?\n\n[Chorus]\nFuck all the money, ain't tryna dance with the devil\nSaw his ass in a dream and I told him get up on my level\nAll the money and power recondition is some special\nBut fuck a check cause I never finna settle\nFuck all the money, ain't tryna dance with the devil\nNah, I ain't tryna dance with the devil\nFuck all the money, ain't tryna dance with the devil\nTold that little ass nigga he couldn't get up on my level\n\n[Outro]\nPrize and I know\nY'all thought that I was unfine\nAin't no needed help 'cause I'm a star, how could I not shine?\nJust started killing and this shit ain't even my prime\nRecord labels calling already, this here is my time, huh\nThis here is my time nigga, I ain't signing for\nI told that little ass nigga he couldn't get up on my level", "[Intro: Dax]\nAfter they hurt you the first time, leave\n(Ayy, this a Trademark production)\n'Cause if they'll do it once ([?])\nThey'll do it again\n\n[Chorus: Dax]\nNever thought you'd leave, never thought it would end (Yeah, uh)\nLook at all the pain that you caused me\nFuck it, I don’t want another sorry (Uh)\nSorry, uh\nI never thought this shit would end, yeah\nAnd I don't want another sorry\nUh, sorry, you're not sorry, uh\nI never thought this shit would end, yeah\n\n[Verse 1: Dax]\nYo, uh, two wrongs don't make a right, I turn left\nNow you mad I don't pick up, I don't return texts\nLike I'm supposed to let it slide, what? And just forget\nThat you destroyed everything we had, what, just for sex?\nFuck that, I'm angry, I'm depressed, and I'm mad\nRemenicising over days, livin' life in the past\nHow'd you do that shit? Was I really that bad\nI even let you stay, I even let you meet my dad\nI don't know where we goin' but I know that you not for me\nYou're not for me, damn, ho\nDamn\n\n[Chorus: Dax]\nNever thought you'd leave, never thought it would end (Yeah, uh)\nLook at all the pain that you caused me\nFuck it, I don’t want another sorry (Sorry, uh)\nSorry, uh (I'm sorry)\nI never thought this shit would end (I never thought this shit would end), yeah\nAnd I don't want another sorry\nUh, sorry, you're not sorry, uh\nI never thought this shit would end (I never thought this shit would end), yeah\n\n[Verse 2: Trippie Redd]\nYeah, I'm sorry (I'm sorry, uh), it was a mistake (A mistake)\nEvery fuckin' day, another heartbreak (Yeah)\nI can't take this pain, how much my heart aches\nThere won't be nothing left\nSay you not sorry, not sorry either (Either)\nTold you I'ma love you to the moon and to the ether (Ether)\nYeah, she think I’m stupid and I peep her\nTold her I'm alone, by myself, I need to leave her, yeah, uh\n\n[Chorus: Dax & Trippie Redd]\nNever thought you'd leave, never thought it would end (Yeah, uh)\nLook at all the pain that you caused me (Yeah)\nFuck it, I don’t want another sorry (Sorry, uh)\nSorry, uh (I'm sorry)\nI never thought this shit would end (I never thought this shit would end), yeah\nAnd I don't want another sorry\nUh, sorry, you're not sorry, uh\nI never thought this shit would end (I never thought this shit would end), yeah", "[Intro]\nMan\nIt's funny how things change man\nWe makin history\nDax!\nHuh, listen, listen\n\n\n[Verse 1]\nIt was history, yeah you know we made it(whoo)\nStarted in the basement now we rapping on these stages\nI got all these people calling and I'm asking where have they been\nAsking me to help em, so I tell em God will save em\nI am not the one to pick up the pieces\nIf you want a ticket paid, there's no VIP treatment\nStarted off as a janitor, my gym I was cleaning\nI was moving piss, pushing shit, all while I was dreaming(whoo)\nNow, they asking why you change how you do that\nWasn't trying to stay the same, needed change and I knew that\nTo come up in the game with my name and this new rap(Dax)\nWould have to go insane, fight the pain so I proved that I\nI could go toe to toe with the best in the game, man that's word to Cole\nSit at a table share a plate, man that's word to Drake\nCuz I was chosen for this shit, man that's word to faith, man\n\n\n[Chorus]\nAin't tryna do wrong, just right(no)\nWhat's left I was handed, grabbed on, took flight(flight)\nSuccess I demanded, wasn't gave the upper hand and tried to help you understand that I was made for the fight(fight)\nAin't tryna do wrong, just right(right)\nWhat's left I was handed, grabbed on, took flight(flight)\nSuccess I demanded, wasn't gave the upper hand and tried to help you understand that I was made for this fight\n\n\n[Verse 2]\nWe, we, we, we took the longer route(ha)\nNow we the people in the books we would read about(yup)\nMake fans look shook, have em scream and shout\nYell Dax, yell it back, yeah they scream it out(Dax)\nNow, I got all blessing, no sin\nNever guessing, I was headed for the light at the end of the tunnel\nI was running through it all with my friends, I'm the only one who made it\nStarted basic, turned famous, now\nI show em how to write they book, take minds, rearrange and reword the hook\nCuz my words good as goals, so they play the crook\nLet em eat, I ain't hungry, how I played the crook, look\nI'm just tryna help you understand\nIt's strange how they change when you now is the man\nFriends turn to fake, but to face, they the fam or they hate to ya face, but in secret they a fan, damn\n\n\n[Hook]\nAin't tryna do wrong, just right\nWhat's left I was handed, grabbed on, took flight(flight)\nSuccess I demanded, wasn't gave the upper hand and tried to help you understand that I was made for this fight, damn\nAin't tryna do wrong, just right(right)\nWhat's left I was handed, grabbed on, took flight\nSuccess I demanded, wasn't gave the upper hand and tried to help you understand that I was made for this fight, man\n\n\n[Outro]\nAin't tryna do wrong, all right\nWhat's left I was handed, grabbed on, took flight\nSuccess I demanded, wasn't gave the upper hand and tried to help you understand that I was made for this fight, damn", "[Hook]\nThis heaux be trapping, this heaux be tripping\nThis heaux be fucking, that heaux be stripping\nThis heaux be smiling, fake shit she lying\nFuck all the love man I'm done with the trifling\nThis heaux be trapping, this heaux be tripping\nThis heaux be fucking, that heaux be stripping\nThis heaux be smiling, fake shit she lying\nFuck all the love man I'm done with the trifling\n\n[Verse 1]\nThis heaux be tripping had me caught up now I'm dissing\nCould've sworn that you was different\nCaught you fucking with a nigga\nNow I'm doing different\nAin't no fucking limit, fuck the game up with the condom\nI ain't in there having children nigga\nThis heaux used to grab she always flexing\nHad a phone when she be with you, you wanna know who she be texting\nProbably out she sexting\nDealing with a yes man\nOnly fucking with you cuz she know she touching on the pension nigga\nThis heaux I ain't seen her in days\nHear she, sucking and fucking and she going both ways\nNiggas tryna cuff it they ain't know they were played\nThis a warning to my niggas I'm just praying you saved\nNigga this heaux went and fucked my best friend\nTalking to me on the phone while she was fucking in the bed\nProbably giving head\nSaying that she love me\nI'mma dummy she was choking\nI ain't hear what she has said\nNigga this heaux\nWent and spend all my money\nNot funny now I'm sick and hear the rumble in my tummy\nHelp a nigga stun me\nNever come correct cause when you asking them for money\nNiggas never show respect\nMy nigga this heaux\nGot a hunny million fans\nSo how the fuck she gone be faithful to one man\nStick to one plan, hate no way\nThe same nigga that she fucking boi\nShe told you was gay\n\n[Hook]\nThis heaux be trapping, this heaux be tripping\nThis heaux be fucking, that heaux be stripping\nThis heaux be smiling, fake shit she lying\nFuck all the love man I'm done with the trifling\n\n[Verse 2]\nGot a plan got a paper started to write it\nThis heaux, that heaux\nNot if they in it just to be lying\nThis heaux, that heaux\nNot if they in it just to be wilin\nHit the store they like it buy it\nAnd working trying to provide it\nAin't got wif it niggas cuffing women just to boost the image\nI ain't wit it you is a jimmy\nYea, I don't cuff if she said Diddy\nYea, I don't care if she got titties\nBooty big a small committee\nIf you fucking up my mental baby you ain't fucking wit me\nThat's a fact you on crack if you think I'm taking you back\nAll black cuz you dented me now and I'm more smashed\nNo track you was running with niggas doing them laps\nNo Dax, that's a fact cuz I'm done and you just trash\n\n[Hook]\nThis heaux be trapping, this heaux be tripping\nThis heaux be fucking, that heaux be stripping\nThis heaux be smiling, fake shit she lying\nFuck all the love man I'm done with the trifling\nThis heaux be trapping, this heaux be tripping\nThis heaux be fucking, that heaux be stripping\nThis heaux be smiling, fake shit she lying\nFuck all the love man I'm done with the trifling", "[Verse 1]\nPewdiepie, fuck you think you doin?\nFucking nigga shit just spewing Dax about to start a movement\n'Bout to get it boomin', boy you better tune this\nHow you laughin', it ain't funny now yo ass is fucking loosing\nI'mma do this for the people, yeah the ones who was unequal\nHit you once and now I'm back, I finna kill you with the sequel\nHatred shit is evil, know that you was trippin'\nApologizing public so these kids know that it's different\nShit was mistake, I know you know you wrong\nI know it didn't take me long, I put it in a song\nThis shit is tragic cuz they follow what you put 'em on\nHad to come and let you have it call me Farrakhan\n\n[Chorus]\nPewdiepie was trippin' had to pull the trigga\nHow you screaming let 'em heat for saying fucking nigga\nWas you high or was you drinking on that dark liquor\nFuck you nigga, I'm a nigga, I can say nigga\n\n[Verse 2]\nI know you thinking that this shit dun matter\nWhy am I talkin' bout this shit when I'm a YouTube rapper\nDidn't know I'm the realest and I spit this hard\nBut I'm an angel yeah my nigga I was sent by God\nHad to talk it, I'mma walk it, I'mma give it to public\nI ain't quiet, finna riot, ain't no bitch ass puppet\nRead the comments, half these people, man they think that is nothing\nBut I'mma tell you how I feel my nigga, that shit's something\nYou a famous fucking 'Tuber and they look up to you\nIf you talkin' out yo ass they gonna do that shit too\nIf you quiet, they gon' like it, they gonna think that shit's cool\nSay something please my nigga, man you look like a fool\n\n[Chorus]\nPewdiepie was trippin' had to pull the trigga\nHow you screaming let 'em heat for saying fucking nigga\nWas you high or was you drinking on that dark liquor\nFuck you nigga, I'm a nigga, I can say nigga\n\n[Hook]\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, haha\n\n[Bridge]\nI wore it out man is you still gonna use it ?\nI wore out I know they still gon use it\nI wore it out man is you still gonna use it ?\nI wore out I know they still gon use it\nI wore it out man is you still gonna use it ?\nI wore out I know they still gon use it\nI wore it out man is you still gonna use it ?\nI wore out I know they still gon use it\n\n[Hook]\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga!\n\n[Outro]\nI don't even feel that shit no more!", "[Intro]\n\n[Hook]\nI'm going on tour, you love it\nIf you don’t get a ticket, you buggin'\nIf you get on the bus, we're fuckin’\nSo sign an NDA or nothin'\n\n[Verse]\nIt's Dax, listen yeah uh\nI'm a sick fuck, get on the tour bus\nYour bitch got lick mush\nShe lick the mine nuts, trust\nEveryday I'm city, I'm tearing the bitch up\nYou still DC, so come and see us\nStart this morning, now we poppin'\nNovember 7th, we mobbin'\nCity to city, we killin’\nGig and crack and musin’\nNeed you to empty your pockets\nAnd don't be trippin’\nTake your ass and go get the tickets\n\n[Hook]\nI'm going on tour, you love it\nIf you don't get a ticket, you buggin'\nIf you get on the bus, we’re fuckin'\nSo sign an NDA or nothin'\n\n[Outro]", "[Chorus]\nYou won't see the positive with the negative, I'm\nI'm calm now so calm down and take a sedative, I\nKnow is wrong but that house, inside he sell it\nThe pill form too comfort is stay relevant, see\nIt's a drug and yeah don't show you how to use it\nBut won't expand the change when the negative turn to pursuit\nAnd every sit here wonder, how it can be confused\nWhen I come that could I aim a whole negative influence\n\n[Verse]\nIt's a world problem and I think I know how to solve it\nIt's not a class money\nIt's something that dissolves in a solve and it's just\nSomething you choose, choice is yours\nWinter lose, lost a flame, like the few, changed the game, different rules, positivity\nOnly thing that I'm finna call\nIt is the bounce back, once you hit, them balls ball\nThen it's the react, all in your head is just where you be\nYeah you the only one that spark the change\nI hope you see that\nWe need to be, all the change and we wish to see\nChange life, if that's what left we chose right\nJump cliffs, have trust, wings spread, we take flight\nKeep faith, once cold, lost grip, hold on tight\nOne chance, it's the story that end up with you right\nSo ask yourself what actually you need to start to manifest\nCause Gods plan it won't happend when you do yourself damage\n\n[Chorus]\nYou won't see the positive with the negative, I'm\nI'm calm now so calm down and take a sedative, I\nKnow is wrong but that house, inside he sell it\nThe pill form too comfort is stay relevant, see\nIt's a drug and yeah don't show you how to use it\nBut won't expand the change when the negative turn to pursuit\nAnd every sit here wonder, how it can be confused\nWhen I come that could I aim a whole negative influence\n\n[Instrumental]\n\n[Chorus]\nYou won't see the positive with the negative, I'm\nI'm calm now so calm down and take a sedative, I\nKnow is wrong but that house, inside he sell it\nThe pill form too comfort is stay relevant, see\nIt's a drug and yeah don't show you how to use it\nBut won't expand the change when the negative turn to pursuit\nAnd every sit here wonder, how it can be confused\nWhen I come that could I aim a whole negative influence\n\n[Chorus]\nYou won't see the positive with the negative, I'm\nI'm calm now so calm down and take a sedative, I\nKnow is wrong but that house, inside he sell it\nThe pill form too comfort is stay relevant, see\nIt's a drug and yeah don't show you how to use it\nBut won't expand the change when the negative turn to pursuit\nAnd every sit here wonder, how it can be confused\nWhen I come that could I aim a whole negative influence", "I came in just like lightning\nGot bars just like Verizon\nI’m eating rappers up\nThis shit is appetizing\nI use to dream about it\nNow I’m through, I’m fantasizing\nGreatest up and coming\nDo your research, fucking analyze it\n\nWhat they gonna say about a boy who raps with a name like, DAX\nSo fast [?]", "[Verse]\nDon't tell me shit, I already know\nWhere I'm at is a reflection of my work grid, hunger and my thirst\nI was told that you reap with your soul\nAnd that your dreams are just dreams till you sit down and you write out your goals\nI remember I was 10 years old, shooting jumpers in the Canada cold\nNo gym I had to shovel the snow, now I travel the globe\nUK for a couple of shows, I can't fall I stand on my toes\nOh I'm different now?\nI ain't changed, you changed, I'm the same, I just got more chains\nStop stressing about fans that I could not change\nStop tryna change people that I could not change, yeah\nNow it's lamb or with the steak\nI got to fuck her with a condom, cause I got to much estate\nGot off tour the other day it was like 55 shows\n35 states, man I need a motherfucking break, but I can't take one\nIf I don't work, who does?\nI don't care about your booth in the club\nI don't care about a thing you gotta say unless it's keeping all the people that I love from what they once was\nMan, why do they judge?\nWe are one and the same\nI spread my wings took off like a plane\nI ain't stressin' 'bout the hate\nThe divide is the price you pay\nTo be real you have to deal with the fake\nThese people mad 'cause I change name stop hooping\nHad to change lanes, subbed in to the game, made the game changed\nMy bitch cheated, I can't even find a main thing\nNow I be fucking bitches only 'cause I have to maintain\nStuck inside a maze man\nEvery bitch I meet is just the same thing\nDoesn't know me since I am amazing\nThen we get to talking I find out that she's a liar\nOnly wants me for my money, so we play the blame game, fuck\nLife is a trip, anything that comes quick, you lose quick\nYou could try to push your views on someone but if it isn't for them\nNo money in the world's gonna make it stick\nI done seen both sides of the fence\nSame poeple that lied, I used to let them vent\nTurn around and give 'em money for rent\nSo when I say that I'm mad, yes nigga it does make sense\nNah, I ain't different, it's just the shit around me\nI was lit when these motherfuckers found me\nCouple people tried to drown me\nBut how you gonna drown me?\nIt's my wave nigga get the fuck from around me\nThese people been sleep and if they awake they drouzy\nRain on my parade you cloudy\nWhy could y'all doubt me?\nMan how could y'all doubt me, it's Dax", "[From Instagram snippets]\n[?]\nReal nigga, I ain't even gonna lie\nBeen disrespected, one, two, three, many times\nI done seen close friends ride lies, switch sides\nHaven't felt hell, see what it look with my own two eyes\nThat's a fact and the hell came back on a stretcher\nTiptoeing in my demons in some all white sketchers\nNo cap felt good, bet heaven feels better\n[?]\nThis music is my destiny\nYou can't stop what is meant to be\nFuck what you thinking, you niggas must be irrational\nFuck what you thinking, you niggas, my shit is magical\nFuck what you thinking for saying I wasn't valuable\nCouldn't make it to music, haha, that shit is laughable\n[?]", "My flow is unpredictable\nMoonwalk on beat, Smooth Criminal\nDead beat copy, so original\nCannot stop me, I’m invincible\nFuck the economy\nNiggas throw money like the fucking monopoly\nNiggas hate on me\nI’m a fucking anomaly\n[?]", "[From Instagram snippets]\n[?]\nYou can't feel real peace 'till you feel real pain\nHow do you know love if you ain't felt hate?\nHow do you know hope if you don't know faith?\nWhat if I went ghost, who would take my place?\nI don't wanna be good nor wanna be great\nI don't need new fans, don't want no snakes\nI don't need that latest plastic fake out (Yeaaah)\n\n[Chorus]\nSick and tired of being sick and tired\nYeah, my life is a movie every time\nThrowing all of my demons in the fire\n\n[Verse ?]\nFeels like I'm trapped in the maze\nTrapped in my mind...\n[?]", "[Verse]\nYou know Dasher and Dancer and Prancer and Vixen\nComet and Cupid and Donner and Blitzen\nBut do you recall the most savage reindeer of them all?\nRudolph the trap nosed reindeer\nHad a very powdered nose\nAnd if you ever saw him\nYou would probably think he smoked\nAll of the other reindeer\nTried to get at his cocaine\nBut didn't know poor Rudolph\nHad a gun stuck inside is mane\nThen on foggy Christmas Eve\nSanta came to say\nRudolph you've got all this white\nLet's team up and sell it Christmas night\nThen all the reindeer loved him\n'Cause Santa put him on his team\nRudolph the trap nosed reindeer\nWill go down for selling cocaine", "Dear Alcohol, a love story\n\nDear alcohol, quite frankly\nI don't think you're as bad\nAs what they say\nI mean you might be killing\nMy liver slowly but everything\nElse in this world is temporary\nSo why does it even matter if I drink you anyway?\nEach and every day\n\nBecause when I drink you\nI mind you in moderation\nDepending on type, taste, brand\nAnd filtration, I feel so uplifted\nSo confident that the average driver\nI am suddenly turns into one\nSupernaturally gifted\n\nAnd that stop sign?\nYeah, I missed it\nBut I made it home safe again\nSo who rеally cares if I'm twisted?\nI mean, no pain was inflictеd\nAnd I didn't get a ticket\nSo how dare they be vindictive\nWhen there were no victims\n\nYou never lie to me\nWell, atleast not to my face\nWho I really am is a little slow\nSo you help me speed up my pace\nYou know I need to stay in shape\nWhich is why you have me run your race\nSo we do intervals, all sprints\nYou set the tone, So all I have to do\nIs close my eyes and chase\n\nWell actually, I keep 'em open because\nI can't run you straight\nAnd you didn't lie, you just never\nTold me too much of you over time\nActually increases weight\nI'm not mad at you though\nIt's really not a big deal\nBecause my loss of self-esteem\nDue to weight gain feels in\nComparison to how good\nYou always make me feel\n\nYou made me the man I am\nWell actually, you temporarily\nMade me the man I wish I could be\nThe one with the big smile\nConfident with his own style\nAnd personality to make you think\nI'm worthwhile\nI mean, the man that I should be\nI mean the man that I would be\nIf I wasn't always scared\n'Cause other guy's smarter and\nBetter looking so I just need to drink\nSo I can make this plane feel fair\n\nSo in reality, you helped me conquer\nMy fear, I could bring you to class\nWork, a little on the court\nAs long as I choosed a drink that's clear\nI mean, they'll just think it's water\nSo I brought you home the other night\nAnd said some things I didn't mean\nTo my father\nHe told me he knows I don't mean it\nI just wish he would've also told me\nTo fast track my thoughts [?] my words\n[?] [seen it?]\n\nAlcohol, we're together all the time now\nI hope you don't think I'm getting too\nIndependent, I've got your back and\nYou've got mine, right?\nSo when the others say we need to\nSpend less time together\nI get defensive\n'Cause what they're sayin' is offensive\nTellin' me you're way too expensive\nCausin' me to be aggressive\nRendered me defenseless\nAre extremely deceptive\nAll reasons why they say I shouldn't\nBe apprehensive\n\nThey don't know you like I do though\nYou're the only one who can deal with me\nAnd I know you're down to ride with me\nBecause when you told me\nYou'd kill for me\nSo we fell in love\nAnd I never believed them when\nThey said you were a drug\n'Cause I don't think you're addictive\nPlus our relationship isn't built on lust\nIt's love, right? And that's purely commitment\nBut I soon figured out you weren't committed\nThat you were sleepin' out with-\nThat you were sleepin' with other people\nYou may feel the same way you make me feel\nMe and them becomin' equals\n\nYou told me you loved me\nTricked me into becomin' exclusive\nYou would treat me great in public\nBut behind closed doors, you were\nPhysically and emotionally abusive\nAnd no one knew it\nBut I still couldn't quit it\nAnd when they would ask about my scars\nI'd lie and tell 'em they were all self-inflicted\nTheir help, I resisted\nIt wasn't until I caught you in bed\nWith my best friend that I realized\nThat I needed it\nAlcohol, you left him crushed\n\nAlcohol, I think it's time we break up\nThe scars you gave me are too deep\nAnd there's no way I can continue to\nCover them with the use of this\nEmotional makeup\nSo I made the decision\nI'm leavin'\nDon't show up to my house, school\nWork, and especially not on the weekend\nAnd I know you know I can't swim\nSo I won't let you pressure me\nOff the deep end\n'Cause they won't only soak my scars\nAnd cause the fresh wounds to deepen\n\nAlcohol, I will no longer depend\nAlcohol, our relationship is over\nToday marks the beginning of our end\nI decide it's best we go sober\nDear alcohol, I found out\nYou were even worse than what they said\nSometimes I try to remember the good times\nBut you actually made me forget\nMost of those memories instead"]}