{"artist": "JID", "songs": ["[Intro]\nAct one, scene four\n\n[Chorus]\nYeah, run, Ricky, run, run nigga, run, jump, nigga, jump\nCome here they come, run, run, run, run\nGun with the drum, bum bitty bum, slump in the trunk\nMy city go dumb, dumb, dumb, dumb\n151 rum and a blunt\nYoung nigga numb, numb, numb and he got a little gun\nA little bitty killer really doin' it for fun\nGive him a little bit and he'll get a nigga done\n\n[Verse]\nSon of a god, son of a bitch\nSon of woman and man, son of a son, in a sunken abyss\nSummon a plan, please come with a script\nCover my back, cover man, please come with the blitz\nLook at the stats, JID like a magician\nFuck that, this some real ass shit, I paid blood for this\nTaking cheese from the government\nCereal boxes with the bugs in it\nHand me down, this my brother brother's shit\nDon't compare me to no other other niggas\nIn the city, boy, they say they fucking with you\nHeebie jeebie, that's a bit disgusting, but I get it\nI'm full of tension, full of spirit but full of shit\nStanding next to Lil Tay when that bullet hit him\nShit, I miss him, I wish that that bullet missed him but it didn't\nAnd since I been living with it like a sickness\nIntimate, infinite rhymes, give me the baton\nA ticking, ticking time bomb, takin' the finish line\nLook alive, look in my eyes, look at you niggas tryin'\nAnd ya dumb, dumb, better run, run 'cause we fryin' em\nEastside, where ya from, from niggas wildin'\nSo be silent before my niggas creep silent\nWith street knowledge, complete nonsense\nDelete comments, online, all lies, we see violence\nEvery day in my eyes, they killing my niggas, die, nigga die\nPull up with the fye, get 'em, nigga, it's eye for an eye\nIf we gotta ride, fuck it, nigga, ride for the ride of ya life\nDiabolical minds, I don't mind it, I like it, I like it, I love it\nI fuck with you, you a thug, I'ma thug with you\nWe can knuck, we can buck if a nigga fuck with you\nI got love for you out the mud with you, off the muscle\n\n[Chorus]\nYeah, run Ricky, run, run nigga, run, jump nigga, jump\nCome here they come run, run, run, run\nGun with the drum, bum bitty bum, slump in the trunk\nMy city go dumb, dumb, dumb, dumb\n151 rum and a blunt\nYoung nigga numb, numb, numb and he got a little gun\nA little bitty killer really doin' it for fun\nGive him a little bit and he'll get a nigga—", "[Chorus]\nOkay, never been shit, never had shit\nNever knew shit, never out, never do shit, damn\nBut a nigga never gave two shits, damn\nNever been a bitch, never had a Rollie on the wrist\nNever had shit, I'ma take\nNever askin', \"Give me this, give me that shit\nGive me everything, nigga, give me everything, nigga…\"\nAgain, never been shit, never had shit\nNever knew shit, never out, never do shit, damn\nBut a nigga never gave two shits, damn, damn\nNever been a bitch, never had a bezel on the wrist\nNever had shit, never take\nNever askin', \"Give me this, give me that shit\nGive me everything, nigga, give me everything, nigga\nGive me everything…\"\n\n[Verse 1]\nNever had a real dollar to my name, bruh, shit been lame, bruh\nI ain't even in this shit for the fame, bruh, it's the pain, bruh\nMost of the niggas I came up with haven't came up\nAnd doin' the same stuff, but I haven't came up, this really ain't none\nNiggas thinkin' that they fuckin' with JID, y'all got the game fucked up\nTremendously, can't fuck with the mind of a mental fiend\nWho dig deep in the depths when he in too deep\nI crept on the steps where the demon sleeps\nAnd yell, belch, tell my Lord what he means to me\n\"Oh, my God, don't be mean to me\"\nIn the ride with a bean or three\nAnd it's not what it seems to be, I can die, I can fly\nI can try very easily, I'm a guy and a giant\nShe's a vivrant thing, I prolly won't buy it\nBird bitch, take flight, no pilot\nServe dick, curve bitch, no bias\nBack up, back up, chick, bad timing\nI got to get on stage, you better get on page\nI have you looking out the windowpane\nOr in the rain or anything but in the way\nAnd if I say that's what it is, forget the lip\nNow, what's my point, now I forget—damn, this bitch\nGot me fuckin' up my script, fuck this shit, I got this shit\nGettin' to the point where everybody say they from the block and shit\nWith Glocks and shit and poppin', pimpin', trappin', sippin' lean\nY'all niggas fall for anything, you got the plug in Medellín?\nKingpin? You a pen king (Kingpin? You a pen king, ayy)\nBye, bye, niggas, 'N Sync, try I? Nigga, risky\nFire, fire from the wrist piece, niggas shootin' like the '60s\n\n[Chorus]\nAgain, never been shit, never had shit, never knew shit\nNever out, never do shit, damn\nBut a nigga never gave two shits, damn, damn\nNever been a bitch, never had a Rollie on the wrist\nNever had shit, I'ma take\nNever asking, \"Give me this, give me that shit\nGive me everything, nigga, fuck you…\"\n\n[Beat Switch/Interlude]\nUhh, let's go\n\n[Verse 2]\nYeah… yeah, yeah, what, um\nAlright, what you call a chick that don't suck dick? You don't\nAnd if you think you finna come up this, you won't\nDown comes the boogie and up jumps the funk\nThis beat takin' a beating, I hand out the lumps\nDamn, baby, yo' ass stand out in pumps\nThat's outstanding, stand outside until your man come\nOr you can leave with the kid, we can plan something\nYou know I came from the dirt like a sandstorm\nNigga, this a 3 point and-1\nAnd 100, Wilt Chamberlain with the hand dunk\nShawty love JID, let me turn her to a hand puppet\nShe moan, sound like German or something\nRun game, bitches think I'm Todd Gurley or something\nGive me a jersey, I done balled so hard, I caught a hernia\nWheeled yo' bitch out my bed in a gurney\nYou gotta leave lil' mama, the clock's turning\nI hit it first, Ray J or Ron Jeremy\nThey bleed like us so them niggas could never scare me\nNo niggas got more glow than JID, barely scratchin' the fucking surface\nYou need work, you need purpose\nEverybody good, everybody trap perfect\nEverything cool, don't nobody act nervous\nJust ignore the fact that your favorite rap nigga is a sap nigga\nWe don't dap niggas, get the rrrat from the ratchet\nGet the pack out the package\nLil' savage ass, ratchet ass, bastard ass, havin' ass\nRappin' ass, jackin' ass, wait\nFinna blast, green dot, send the cash, pen and pad\nMinivan, been a dad, been with that bullshit, nigga\nI don't wake up to the bull like I usually do\nYoung niggas down the block on the woopty woop\nBetter pray to God they don't shoot at you\nDreams of cleanin' this dirty money out my cuticles\nThen a nigga make the crowd jump like Zoboomafoo\n\n[Outro]\nShit's beautiful, shit's beautiful\nShit's beautiful, shit's beautiful, shit's beautiful", "[Intro]\nTake your heart, don't let me break it in two\nI'm sure that I could possibly do nothin' for you\nI'm nearly on the edge, I'm 'bout to jump in a few\nI'm really not afraid of nothin'\n\n[Verse 1]\nLook, on everything\nI gave everything and got nothing back\nAin't looking for no pat on backs\nThat ain't how we got where the fuck we at\nMama called, \"Where the fuck you at?\"\n\"On the road, and I ain't coming back\nUntil my hundred stacks make a hundred racks\nAnd that hundred racks bring a bundle back\"\nI was blowin' gas like the Honey Badger\nJ.I.D, bitch, the money snatcher\nC'est la vie, shit, I'm coming after everybody\nDon't get the bloody splatter\nI'm fly and I got my niggas fly too\nShit is like buddy passes\nI wanna cry 'cause I'm numb inside (Ugh)\nIf you wonder why, ask, \"What's the matter?\" (Yeah)\n\n[Chorus]\n'Cause I been working hella hard, shit ain't really working out\nI been praying to the Lord, shit ain't really working out\nI been looking to the stars, keep my head up in the clouds\nShit ain't really working out, shit ain't really working out\nShit ain't really working out\n\n[Interlude]\nQuiet, don't explain\nWhat is there to gain\n\n[Verse 2]\nShit, shit ain't really working out, huh\nNow I got a little bread, got my niggas working outta town\nBaby, your ass fat, I can see you working out, shit\nAnd you got a new job? Tell me, how that shit working out? Heh\nHeard you doing pretty good, yeah, people talk, word of mouth\nWasn't 'round when you had the dirty house\nNow they won't leave when you kick 'em out\nThese type of people can't stick around\nOnly down when there's liquor 'round or the spliff around\nThat's why I don't fuck with niggas now\nWell, I fuck with all my niggas, you know the difference\nYou been living with tunnel vision\nYou and all of your friends are like wonder women\nWonder Woman working for it, if you ever wanted something\nSearching for a purpose, I see what you on\nThe difference in how you be using your gifts\nIn the midst of the shit that you dealing with\nReally specific, you paid attention, panoramic\nYou got the vision like a fer-de-lance\nYou attack and you kill it, sinkin' your teeth with the venom\nKinda like me with these instrumentals\nOr the pen and the pencil or off the temple\nPimpin' since been pimpin', keep it sensible\nSince you winning, you a object of ridicule\nObjects appearing closer than you ready for\nObviously, you don't know what's ahead\nBut that's the reason you can work 'til you dead\n\n[Chorus]\nI been working hella hard, shit ain't really working out\nI been praying to the Lord, shit ain't really working out\nI been looking to the stars, keep my head up in the clouds\nShit ain't really working out, shit ain't really working out\nShit ain't really working out\n\n[Outro: Zack Fox]\nC'mon, bruh, come to the booty club one time\nThrow some of that Dreamville money\nThrow some of that Dreamville money at these hoes, bruh\nThey got dreams too, nigga\nThey got shit to do too, nigga\nThey got dreams too, bruh-bruh\nY'all Dreamville, uh, ayy-ayy, ayy-ayy, uh-uh\nNext time you see that nigga J. Cole, bruh\nYou tell that nigga the same thing, man\nI fuck with y'all niggas, bro\nWhy that nigga J. Cole, got all this money\nLook like he 'bout to borrow somebody charger or something\n\"C'mon, bruh, let me get your charger, bruh\nLet me get my shit to uh, uh, ten percent\nAnd I'll give that shit back to you, bruh bruh\"\nC'mon, bruh, flex some of that Dreamville money, let me see it", "[Intro]\nI, I am so grateful\nI'm very, very, very grateful\nYeah yeah yeah\nYeah yeah yeah\nUh\nAlright, J.I.D and (Christo)\n\n[Verse]\nY'all niggas need to lay off the drugs\nSome of y'all need to lay off the dope\nMy niggas gettin' it straight off the boat\nPure cut, put it straight to your nose\nI ain't nosy, but I know what I know\nMr. Know-It-All, \"oh here he go\"\nI'm the GOAT, I never go with the flow\nThrowin' shots, boy, it's blow for a blow\nI'm the nigga kick the do' with the do'\nI'm the nigga fuck the ho with the ho\nI'm the nigga lit the blunt with the blunt\nI'ma get it 'cause I want what I want\nI'ma say this shit again and again\nI'ma go and put this shit to an end\nI'm the sickest with the pencil and pen\nHit the blunt and mix the Hen' with the wait\nI'ma go ahead and lay off the Xans\nI'ma fall back sippin' the lean\nI gotta make sure my vision is clear\nOh God, no, it's not what it seems\nSix, five, four, one, two, three\n.45 tote, you know me\nYou don't want smoke, so what it's gon' be?\nGotta watch what you say when you lookin' at me\nLookin' at God, lookin' for leaders, lookin' for keys\nLook at the pain in your eyes, nigga, look where we been\nLook at our wins, look at our sins, and look at our skin\nI've been on a frenzy binge tryna get me a Benz\nAnd then your fuzzy ass lens wanna fuck up the ends\nOh God, no, where are my friends?\nLord forgive me, yeah, I need to repent\nMind blurred, need to lay off the drugs\nYeah God, they ain't prayin' enough\nNiggas dyin', we ain't sayin' enough\nCops fire, stockpiling rottweiler\nTell my little niggas lay off the stuff\nRonald Reagan, I can't thank him enough\nNah, I'm playin', nigga racist as fuck\nTold my nigga if he leave a pack of ports around me, I'ma take em'\nAnd throw em' away\nHe smoke em' around me, I'ma break em'\nAnd we almost had got into fightin'\nI'm talkin' 'bout dead that, finna fade it\nBut shit, but maybe I did too much\nBut fuck it, I love my nigga, I'ma save him\nAnd he prolly thinkin' I'm a player-hater\nI don't hate a player, I just need all my niggas to wake up\nAnd take a real good look, we a long way from Decatur\nLong days still ahead of us, grown dads still scared of us\nI'm just workin' my incredible\nStick my dick in the inevitable\nSo fuck whatever happen, fuckin' cinematic\nSins of the father, I'm a fuckin' addict\nUnderstand addiction, so I'm sympathetic\nBut I know, I know, I know that I gotta be strong\nI ain't tryna be where I don't belong\nLittle syrup sippin' out of a foam\nLittle powder, put the pot in the bong\nI ain't trippin', I ain't sayin' it's wrong\nBut, it's some other shit we can be on\n\n[Bridge]\nGangsta Gri-zillz\nOh, now that I may be free, yeah\nAnd he, he...\n\n[Outro]\n...if you need it\nYeah\n'Cause we the old people, you know\nThat's way you get blessed\nYeah\nThat's comes to you, people don't know\nBless, you can see it\nGod, He come, He come, He come\nHe come depending what... what you do to people\nUh-huh\nThat's where bless come from, you know what I mean?\nYeah\nYou see, you can see that\nLook at that, look at how fast President Reagan dead\nYou don't know him right?\nYeah, I did\nRight okay, He was a criminal, you know what I mean?\nBut look at... at Jimmy Carter\nUh, uh\nJimmy Carter all... more older than Reagan\nUh, uh\nReagan gone already, Carter still here\nThe good person?\nYou know what I mean, 'cause he got a open heart\nHe never do war, when he was President\nHe never hurt nobody, he help people", "[Intro]\nActivate, activate, activate, activate\nActivate, activate, you know I'm about to activate\nActivate, activate, activate, activate\nActivate, activate\n(Woah, Kenny)\n\n[Verse 1]\nActivation, activation\nMaturation process, rap game too saturated\nGrab your lady, masturbation on her face\nAn acne patient acting patient, so complacent\nComfortable, a basic bowl of shit\nHold my own, I own my dick\nGo shalom, I’m unpredictable\nAnd roll with the clique and fold with big clips\nI know I'm feelin' activated when I came in this bitch\nClaiming the 6, I don’t care about being famous and shit\nI was a bad little never had, nigga get the bag\nGive it back to my fam, boy I am who I am\nHope I don't get in a jam in a jam\nHad a dream of eating lamb in the Lam'\nAnd the label come off fam with the ram\nLike Martin, Gina, Cole, Tommy, and Pam\nStart scheming, boy, you die where you-\n\n[Beat Switch]\n\n[Interlude: Jamaican DJ]\nNow hear dis! You likkle spit and chew out soundbwoy\nYou mussi think you can go buy experience a Woolworth!\nYou mussi think a so King Selassie ah get him crown!\nNo, no, no!\nNo, no, no, no way!\nYou got to work hard for it!\n\n[Verse 2]\nLook, okay\nThis the type of shit that have niggas in beef\nDat slick talk followed by some stick talk then sleep\nPissed off, I done took my fifth loss this week\nBig dog, I can scratch that shit off like fleas\nI got a lotta shit to say, but I'ma keep my list short\nI know alotta your favorites not gon' fuck with this part\nWhen I'm done, please know that I was trying to diss y'all\n'Cause if this is a competition, then I’m setting this bar\nIn my city, who’s with me? I'm in my own lane, jack\nNiggas said JID so flame, I propane rap\nI’m from East Atlanta like Gucci and Travis Porter\nBut my story is similar to the hare and the tortoise\nPen so sharp told stories you thought I forged it\nBack in the fourth grade, never read Curious Jorge\nMy nigga Corey kept a little 40 inside his North Face\nLeft a nigga with no face and beat the court case\nComing home from ball practice, took the street the short way\nWe from the East, but never gave niggas a reason\nTo try it or think it's easy, soft pussy niggas eat the sorbet\nOr eating your face, or squeeze the heat, then leaving your place\nI've been telling you life's a bitch, but it’s a beach in your case\nI've been yelling and throwing fits, I'm tired of screaming all day\nI've been fighting these fucking demons all day\nMan, this shit ain't never been easy, maybe I just need a breather\nHand your boy the blower, let me squeeze it\nBlow a little steam, I ain't hating, I'm just heated\nNiggas know what I mean, but niggas don't know what I been through\nSo if I offend you then, uhh, uhh, uhh, uhh\n\n[Chorus]\nI heard niggas looking for a problem\nBut we don't even move until the rent due\nMy niggas' hands itching, finna rob something\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you (Our Father)\nBetter pray to God\n\n[Verse 3]\nLook, okay\nFuck what a nigga say or, look, my mama think I made it\nLift my head to the skies, I cry and begin prayer\nThanks to the maker, got me out of an awful place\nMy nigga gone for 17 years like a cicada\nMore than a motivator for me to get off my anus\nAnd kick ass like I'm Danny Mainus\nPut the pen pad to the paper, big mad with a painting brush\nSplish splash, drawing scenes from my dim lit past\nDimwit, pimp shit, syndicate with the pen grip\nRipping shit, intimate, infinite rhyme kicking, l-l-let's begin\nWho's your list? Your top 10? You can say whoever better than\nI'm ready now, I was ready then, I was headed down the aisle\nRap game in a wedding gown, she gave me the ring\nI said, \"Yes\" and vowed for forever now\nOn the honeymoon getting naked now\nOn a money pile doing doggystyle\nI'm a father now, and you are my child\nOr you aren't my child, I'm on Maury now\nAnd I'm talking loud, the results are found\nYou are not the, wow, I should kill this bitch like a doggy pound\nWe divorcing now\nI want the cars, ring, clothes, all the house\nAnd you broke my heart, I'm re-organizing\nAnd really trying to be mature about it\nBut I gotta kill it like a fucking villain\nDream-villain, Spill-villain, rhyme to the ceiling\nWould I should I kill a rapper 'cause I coulda\nDuh nigga, this a gun and a bullet\n\n[Chorus]\nI heard niggas looking for a problem\nBut we don't even move till' the rent due\nMy niggas' hands itching, finna rob something\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\nBetter pray to God that he don't get you\n\n[Outro]\nNot that I need it\nThis nigga cap as fuck, man\nAin't no cap in my rap\nThis super cap in your rap, boy\nWhere y'all niggas from for real?\nWhere y'all from?\nNaw\nOhhh", "[Intro: J. Cole]\nYo, I'm in Atlanta, bruh\nHit me back, lil' nigga\n\n[Chorus: Johnny Venus]\nNow, elevate my status to \"Gucci bag us\"\nGlued to my apparatus, pussy harass us\nMe and Siri moving steery so that shit don't matter\nAnd, yes, them things gon' flash if you want to act up\n\n[Verse 1: J.I.D]\nDead 'em from every side of the spectrum\nHannibal Lecter lecture, body part bone collector\nNosy ass hoes get punched in the septum\nThat's part of the woes for throwing salt like Epsom\nPardon my bros, kinda off the rocker and steps\nDon't step, stupid, or you get slept stupid\nEast side little Route, Zone 6 vet\nShowin' respect, a nigga forever in debt, but don't forget it\nAnybody wanna see 'em, I can make 'em a believer\nAt your neck like Gillette, get you and the nigga next to ya\nIn present time they sayin' that I'm the next nigga\nWoah, woah, that kinda sound like a death trap\nCan't see the floor, elevator, where the steps at?\nJames Bond' 9—James Harden with the step-back\nNo D, niggas playin' foul, where the techs at?\nThat's cool, wave the 30 round, where the TECs at?\nBetter get back, better get you a jetpack\nThey shoot where the ref at\nThey shoot at your jefe\nThey leavin' 'em stank like Pepé Le Pew\nThey just put a hole in his Pepe\nI go where the check at, Margiella Gorilla\nThey kill a nigga for a thrill, they feel it now, cool, keep it movin'\nI won't be the nigga they taking out, breaking down, face down\nAs far as these rappers man, these words couldn't hurt a nigga\nFar as these rappers, I can't count on a ninja turtle's finger\nWho really is fucking with the kid, that is J.I.D\nI am loud, that is mid, I'm a pound, that's a smidge\nI'm a stallion, stout, strong, war ready, resilient\nGuess the Lord put me in position just to kill niggas\nA warrior, but words used is my spear\nMy sword, my fear, my Lord, my chance is void if I\nDo it for myself and don't give back to the loyal\nThe unemployed, all my boys in here\nOkay, let's really make some noise in here\n\n[Verse 2: Doctur Dot]\nI'm under pressure, smoking pressure, walking in no direction\nChalk it up to the devil for fucking with my perspective\nToo young to be a witness but old enough for the lessons\nSoo Young, got a tucker to fuck with the chief inspector\nI bleed just like your favorites, I shit just like the angels\nOh shit, I feel a change and a shift in niggas' thinkin'\nLike Lute, I got the jugg, I'ma say it's quite the finagle\nGet rich and make some babies that's weirder than Will and Jada's\nBut lately, I've been blocked up\nLately, I've been strugglin' with ways to get my stock up\nMe and Venus workin' on new videos to blockbust and city shows and pop-ups\nAnd really though I feel as though there's no bitch I could not fuck\nNiggas make art and act hard for no Oscar\nBoy, you're just Leonardo\nBorn in the life you had to learn to be part of\nStill, no deal, still whippin' the Mazda, but fuck\n\n[Verse 3: Johnny Venus]\n\"Niggas ain't seein' you, Venus\"—shit, and I ain't seeing me\nSo many nights at the bottom, swore I was ET\nMy mama beat me, mu'fuck a degree\nI chose both pills—my thoughts 3D\nAnd often I probably come off so off the deep beat\nThat a lil' nigga like me gotta keep at least two or three BPs\nIn the blunt, they're off a DP as the rain pops off of these street\nAnd the pain pops me another one to the brain\nI let the strain do what you can't, I know it's hard out tryna reach me, huh\nI'm battling addiction, I'm deep in premonitions\nI'm clutching on my last dollars, I'm stretching common sense\nA pressure point a keeper so I question my existence\nBe assessing my involvement, second-guessing my delivery\nLord, Ezekiel take the wheel, I'm flying in the young\nOut of luck, out of hope to fuck up\nSo motherfuck a time-limit, I'ma take what's mine, nigga\nHa—now, elevate my status to \"Gucci bag us\"\nGlued to my apparatus, pussy harass us\nMe and Siri moving steery so that shit don't matter\nAnd, yes, them things gon' flash if you want to act up\n\n[Chorus: Johnny Venus]\nNow, elevate my status to \"Gucci bag us\"\nGlued to my apparatus, pussy harass us\nMe and Siri moving steery so that shit don't matter\nAnd, yes, them things gon' flash if you want to act up\n\n[Outro: Johnny Venus]\nIf you want to act up\nIf you want to act up\nCome, act up", "[Intro]\nHasta luego, I'm finna break\n\n[Verse 1]\nAll of my, all of my life\nI been chasing a check and I never get it\nBeen around it, seen it, never had it\nMama, daddy, whole family, broke family\nI'ma get it, told 'em I'll fuckin' handle it\nAnd murder the game so the service candlelit\nEmergency lane and I'm swerving, damaging the whip\nBut shit, fuck it, I'm fucking vanishing\nHad to get out of Atlanta for a little minute\nYou know that there's madness in the fuckin' city\nI thought it was love here\nI thought I was good, I'm stuck in the mud here\nI'm looking for drugs\nI'm looking for big butts with the good hair\nOr a ten-piece hot lemon pepper sprinkled\nFries crinkled, that's the lingo\nIf that's your girlfriend, she acting single\nI caught the pass like I'm Ochocinco\nI hit the gas down ocho cinco, like 85\nIt's like 8 or 9 'o clock, my nine cocked\nIf you on my guap, I won't stop 'til that boy go pop\nThey won't stop 'til they boy like Pac\nThey just pop 'til they brain fall out (Damn)\nThey never know what I be talking about\nI only do it 'cause they never really talking about it\nBout it, bout it, turn the music louder, louder\nHow the fuck did anyone assume the God\nThe Son, the Son of God, the runnin' from the money\nBleed the blood just like the money, it's not Jumanji\nI'm the doom that damned the dungeon\nI'm the spoon that fed the hungry\nStand for something, fall for nothing, all or nothing\nY'all niggas balling, huh?\nJust to find out that shit is all for nothing\n\n[Pre-Chorus 1]\nI been going crazy, somebody pray for me\nTake a second, take a knee\nIt'll mean everything, it'll mean everything to me\n\n[Chorus]\nI tell 'em to get out the way, I'm finna take it to 'em\nHasta luego, we finna make a move\nGive me a break, what is you saying to 'em?\nGive me the 'K, I'm finna spray the room\nI'm finna spray the room (Shit, uh, okay)\n\n[Verse 2]\nOk, everybody rich, everybody skraight, yeah, everybody ballin'\nI never had shit, mind over matter, outside, I can't call it\nAll my niggas finna get a job, or they already got it\nCouple trapping, couple catching bodies\nPlease don't come to East Atlanta, shawty\nWith your bullshit and your flex cap tryna' juug shit\nNah nigga, you'se a good lick, be a good guy, you a good kid\nNever really understood this\nBut it's probably not for me to understand\nI just played the cards I was fucking handed\nAnd dealt with it like a fucking man\nYou my nigga then you my nigga then\nThen we stick together like we Huck and Finn\nWe gon' get the chicken while we fucking hens\nDon't let any nigga come fuck up the plan\nIf we gotta ride, well then, fuck it, then\nIf a nigga die, it got out of hand\nIf I touch the sky then my other guys\nRecognize, must avenge\nJeopardize, I publicize, justified\nWhen we busted in, were you terrified?\nWas it televised when them rebel guys started busting heads\nOver what a nigga said or do to JID?\nThese the crazy niggas that I grew up with\nIn the shady city that I grew up in\nThey ain't doin' shit, but they doin' shit\n\n[Pre-Chorus 2]\nHasta luego, I gotta get up away from here\nHoping that somebody pray for me\nTelling you it'll mean everything\nEverything you know what I mean\nThere's no working no emergency\nI don't wanna be a burden, yeah\nI just really hope you love a nigga when he's hurting\n\n[Chorus]\nI tell 'em get out the way, I'm finna take it to 'em\nHasta luego, we finna make a move\nGive me a break, what is you saying to 'em\nGive me the 'K, I'm finna spray the room\nI'm finna spray the room", "[Skit]\nNah bruh (Huh?)\nWhat you talking bout, homes?\nAyy, ayy, nigga, Snapchat niggas twisted up real tight\nI'm with my motherfucking brothers, nigga (Hahahahah)\nThey was representing for Trump real tight\nBut we in this motherfucker real tight\nNigga, ain't left, everything right\nNigga, I'm tight!\nNigga, fuck you talking about?\nBars forever, nigga!\n\n[Intro]\nBars, bars\nMe and my two, okay\nMe and my two, alright, me and my two, okay\n\n[Verse]\nMe and my two niggas be like Ed, Edd 'n' Eddy\nI'm Zack, you AC, that Jessie and Kelly\nI pull up to your hood, just let me know when you ready\nI'm rolling up this dub, finna face it, beheaded, mm-mm\nHold on, chill out, please give me a second\nI'm drowsy off a Xan, nigga, legs is spaghetti\nCut all of the bullshit, nigga, chop the confetti\nYou ready? I'm ready, you ready? I'm ready, uh, alright\nNever sell weed cause I smoke it too much\nI fuck up the pack, I don't fuck with the sack\nAnd I mean the bread come quick\nHe told me bring him 300\nI brought him excuses and like 200 or something\nI mean most of y'all niggas love drugs like me\nLove me like drugs, bitch, I might be\nYo' love light bulb, turn on lights please\nTurn off your cool, I mean, I might freeze\nI mean hold on, relax, please give me a chance\nI was moving too fast, I ain't hear what you said\nWe was celebrating life, tryna get to the fetti\nBut me and my two niggas, we like Ed, Edd 'n' Eddy, damn\n\n[Outro]\nEd, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy\nEd, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy\nNigga, Ed, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy\nEd, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy, damn", "[Verse 1: J.I.D]\nMy girl booty soft and it's shaped like a skrawberry\nHer pussy bald with a tat like Stephon Marbury\nCarry all my dirt to the grave, I'm the pallbearer\nBury all of my sins, staring out of the Benz\nGone off weed, gone off Hen', gone with the wind\nGone with the pretty long heiress with the fairest skin\nYelling in her face, and she repeat it like a parrot and\nApparently, she gone keep yelling at me, I'ma never win\nWhere your ass was at when I was sleeping on the couch\nAnd in the whip?\nProbably with another nigga, on another nigga dick\nI'm on another tip, my skin so tint, strength on strength\nOne on ten against me, I won't break, I don't bend\nWatch your statements, guard your chin\nGuard your heart, guard your light\nFind your zen, mind your lightness\nYou doing without cause you ain't looking within\nBut if you ever in doubt, give this a spin\n\n[Chorus: BJ the Chicago Kid]\nYeah, for life, baby, I'm dressed for the war\nBaby girl, I'm your soldier\nBut trippin' like this, back and forth, wonder who gon' hold you (Who's gon')\nEverybody needs somebody to hold them down (I said)\nEverybody needs somebody to hold them down\n\n[Verse 2: J.I.D]\nCheck, look, cool\nI mean shawty had relations that we never could speak about\nYou get mad, I'm mad, we sleep it out\nAnd then she had a man who used to beat her\nSo she told me she wanted out\nGot a couple abortions, now that pussy's a haunted house\nNow her heart cold, Antartica, Siberia\nHad it planned out, curriculum, criteria\nChange, she feel pain, strain, built-up anger\nFrom dealing with a dickhead, putting her life in danger\nI understand, it's times that you go through your women things\nAnd sometimes can't gauge clearly on what you be thinking\nI swear I got your back and got the tab on what you drinking\nYou ain't gotta move a finger or pinky when we linking\nWhatever keeps your boat afloat or ship sinking\nFrom loose lips of side women stepping out of position\nBreaking out of a system, prison\nParallelogram, shaping the prism, stop signs never stopped I\nLet's be realistic, I been trying to get in touch with my senses\nAnd be better to my sisters\nBut niggas think that you feminine when you sensitive\nMy homegirl rap, and she feminist\nHold it down for the women, I call her \"Feminem\"\nTell 'em how you really feel headass\n'Cause ass shots are dead ass and fake tits been around, we gas it\nGirl, you perfect without that makeup or the plastic surgery\nI'ma tell you how it is like Ron Burgundy\n\n[Chorus: BJ the Chicago Kid]\nYeah, for life, baby, I'm dressed for the war\nBaby girl, I'm your soldier\nBut trippin' like this, back and forth, wonder who gon' hold you (Who's gon')\nEverybody needs somebody to hold them down (I said)\nEverybody needs somebody to hold them down", "[Intro]\nYeah\n\n[Chorus]\nOkay, I told motherfuckers I was sick as a bitch\nThe dopest dope you smoke, gon' get you a whiff\nWatch how these niggas flip the script with the flick of they wrist\nSouthern lyricists don't exist like my flow is a myth\n\n[Verse 1]\nGet my girl angry and pissed and give that pussy a kiss\nPushing the same piece of shit until I get me a Bentley\nSame niggas, same goals, same dreams and epiphanies\nMe and my niggas are same lines as symmetry, wasn't empathy\nRemember we would front yard brawl with big Timothy?\nKicked them doors because we had a lot of energy\nMy brother was locked up for shooting at the enemy\nCaught one nigga then caught fifteen\nI ain't meet that nigga 'til I was fifteen\nNow I'm kicking 16's with a big screen in attempt to get the big cream\nLittle guy with a big dream, I need guidance\n'Cause if I don't succeed, I probably proceed violence\nSippin' on the brown, no Bobby, I don't fuck with nobody\nNo team and no posse, you can catch it like Shockey\nKing of all kings, praise Haile Selassie\nRastafari, I don't need nobody, the God's got me\n\n[Chorus]\nOkay, I told motherfuckers I was sick as a bitch\nThe dopest dope you smoke, gon' get you a whiff\nWatch how these niggas flip the script with the flick of they wrist\nSouthern lyricists don't exist like my flow is a myth\n\n[Interlude]\nYou ain't used to the hustle, bro\nYeah, that shit how you live\nWe on a trade for a trade\nI do this for you, I do this for you, you know what I mean?\nI took the risk, you took the risk, I ain't disrespect it\n\n[Verse 2]\nSo part of the reason I be so hard on my people\nWe never had it easy, never had a pot to pee in\nI be on my knees praying till my onomatopoeia's packing a coliseum\nAin't no parking, I gotta see J.I.D\nGotta be there for my family, I gotta, can't try to be\nI could be out of my mind, thinking logically\nNo apologies for speaking how I feel, I silently swore solemnly\nThat I would be the guy to make my black people proud of me\nRoses to the mothers of anybody that doubted me\nYo' chick want dick, bitch dove in the covers\nOverseen my areas, surveyed over my brothers\nYou touch them, you kill me, you can't get close to none of us\nThey still double-dribble, we going for triple-doubles\nTriple up on your investment fuckin' with us\nProbably have to rock that vest shit, you fuckin' with us\nWait (Nah bro) Huh? (What you talkin' 'bout, homes?)\n\n[Chorus]\nOkay, I told motherfuckers I was sick as a bitch\nThe dopest dope you smoke gon' get you a whiff\nWatch how these niggas flip the script with the flick of they wrist\nSouthern lyricists don't exist like my flow is a myth\n\n[Verse 3]\nOkay but fuck that shit, I gotta get it, I gotta get 'em\nTired of picking these locks, you don't respect my existence\nI used to sleep in my car, never a park or a bench\nBut damn a nigga was broke, damnit if I didn't get it\nThem niggas was thinking that it was just some rap for the kid\nOne day they gon' hit my phone, hit the show, scream, clap for the kid\nLet's get it poppin', they're pulling pistols on apostle Paul\nSo pay the piper or meet the sniper, legend of the fall\nI knew in diapers you and I was nothing alike at all\nI do or die, you do it to die, I'm really making calls\nYou couldn't kill it and take it out of me, the ideology\nThis the odyssey, I'm Odysseus, you gotta follow me\nWatch how I maneuver, I influence the influencers\nThe flow is like a fluent influenza going through the motion\nSo I motivate all of my niggas, they tell me kill 'em with kindness\nI'd rather kill 'em and their other significants\nWriting lyrics in the city with pretty booties and titties\nDon't get the cooties, it ain't like the movies\nIt kinda is 'cause they're shooting, kind of shit is you moving?\nShit I'm pushing, empower the people life where I grew up\nSomeone tutored the students, these niggas stupidest, stupider, stupid shit\nSick as a bitch, flick of the wrist, my pen cleanse  my many sins\nThe irony the iron can't straighten out any wrinkle in existence\nRipple in time triple my eyes realistically sick in the mind\nSick in the head?\nWish I was dead, sick on a med, addicted\nMy lead sick 'em, give 'em, send 'em to hell, eh\n\n[Outro]\nOkay, okay, I told motherfuckers I was sick as a—\nOkay, I told motherfuckers I—\nBitch", "[Intro]\nHey, we really need to talk\n\n[Chorus]\nYeah, yeah, uh\nWant me to tell you the truth?\nWhat you expect me to say?\n'Cause if we keeping it true\nIt's probably never gon' change\nBut I guess it's hereditary, baby, why you playing with my heart?\nIt's hereditary, girl, you was just playing from the start, yeah\nShit, but if you let me explain, shit\n\n[Verse 1]\nI shouldn't let you explain, you should just let me explain\nI see the games you be playing, it's really ice in your veins\nIt's kinda fucking insane, argue and power exchange?\nI guess I'm out of my lane, I know I'm losing my brain\nBut I know it's hereditary, baby, 'cause your mama was a G\nAnd your daddy wasn't there so you be tryna play with me, yeah\nShit, but, but that ain't the wave, yeah\nBut if I'm keeping it true, I know why I be this way now\nWe don't speak, we sit, eat food faced down\nWe don't sleep no more, we need space now\nShe gon' leave and go and her find her a bae now\nOuch, ouch, that's pain, yo, oh, so painful\nTrying to change, just let me die in the rainfall\nI can't save her if she don't want to be saved, how\nPlease, God, do something for me, God\nShe cut me deep just to see if I'ma bleed out\nI know this ain't​ what I need, but who's to say what I need\nWhat you say to your demons?\nWhat you say when your heart is walking away with your feelings?\nAhhh, but didn't you know I tried, tried, tried, tried\nTried to be the guy in your life?\nBut you tied my soul, spirit, and mind\nBeen doing this all your life\n\n[Bridge]\nThe fuck you want me to say?\nAnd if I'm keeping it true\nIt's probably never gon' change, no\nBut I guess it's hereditary baby, why you playing with my heart?\nIt's hereditary, girl, you could've said this from the start, yeah\nBut, but ain't that a waste?\nA big fucking waste of time\nA big fucking waste of time, yeah\n\n[Verse 2]\nUh, okay, I remember all the better days\nUsed to spend a hella lot of time\nGuessing something had got in the way\nGuessing I was probably out of line\nThen you said, \"Don't speak to me\"\nI'd be like, \"Okay, it's fine\"\nThat's just gon' prolong the fight\nKnow that we said that if one of us upset\nThen we just not gon' sleep tonight, aw, damn\nMan, this shit has turned all bad\nCall Mama, call Dad, call Izzy, call Precious, call Pat\nShit, it's like she spit in my face\nAnd now the world's fallin' down on me\nAnd I can't handle the weight\nBut I'm finna get medicated, maybe it'll take the pain away\nA relationship will make you have a fucking revelation\nBut, but that ain't a waste, no\nIt's never been a waste of time, a waste of time, waste of time\n\n[Chorus]\nUh, want me to tell you the truth?\nWhat you expect me to say?\n'Cause if we keeping it true\nIt's probably never gon' change\nBut I guess it's hereditary, baby, why you playing with my heart?\nIt's hereditary, girl, you was just playing from the start, yeah\nShit, but if you let me explain, shit\n\n[Outro]\nHey, we really need to talk\nBut, of course, you never answer your phone\nI just don't think this relationship is working out\nYou never make time for me\nYou never show me off\nYou just never make me feel special\nI mean, I want to work things out, but I would need you to change first\nAnd we both know, that will never happen", "[Chorus: J.I.D]\nI been so down on my luck and stuff ain't lookin' up\nI need somethin' that's takin' me higher\nAnd maybe I'm outta touch in a rush\nAnd life been kickin' my butt but that ignited the fire\nAnd maybe it's when I'm spillin' my guts\nKnow you don't trust me or love me, you steady you call me a liar\nOr maybe you really hate me, you can't be\nI need for somethin' to save me 'cause, little baby, I'm tired\nYeah\n\n[Verse 1: J.I.D]\nHow you gon' dump me and then leave wit' my hoodie?\nAnd you ain't comin' back, give me back my hoodie\nAnd now you tryna make a scene at the movies\nYou really wanna act, bitch, we at the movies\nI want my money back, I'm leavin' for goodie\nAnd I get aggy, don't even wanna be here\nAnd you get mad 'cause you don't even wanna leave here\nAnd now it's bad 'cause we ain't even seen the previews\nAnd now she mad, takin' shit to social media\nAnd I just need you to tell me how you feelin'\nAnd I just need you to come at me wit' real shit\nBotherin' people 'cause we fightin' in the dark, yeah\nWe ain’t gotta leave but we gon' sit a seat apart (Yeah)\nUh, tears in the bucket of fuck-its\nFightin' and fuckin' and tusslin' and fightin' and fuckin'\nLovin', lovin' unless you lucky\nI fuck wit' you because you real and you beautiful\nBut still, starin' at the screen only thinkin' how I feel\nFor real\nI wanna share my popcorn wit' you\n'Cause I won't eat the whole thing\nBut you still got an issue\nAnd I been tryna sip yo' drink, meet the kid in the middle\nBut naw, movie over, she just goes to the car\nPull off, she drove, didn't open the door\nSo cold, outside\nAnd ya boy need a ride\nOh God, it's really a problem\nAnd I'm so tired of\n\n[Chorus: J.I.D]\nI been so down on my luck and stuff ain't lookin' up\nI need somethin' that's takin' me higher\nAnd maybe I'm outta touch in a rush\nAnd life been kickin' my butt but that ignited the fire\nAnd maybe it's when I'm spillin' my guts\nKnow you don't trust me or love me, you steady you call me a liar\nOr maybe you really hate me, you can't be\nI need for somethin' to save me 'cause, little baby, I'm tired\nYeah, I'm tired, baby\n\n[Verse 2: 6LACK]\nHey, how you gon' leave wit' yo number on my phone bill? (Bill)\nLook inside yo' wallet you got one bill (Bill)\nNever got a job but you want chill (Chill)\nGirl, that shit is unreal (Unreal)\nI'm feelin' a little sluggish\nYou think I'm entertainin' all the rubbish\nIt's a no from me, dawg\nI guess I gotta let you free fall\nFlippin' through my shit like we in a gym, naw\nI'm talkin' my shit 'cause I'm off the Hen', dawg\nIf I, uh\nThere ain't nothin' left to admire\nI been listenin' to Mýa like woah\nDon't you let the love turn to pyro\nHow you let it drag on? Spyro\nGoin' 'em at Matt Ryan, spirals\nI'm seein' Z after Z after Z\nHe, wait, who after me, huh? (Huh?)\nWait, don't actually explain nothin', I don't wanna know\nI'm tired every time I come home\nShe all alone, it ain't my fault\nI'm livin' life, she in the dark (Yeah, yeah)\nAin't got no bite, a lot of bark\nI clear the room, so we can talk\n\n[Chorus: J.I.D]\nI been so down on my luck and stuff ain't lookin' up\nI need somethin' that's takin' me higher\nAnd maybe I'm outta touch in a rush\nAnd life been kickin' my butt but that ignited the fire\nAnd maybe it's when I'm spillin' my guts\nKnow you don't trust me or love me, you steady you call me a liar\nOr maybe you really hate me, you can't be\nI need for somethin' to save me 'cause, little baby, I'm tired\n\n[Verse 3: Ella Mai]\nTired (Tired)\nThat makes two of us\nI'm a liar (Liar)\nWhere's the truth in that?\nI can't figure how you run your mouth\nYou been so down on your luck, and stuff ain't lookin' up\nYou need somethin' that's takin' you higher\nMaybe you're out of touch in a rush\nAnd life been kickin' your butt, but that ignited your fire\nAnd baby, it's when you're spillin' your guts\nYou don't trust me, love me, steady call me a liar\nOh baby, you really hate me, you can't be\nYou need for somethin' to save you\n'Cause, little baby, you tired\nTired\n\n[Outro]\nPublic service announcement\nNiggas ain't shit\n(Niggas ain't shit but a tongue and a dick)\nHey\n(Niggas ain't shit but a) What? (And a dick)\nOkay\nNiggas ain't shit but a tongue and a dick\n(He ask me where I'm at like I owe him shit)\nPeriod", "[Chorus: J.I.D & Mereba]\nAnd if I'm trying to tell the truth, it's all bad\n'Cause if you looking for the proof, it's all there\nCome on baby, I'ma tell the truth and nothing but the truth\nYou can't handle the truth, you can't handle it, ahh\nAnd if I'm trying to tell the truth, it's all bad\n'Cause if you looking for the proof, it's all there\nCome on baby, I'ma tell the truth and nothing but the truth\nYou can't handle it, you can't handle the truth, no\n\n[Verse 1: J.I.D & Mereba]\nAnd if I'm trying to tell the truth, it's all bad\nBaby, do you love me? I know that you do\nI been trying so hard, I know I gotta be real with you\nCan't be playing with hearts, I know you feel like you feel it too\nI'm gon' step into the shade\nI don't want the sun in my face, but I don't want to walk away\nWithout me saying what I have to say\nAnd I been praying it's another way\nBut it's like mayhem on my fucking brain\nI gotta say, I'm finna go insane, shame, shame\nAnd I don't know what I can do (Fuck)\n'Cause maybe you're past I\nAnd maybe your last guy was probably just right for you\nAnd baby, I can't fight the truth\nBaby, I can't provide the proof\nAnd baby, I can't fight with you, yeah\n\n[Chorus: J.I.D & Mereba]\nAnd since I'm trying to tell the truth, it's all bad\nAnd since you're looking for the proof, it's all there\nCome on baby, I'ma tell the truth and nothing but the truth\nYou can't handle the truth, you can't handle it\nAnd since I'm trying to tell the truth, it's all bad\nAnd since you're looking for the proof, it's all there\nCome on baby, I'ma tell the truth and nothing but the truth\nYou can't handle the truth, you can't handle the truth, no\n\n[Bridge: J.I.D & Mereba]\nAnd since I'm trying to tell the truth\nSo tell me why you got to lie, lie, lie, lie, lie, lie?\nSo tell me why you got to lie, lie, lie, lie, lie, lie, lie, lie, lie?\n\n[Verse 2: Mereba]\nSee I'ma call it off here, boy this intuition ancient, oh\nYou ain't even really gotta say shit\nI peep your in-the-cut shit, yeah, I'm a sharp motherfuck—er\nNo peace 'til we sleeping\nWe find reasons for deceiving\nAnd then we both been keeping secrets\nI remember when it felt like a dream\nI hope it's a blessed world\nThough I bet your next girl won't tell you the truth, like I do\nIt's just we were coasting on a new high\nYou never let slip that hand on my hip\nIt was Heaven, it was bliss 'til it flipped right\nI ain't finna lie to you though\nI ain't finna cry, never mind that you lied\nThat you spilled milk all on my clothes (fuck)\nThey say you reap what you sow\nLord knows that's some lies I've been told\nOooh watch it grow\n\n[Outro: J.I.D & Mereba]\nAnd I done finally heard the truth is all bad\nI wasn't looking for the proof, but God damn\nCome on baby, you should tell the truth, but baby fuck the truth\nI can't handle it, you can't handle it\n\n[Outro: Mereba]\nYou got me extremely fucked up", "[Intro: DJ Drama]\nOh yeah, DJ Drama\n\n[Chorus: Joey Bada$$ & DJ Drama]\nI'm trapped in my mind, I need help (I need help)\nI'm still going, gangster\nI sit back and recline, and inhale (And inhale)\nBitch, I'm back on my grind, you can't tell\nWhen I hit the spliff, only time we face L's\n\n[Verse 1: J.I.D]\nUh, okay, I stepped in this bitch like I stepped in some shit\nRight, left, right, left, left, hop, dip, skip\nJ.I.D, dipshit, the spliff lit, I'm lifted\nI'm finna hit the zip lick for zip-lock bags so keep your lip zipped\nShit poppin' like ten zits, I got a little weed oil\nPull it when the pen lit, that's a good drag\nHe be high as fuck in a minute, and that's a good bag\nI got it from my Cali plug and she's a dentist\nBack in the book bag, I roll it, light it, no look pass\nThat's too gassy, sulfuric acid, girl you nasty\nNow the lips of this spliff is like wet as shit from your lipstick\nYou could just have it, but you still got a fatty\nStill managing to come up with the magic in the true fashion\nJ.I.D Milly Rockin' through the madness (Madness)\nSilly cockroaches don't forget the Glock is closer to me\nSo when you approach him or greet him do it with caution (Caution)\nWe can smoke and you can watch me roll it up\nStay away from them niggas tryna sneak Cosby in your cup\nTold you one time, I ain't gon' do no molly with you but\nYou so fine, I'd try and do some molly off your bu-, heheheh\nI ain't tryna sabotage your killer vibe\nI made a joke so I can hide what it is I really feel inside\nBut in your mind, I be wildin' and I'm high out of my mind\n\n[Interlude: DJ Drama]\nM-E-T-H\n\n[Verse 2: Method Man]\nAyy, look\nLight a booger up, wedgie in the butt, yep, we pulling up\nMy cup runneth over, theirs ain't full enough\nThey bad but that ain't good enough\nThey mad 'cause they ain't half of what I'm cookin' up\nTaraji out in line, giving cookies up\nPlug in my supply, need a jumper cable, why?\nGon' hook me up, the devil is a lie (Lie)\nWho won't shush me up, I heard he got that fire\nGon' kush me up, I'm gone\nPush me up, mister how high, that I can kiss the sky\nGon' look me up\nShe pushing up her bra, like cookies looking kushy in the jar\nTold her book me, hit the nookie up tomorrow\nSee police be tryna book me 'cause they put me in Segal\nYou's a rookie, I'ma boogie 'fore you put me in the car\nI got beef with my connect, I'm vexed\n'Cause you see his THC is not correct, I think he should not collect\nNot upset, I ain't trippin', what, he pitchin' out his best\nShould be glad my hand is gripped around his spliff and not his neck, yes\nThis not a bogie, you already know the smell\nNot that codeine, I heard that lean is deadly for your health\nIf you know me, then know that I already got some L's\nOf some OG, so you can smoke that Reggie by yourself\n\n[Chorus: Joey Bada$$]\nHa, I'm trapped in my mind, I need help (I need help)\nI sit back and recline, and inhale (And inhale)\nBitch, I'm back on my grind, you can't tell\nWhen I hit the spliff, only time we face L's\n\n[Verse 3: Joey Bada$$]\nEenie miney moe, I pick a flow and set sail\nJ.I.D and Joey, they say we the best out\nThey studying the methods, tell them, \"Class in sesh now\"\nI'm a walking legend walking with my chest out\nPlease babe don't you push me 'cause I'm off the edge, dawg\nMy sonics got me politicin' with them hedgehogs\nYou hooked up on my findings, I'm hooked on this chemdawg\nI smoke on the regular, you smokin' that Reginald\nLook y'all ain't ready for this, I'm back spazzin'\nChain too heavy, it's giving me back spasm\nPardon the sarcasm, inside it's all pessim'\nI rides the beat until it have a bargasm\nPregnant pause (Uh, uh)\nBitch I might shoot the club up\nI'm way too raw, I'm going in without a rubber\nI'm smokin' on this fire batch, it got me raisin' hell\nWhile I hold this Mac-11 screaming, \"Fuck twelve\"\n\n[Chorus: Joey Bada$$]\nI'm trapped in my mind, I need help (I need help)\nI sit back and recline, and inhale (And inhale)\nBitch I'm back on my grind, you can't tell (You can't tell)\nWhen I hit the spliff, only time we face L's (Face L's)\nI'm trapped in my mind, I need help\nI sit back and recline, and inhale\nBitch I'm back on my grind, you can't tell\nWhen I hit the spliff, only time we face L's\n\n[Outro: DJ Drama]\nRide out\nThat's what you call generations, and generation now\nKnow that, J.I.D", "[Intro: DJ Drama]\nJust the other day it was a just dream to make it\nJust the other day, that same dream, they tried to take it\nJust the other day all you wanna do is see 'em be great\nJust the other day, they look you in your face, eyes full of hate\nBobby Kritical\n\n[Chorus]\nJust the other day I was goddamn broke\nYou got a five, I got a five, let's smoke\nJust the other day I was running from them folks\nLike (Woah, woah) nigga you too slow\nJust the other day I was telling all my bros\n(Woah, woah) Nigga, it's time to go (Woah, woah)\nJust the other day I was goddamn broke\nJust the other day I was, yeah\n\n[Verse 1]\nJust other day I was broke as a bitch\nWalking to work in the hot sun, so-soaking it in\nI never been a dope man, but I'm the dopest of man\nBuying some smoke from the dude with the dope\nThrow five, four point five, so on, so forth\nI'm tryna get my fucking goals, not Goyard\nPaying for the lawyers, get my bros out the courtyard\nCause I got the ear for the flows, not Mozart, but damn a nigga go hard\nPut me on a postcard or miss me 'til the show start\nMy niggas got a Benz and he push it like a go-cart\nTryna get one of them, but my aunts like \"don't start\nThe bullshit again fore' you end up a broke boy again\"\nSo don't pretend\nOh we remember, last September, like the coldest winter\nMan I really had to show these niggas\nI owe these niggas a throat slit, know me nigga\n\n[Chorus]\nJust the other day I was goddamn broke\nYou got a five, I got a five, let's smoke\nJust the other day I was running from them folks\nLike (Woah, woah) nigga you too slow\nJust the other day I was telling all my bros\n(Woah, woah) Nigga, it's time to go (Woah, woah)\nJust the other day I was goddamn broke\nJust the other day I was, yeah\n\n[Verse 2]\nToday, today, I woke up like this\nMy girl on my left, no watch on my wrist\nSome rings on my fist, what we did last night? Damn\nWas it a hurricane in here last night?\nIt would appear that something sexual or severe happened\nBeing that I see liquor and beer, weed\nPeople still in the living room sleep\nCome and see, huh\nShe say, \"I'm dizzy,\" don't wanna move, just wanna lay under me\nHonestly, I know that just the other day you was goddamn broke\nWatch outside, that nigga shot them folks\nGlock in ya ride, you gotta watch them folks\nAnd the cops be wilding, we ain't even provoke 'em\nI remember being broker than I is right now\nTryna find a place to live, shit I'm is right now\nIn doubt of my next move, get a pill, bite down, find focus\nI grab pen, it was poetry in motion\nNot the same for many folks, different strokes\nColloquialism, idiot vision, y'all seen I was doing the most\nDefinite dope, it's on the scene, not in need of a vote\nRepping the city, what's ya team, nigga? Fuck 'em\nEast Atlanta king and I mean every letter\nBut when I'm good, I'm good, when I'm bad, I'm better\nThe man of the method, it's a method to the madness\nI'm stepping in my bag with the cannon, step back\nRepping the city, showing love that I don't ever get back\nBut that's the plight of a player, plot an attack and rocking and rapping\nRippin' rappers off of the fuckin' map, suckers suffering, succotash\nI need that Mark Zucker bag, Zuckerberg\nHovercraft flows, I don't fuck with that, bullshit below\nFrom the ceiling to the floor, full schizo for the dough\nDual pistol, but I know I'm planting seeds so they can grow\nBut if they don't, then I don't know\nBut all I know is, nigga\n\n[Chorus]\nJust the other day I was goddamn broke\nYou got a five, I got a five, let's smoke\nJust the other day I was running from them folks\nLike (Woah, woah) nigga you too slow\nJust the other day I was telling all my bros\n(Woah, woah) Nigga, it's time to go (Woah, woah)\nJust the other day I was goddamn broke\nJust the other day I was, yeah", "[Intro]\n*Coughs*\nAhem, yeah\nMelancholy cool\n\n[Chorus]\nMelancholy cool\nMatthew McConaughey\nOn a money mission, tryna get it\nSplit it with all of my hombres\nBoy, the revolution underway (on the way?)\nNo, it's underway (under where?)\nHah, bitch you said underwear, alright, yeah, yeah, yeah\nHe said underwear, that's so stupid\n\n[Verse 1]\nI don't really like the fuckin' riddle\nBut if it's an issue, then let's address it, I got other shit to tend to\nReally with the pen, I'm an issue\nBut it's not what you saying, it's what you thinking on your mental\nNever diss you, never did shoot, well never could prove\nMy young niggas pull incredible moves\nGet off the couch, get money like the Everest dude\nThe world tough, boy, don't get beheaded\nYou damn right, I could've never better said it\n\n[Chorus]\nMelancholy cool\nMatthew McConaughey\nOn a money mission, tryna get it\nSplit it with all of my hombres\nBoy, the revolution underway (on the way?)\nNo, it's underway (under where?)\nHe said underwear, that's so stupid\nHah, bitch you said underwear, alright, yeah, yeah, yeah\nWell, again!\n\n[Verse 2]\nTryna make a little meal ticket\nPut a mil' on a house and crib\nHouse of cards, house of broads, get it in how you live\nHow the fam? How the kids, little son?\nGetting big, that's your chick? Oh shit\n\"I wanna be like you when I get older\nI wanna try the baking and soda\nAnd coke with the cola and dope with the odor\"\nDamn, shit\nIt look like I gotta bust heads like bruh said, nigga suspect\nAnd I don't play muh'fuckin nut check, this a gut check\nAfter I done killed y'all, I'ma hit your bitch up and have a slut fest\nNo Morris Chestnut, bitch nut chest\nLeave the nigga in the past where the dust is\nThis a 100 round drum, nigga duck this!\n\n[Chorus]\nMelancholy cool\nMatthew McConaughey\nOn a money mission, tryna get it\nSplit it with all of my hombres\nBoy, the revolution underway (on the way?)\nNo, it's underway (under where?)\nHah, bitch you said underwear, alright, yeah, yeah, yeah\nHe said underwear, that's so stupid\n\n[Verse 3]\nMelancholy cool, Matthew McConaughey\nLeonardo too, you know what I'ma say\nI'ma make a move, get to it andale\nOver and under pay, stunt like my mama say\nI don't really like the fuckin' riddle\nSo if it's an issue then let's address it like salad, come on, let us\nBurger wanna beef with a king, come on Checkers\nCheck us, chickity check yourself before you wreck yo'\nNiggas slap and dap hands and let the TEC go\nDisrespectful shit like that, I don't regret tho\nMy nigga just got locked up two Fridays ago\nPlay the McConaughey, now he out of that hoe\nFuck the streets, we done conquered divided that hoe\nBlock shots, I am Vlade Divac in this hoe\nWith a '9 cocked screaming, \"Hypocrisy though\"\nFinna wild in this hoe, finna wild in this hoe!\n\n[Chorus]\nMelancholy cool\nMatthew McConaughey\nOn a money mission, tryna get it\nSplit it with all of my hombres\nBoy the revolution underway (on the way?)\nNo, it's underway (under where?)\nUnderwear, yeah, yeah, yeah\nDamn, everything is underway\n\n[Outro]\nMelancholy cool\nMatthew McConaughey\nOn a money mission, tryna get it\nSplit it with all of my hombres\nBoy the revolution underway, on the way?\nNah, it's underway, under where?\nOver there, yeah, yeah, yeah\nMelancholy cool\nMatthew McConaughey, yeah, yeah, yeah", "[Intro]\nUh, fuckin' wisdom tooth is killin' me\nFuck, whatever—ahem\n\n[Verse 1]\nCheck, anybody can see the kid got it\nI see niggas ignore it so I feel a way about it\nFrom rapping in that truck with bolts on and rolling blunts\nBagging a couple bitches and fucking them all at once\nFriday night lights, I was catching and dropping punts\nThinking 'bout rapping, I could be J.I.D or like Chris Johnson\nMy thumbs keep strumming kinda like the Mumford & Sons\nMommy went dumb when she got that call, I had got caught\nKicked out of college for tongues, niggas be talking\nI wasn't even on camera, just hit the lick with some amateurs\nGlad we did that, now I'm flying to Los Angeles\nWith a 8th in my pre-rolls, call that shit a tarantula\nTarantino on your big screen, ho\nSlave man, South East Coast, J.I.D or DiCap Leo\nSet it off, my big sis reminded me of Cleo\nAnd my brothers is killers you might see on Nat Geo\nYou gotta chill cause niggas can get they cap peeled\nI keep that 40 like I'm Pat Tillman\nThey sent my nigga up the hill, yea they jack jill'd 'em\nAnd a million other black children, let's crack the seal, I'm spillin'\n\n[Chorus]\nAlright, I feel amazing, I can feel the haters, do something\nI ain't finna fade ya, I ain't got a taser, shoot something\nNiggas talkin' crazy, wipe the little baby, too funny\nPull up on ya, had a crew coming, take a deuce on ya, hold up\n\n[Interlude]\nHahaha, for real\nI mean man, I did it man, talkin' 'bout for real, man\nYou had me doin' that, three in this shit man\nYou some dick, you guys had, you guys [?]\nYou had [?]\n\n\n[Verse 2]\nLook, look, alright\nLooking for it in the night time, I been looking for it all day\nI'ma get it at the right time, watch 'em fuck with me the long way\nWatch a nigga at the bike whip, hit the buyer with the stone face\nGreenbriar with the whole case, bust it down and flood the whole state\nBitches know when that work good, Anna Mae eat the whole cake\nWe ain't even gotta role play, had to get it out the bowl way\nKill shit, OJ, no way, Jose, slo-mo, okay\nI don't do this shit at your pace, I ain't here to do it your way\nAnd I'm coming through the ceiling\nThrough the floor, back and front door way\nYou do not want war, I swear, I swore on your grave\nI been on my shit since like 6th, 5th, and 4th grade—wait\nEven before grades, going to my brother court dates\nAnd I asked my mom and dad what he did but they'd never tell me\nThen I figured he killed a nigga or got caught for some dope he selling\nKinda close but no cigarillo, he was armored up, that's a armadillo\nMy pops did time in the military and he taught us how to disarm a nigga\nSee the boys, you better warn a nigga but J.I.D prolly got warrants, nigga\nLike North Carolina or South Carolina, got the hideout in like Florence, nigga\nSwear your raps so borin', nigga\nThen you say you trap—you be lyin', nigga\nI don't fuck with none of y'all happy trappers\nBetter grab and strap, people dyin', nigga, Lord\nSorry we making all the noise, but you ain't have to call the boys\nSome shit you just can't avoid, dumb shit, coolin' with the squad\n\n[Outro]\n[?]", "[Intro: 6LACK]\nYour best shit ain't better than my worst shit, yeah\nAin't better than my worst shit, yeah, mm\n\n[Verse 1: 6LACK]\nYour best shit ain't better than my worst shit, yeah\nDon't call me underrated, you ain't heard shit, yeah\nWork like a vet, and know I don't work for a check\nBut I'ma run it up, you can bet\nFuck the competition, I'll impress myself\nDon't need to watch me, you should check yourself\nSo much on the shelf, that if I take a verse off the shelf\nIt probably break the Earth, raise Hell\nBurn like 8701\nUshered in a new flow for the old one\nHer pants too tight, I don't hold no gun\nBut Jiddy-Jid bookbag probably hold one\nI keep a smile on my face when it's all bad\nRecord labels on my line, I ain't call back\nAnd your girl on my line, I ain't call back\nHe got his eyes on the prize and they all mad\n\n[Verse 2: J.I.D]\nAye, shit, it's like as a reminisce I'm doing well, yeah\nBuying with my 9, bitch it ain't the smell, no\nMy nigga caught the charge, yeah, he caught the L\nHe down the road now, send him some mail, uh\nGet it while the gettin's good, I had to get it together\nI was gathering my goods for the inclement weather\nTrying to make it heavy and heard, your shit was light as a feather\nThat's fine, get it together, you can do better\nYou can be whatever you gon' be but you can be never\nJ.I.D the monster, mayhem and tax by the letter\nLet us pray for those who thought it was a game or child's play\nSomebody answer, take the floor and I'll wait\n\n[Outro: J.I.D]\nYour best shit ain't better than my worst shit, yeah\nThat .40 on me now, I disperse shit, yeah\nHeard what I said, let 'em twerk, drop they berk shit, yeah\nBut she ain't even heard the kid yet\nServe shit, off purpose, on point with a smooth work shit\nOn purpose, outpatient, might surface\n\n[Skit]\nNah bruh (huh?)", "[Intro: DJ Drama]\nFam, take me to where the bars is at\nTake me to the street where the bars is at\nJID, DJ Drama, let's get it\n\n[Chorus]\nOkay, I'm mounted up (Huh)\nHigh off the ground, watch me count it up\nCop me a pound, burn it down with us (Uh)\nLet's hit the town, is you down or nah?\nLook at me now, I done found me some\n\n[Verse 1]\nTreasure inside the trash\nSever my hands reaching through the metal and glass\nIt's been a blast, feel the magic in the madness, give me yo' hands\nGive me passion, anything that can equal some satisfaction\nLooking for love at the end of this Henn' bottle\nLooking for pub', let me pen your next album\nCall from above, tell me kid you been allowed to\nPoint it to re-emerge, kicking lyrics in the South, no issue\nWipe that drizzle off your mouth, it's time to wake up the house\nY'all niggas been playing skins versus blouses\nI'ma keep my shirt on until some hoes come out\nAlways keep your word, homie, I don't know nothing else\nI'm your father, go get a switch or a belt\nInterrupting my method, in here making this velvet\nGrab my dick and do a thrust with my pelvis\nMy shoes suede but don't fuck with no Elvis\nI'm from the era of real shit, kill-or-be-killed shit\nKill-or-be real quick, float like butterfly\nSting like killer bee, flow worth kilograms\nYou niggas killin' me thinkin’ you ill as me\nWhat's shit to an enema, enemy?\nAnyone, get at me, I'm the epitome\n\n[Chorus]\nFuck, hey, I'm mounted up (Huh)\nHigh off the ground, watch me count it up (Look)\nCop me a pound, burn it down with us (Uh)\nLet's hit the town, is you down or nah? (Yeah)\nLook at me now I done found me a\n\n[Verse 2]\nMethod to all the madness\nCheckin' my back, checkin' my hands\nCheckin' in cash, and checkin' and balancin'\nHard work, callouses\nGripping the challenge by the cabbage\nAnd bl-bl-blackin' 'til it's no longer a factor\nMurder the, murder the game, kill it\nMetaphysical living, deranged vision\nNot a typical picture, the same limit\nBut I'm limited edition, I change prisms\nAm I trippin'? A nigga be trippin'\nI'm feelin' like most of you niggas be slippin'\nI'm giving you tips and a nigga just went with it flippant\nNot sayin' you stupid, but hella reminiscent\nOf a stupid nigga, what they do to niggas\nKill or shoot a nigga (Die)\nWow, then recruit a nigga, boot or suit a nigga\nSend em to the other side\nIs you gon' buckle up for the ride?\nNiggas is fuckin' tough 'til it's buckin' time\nThen they motherfuck, better buckle down\nCause I'm coming up nigga, hella mounted\nKnow my name cross hella counties\n(Hey, JID, hey), what's up shawty?\nBeen around the world, ooh yeah\nLet me tell you 'bout it\nKeep your shit cool, melancholy\nKeep your tool, shit metabolic\nGet some money, niggas jealous\nSo him and his fellas come deliver hella bodies\nPost robberies, another dead nigga no problem\nYou happy 'cause we doin' your job\nI'm pulling everybody's ho card\nI never play with little boy toys\nI was busy inside of laboratories\nLookin' out the window like a labrador\nTo the bullshit, I'm a matador\nIn the pulpit like God's son, not a daddy's boy\nCornered boar, carnivore, ready for any war\nSend 'em forward, fifty more, plenty more\nGimme more, see me Lord\nAfter me, no before he be king\nSee me, boy, see these boys\nGon' need CPR to be me, remorse\nFor these meteors, it's just me recording\n\n[Outro: DJ Drama & Lil Jon]\nHahaha, DiCaprio 2\n(Gangsta, Gangsta)\nSuckers", "[Intro]\nU-U-U-U-Uptown\nAyy, it's, it's all for the kids man\nThis-this shit for the kids, hahahah\nFor the little children, uh, um\n\n[Verse 1]\nI can be, whatever I want to be\nBet not a bitch or a nigga stand in front of me\nI got the devil in the pockets of my dungarees\nTaking a dump on anything that standing under me\nI can be your dream guy or I can be your nightmare\nBorn on Halloween night, it seems like a light year\nDouble my Sprite, hey my guy, do you got a light? Yeah\nSquash stampede, plenty lion and many bison, huh\nSeen some, seen one, but it's not many like 'em\nWhen I fry or when I die, bury me with many mics, yeah\nI can be, whatever I want to be\nBet not a pussy ass nigga stand in front of me\nTook a stop at the light, made a right on humble street\nGuess I been buzzin' like a motherfucking bumblebee\nTryna turn this honey tree into a money tree\nBut it's only one of me, and y'all niggas the son of me\nGod\n\n[Interlude]\nWait, wait if I win this, like\nIt's gonna be something, but I don't know what it's gon' be\n\n[Verse 2]\nUh, okay I'm gonna be, whatever I want to be\nBet not a bitch or a nigga stand in front of me\nThey tryna snatch this motherfucking rug from under me\nBut never stumble, young man rumble, the sensei\nThe J.I.D babe, Mutombo, the brass ensemble\nCop an eighth and spend the last on paper and fronto\nSo at Thanksgiving, I'm your drunk ass uncle\nOn the corner, that junky that mumble\nThe little nigga that climbed the hair of Rapunzel\nI'm the shrimp beside your gumbo, I make myself sick, damn\nDick down doctor, that's the JID, give a health check\nI'm the wrong letter that made it up out your spell check\nFucking up your texts, uh, I'm electric, I'm a Lexus\nI'm the evidence, like the shell case when the shell hit\nBut I never tell shit\nI'm cold with the flow and come from the bottom like whale shit\nI know what I know, and I know that you prolly fail shit\n'Cause y'all niggas selfish, and my niggas desperate, damn\n\n[Interlude]\nDamn, fuck\nI wish I knew, Black Panther, but he's not real\nFuck man, homie, I don't know\nNot real\nWhat you trying?\n\n[Verse 3]\nUm, look\nThey saying, \"What you wanna be JID? What you wanna be, kid?\nA doctor, a lawyer, exploring the coral reef shit?\nA football player, a track sprinter, I know you run fast\nOh you gon' be a rapper with your dumb ass\nJust because you used to bump 'Kast, talk fast, and can tap a drum pad\nYou thinkin' that the world's going mad? Bighead, short ass\nBig eye, bug-eye, drug head, shoo fly, don't bother me\"\nI'ma be better than y'all will be, tryna be, y'all see\nAll for one, all for me, shit, you niggas ain't all for me\nMotherfucker with your offering, talk-a-talk-a\nTalk is cheap but so am I, I keep receipts\nI beat the beat and eat the beat\nSo I could be the beat if I want to be\nReact how you want to, the son do what the son do\nRise when the gun drew\nWould meet the devil in hell, but niggas'll hunt you\nWhen it's dark all around and you lookin' for some\nBut in the heart of the jungle, my nigga, you run\nYou could be whatever you want, but better get you a gun\nBetter do what you want, whatever you feel in your stomach\nWhatever you gotta do at the moment, only the strong survive\nOnly the strong in mind and soul and spirit and spine\nYou stand firm, you rise, it's go time\nHe looks determined without being ruthless\n\n[Outro]\nI wish I knew, Black Panther, but he's not real\nYeah\nNot real", "[Intro]\nJ-J-J-J.I.D\nD-D-D-D\nD-D-D-D\n\n[Verse]\nD-D-D-D-Damn, said I'm back again to whoop ass\nThe blicka-blast from the ratchet, man\nThe maddest, blackest lad in a savage land\nOf grab and dash and crash in your daddy's van\nD-D-D, D-D\nBad as the most havin'est, most swaggiest, braggy as never had anything\nSo I'm mackin' as if I never had shit\nEyes movin' backwards, I coulda hit a backflip, check this\nI ain't never hustled for a necklace\nTryna get the fam straight, get us out of debt, shit\nThat shit get testy\nI feel Dizzy Gillespie, in the room pack me, Carl, Izzy, and Precious\nOut the womb, I was last, I'm the youngest of seven\nBirthday same day as the reverend\nBirthday same day as the devil\nBlack lock like the pot and the kettle\nWreck shop, a monotonous fellow\nLick a shot for the niggas tryna stop the journey\nJID pull up on a opp like what's poppin' kermie\nBlocka Blocka, operate, doctor, surgery\nIVs, gurneys, shit bag, gone for eternity, hey\nMore the merrier, more to come murder me, hey\nClose the casket, common the courtesy, hey\nHead shots, too personal for a burglary, ooh\nRed dots cause killers could close curtains me\nI done did wrong, someone send me up vertically\nHorizontally, read me a passage from Deuteronomy\nAnything you can do to conquer the demon inside of me\nAny meaning the truth and the father, the spirit guided me\nI can bleed in the booth and leave a tooth as a souvenir for who was here\nAnd if you hearing it, you know the spirit is imperitive, imperative, imperial\nBlack man pyramid, the peer of men, jack man with the gat\nScratching off the serial\nSack man, get the pack\nMoney in the envelope\nPissing down the urinal\nAss man in the strip club, tell 'em bend it over\nGon give it to her, she been working for it, hey\nYou gon' make a nigga cop a birkin for ya, hey\nYou the bomb, look I got a turban for ya, bae\nBeat a nigga til he color purple for ya, babe\nI'ma murder for you, babe\n7:30 for ya, ay\n\n[Chorus]\nSwervin', swervin', swervin'\nSkrrtin', skrrtin', skrrtin'\nServin', servin', servin'\nEverything I done, it comes full circle\nWorkin', workin', workin', workin'\nI-I-I'm swervin', swervin', swervin'\nSkrrtin', skrrtin', skrrtin'\nServin', servin', servin'\nEverything I done, it comes full circle\nWorkin', workin', workin', workin', workin'", "[Verse]\nFuck what a nigga say because my mama think I made it\nLift my head to the skies, I try to begin prayer\nThanks to the maker, got me out of an awful place\nMy nigga gone for 17 years like a cicada\nMore than a motivator, immortal and innovative\nA dorsal and with pectoral fins\nSwimming through the waves in course of habeas corpus\nI'm orbitin' through my days, I'm fortunate\nI ain't come in this bitch to be fuckin' famous\nI just hope when you hear me that you hold me in high regards\nNot as high as your God\nMaybe the stars moving a couple mountains ajar\nAjayi, a juke move fitted up the side line, then a pylon\nBiddy-bye-bye, di-did-di-die now\nWe don't let bygones be bygones\nWe buy guns and squeeze like a python until the night come\nThe bear to right, uhm, the right to bear arms so we could fight\nI get my shine on, Belt of Orion, cut on the lights\nAnd when I die just take me to Zion and kill me twice\nIt's like my second life, my second-second line\nI put this noose around my neck just to accessorize\nRidin' in this coupe terrified\n12 try and petrify a nigga with petty crimes\n\"How you feel about me don't matters like black lives\nNothin' even matters, dog,\" I heard that when I was five\nThat's around the same time my big brother had shown me his .9 and let me hold it\nLiterally what I call a 9 to 5\nTen times out of nine, I prolly wouldn't survive\nBut sun do what my gun do, rise\nGuns drew, this the last hoorah\nTakin' lives 'fore you dudes take mine\nTake your time, these things take time, tickin', tickin'\nTypical flow to keep you niggas on the tip of your toes\nLo and behold, make your temple explode\nGive and go, pick and roll\nNever listen to the rigmarole\nThis rigor mortis make your temperature cold\nWoah, woah, I don't troll, bro, I been in my mode\nI'm a full schizo with a duel Pistol, that's a cool visual\nThat pocket missle pop a pimple, hit him, he bent over\nGive me the tempo, bika-bow, bika-bow-da-boom\nIt's a elephant and cow in the room\nI'm in the Prague, bruh, how ya doin'?\nYou better bounce 'fore I make a move\nDon't got the juice like you say you do\nI'm finna be like a saber-tooth\nWreck a roof, any booth, anybody get it too, you ain't invisible\nShootin' at us, metaphysical, put 'em in critical, critical, uh\nFinna get 'em, finishin' 'em, benefit 'em, then I'm finished with 'em", "[Intro]\nImagine me if I got it\nIf my nine stop busting, imagine me with a shotty\nImagine me with your shorty\nBumping \"God's Whisper\" by Raury\nProbably be with your\n\n[Verse 1]\nYeah, too many hoes on my D-I-C-K\nI run the game like V-I-C-K\nYou ain't talking shit, no habla ingles\nI can cock that thing back and pon de replay\nI'ma be the man, and I know that you feel it\nFast-forward, in five years in L.A. in a Bentley\nI been a Renaissance, finna send a bomb\nHit him in his arm, leg, head, nigga swam oceans for the commas\nOh my Jésus, the tops in the gray coupe\nAnd when you hit the gas, that shit growl like a gray wolf\nI'm murdering the game like Beowulf, what you saying?\nYou 'bout to get slayed, hop out the roof with the woof\n\n[Chorus]\nBoy, I be happy with nothing, imagine me if I got it\nSay if my nine stop busting, imagine me with the shotty\nI been pushing this Pontiac, imagine me in the 'Rari\nBumping \"God's Whisper\" by Raury, probably be with ya shawty\nIt's probably Tuesday night, she probably pull up at Follies\nI probably pop me a, nah, she probably pop her a molly\nAnd then she just a hood booger, probably claim she exotic\nThe only thing that's exotic is all this weed in my pocket\nBut she fine\n\n[Post-Chorus]\nAin't nothin' better than a bad ass chick with the check\nNothin' badder than a bad bitch with the check\nNothin' better than a bad ass bitch with the check\nNothin' badder than a bad ass bitch with the\n\n[Verse 2]\nTwenty-three dollars in my pockets, I'm rich as fuck\n'Cause my nigga just hit me from the pen and I hooked him up\nFast-forward ten years, we hopping out of the matte black truck\nBlack lips, dark abyss in my cup\nWrist sick 'cause I shit like \"2 Bitches, 1 Cup\"\nYou a witness, I been had bitches like Pac and Clinton\nI Ibaka your shot to give dick to Ms. Hilson\nDo the \"Pretty Girl Rock\" with this shit in your kidneys\nBlow the clit to oblivion, guess I'm talking belligerent\nHead off, I'm so ignorant, please state your significance\nAin't no harmony, thug, but my bone is the busiest\nHit my phone, I'm lonely inside expensive interior\n\n[Chorus]\nBoy, I be happy with nothing, imagine me if I got it\nSay if my nine stop busting, imagine me with the shotty\nI been pushing this Pontiac, imagine me in the 'Rari\nBumping \"God's Whisper\" by Raury, probably be with a shorty\nIt's probably Tuesday night, she probably pull up at Follies\nI probably pop me a, nah, she probably pop her a molly\nAnd then she just a hood booger, probably claim she exotic\nThe only thing that's exotic is all this weed in my pocket\nBut she fine\n\n[Post-Chorus]\nAin't nothin' better than a bad ass chick with the check\nNothin' badder than a bad bitch with the check\nNothin' better than a bad ass bitch with the check\nNothin' badder than a bad ass bitch with the", "[Intro]\nUmm, yeah\n\n[Chorus]\nEverybody gotta be something\nEverybody wanna be something\nBe something, don't be nothing\nEverybody gotta be something\nEverybody gotta love somebody\nEverybody gotta fuck somebody\nLove somebody, don't fuck anybody\nEverybody gotta be something\n\n[Verse 1]\nLook, it's like quiet as kept, I been the sickest for a sec\nI never been pressed for all the cameras and the press\nI'm not the type of guy that be wildin' for respect\nI'd rather be wildin' for a check\nI'm doing that now to manifest, I got my head right and it's blessed\nYeah, the rap game like checkers and chess\nAnd tryna make a monopoly, I got a lot of mess\nBut it's cool, I'ma test it\nGot my choice route, I'm destined for greatness\nPatience is cool, I had to learn that too\nI had got kicked out of school like, \"Nigga, fuck y'all rules\"\nAnd them niggas that snitched on me, yeah, it's fuck y'all too\nMy momma hit a nigga phone like what the fuck y'all do? Nothing\nI just finesse, I'll give 'em back all they little money\nBut everybody gotta juug somebody, huh\nEverybody gotta juug somebody, yeah\n\n[Chorus]\nEverybody gotta be something\nEverybody wanna be something\nBe something, don't be nothing\nEverybody gotta be something\nEverybody gotta love somebody\nEverybody gotta fuck somebody\nLove somebody, don't fuck anybody\nEverybody gotta be something\n\n[Verse 2]\nThey asked me \"What's my sound\"? I tell 'em nothing particular\nI'm blowing this purple 'til I feel perpendicular\nMy flow crash like homicide vehicular\nLeave a nigga's brain at the scene, sign for signature\nKicking rhymes as I'm flipping through the pages of literature\nLiterally, I'm the shit, what you having for dinner?\nBorn to win but born a sinner, and that's word to Jermaine\nCold flow, Cole World, but we living the same\nI was standing in the hall, we was listening to Dame\nHe was schooling some niggas, putting them up on some game\nI'm ear hustling, hoping my niggas doing the same\nShit, that he saying, my brain strain, combust into flames\nHe dropped gems 'bout life and getting up in the game\nOr getting fucked in the game and how it's really kinda tough to complain\nWhen you can be what you want, it not really much to explain\nSo fuck that, hustle for cream and go for the dream\n\n[Chorus]\nEverybody gotta be something\nEverybody wanna be something\nBe something, don't be nothing\nEverybody gotta be something\nEverybody gotta love somebody\nEverybody gotta fuck somebody\nLove somebody, don't fuck anybody\nEverybody gotta be something\n\n[Outro]", "[Intro]\nAlright\nHeard this shit like one time before, this beat\nCheck, uh, look, get it\n\n[Verse 1]\nSplit it with my niggas 'cause what's mines is ours\nOnly way you multiply if you divide the power\nGrind for hours, fronto, pine-i sour\nWhy the fuck you think this nigga Cole was high for hours?\nWhy the fuck you think they got me out the slums of Atlanta?\n'Cause J.I.D a computer, boy, I come with the data\nCool, keeping my balance, stumbled over a carcass\nSmooth drink from a chalice, let me cook, I'm an artist\nYou can never see me, I b-ring the noise\nFuck your haha's and hehe's, you see, we deploy\nCouldn't read me if he W.E.B Du Bois\nNigga cease-cease your voice 'fore we lea-leak your boy\nPeep me, J.I.D be on your TV, my girl skee wee\nMy weed kiwi, my dreads tipi, my oil tea tree\nWake the game up, them boys sleepy\nA rose grew from concrete, soil, and feces\nHear me clear 'cause I don't really like to repeat it\nYour favorite rapper gets ctrl-alt-deleted\nHe sees it, she sees it, nigga, we seize the moment\nPlease show me my opponent, motherfucker\nMy dad gave me the swag, God gave me the voice\nI said you niggas play it like we gave you a choice\nJust watch how the game play, don't play with them boys\nThey breath stankin', hand shaking and moist\nMust avoid, gun blast such a joyful noise\nPick your poison, pick your squad of boys and vandalize some stores\nFive, four, trey, deuce, one, Jesus son\nMake nuisance or shake loose 'cause you can die from a gun\nGay guys do drive-bys—that's a fruit roll up\nAnd I ain't homophobic, look, my gun will blow her\nTryna turn my city to the modern Sodom and Gomorrah\nThey sneak dissing but they will not take a shot at the boy, yuh\nNever Oscar de la Hoya, I'm like Ali with it\nI got this 3-57, I got this weed with me\nAnd it's crazy because I'm up in NYC with it\nWon't catch me with it, Plaxico Beezy, shit\nI ain't Lil Weezy, but that nigga inspired my dreams\nSo word to him, Jay, Nas, 'Ye, Kenny, and D\nBut watch this guillotine flow, slice the head of her king\nKings cool, kamikaze, J.I.D step on the scene\nJust like somebody has awoken a kraken out the cave\nCrack in a box, and I lock in intemperate rage\nI was down in my socks and intoxicated in the rain\n'Cause my rhymes wasn't getting to the people from the page\nI took my piggy bank, came back to the A with a felony charge\nPenning if I don't pay the state\nPendulum swing, swang, swung, knocked me across my face\nRealizations of not becoming anything\nKinda funny 'cause it's like a fucking dungeon in my brain\nPut a noose around my neck, let that bungeecord hang\nCall upon the Lord mane, I need run support\nOr a magic wand, maybe Dumbledore\nTo help me out, then get me out this damn revolving door\nThe hell we 'bout to do I'm 'bout to just jump out the porch\nI know I'm bound to make it, boy, I'm the cow manure\nMegatron with the puns, I'm like the Calvin boy\nSaddle the cattle niggas down for the battle, it ends one or two ways in the ground or the gavel\nGravel under my toes, thinking the time I’ve done traveled\nMind over matter, not with the chatter, you running my data blocka the block up\nNiggas act up, and act as if the reaction to happenings hella tragic\nBut it's part of the pattern\nPaddy cake in her face and she freebasing and scraping it off the plate\nOn that white, 'cause that green being tested by the state\nOn this mic so I formulate the method every day\nWhat you like, what you wanna hear, I show you how it's made\nOn this Hen straight, fuck a beer, see a slim waist and her friend\nI could probably cover two like a buccaneer\n\n[Interlude]\nHaha, oh shit, aight that's all I got on that one\nLet's do it\nOh yeah I can run with that, this my dawg\nRun that back, run it back, run it back, let me get it from top\nThis my shit, this my shit, this my shit right here\nAight I got you, whatever\nUh, aight, where we gonna go with this one\nUm, check, this my Big shit, word to B.I.G\nCheck, um, alright\n\n[Verse 2]\nHabeas corpus, how to produce a fuckin' body on the spot\nNever not being ready for whatever\nI had to fight with the Devil himself\nHe was upset that God's a woman\nNever let him fuck, so he was mad in hell\nThe irony mad as hell 'cause you weak\nThinking 'bout these niggas in the rap game, boy, you weak\nI won't speak unless a nigga speak to me\nBut I think, I'm on a brink of a—it's like, eureka! Eureka! I got it\nComing for your spot with head shots and red dots\nHad my sister beat your lady into some red bottom\nThe flow like Alzheimer's; spit it, forget it, but he quick with it\nAll the time, God is good, all the time\nJiddy got all the rhymes, all the rhythms\nI grab pens, calculate flows, algorithms\nArithmetic, a mathematician\nThe rhythm could kick the sound to kill 'em\nBut I don't even need the hassle\nI just need the keys to the castle and some weed\nTell the judge you won't need my pee, like pterodactyl\nI don't feel these niggas\nDown south, Georgia boy watchin' Troy, I'mma kill these niggas\nJ.I.D snap like achilles tendons; you need to stretch more\nNiggas tried to kick it to me, I'm Devin Hester\nWith the Russian chopper I got from my homegirl, Svetla\nGet in the booth and niggas sweatin'\nIt's a sweatlodge when J.I.D in the room\nYou better come with all your methods, insidious moves\nWe taking flight when it's dark at night\nBig gun with the sharpest knife, Hill Harper height\nGlocks in Toy Story, J.I.D like a Gorgonite\nPoltergeist, chill up your spine when it's cold at night\nPour quatro in the coldest sprite\nThen bite down, Denzel with the overbite\nMe and your lady on a motorbike\nShe facing me so I can motorboat her titties after this next right\nUsually I'm blowing weed like Curren$y and Jet Life\nNiggas aiming at dome, so keep your vest tight\nI'm just trying get my steps right flow is a bloody mess\nI was blessed with treasure inside the trash\nSever my hands reaching through the metal and glass\nIt's been a blast, feeling magic and in the madness, give me your hands\nGive me passion, anything that could equal some satisfaction\nLooking for love at the end of this Hen bottle\nLooking for pub', let me pen your next album\nCall from above, tell me J.I.D you been allowed to point it\nRemerged, kicking lyrics in the South, no issue\nWipe that drizzle of your mouth, it's time to wake up the house\nY'all niggas been playing Skins vs. Blouses\nI'mma keep my shirt on until some hoes come out\nAlways keep your word, homie, I don't know nothing else\nI'm your father, go get a switch or a belt\nInterrupting my method, in here making this velvet\nGrab my dick and do a thrust with my pelvis\nMy shoes suede, but don't fuck with no Elvis\nI'm from the era of real shit; kill-or-be-killed shit\nKiller bee; real quick, float like butterfly\nSting like killer bee, flow worth kilograms, you niggas killin’ me\nThinkin’ you ill as me—what's shit to a enema?\nEnemy, anyone, get at me, I'm the epitome\n\n[Outro]\nHold on, man\nYeah, yo", "[Intro: Sean McVerry]\nYeah—maybe a little more\nThat's good\nWe rockin'? Oh, word\n\n[Chorus: Sean McVerry & J.I.D]\nEveryone's a star, every day's the move\nEverywhere you are, is for you\nAnd don't you know that everyone's a star (Everyone's a star)\nEvery day's the move (Every day's the move)\nEverywhere you are (Everywhere you are, for you, for you)\nEveryone's a star (Everyone's a star)\nEvery day's the move (Every day's the move)\nEverywhere you are (Everywhere, everywhere, everywhere's for you)\nEveryone's a star (Everyone's a star)\nEvery day's the move (Every day's the move)\nEverywhere you are (Everywhere, everywhere, everywhere's for you)\nEveryone's a star (Everyone's a star)\nEvery day's the move (Every day's the move)\nEverywhere you are (Everywhere, everywhere, everywhere's for you)", "[Intro]\n*Thud*\n*Yawn*\n*Lighter Flick*\n*Channel Switch*\n\n[First Channel: Love Chat Line Teleprompter]\nOoh, you wanna have a fantasy tonight, call 1-800-555-DiC-2...\n*Channel Switch*\n\n[Second Channel: Wildlife Documentary Host]\nToday on DiCaprio's World Discoveries, I'm here backstage at a hip-hop concert. I just spotted a gaggle of rappers. I see loads and loads of cash in their bags. I see guns with extended clips that don't even fit the guns in their trousers. So what he's trying to say: \"I'm so tough, don't mess with me, I'm the baddest bloke on the block...\n*Channel Switch*\n\n[Third Channel: Demetrius & Susan]\nSusan, I've found another lover\nWell so have I, Demetrius, it's over\n*Dramatic Music Intensifies*\n*Channel Switch*\n\n[Fourth Channel: Anchorman Jason, Anchorman John, & Witness]\nBreaking news on DiCaprio 2, channel two, at two. Take it, John\nI'm on DiCaprio Lane, Jason, in the Mirrorland casino where there seem to be two niggas about to jump ready to die, I'm here on the scene with a witness\n*(Reversed Speech)* Them two niggas mad\nOh yeah?\n*(Reversed Speech)* That shit was the first black president\nIs that right?\n*(Reversed Speech)* Barack Obama was number two\nInteresting\n*(Reversed Speech)* Alive, I said CDC  (Do it!, Don't do it!, He's doin' it, dude!)\nOh, shit, there they go\n*Audience Gasps*\n*Channel Switch*", "[Intro]\nBe you\nYou focus on one, you'll never be two\nAnd then number two, most niggas see through\nBut now that I think, that's probably number three too\nHuh, yeah\n\n[Verse 1]\nY'all want that real shit back, then please say so\nYou niggas got it Manti Teo'd\nOn the eighth show\nI'm walking 'round with the eighth tryna fuck Jhene Aiko\nHowever you say the name\nI cream that pussy like a bagel\nYou know how the play goes\nStunt a little then lay low\nNames, never say those\nYour girl in Giuseppes on Quavo\nDancing on top of tables\nI'm finna pick six like 22 with son Tadoe\nI hop in her whip, she bumping Gucci Mane and Zaytoven\nShe get in mines I'm bumping Beethoven\nIts to the crib ain't gotta say nothing\nI send her back to ya\nBlood drained, J.I.D. and yes the \"D\" for Dracula\nCrack her back play the sax, call Satchmo\nHe ain't gon' react\nJust relax bro, it ain't for a show\nI'm just waterin' my lawn 'cause I turn on the hose\n\n[Chorus]\nRule number one: be you\nYou focus on one, you'll never be two\nAnd then number two, most niggas see through\nBut now that I think, that's probably number three too\n\n[Verse 2]\nAnd then number four is like pour D'ousse D'ousse\nNow this the wrong book, I'm looking at the wrong rules\nCause then number five says \"purchase a coupe\"\nAll black no shoes, then T-top the roof\nAnd then get your windows and doors bulletproof\nSo the shots can't come in\nBut then we spray out the roof\nDog niggas like \"ROOF\" at your bitch like a wolf\nOr a pack of Spill-niggas, government my own troops\nGive me some of that Gil-Scott, bitch turn on the loops\nMotherfuck your drums, I'm finna spit it to the flutes\nTalk around my city, just point him out who got the juice\nCouldn't quote my shit, you'll probably break a fucking tooth\nYou're talking about Richter scale, I earthquake the fucking booth\nI shake it 'till its fucking loose, so fuck a rapper, fuck a cougar\nPut my dick like right into her\nFuck a mattress, fuck theatrics\nUnless your ass is an actor\nThen fools need to be captured\nI'm the master, I'm the massa'\nAnd they wanna assassinate me\nWhy they wanna hate me?\nI just need a cure for these rap bar rabies\nAnd a Beijing bitch to come massage then rape me\nXvid tape me\nTaste these kids then I'm on back to my day scheme\nYou living single like Regin and Queen La\nI'm prolly coaching your team, I'm J.I.D, JoePa\nMy D.C. girl tell me she love Sosa\nPut her hair in a pin, bang bang in O-Block\nShots rang, cops came, nigga no sir\nArrividerci and bonsoir\nYeah", "[Intro: Sample]\nI'm honored to be here today. I stand before you not as an expert, but as a concerned citizen. This is the most urgent of times and the most urgent of messages. The community knows it, industry knows it, governments know it, even the United States military knows it. You can make history, or you will be vilified by it\n\n[Verse 1: J.I.D]\nWhile they were sittin' on they hands, I was standin' and plottin'\nWhen I be in my own world, It's like the world has forgotten\nMeditatin' in silence besides the loud in my pocket\nI don't want to hear nothing, a rat pissin' on cotton\nA rapper pissin' on rappers, I'm a Jekyll, I'm a jackal\nFrom rapper to rapper, you rappers PaRappa the Rapper\nShark in the lake, dodgin' the fake\nOn the line, I'm a snapper\nHeard you the best thing coming up, oh, God, I'm dyin' from laughter\nNo, I'm dyin' from living\nI been robbing and giving\nNiggas chances just to raise the fucking standards, wait\nHeard all the hoopla, faking, and all the antics\nCan't even count all the punches a nigga landed\nNationwide tour from the west side, then back to Decatur\nI ain't even signed this deal, girl, I'm just splashing this swavor\nBaby, you Betty Shabazz, you kinda match my flavor\nI'm a freak with a great mind, girl, a master debater\nHornier than the good Reverend Dr. Martin Luther\nCome here, baby, come and kiss on the king junior\nThen take a trip to the six, with me, it ain't pretty as Toronto, Canada\nGotta walk with the hammer here\nSmall things like that you couldn't fathom\nLittle forty'll knock the apple out of Adam\nLittle shorty sling weed and crack dabble\nUpgrade to full-time, where your tassle, where your bando?\nWhere the hassle when the cops jocking, blocking trying to find?\nWhere the guala and the drugs? Ollie oxen free\nHotbox topping foxy mama in a box chevy, monotonous debauchery\nObviously I've been out of it awhile\nYou should've got my things and sent for me\nEmpathy, empathize with my pathological lies\nDivide that pride and split the pot\nIt's only by God's grace that I made it this far\nThus far, I need his plus y'alls\n\n[Interlude: Leonardo DiCaprio]\nEvery week, we’re seeing new and undeniable events, evidence that accelerated climate change is here now. Droughts are intensifying, our oceans are acidifying, with methane plumes rising up from beneath the ocean floor. We are seeing extreme weather events, and the West Antarctic and Greenland ice-sheets melting at unprecedented rates, decades ahead of scientific projections\n\n[Verse 2: 6LACK]\nWaiting on shit to pan out, why you standing there with your hand out like you looking for some change?\nI mean, I could offer that, but why would I offer that when you niggas could just utilize your brain?\nI want that right there, yeah, I want that right there, yeah, give me all that there\nYeah, want that right there, so, come on 'bout that there, I need all that there\n\n[Outro: Shelly Nicole]\nWe need it all, like\nSome niggas like, how he get on, how he get on?\nHe get on because he's supposed to be\nYou gotta work for this shit\nNiggas got great time, great time, great hustle\nThis is the time, no more weak shit\nIt's not allowed like, new rules, we on some new shit\nWell, it's the same shit, but we gon' teach y'all some new rules\nCause niggas make the same shit\nThis right here, it's gon' get you right\nThis is the motivation that you need\nTake notes, take notes\nDon't copy cause you can't, but you can take some notes", "[Intro]\nMay I have your attention please\nMy name is, what? My name is, who? chka-chka\nYeah\n\n[Chorus]\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nJ.I.D, yeah\n\n[Verse 1]\nHi kids, wanna know what I did?\nI do drugs, get drunk and promote violence\nEverywhere I go I take my gun, even churches\nOpen carry in Georgia so save me a seat in circus\nFuck takin' Dylan Roof to jail, you should bring him to me and my niggas\nOn God there won't be a homicide\nWe'll keep him alive, give me four days, maybe even five\nJust from Monday to Friday, I promise he'll cooperate\nWe'll snatch out one of his eyes, make it look him in his eye\nThen scalp shave, then use his hide for black pride\nI guess you would think I'm tryna incite a race riot, but naw\nI like white people, I hate that guy\nI never understood the mind of a person that wanna murder\nAnd hurt people who tryna make a change and do good\nIf he wanted real war, he shoulda went to the hood\nI would have felt better about it, I just had to acknowledge it, but\n\n[Chorus]\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHI, My name is, what? My name is, who?\nJ.I.D\n\n[Verse 2]\nMy English teacher called me nigga like in Junior High\nThanks a lot, I'll use this word the rest of my life\nMy nigga this, my nigga that, dawg where my niggas at?\nDamn don't make me kill a nigga, god bring my nigga back\nUse it in the wrong context can get a nigga smacked\nLittle-bitty bullet make a skinny nigga fat\nWait, Bonjour my shitty amour, where your nigga at?\nWork? Ok, cool. Get drunk? Where the liquor at?\nBasically, what I'm sayin' girls and guys are piranhas\nMy dawg, hit a chick raw, and caught the gonor-Rihanna\nI just combine in a word because she was fine as Rihanna\nNot sayin' nothin' about Rihanna, oh I'm sorry Rihanna\nI ain't slept in 20 days, I'm a zombie lil' mama\nI'm tryna pay attention this much for fuckin' insomnia\nI'm cardinal, carnivore, hard as hard-on\nA tryna be good and God on my side\nI ain't vulnerable, it's the honorable\n\n[Chorus]\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHI, My name is, what? My name is, who?\nJ.I.D", "[Intro]\nUh, see what the fuck I'm sayin'? See what I'm sayin'?\n\n[Verse 1]\nLook, nigga, don't talk about style, 'cause I violate\nShut the fuck up when you talk to me 'fore I annihilate\nLet the gun sound, drum sound, then sirens play\nHow many caskets can niggas buy today? Trap-boom!\nFuck the classroom, shawty said he gotta tassel in the street\n'Cause in school, he only trap out the bathroom\nSellin' weed, grassroots, and some pill capsules\nPlus he get can run on your pad with the mask like raccoons they scavengin'\nThey ain't dribblin', they travelin', they ain't civil, they savages\nWrist little, they shootin' like Shawn Marion—accurate\nBaggin' shit, shit bag, body bag, bad shit happenin'\nBad men, bullеts racket like badminton, that's past tensе\nBoy, you're dumb, you your daddy son, never had shit\nLil' bad kid tryna act big\nI'll send him home with an ass kickin' then an aspirin\nStick to the rap shit\nThey bustin' their gun, but only in adlibs\nI know what the facts is they really ain't bustin' the packages down\nI was just hand in hand, they got the plan and found me out, uh\nNiggas'll wrap saran, we on yo' lass around your house, uh\nLookin' out for my man, he down and bad, he down and out, uh\nNiggas be tryna laugh, we knock the gram from out your mouth\n\n[Chorus]\nI'm up when the sun down\nI sleep when my heart don't pound\nI'm off the ground\nYou couldn't fuck with my bounce\nBounce, bounce, bounce, bounce (Uh)\nBounce, bounce, bounce, bounce (Yeah)\nBounce, bounce, bounce, bounce (Uh)\nBounce, bounce, bounce, bounce (Yeah)\nBounce, bounce, bounce, bounce (Uh)\nBounce, bounce, bounce, bounce (Yeah)\nBounce, bounce, bounce, bounce (Uh)\nBounce, bounce, bounce, bounce (Yeah)\n\n[Break]\nCheck it, dawg, check it, uh, look\n\n[Verse 2]\nI'm tired all the fuckin' talk about, \"What you talkin' about?\"\nTalkin' to them - I'm snatchin' your tongue up out your fuckin' mouth\nPop said, \"Be silent and observe\"\nTwo ears and one mouth, a nigga got it for a purpose\nGon' pop that pussy, baby, you got it for a purpose\nI know I just got off-topic I just had to insert it, 'cause I'm a pervert\nAnyways, word, I'm still broke as a fuck\nMy big homie just passed, he was young and not old enough\nTo not be bumpin' P. Troy in that box Chevy with that knock B\nDown the block, fuck a tall bitch 'til she knock-kneed\nWhat you not gon' do is sit and say that you got me\n'Cause when a nigga had fell it's 'cause people had dropped me, ah\nNever trust a nigga sayin', \"Trust me\"\nBe stupid to trust a bitch\nThe only time she love me is when we fuckin'\nThe truth will come out the closet, all dirty and dusty\nBut a real nigga can't get touched by Sandusky\nDodge your stampede, I done seen\nJumanji run up on it, I promise he end up runnin'\nFuck a runner, run a check\nStill checkin' my balance to pay my mama debt\nI ain't quite fulfilled my promise yet\nAnd I didn't finish college, but it wasn't time for that\nBut I got the A in vagina Ed and I'm from the A, like Simon says\nEverybody do the same shit, except for JID\nNow what the problem is\n\n[Chorus]\nI'm up when the sun down\nI sleep with my heart don't pound\nI'm off the ground\nYou couldn't fuck with my bounce\nBounce, bounce, bounce, bounce\nBounce, bounce, bounce, bounce\nBounce, bounce, bounce, bounce\nBounce, bounce, bounce, bounce\nBounce, bounce, bounce, bounce\nBounce, bounce, bounce, bounce\nBounce, bounce, bounce, bounce\nBounce, bounce, oh", "[Verse 1: J.I.D]\nA lot of hair on the pussy, I can't see it like Sia\nYou should shave that shit, and I'll wear it like a mink\nKill the pussy, now they gotta call PETA\nNo animal cruelty\nI been just waiting on my cut like a jewel thief\nYe'en in love shorty\nCoudl've fooled me\nRaised my nephew but he could've schooled me\nA pure child showed a nigga how to be true to me\nLet's not get too deep, cause this our first time\nI'ma dumb it down, nigga this my nurse rhyme\nMy verse in cursive adverse the divine, signed with my signature\nOut of my mind, smoking good gas in the lituation\nGotta a whole zip for the situation\nAll black, you can take a picture baby\nWith a middle finger, tell em we don't give a fuck cause we know they hating\nIf they want war, tell 'em go when you read\nHead nod, let me know when you ready\nThe way it's looking, now this shit could blow any second\nTryna drive, you don't know where you headed\nJust let me know when you ready\nLook bitch, you guessing, that shit evident\nHypothesize yo' motherfuckin' experiment\nCome back strong on your Marion Berry shit\nRisk embarrassment, but uh, get the check\n\n[Hook: 6lack]\nHand on the bible, other on the rifle\nI wouldn't take another step, that's if you know what I know\nI'm sitting here trying to calculate\nRifle, Bible, Bible, rifle, main chick, side ho\nWhat a life though\nRifle, Bible, Bible, rifle, main chick, side ho\nWhat a life though\nI look at everything around and I feel if I don't get it right this time, then I fail\nRifle, Bible, Bible, rifle, main chick, side ho\nWhat a life though\nRifle, Bible, Bible, rifle\nMain chick, main chick, main chick\n\n\n[Verse 2: J.I.D]\nNo hair on the kitty, shit bald like chemo\nJ.I.D, Larry, Michael Jordan, Kobe at the free throw\nJ.I.D, lion, leopard, tiger, sniper with a rifle on the Eiffel, African, fish, eagle\nHow statistical, I got a big ego\nNever seen an animal like this before, started with one style\nThen I switch the flow, got an ol' lady, but I make this beat me ho\nI just squeeze the load, yeah baby, I'm nasty\nAnd you remind me of Skin Diamond and Cassie\nAnd if you love my bark, then let me bury my bone and you can bring that shit back like Lassie\nVoila, magic, frantic, frivolous, mischievous friends with the indica\nLiving life lavish, likewise learning life lessons and letting shit happen, pray to god from Sunday until the sabbath\n\n[Verse 3: 6lack]\nWhy everywhere we go, them ladies flock like a pageant?\nAnd it don't help the fact that I'm ?\nIt's holographic\nI be trying to keep the peace, they want me to do the damage\nDamn, like please let us get the cabbage\nAnd blow that purple like radish\nDamn, bitch, holy smokes, roll the dope, hold the coke, we ain't trying to overdose\nAll I know is get it all 'til you overload\nComa, coma, coma, coma, 'til I'm comatose\nShe want that family life with a rock in it\nI lean so hard I had to rock with it\nNo commitment shit, commitment to the game and I don't think it'll ever change, change, change\n\n[Hook: 6lack]\nHand on the bible, other on the rifle\nI wouldn't take another step, that's if you know what I know\nI'm sitting here trying to calculate\nRifle, Bible, Bible, rifle, main chick, side ho\nWhat a life though\nRifle, Bible, Bible, rifle, main chick, side ho\nWhat a life though\nI look at everything around and I feel if I don't get it right this time, then I fail\nRifle, Bible, Bible, rifle, main chick, side ho\nWhat a life though\nRifle, Bible, Bible, rifle\nMain chick, main chick, main chick", "[Intro]\nYeah\n\n[Verse 1]\nLook, ugh, on everything\nI gave everything and got nothing back\nAin't looking for no pat on backs\nThat ain't how we got where the fuck we at\nMama called, \"Where the fuck you at?\"\n\"On the road, and I ain't coming back\nUntil my hundred stacks make a hundred racks\nAnd that hundred racks bring a bundle back\"\nI was blowin' gas like the Honey Badger\nJ.I.D, bitch, the money snatcher\nC'est la vie, shit I'm coming after everybody\nDon't get the bloody splatter\nI'm fly and I got my niggas fly too\nShit is like buddy passes\nI wanna cry 'cause I'm numb inside\nIf you wonder why, ask, \"What's the matter?\"\n\n[Chorus]\n'Cause I been workin' hella hard, shit ain't really workin' out\nI been praying to the Lord, shit ain't really workin' out\nI been looking to the stars, keep my head up in the clouds\nShit ain't really workin' out, shit ain't really workin' out\nShit ain't really workin' out\n\n[Interlude]\nQuiet, don't explain\nWhat is there to gain\nR.I.P. my nigga Mac and [?]\n\n[Verse 2]\nYeah, okay, shit ain't really workin' out, huh\nNow I got a little bread, got my niggas workin' out, damn\nBaby your ass fat, shit, I can see you workin' out, shit\nAnd you got a new job? Tell me, how that shit workin' out? Heh\nHeard you doing pretty good, yeah, people talk, word of mouth\nWasn't 'round when you had the dirty house\nNow they won't leave when you kick 'em out\nThese type of people can't stick around\nOnly down when there's liquor 'round or the spliff around\nThat's why I don't fuck with niggas now\nWell I fuck with all my niggas, you know the difference\nYou been living with tunnel vision\nYou and all of your friends are like wonder women\nWonder Woman working for it if you ever wanted something\nSearching for a purpose, I see what you on\nDifference in how you be using your gifts\nIn the midst of the shit that you dealing with\nReally specific, you paid attention, panoramic\nGot the vision like a fer-de-lance\nYou attack and you kill it, sinkin' your teeth with the venom\nKinda like me with these instrumentals\nOr the pen and the pencil or off the-\nPimpin' since been pimpin', keep it sensible\nSince you winning, you a object of ridicule\nObjects appearing closer than you ready for\nObviously you don't know what's ahead\nBut that's the reason you can work 'til you dead\n\n[Chorus]\nI been workin' hella hard, shit ain't really workin' out\nI been praying to the Lord, shit ain't really workin' out\nI been looking to the stars, keep my head up in the clouds\nShit ain't really workin' out, shit ain't really workin' out\nShit ain't really workin' out\n\n[Outro: Zack Fox]\nC'mon bruh, come to the booty club one time\nThrow some of that Dreamville money", "Lyrics from Snippet\n\n[Intro: JID]\nI arrived last night in Japan, Tokyo airport\nSuperman captain\nLook, I need everything, I need everything\nI need everything, I need everything, look\nI need everything, nigga, I need everything\nI need everything, I need everything\n\n[Verse 1: JID]\n...Drops negative, five yard tackle\nI'm not you bastards\nI grew too fast and I knew my daddy\nI roll my fatty and zone out\nI'm on the phone with a shone who tell me pull my bone out\nI'm coming home now, I'm really on now\n\n[Chorus: JID & Isaiah Rashad]\nI need everything, nigga, I need everything (Superman captain)\nI need everything, I need everything (What's that mean, everything)\nI need everything (Isaiah), I need everything\nI need everything, I need everything\nI need everything, nigga I need everything (Hey)\n\n[Verse 2: Isaiah Rashad]\nI put myself before these hoes, I gotta a couple of kids\nI left it wet for your nigga, with a slap on the wrist\nI'm from the motherfucking South, put the pipe in her throat\nSince my little brother told me, \"Hold it down,\" I spread out the dough\nI'm on this liquor, you ain't shit yet, you look like bitches to me\nThey ain't my hoe dog, if I go it's just a mission to me\nYou want it back, I brought it back, ho don't get lost in the keys\nBack in the day, I tip a marker...", "[Sample: Gangs of New York]\nWhat’s up wood\nWhat’s going on\nIt means body snatchers\nI didn’t ask for meaning\nI asked the word\nGhoul, ghoul?\nIt’s a good word\nGhoul gang slaughters\nA fresh out, outrage in the five points\n\n[Verse 1: OG Maco]\nHooligan plotting loot\nI was born and I know this world\nOnly the strong survive and I can prove it\nDucking behind the bushes sipping goose\nBurning down your neck like a noose\nWith the homies hanging\nNiggas riding by, we twisting fingers\nGang banging, set claiming\nOh if momma know how she would hate it\nTrips in the field\nFuck a waiver for the glory\nNeighbourhood legend why they bought you\nI don’t know you\nWho you?\nWe don’t know you, we’ll show you\nSaid they find them slumped over\nBag of bad bitch weed next to him\nDie like he lived it\nNothing short of greatness how I give it\nTry replicate and break your printer\nSpool of that paper in my denims\nItalian lamb skin on my balenci's\nWoman so humble she go thrifting\nReward her with that berkin pussy tingling\nPut her on that counter split decision\nShe spread eagle\nDog her like a master\nBet you beat her like a beagle\nDid it for my niggas who the woman call to fuck\nAnd if they ask the gang, OGG what you throw up?\nBet you know what’s up\nBitch try if you want\n\n[Verse 2: J.I.D.]\nIt’s like Hooligan plotting loot\nGoing through hula hoops\nFrom shooters who yell \"hootie hoo\"\nWhen they finna shoot\nShit bags leave em miserable\nThey going digital\nHoly Jesus, Christian louboutins on her physical\nSwear my flow was sick and it just not that curable\nI’m shooter from the hip\nBeef just not that miniscule\nI’ve been a fool, benefited, like a benefactor\nYou rappers are knee slappers\nImma say it first\nYou repeat after\nWait for it\nI been trying to flex\nBut I don’t even got the K for it\nBut if you try to hold it in my face, then I will take yours\nJID just a hooligan, fuck if I cannot gaylord\nGonna fuck a white bitch\nThank the Based God\n\n[Verse 3: Johnny Venus]\nHooligan bill collectors\nKeep on calling me up\nGot to be cautious\nGot to stalling for a couple more months\nI know my time almost up\nI know transition is a must\nFrom where they busting they busting\nJust to come up you must duck\nI can’t do much but tell it like it is\nI ain’t really got nothing else in my dream\nFlying round wondering who taught y'all that shit\nMan must have been hard coming up I see\nBut look, God bless you though\nHope the best for you\nExtra extra terrestrial\nWe save the nest to rescue you\nI'm guessing trapped inside cocoons where you learned to be flexible\nAdding the extra addicts for your partner sitting next to you\nWas hard for a nigga out here like me\nHit the country\nIn the car pack three by three\nPlus I'm black so they ain’t really gotta see ID\nI’m back in these streets\nLike the paint in the sinks\nThat’s a stacks out my pocket every 3 cities\nBet a stack imma stack it back by 3 cities\nProbably like three NY’s\nMaybe like three Philly’s\nMaybe like three little wives\nStack like three Peachtree's\n\n[Verse 4: Doctur Dot]\nIt’s like Hooligan plotting loot\nLooting like vikings do\nLooking inside of you just one trick that my eyes can do\nSipping on lighter fluid\nInfluence inspire you\nTo put fire inside your belly\nEmpire is coming soon\nAppetite so intense\nRottweilers, Dobermans\nChoose a side\nPussy ride is on the fence\nSo delicious\nSmell of cunnilingis\nLinger round my chin and lips\nAt thirteen had me convinced\nIt make my facial hair get thick\nI know niggas they will rather live a lie than man up and admit\nThe idols they worship was never really seen\nThe tide that I’m surfing have never seen the fishes\nToo many storms\nToo many storms\nBending these corners\nLeaning in a the mazda\nWishing for a tesla\nScreaming up to God\nLike why you keep on testing\nI done broke my pencil\nAsking all these questions\nI can see the future\nEvery thirty seconds\nParanoia got me walking softly\nCypher calls me like a silent auction\nProbably would have been a smart abortion\nBut them college students, they just can’t afford it\nFuck it, Spillage Village 'till it stain the floor\nPay in a quarterly or pay the full\nSee they gun us down\nScreaming save the forest\nThen they turn the lumber into caskets for us\nSo I don’t do with all that back and forth", "Lyrics from Snippet\n\n[Verse: Ski Mask the Slump God & JID]\nDolla, dolla cold (Cold) like the winter be (Wet, water)\nFroze like the dinner meat (Buck, brr)\nKeep the same energy\nSauce all 'cross them, no Italy (Ayy)\nCreepin' on your spirit like an entity (Buck-buck)\nYou the enemy, catchin' shit from me\nDolla, dolla, dolla, tell 'em what the lick read\nAnd they know it's goin' down (Swear, uh, okay), better up my fee\nUh, I don't mix no liq', my bitch mixed\nGive big dick, she give lip, dismissed\nOoh, yeehaw (Uh-huh), she ride me like a retard (Uh-huh)\nUp and down like a seesaw (Uh-huh)", "[Intro]\nExclusive shit\n\n[Verse]\nI don't really drink\nI don't really smoke that shit\nI ain't tryna fuck yo bitch\nI am from the 6\nHell yeah I join your team\nYeah yeah I get down with your clique\nWear the same clothes\nBe the same nigga\nWhat's that mean?\nHell yeah I smoke with you\nHad some gold diggin' hoes composing the picture\nThen give dough,  give dough to the bitches\nFuck my [?]\nPretty boy swagger, all that shit\nYeah right, bitch\nYa'll can suck all my dick\n'Cause all that shit ya'll kick, don't even know what to call that shit\nBut nah\n\nI don't really like these niggas\nI don't really tell 'em what's good\nI don't really shake no hands\nI'll make them plans if a nigga try to play me for a joog\nNigga I'm leanin'\nHell yeah i smoke that shit\nHell yeah I prolly fucked your bitch\nYeah I'm from the 6\nNo I don't wanna join your team\nHell nah I don't wanna join your clique\nMy outfit fly\nExclusive shit\n\nNigga pass me and almost got kicked, should'a jabbed him but I slapped him with an open fist\nJust focus\nLil JID [?], Lil JID focus\nNah\n\nI don't really like these niggas\nI don't really tell 'em what's good\nI don't really shake no hands\nI'll make them plans if a nigga try to play me for a joog\nNigga I'm leanin'\nHell yeah i smoke that shit\nHell yeah I prolly fucked your bitch\nYeah I'm from the 6\nNo I don't wanna join your team\nHell nah I don't get down with your clique\nMy outfit fly\nExclusive shit\nMy outfit fly\nExclusive shit\nMy outfit fly\nExclusive shit\nMy outfit fly\nExclusive shit\nMy outfit fly\nExclusive shit\nMy outfit fly\nExclusive shit\nMy outfit fly\nExclusive shit\nMy outfit fly\nExclusive shit\nYah", "[Verse 1: J.I.D]\nSavage, hard-head living, huh\nDevil on my shoulder, I can't see him, I just feel him, huh\nGod is my witness, focus vision, keep a distance, huh\nDream motion living, being broke got me livid, huh\nBitches after bitches, huh, all my niggas 2Pac\nSpeaking revolution or that shit that might get you shot, huh\nThreatened like I'm Biggie, huh\nKicking like I'm Ong Bak\nBitches love Jid 'cause I got three legs and two socks\n\n[Hook: Curtis Williams]\nI smoke more than I eat\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\nI smoke more than I eat\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\nI smoke more than I eat\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\nI smoke more than I eat\n(you so crazy, you so crazy, you so crazy)\nDrink more than I sleep\nI fuck more than I love girl, so wassup?\nIs you freaky?\n\n[Verse 2: J.I.D]\nSavages, let's get back to business\nI was bumping Webbie, webbing through what's in his vision\nRealize the image, was nothing like myself\nBecame something different, I ain't nothing like no one else\nFunny I would say that, sorry that you didn't\nSorry woman, sorry nigga, I feel sorry for your kiddies\nI can't keep it artificial\nI official, all the whistles\nI won't even argue with you\nI'm so high, it's all medicinal\nImma get you high\nPull up on a lones and it get you shot\nTalk a little shit brrr pop pop\nStill called your nigga like Jid Joe Pa, but is Jid Joe Pa\nYeah no naw\nI just fuck, I hit no raw\nThem talk slick, I twist your jaw\nNo boys on leash don't tempt no dog\nAll I gotta do is let 'em off the wrist though\n10 4 niggas shooting from the hip so\nShut eye I can shoot 'em from a disco\nNiggas shooting on the blitz tho\nTouchdown, had to throw the ball to Christo\nNigga had to get ghost\nMe talking shit, broke, pissed and paranoid I'm grabbing on my pistol\nMy bull in a dismal state for dismissal I dipped my dick in gold girl who sent you?\nTell my dick don't get too hard, we out in public being stars\nI would just take you to my whip\nFucked a bitch, flipped a car\nRidin slab, sipping bar\nI heard it from a G before, I always knew I'd be a star\nHad to talk, me and God\nTold me there was two types of people, me and yall\nSorry I ain't seeing y'all, it's gonna take like 33 of y'all\n45s at 4-5 am, no I ain't sleep at all\nAsk me why I go so hard\nAsk me why my flow so hard\nI ain't tripping, I just ask them niggas what team they going for", "[Verse 1]\nWait...alright\nSorry I don’t give a fuck about no college shit\nThey couldn’t keep me in that bitch with a scholarship\nI would've been the Dali Lama or like Don Lemon\nBut I'm Dicaprio, digging my inner Bart Simpson\nThe bitch fine\nI’m breath smelling and toe sniffing\nI just look at you like you art\nI cry books of garth\nI know that she prolly leave\nAnd break my achy breaky heart\nBut I don’t care cause I don’t need that organ\nProbably find that shit again when I have me a daughter\nBut with my karma I probably have forty four of them\nOne son\nLittle one son\nJapanese mom\nBeyonce\nBut if you jump dumb\nI turn your ass to Willy Lump Lump\nLeft silly slumped\nRap game, Willy Wonka\nNeed a ticket or a sponsor\nI'm just coming through your monitors\nSitting in your kitchen\nWhile your momma in her pajamas\nMaking eggs for your brother and your father\nGo to school now\nGym locker room\nLittle buddy got the tool\nWe ain’t telling, shit's cool till he busting at you\nI was just thinking I could die or get some dust on my shoes\nFrom running, but these my favs\nI should walk the other way\nSee, me and God had a long talk the other day\nHe just told me some jokes\nAnd told me I can lead the way\nTold me I could make the change\nBut, thats all I gotta say\n\n[Chorus]\nBeen a long day\nSmoke until my head hurt\nRunning all the way\nPutting in the leg work\nRolling up the paper\nTake a shot of Jager\nShawty wan me swam in the pussy like a sailor\nShorty from Chicago\nShe love O Block\nHop out the car smoking out the whole block\nTryna pull me over\nWe don’t fuck with no cops\nWe don't stop\nWe don't fuck with roadblocks\n\n[Interlude: Sample]\nCould you not talk with your mouth full?\nExcuse me?\nYou're making me sick, I'm gonna throw up\nOh, okay, Dad\nSure thing, Dad\n\n[Verse 2]\nBaby got the ass like SZA\nLong ass hair\nWanna beat like the RZA\nShe just want joke like the Riddler\nBut if I puzzle this little picture\nShe probably end up with dick near her appendix\nOoh splendid\nNow I gotta buy her shiny shit\nDyslexic she tryna do the 96\nWanna come to a G spot bitch\nFind this shit\nTryna tell me you the bomb\nLike I don't mine and shit\nI been all across the world\nOn my grind and shit\nSticky bud in my grinder\nCan't grind this shit\nSuck a dick on your Insta and Vine\nBut its words you want\nAnd I promise I ain't got a dime\nLook at God while you crying\nI ain't dying for a record to sell\nBeef not getting the money\nSo it's selfish as hell to the squad\nAnyways, if I was there I never could fail\nCause JID major childish, Petty Labelle\nSqeaky voice, but the flow hold steady as hell\nMy wordplay wordly and I ate the gazelle\nThe other day and the girl, her name was Giselle\nIt was easy as hell, she was a jezebel\nYeah, uh\nI go an split a short with my shorty\nLittle tired, she been riding, Kentucky Derby\nLittle God bless this strong and hold it sturdy\nHold that shit down I don't wanna catch a murdy\nOvua, merci\nI never been in a Testarossa\nBut I throw this dick like Testaverde\nAll of them heard me\nJID so nouny and verby\nTalking about pussy pounding and slurping\nWait...\n\n[Chorus]\nBeen a long day\nSmoke until my head hurt\nRunning all the way\nPutting in the leg work\nRolling up the paper\nTake a shot of Jager\nShawty wan me swam in the pussy like a sailor\nShorty from Chicago\nShe love O Block\nHop out the car smoking out the whole block\nTryna pull me over\nWe don’t fuck with no cops\nWe don't stop\nWe don't fuck with roadblocks, x 4", "[Intro: J.I.D]\nCome to my garden, it's for you\nEuphoria, next level\nUni—[static] and [static]\nYou can start what you finish\nTemptation is simply what you make it\nIndulge, please\nI want you to indulge\nEvery thump (everyone's a star)\nWill run from your head (every day's the move)\nTo your toes (everywhere we are)\nClose your eyes (you, yeah)\nGet away (everyone's a star)\nIt's for you (every day's the move)\nOnly you (everywhere we are)\nAnd there's the one thing you cannot forget\n\n[Verse]\nI'm just trying to come from under the thumb of this regime\nAll plans I got a scheme, consulted among kings\nSpread my wings, I bleed\nI'ma tell you like a nigga told me\nI'ma tell you like a nigga told me\nCash rules everything around foolies\nSo these niggas walkin' around with the uzis\nStrapped up, no camera, finisher the movie\nYour life is a movie, get it? you stupid\nBrother blind, colorblind, you're Doug Flutie\nMy girl is a nubian princess, convinced she was sent here for me\nSent here to be, anyways I'ma rip this and eat any pussy MC\nSay you are what you eat, ain't no pussy in me\nTell a nigga bye bye 'cause you pussies N-Sync\nDon't squint nor blink, better talk 'fore you think\nNo, think 'fore you talk or the plank you can walk\nLike a pirate, Spillville violence\nMushrooms molly, y'all niggas wildin'\nGrown man fuck boy, y'all niggas childish\nMy dick is the bomb like Arabian Saudi\nYeah yeah shawty, you cannot afford it\nLet me get back to my blunt and my forty\nPara Tu shawty, what it do shawty?\nThis bitch choosin', who shawty? (who shawty?)\nI gotta do what I gotta do and I gotta move how a nigga gotta move, too cool (too cool)\nGot bitches like buku, got money like buku, red suit like soowoo\nYour flow boo-boo, my shit too\nI'm too cool man, shit, ahh, Para Tu\n\n[Outro]\nEveryone's a star\nEvery day's the move\nEverywhere we are\nFor you, yeah\nEveryone's a star\nEvery day's the move\nEverywhere we are\nFor you", "[Intro: J.I.D, Girl, Guy]\n\"You have to be the life coach!\"\n\"I'm not trying to laugh\"\n\"Haha! No real, like, real though, okay? What we suppose to be talkin' about. Well?\"\nYo, yo, yo, yo\nYo, yo, yo, yo\nYo, yo, yo, yo\nYo, yo, yo\n\n[Verse 1]\nI was on some other shit, now I'm back to this\nI had my humble pie, now it's time to take a shit\nShe wanna suck my (Hahaha), only if you insist\nOnly because I'm lonely and only cuz I ain't shit\nOf course she say she won't, then go on with the lists\nI wanna slit my wrists, I'm horny as a bitch\nHer brother and her sister act too, father crisp\nShe givin me her maybe's, she tellin me her if's\nHer then statements, her family, even the rips\nI tell her take a sip, grab her neck and start kissin\nShe said I'm too explicit, I'm thinkin like a midget\nGettin fisted, I just wanna stick it, maybe fifty\nAnd I'm back to the digit, she think about it\n\"Mmmmmm\", JID, don't be so sadistic\"\nI'm tryna get her to fuck, so this dick can get stuck\nBut she can't get, past the fact that I'm fuckin brilliant\nMost niggas act, retarded off [static]\nI don't really rap, I'm just followin the tick-ticks\nThe booms, and the claps, it just so happens\nThat the kid keeps it accurate, used to whip the Acura\nBack in the days when I was young\nI'm not a kid anymore\nBut now I'm grown and my women are gorg'\nShe prolly just want my heart, and to surrender the sword\nBut I'm a Ginsu warrior, slingin dick victoriously\n\n[Chorus: Doctur Dot]\nYou think you clever huh\nYou looking at me so passionate let me know that the nigga that you been tappin is actually unimpressive huh\nOh well\nI see what I can do about you, see what I can do about you\nYou think you clever huh\nYou looking at me so passionate let me know that the nigga that you been tappin is actually unimpressive huh\nOh well\nI see what I can do about you, see what I can do about you\n\n[Verse 2]\nBaby you interesting, and I'm interested after having long sex\nEight sets of ten that's a long set\nBend that ass over like a long snap\nShe ain't say nothing just supply me with the bone grip\nTold me it's a full ass moon that shit glowing\nLittle nigga put your coat on, your Scorpio showing\nI never told her my birthday, it's not even the first date\nAnd then I made it worse then my October the 31st\nNo wonder you kinda thirst\nAnd then she laugh it off\nYou freaky nigga I wonder if you be jackin' off\nBad bitch with a sense of humor\nFuck a fan it don't get cooler\nFuck your ice and your bed it don't get cooler\nThink I won gettin cooler like I'm Don Shula\nGot a piece like a damn Buddha\nSmoking a gram I'm the Grand Puba\nGot a gun fuck your shooter anyway\nLittle shawty got me amazed\nThe fact, the fact, the blood leaving from my dick to my brain\nIt's cool how we converse never say conversate\nShe said I know I always had a way word with ways\nWay with words, wayward sons lit up with jay\nThey finna leave, I'm finna to sleaze to the back room\nTryna see if I can get me a little vacuum\nBefore the moon change clothes with the sun\nAnd presume another day another doom\nShe say if I stay then I got to sleep in the other room\nI said it's cool cause around 3 I'll probably come and creep in your room\n\n[Outro]\nYou, you ain't got to be so cold\nYou, you, you, you ain't got to be so cold (so cold)\nYou ain't gotta to be\nYou ain't gotta to be so cold (so cold)\nYou, you, you ain't got to be so cold\nYou, you, you ain't got to be so cold (so cold)\nYou, you, you ain't got to be so cold\nYou ain't gotta to be", "[Chorus: JID]\nGet away, get away, get away\nI pray to God cause I’m afraid to die, and never been afraid\nAnd baby if I die today, it’d probably make me more a man\nI tell ‘em get away, get away, get away\nCause baby if I die today, it’d probably make me more a man\n\n[Verse 1: JID]\nYeah uh\nI like to see it through my mind’s eye\nI couldn’t view it from the thoughts of a like mind\nI like mine and likewise\nEvery atom or Adam and Eve that breathe matter\nChatter I seen most definitely like Yasiin\nLong, dark roads we travel higher than high speed\nCut off them high beams\nBaby I got weed\nI ain’t gon’ kill us cause we in Heaven\nDon’t look up, close your eyes when you jump\nUse your mind when you flyin’\nDodgin’ ducks and duck\n\n[Bridge: Mereba, 6LACK, Both]\nIf you stay\nThen you choose Fate\nI don’t want you to try\nCause I don’t want you to die\nLike me, like me\nLike me, like me, like me\nLike me, like me\nLike me, like me, like me\nLike me, like me, like me\nNo, no, no, no\n\n[Chorus: JID]\nSo get away, get away, get away\nI pray to God cause I’m afraid to die, and never been afraid\nAnd baby if I die today, it’d probably make me more a man\nI tell ‘em get away, get away, get away\nCause baby if I die today, it’d probably make me more a man\n\n[Verse 2: Mereba]\nGood God, there are Angels flyin’ over head\nBut there are demons in my bed\nAnd all of us will run out of time\nBut they say everything, everything will expire\n\n[Chorus: JID]\nSo get away, get away, get away\nI pray to God cause I’m afraid to die, and never been afraid\nAnd baby if I die today, it’d probably make me more a man\nI tell ‘em get away, get away, get away\nCause baby if I die today, it’d probably make me more a man\n\n[Verse 3: PELL]\nRight\nI made a valid life\nBet I won’t live this shit\nYeah she a bitch, but her cousin have you in a ditch\nSix feet deep, when I came on a bih\nCouple past-due bills, check ain’t come in for a week\nWould love to call my parents, but I’m on my own feet\nAnd they run into them dollars even when the road steep\nLook at me, complainin’ ‘bout shit that ain’t my problem\nHalf of them new mistakes came from strangers that I brought in\nBe cautious of the weeds that you keep inside your garden\nCause the moment that you bloom\nThey gon’ block your shine with darkness\nShots that they took left a stain\nBut it’s burned a n**** rug and I’m vacuuming the carpet\nI’m off it\nDamn, I guess I flow the way off from the topic\nToo hot for my enemies, but too low to be heavenly\nI hope the Lord forgivin’ me\nI seen a different life through these lines\nI guess I blame it on the times, yeah\n\n[Chorus: JID]\nSo get away, get away, get away\nI pray to God cause I’m afraid to die, and never been afraid\nAnd baby if I die today, it’d probably make me more a man\nI tell ‘em get away, get away, get away\nCause baby if I die today, it’d probably make me more a man", "[Verse]\nWoopty wop, whatever\nSlay I'm really feeling like Lane Kiffen\nIn your lane switchin'\nFlick on the lights, your dame missing\nIraq, my aim dipping\nSex, giving texts, I'm reffin' you fuckin' peasant\nI'm present, you fuckin' reffin'\nWait, I'm not a present, my presence is not a gift\nMore like a gust of wind or a whiff of shit\nBut I'm clean and I clean the murder scene with a 'Wiffer bitch\nThen go and get your bitch on some Stiffler shit\nStiffer dick than your mans\nShe hate short niggas so she judge me by the height of my pants\n'Fore we fuck, flick the light in advance\nI don't wanna be surprised in the morning if you frightening 'cause baby girl\nLook, I'm ordered by the lord's steps\nMy cologne's like the lord's breath\nThe drum on that tommy gun like a constant qu-qu-quartet\nYoung niggas get mad and you can get your door wet\nYou can get the whole set\nThink about Africa when I see them stores that be buying gold back\nThink about slappin' you, actin' like you own capital\nPut the whole world on my back, crackin' my clavicles\nBut it don't really matter\nI'm coming back from sabbaticals\nGot my nine cocked, Simba standing on pride rock\nPoppin' a couple shots at the eye of a cyclops\nWe don't fight box, put that boy in a pine box\nJust call it a time stopper\nFox 5 choppers in the sky\nWith the chopper, so don't try to play the guy\nIf you tryna say goodbye\nC'est la vie, au revoir\nHasta la, vista and nice to meet ya\nThat P-90 turn a punk into a pasta pizza\nSlice a piece up, get your t-shirt\nYour \"R.I.P.\" shirts\nYour \"should've never tried J.I.D\" shirts\nThe only reason we hurt people, 'cause nigga we hurt\nLook at J.I.D, subject leapin', I'm not a lemur\nIn a Beamer, Willie Beaman\nCrack your head like a pecan, or pecan\nEast side nigga from Bouldercrest to Redan\nStaying in my G stance\nSticking to the p-lan, nigga we ain't p-laying\nSitting on my hands, having the world at my feet\nOne foot in your ass while the other straddles the street\nSaddle my steed like it's 1873\nBut I got a weapon with me and I'm ready to eat\nMetal to meet to settle the beef\nYou got a vendetta with me?\nNiggas get dragged like Edelman in a cover three\nI'm on your bitch ass, Baretta hit him, he fell asleep\nYou such a sick ass, I did it nigga, you tellin' me\nIntellegently though\nSo for the bills he might Belichick you bro\nWe in the field if I recollect correct, with hella debt and neck to neck\nBetter yet, get a TEC for disrespect\nReady set go, steady and slow, let it explode\nEyes on the road, they looking for niggas like me and you\nScared of the future, scared of what we can do\nI jumped off the stoop before two\nShit I jumped off the roof with those dudes\nMama asked if they did it what is you gon' do?\nDrop with a parachute\nGotta get the guap, keep the pots full of kallalou\nI'm gon' shine, but what's lights to a caribou\nGot my nine while you niggas been backstabbing you\nI'ma skedaddle, watch your life crackle\nYou a trip on the gravel, I done added up every atom in the sets to compatibles\nManifested an antidote and a flow that can catapult me out of Atlanta\nPour a four in my Fanta\nPlease excuse my manners, crack a smile for the cameras\nTie my bandana up, swag my stance a lil\nSag my pants a lil\nJust took a trip to my city, it's a landfill\nNot even on camera, you can get hit with the handheld\nDropped at a standstill, left that man ill", "[Verse 1: Jordxn Bryant]\nYeah\nFather forgive me for my sins\nForgotten bout me for so many years\nSo many Ls I can guess the reason why I ain't in XX\nComplex why I'm coppin' doves for less\nMy nigga is the source there's love for that\nLight a [?] I'm levitatin'\nGravity's a bitch my ankles gettin' grabbed by Satan\nDamn I need a change of scene\nMy vibe on fuck a magazine\nMy niggas know this more than just a dream\nI'm more than just a King it's more than just a name\nI don't even want the fucking fame\nI want my fam to be more fucking fortunate\nSo no handouts I want the hand now with the motherfuckin' torch in it\nUh, to many blues not enough yellow women to tell them that green coming soon, greed coming too, seas coming too\nFamily members I can't remember them coming in June\nBut they present now who the peasant now\nCould have been the one the ville never found\nCould have packed 2s\nIf I did would you still come around\n\n[Refrain]\nOoooohhhhhh\nHeeeeyyyyyy\nOooooohhhhh\nHeeeeyyyyyy\n\n[Verse 2: Hollywood JB]\nHold your head up high\nWhy we hide our pride behind that camouflage\nWhy we think it's okay to live life in disguise\nWhy we look to the skies\nWhy we construct our demise\nBetter put more faith in your God\nI really need to talk\nAye yo God, when we gonna spark in the...\nWHy said I'd try, I said swear to\nHe said you swear to me then don't lie\nImagined if you worked as hard as you've cried\nCan point you to the stairs but it's on you to climb\nTo the peak\nI'm anointed when I speak\nThat's what kept me out the streets\nKept my enemies at my feet\nKept the Devil under me\nEverything I want is right in my reach\nSo close I can raise a toast on every coast on every beach\nLet's set sea\nIt's only\nTo see us succeed\n\n[Refrain]\nOoooohhhhhh\nHeeeeyyyyyy\nOooooohhhhh\nHeeeeyyyyyy\n\n[Verse 3: J.I.D & Hollywood JB]\n(Father)\nNever said this shit was easy so make shit make sense\nI make shit, shape shift, makes swift movements to sink ships\nOr bandwagons I view the world I gotta have it\nIn my palms I can write a song, write a song\nRevolutions coming right along\nI seen it, I dreamed it, can taste it\nI see the look on niggas faces\nI never look but they adjacent\nSo things off safety, on my waist\nEnemies close kinda like this .38\nYears older basic kill a nigga round\nTry it sometime, write easy rhymes, I lose sleep\nDaily, daily, nightly, nightly\nHope the Doctor Doc don't try and fight me\nStrike of lightning when I write enlightening\nPara Tu, para you, pair of these for your girl and your main squeeze\nPlease Ms. Thing, don't bring drama to my scene\nJ.I.D para Tu I sing, And as for you\nI never said I couldn't do\nSo I does as should you, Para Tu\nThe weed burns so slow\nSo, so slow as for you I pull two\nPara Tu Para Tu", "[Intro]\nYou give me a month and I'll make a mountain move\nYou give me two months and I'll make a moon for you\nIt's still J.I.D. Route, just a little bit smoother\nI pray for you\nAnd I know it seems hard\nWhen its crazy in your mind, but you know what's in your heart\nAt the top of the mountain where the Earth meets God\nSeems far but\nI pray for you\nSeems far but\nI pray for you, I pray for you\nSeems hard\nI pray for you\nSeems far but\nI pray for you\n\n[Verse 1]\nAnd I know you hate the sight of me\nAnd everything I sit, jump, and stand for\nBut when you see me you know I'm doing good\nDidn't mean to leave your world dismantled\nOr you would say shambles\nGave ample time to blow out the candles\nOn to the next chick, thought it was a scandal\nNow on to my ex something shorty couldn't handle\nIts crazy but, I pray for you\nAnd to those who wish I never make it\nHope you know I'm forever praying\nNot for no jewelry or no wrist bracelets\nBut that I can change lives in my heaven placement\nAt the gates I, I pray for you, I pray for you\nDon't stray, you'll make it, I'll make it too\nI pray for you, I pray for you\nYou knew it, the fact that I'm a human\nMistakes, I'ma do it, pursue it, I pray for you\nI pray for you, I pray for you\n\n[Bridge]\nDouble triple joining souls step in\nStep hoes step left, right directions\nNo hoes left\nShow me something\nShow me something\nShow me how to prove my point\nAlways believed being last is best\nGive me last\nEven if you give me least I'll give complete\nWhy not?\nFeeling this intrinsic interdependance\nYou knew me before your fingers had tips\nAnd your tips had prints\nAnd your prints had grooves\nYou knew\nWe know\nYou knew\nWe know\nEven if no one else had the bag\nScars sustained\nAnd cuts suspended\nCompletely free from both sides of the word \"then\"\nFeel this reciprocity\nWhy not?\nWorst case I'm back to first base\nWoo, Hope me no confuse you\nHope me no elude you\nPromise is not on purpose\nPurpose is not promise\nPromise is not on purpose\nI'll pray for you\n\n{Verse 2}\nYah, four hundred something years\nSo many tears that it could start an ocean\nNot to dwell in the past 'cause I live in the moment\nYou gotta know where you been to see where you goin'\nSee where I'm goin'?\nThe hoodies all black for a reason\nThe clothes all black for a reason\nYou probably just gotta see it\nYou hate that God called his angels back for a reason\nShit happens, reactions and actions\nBut still I pray for you, I promise I'll pray for you\nDon't stress, you'll make it, I'll make it too\nBecause I'll pray for you, I promise I'll pray for you\nDon't stress, you'll make it, I'll make it too\nYeah", "[Intro]\nYeah, uh-uh, uh\nLook\nParadise, Paradise\nEscapades, shit\nLook, uh\n\n[Verse]\nI'm just an old-ass, young nigga\nA smart-ass, dumb nigga\nA brand new nigga, but I still know where I'm from\nI just been bangin' my drum\nBangin' your chick 'til she cum\nAnd I go, and she come again, but I'm on the run\nI'm just an insane, sane nigga\nAn untamed, tamed nigga\nMy membrane tainted, my pen pad painted with pain\nPoint-blank range, aim at your brain, bang! I'm angry\nDrinkin' Jamy, I'm just like you but we ain't the same\nTwenty-something, Kurt Cobain inside the game\nSwerve a change inside your lane\nHeard them people want me dead\nSo get in line and file your claim\nState your gang and state your name\nWe exchanging hate for hate\nYou take a shot, I take a shot, my .38 like 8 for 8\nSo what's the play-by-play?\n'Cause day by day we set the pace\nFeel like Tay, we do the race, but no, this ain’t a game\nSo make my day, so make my day\nSo make my day, so make my day\nNigga, you faded, run my fade\nNigga, you crazy, gun my waist\nLook at you wasted, stay in your place\nFuck all the fakin', we makin' it shake\nI'm from the A, so we bakin' and takin' a nigga cake\nPlay state, milk shake, red drink, I ain't sayin' it\nJust to be sayin' it, comin' back for what they taken for granted\nAnd for what the people took from granddaddy\nKinda shocking, because damn it was steady\n\n[Outro]\nWait, wait\nThrow your hands in the air and just wave\nWave your guns in the air, brush the waves in your fade, wait\nWave at a pretty lady (If you...say)\nWait, wait\nThrow your hands in the air and just wave\nWave your guns in the air, brush the waves in your fade, wait\nWave at a pretty lady (If you...say)", "[Verse 1: JID]\nWasn't used to taking orders if I'm rude, my apologies\nI never been a follower, I'm addicted to the power\nSo I've studied the remains of the game, I'm an archaeologist\nMore money, more problems\nThat's a tough pill to swallow if you ain't about that shit that you be talkin'\nThree holes in his head, bowling balled him\nWho's brawling, nah\nYou calling God but shit me too he gotta hear one of us\nI can give him a chance to meet you if you if you wanna\nCool Cat backing that cone up, ooh, I got a boner\nPlease show me my opponent\nYou and your homie, he with you, that's a bonus\n1-1, 2 shots, that's a bonus\nNever had squat, tried keeping up with the Joneses\nTry wearing off-knocks, niggas popular with Junior\nNigga I been hungry, for a time I was homeless\nI honed in my skill, sharp sword swings along for the moment\nAtonement in my tone\nOwnership is the only shit I've been voyaging\nVoices in my head and then I go record it\nI've been ordered by the Lord\nKill the beat, beat a dead horse\nIll swordsman, sportsmanship\nThat's horseshit, copious corpses\nOutsourcing for resources\nYou got a gun, we got assortments\nThey make appointments, joint rolling, join forces\nAnd we rejoice when real niggas lift their voices for the voiceless\n*Argument and chaos*\n\n[Interlude: JID, Conway the Machine]\nUh, uh, yeah\nAw shit, uh\nAw fuck man\nNiggas, uh, yeah\nFuck a [?]\nLet the machine, uh (Yeah)\nYeah, let the machine\nLet that machine\n\n[Verse 2: Conway the Machine]\nStash boxes for the straps in the navigator\nDon C alligator\nA lot of rappers they just imaginative, exaggerators\nBox landed, take them packs and put them on the calculator\nWeigh it up and stash it bro, I'm coming back to bag it later\nThat bitch bad, I'mma bag her then go stab her later\nGot the pussy free, I didn't have to pay her\nGot the bags so if it come to that, trust me, I have the paper\nBut I'm just that nigga, I ain't have to get her drunk or incapacitate her\nYeah, I'm MVP form like Shaq for Lakers\nAin't no silverware in the trap, fuck it grab the hanger\nRatchet sprayer, Buffalo got the highest murder rate in New York state\nThat's a fact, check the stats and data\nI was deep in them trenches\nHomeless in Atlanta, sleeping on benches\nNow bitches see me in this Benz and it's peakin' they interest\nDawg caught a body L-I-F-E was the sentence\nHe gave his life to God, seeking repentance\nYeah\n\n[Instrumental Outro]", "[Verse 1: J.I.D]\nI had a dream, had a dream\nSeen things, tryna paint a scene\nLot of weed so I don't really dream\nMore like a kush coma cuz this shit was distinct\nYea, I ain't go too deep just to tell you I'll be the king by the end of the week\nExit the stage to your left, take that front row seat, you've been impeached\nShe wet them sheets when I rap offbeat\nJID DiCaprio, put a cap in your soul, dig deep\nThat nigga a fool, he shot the nigga midweek\nCouldn't sleep for a week and he still on the streets\nI'm just another man in the mind from the East\nHad to put down the cleats when I picked up the beats\nRapping under my helmet, they throwing hail marys\nHellbent on being the best, I had to pick one so tell me somebody\nNah, that's just combat for you wombats\nYour niggas react like tomcats to a strong bat\nMy niggas just tell me they want that so they hunt that\nTaunt that until it's in a lunch sack, greatness\nGet your show or your stage ripped, going ape shit\nI'm just a nigga from the 6, hop off the grave-ship\nSlave-shift, great shit, momma I made it\nAnd I hope it never fades but it will one day\nIn the days that y'all got to suck seeds to fucking succeed\nI'm in my all black tuxedo, hair nappy\nJID Buckwheat\nMy girl tryna leave cuz she probably tryna fuck me\nProbably tryna puff weed\n\n[Interlude: J.I.D]\nBlood on the leaves, blood on the leaves\nThey killing niggas for drugs, that's blood on the weed\nSome dumb shit\n\n[Verse 2: Johnny Venus]\nInitial, Check\nSweat drippin down my neck\nAnybody's guess what a nigga gon do next\nFirst chair, I can't rest\nMiddle names yet I'm anxious\nThese niggas ain't about they Hanes yet\nNightmares, I can't breath\nPain test, asteroid, I came blessed\nStill, Spill Vill til they sorting out my will\nLehman Brothers, Goldman Sachs, til they sorting out my deal\nSouthwest, where they sort it out with steel\nCarnegie, Rockefeller, head out in Ben Hill\nHotter than that TEC that he caught off a deal\nHad to keep him safe, keep his body count nil\nCrazy like that man Joey Bad back in South By, standing next to strangers\nHe stepping on my J's but it ain't nothing, I'm humble\nCan't wait to grab the microphone and make that thing run, tho\nDrove 5 states just for 15 minutes\nAll through the hate just for 15 minutes\nMake it even worse dog, yea we ain't hit it\nConscious up ended\nFace so offended\nDrugs help me blend it though\nSo now I'm high and low, you know\nTryna get a hoe, life reciprocals\nShe beg don't let her thighs go\nI beg don't let my eyes close\n\n[Bridge]\n\n[Verse 3: Doctur Dot]\nUh Huh\nCome sit beside a suicide survivor\nYou can die tonight, bruh\nYou can die tonight, bruh\nYou can die tonight, bruh\nWon't nobody find ya body if I hide ya\nLose ya like a lighter\nAlways been evasive when it came to conversation\nFuck whatever question you asking off top\nKeep it locked like the ness monster freaking out the Scots\nGod is the best sponsor of my freaky thoughts, ooo wee\nShe's a freaky girl, She's a leaky faucet\nOn my semi tall shit\nShimmy shimmy ya, shimmy naw kids\nWhat that got you feeling so important\nOf course that's some bullshit\nGot a following from these recordings\nAnd now them courses in college, kinda pointless\nWhatever, I enjoyed fucking every little spoiled bitch\nDaddy had your life planned out 'fore you was born bitch and your rebellion was taking long dick\nIt's the nocturnal, Doc-turnal, hotbox burner, popping like cob kernel, Cobb County Counts\nAlways fucking with a dark person filthier than Pac murder files in a pile of dirty towels\nSome real rabble rousers in your house\nCut the lights, close the curtains\nCouldn't clean the bloody sheets cuz we drank all the detergent\nMasturbating, so perverted\nOnly take it if you serve it\nOnly thank you if it's perfect\nYou forget this-ugh-like honey bun, let that pussy cum right on my tongue\nI'll leave you undone\nLighten up, thunder to come\nIt's a conundrum, why you still trying to run even though we know your body is numb?\nNiggas flexing like the party was fun cuz the populars attended\nBlah blah, fuck them niggas\nUnderdogs are better winners\nBet a miller I could get your bitch then get her wetter, clitter than them pitter patter strokes that you give her\nSpillage Village", "[Intro: KEY! & J.I.D.]\nHello?\nNot from the top, I wait till the beat drop\nLet's feel back it, cause it's that lil' space right there\nGrraa, grrraa, ayy\nCan't do shit like that, just leave it\nI can do one song\nYeah\n\n[Verse 1: J.I.D. & KEY!]\nY'all niggas lookin' like money, ching-ching\nLight shine, starin' at your wrist, bling-bling\nLightweight J.I.D., get drunk off a Yuengling\nLet that thing sing, sing, sing, send him to Sing Sing\nBut I ain't got time for no jail time, no\nPick them shells up, let 'em cool down, blow\nPull up to your big ass crib like Hello?\nNobody here? Y'all ready to go?\nI got division like Mansa Musa\nCan fuck your bitch like a barracuda\nUzi tooly Boolie, who the shooter?\nYeah, it's not mine, cause I forgot the ruger\nNever been a gangster, I'm riding with my seatbelt on\nTryna drive and roll up all of this weed in my palm\n\n[Verse 2: J.I.D.]\nTwenty-five to life, it all started with a coca leaf\nI swear I been the dopest this not how its supposed to be\nNiggas spent the bend and shot at everybody close to me\nAnd they killed my nigga T, dome shot, R.I.P\nNiggas killing niggas I ain't even get the notion\nThey out here catching bodies and a nigga ain't provoke em\nOh shit, guess I need to pick me up a strap now\nNowadays, niggas don't even know how to act (Bow)\nRun to the hills to avoid the high waters\nThey flooded the crops, kill pops, they tryn done us\nThey Marshawn Lynch with the Glock, they ran rumpus\nDunk us, Jordan signs seen clear when they stomp us\nSick of Atlanta, I hit my girl, then flew to Dulles\nBumping Dwele, dwelling on the past they ain't tell us about\nAll we do is accept they bullshit they sell us\n\n[Bridge: Key!]\nOkay!\nNiggas ain't talking how they living\n(Mumbling, repetitive 'For real!' 'Okay!')\n\n[Outro: Leonardo DiCaprio and Interviewer & KEY!]\n*Do feel or do you think that it's a human nature that we always want more?*\nI think it's not just in human nature I think it's a characteristic of all life, I think opportunism and greed has really been the key to you know, survival\n*Can you relate to that, always wanting more?*\nWell, the truth is, it's you know, we all have good and bad in us and that, you know, you have to stop yourself, you have to stop yourself. You know and ultimately create a balance and think about others\nI think everyone can get into that addiction I mean it's an easy trap to get into, you know, on a personal level uh, you know I think that you find people like this and I've met a lot of people like this who's entire world is consumed by wealth. And and you meet them and you talk to them and you realize they dont have a lot of foundation in their life whatsoever\nAnd so therefore this becomes the root of all hapiness for them. And of course I like money like everybody else, that would be an absolute lie, but I think its important to be responsible at the same time. And I also think it's important to give back to if your in a privilaged position. I think that that should be  a pre-requisite to anyone who's gotten to accumulate a lot of welath in their life\nI think that it should be standard\nFor real\nFor real\nFor real\nOkay", "[Verse 1: Jace]\nKrispy or Kreme, whip me a beam\nDouble cup a couple blunts and sip me some wait…\nKrispy or Kreme, whip me a beam\nDouble cup a couple blunts and sip me some lean\nPockets on Shrek though, crazy big green\nCrazy big steam coming out that limousine\nI’m one with my chakras, my partners is mean\nI’ve got to intrigue the thots in my league\nGet the only motherfucker with like three chains on\nIn a free range range with like three gay broads\nWho are all interested in a three way off\nDoing a bunch of drugs with a grade A star\nI am crazy hard and a lazy fart\nKinda way, runaway\nWho say Jace ain’t hard?\nNo, they can’t shake my squad\nAll I pray is pussy niggas learn to play they part\n\n[Verse 2: J.I.D]\nOkay the lights keep flicking, I’mma stand in the dark\nI need a cup of that brown shit and some weed from the heart\nSo show me love lil nigga, I been fuckin’ with y’all\nGhost whispers, she wan’ be my mistress\nBut I ain’t got no time, no time, no time, no more\nI said I was on my Joe Pa\nMy hands still numb from the winter\nInto the door where the mula\nYou niggas been holding out into the door where the shooter\nAin’t nobody fucking moving\nJust want my words to touch like I’m reading in braille\nThe little engine that could can’t get derailed\nIf he tails talks\nTouch we meeting later for brunch\nTo discuss how I’m losing my muchness, pretty much\nI’m done with you silly fucks, need work, you finna Phillipe\nShit, he made Jiddy have to center his inner Ye\nSee me, I’m king with a capital K\nAnd you niggas is all G’s with a capital gay\nAnd I’m gonna go scoop my girl the capital state\nWe gon’ take it somewhere foreign, blunts bud Bjorn\nI’ll probably put a hole in the stage when we start touring\nTearing up cos we toured up\nNigga do the Roosevelt\nDrinking champagne make my stomach belt\nMy girl so juicy it’s like Welch's\nTell me you’re a virgin I’m so selfish\nAnd tell me how you fucked 2Pac with no Elvis\nLove lobster but hate shellfish\nHigh girl but you so celcius\nThat’s why I met a thousand you’s and a thousand crews\nProbably fucked a thousand dudes\nMe and Venus, that’s a thousand 2\nBlood walk on the moon and pay a thousand dues\nThousand dollars to my name nigga, ouch\nJust coming from off the couch with a blunt in my mouth\nStick my head out the door of the house\nHeard something ‘bout you running the south", "[Verse]\nIt’s that lil’, dirty, eastside, nappy-head phenomenon\nRumblin’, young man rumblin’\nTumblin’, twirlin’, troublin’\nWorld got me losin’ my nerves, humblin’\n‘Scuse me, sir, step out of my circumference\nPull up a chair, take off my shirt like I’m Gucci LaFlare\nI’m the shit, nigga; Pepé Le Pew\nGrab the stick, keep the weapon secure\nHave a fit, let the message be heard\nEvery mothafuckin’ word, but I heard from a little bird\nThere’s been a surplus, an emergence of fuckin’ turds\nIt’s an emergency\nRobbin’ you for your bread, it’s been a burglary\nDirty, little niggas, they ain’t worth the detergent\nI could squeeze out of the bottle\nNigga, I came from the bottom\nShot out the top just like a rocket\nGot the hops from my papa\nCouple hots and that chick’ll block\nSay sayonara, say sorry\nKnock it out the park, J.I.D. Garciaparra\nPull up and handle it\nGet off that Twitter handle\nWhat you a man or a mannequin?\nI don’t understand why you’re standin’ still\nNigga, hand it here\nI was on the bedge—I was on the edge of a fantasy and abandonment\nTook a couple pills out the cabinet\nFell upon my knees like I was Kaepernick\nSlap a bitch, slap a rap nigga if he actin’ bitch—whatever", "[Verse 1]\nUm, give me a sec\nI'm just adjusting the proper presets to set the tone\nSettle down, set in stone\nGather round, cop a squat\nYou should have an idea what this about\nI was tryna be a little better than before I was\nThe king that I am before I was\nThe guy I is to-now, tonight, to-now\nTo write, to verbs, to fuck, to curve, to live, to die\nTo seize the day, to ease the pain, I breathe a J\nTo live, to love, to life you lay,  you lie, you down, you suck, you flesh, you fucked, it's cool, I'm fed, i'm up\nI shed my tusk, you touch my ting, get bled and bust, get fed and bruh, you gotta chill with the extra\nBoy, I'm gettin hungry and the rap game a restaurant\nTummy hurting now, where the restroom?\nSneeze, cough, fart, nigga bless you\nCall all of my white friends 'nigga' because I'm ethical\nEver got beat with a bat until you turned vegetable?\nHad some beef now he broccoli inside the medical\nAll over jokes and ridicule\nThe pedestal set, incredible shit, the belly was sick, his mind was glitched, he let off a clip\nHim hit, Him miss, Him hit, Him spit this chick beautiful, bystanding witness\nDamn all on some bitch shit\nNigga came from poor, can I have some more? on my Oliver Twist shit\nOliver Twist spliffs cuz he fuck with the big shit\nWhippin' a Bisquick for a sniff of the lit lit\nMy nigga change drugs now he change drawers\nAlso from winter to fall, you got a cough? He slang Halls\nI bought one of them thangs that bring coffins\nFox 5, my nigga, coffins\n\n[Pre-Hook]\nOk now what makes a motherfucker gangster?\nPull up on the scene with the banger, no please and no thank you's\nOr is it that strong nigga that take care of his family?\nFuck the scene up and then take care of the damages\nShoots ring out, the whole spot start scrambling\nThey got range, them bullets Anthony Hamilton\nWith bad aim, them killers from off of Candler and Campbellton\nFrom the East to the West, long trip in the ambulance\n\n[Hook x2]\nThat's a long trip, a long trip in the ambulance (Eastside to Stone Mountain)\nThat's a long trip, a long trip in the ambulance\nThat's a long trip, a long trip in the ambulance (Cascade to Bouldercrest, a long way)\nThat's a long trip, a long trip in the ambulance\n\n[Verse 2]\nI say hakuna matata\nNot worried, you can do nada\nI dip my shoters in Prada, you can get dropped in that Aquafina\nFela in my speakers, I'm so surprised you can see us\nSee us, see it from afar, don't throw a rock at a star\nIf I'm Aladdin, I would've just pulled the Glock on Jafar\nI'm hittin licks and I'm flippin it, come and shop with the boy\nShe doing dicks and she pretty lit but I'm straight on it tho\nYou make a living, you cool with it, I can't hate on it tho\nY'all niggas need to get your motherfucking mind right\nNigga light me, hit you from the blind side\nToss 3, get clipped like a mine site\nDon't drip blood on concrete\nDamn, gin drop by the sunlight\nBeen a long day and a long night\nDamn, always something, right?\nNever chill, can't relate\nDo it again, back to back\nBack to back, back to back\nI love practice, practice crack but the shit I do, you can't practice that damn\nDamn did it again\nThere I go, shitted again\nGo places I shouldn't have been\nThen again\n\n[Pre-Hook]\nAlright now what make a motherfucker gangster?\nPull up on the scene with the banger, no please and no thank you's\nOr is it that strong nigga that take care of his family?\nFuck the scene up and then take care of the damages\nShots ring out, the whole spot start scrambling\nThey got range, them bullets Anthony Hamilton\nWith bad aim, them niggas up off Candler and Campbellton\nFrom the East to the West, long trip in the ambulance\n\n[Hook x2]\nThat's a long trip, long trip in the ambulance\nThat's a long trip, long trip in the ambulance\nThat's a long trip, long trip in the ambulance\nThat's a long trip, long trip in the ambulance", "[Intro]\nCan you say that again?\nJust the way you said it, just the same way\nThis shit kinda special right now\nI don’t know what you’re talking about\nNo..c’mon you know what I’m talking about\nIf I’m not mistaken, you just tried to bribe a federal officer\nNo technically I didn’t bribe anybody\nNo, no that's not the conversation I heard\n\n[Verse 1]\nI got weed on my head, but don’t call me a weed head\nFleas in my bed, but don’t say I’m a dog\nThem niggas thought we were cool because they saw me with y’all\nI’m sorry that you’re confused, but they aren’t arguing dog\nThey tried to shit on “jed”, I just use it as fertilizer\nI came from a twig, from seeds to burglarizer\nAm high as a bitch, I got women to circumcise you\nCirculatory service, service to sanitize you\n\n[Verse 2]\nI got cheese on my head, but don’t call me a cheese head\nI’m packing like a packer,when it comes to cheese bread\nI said I need money, I got to keep that bread close\nBread dough, hopefully I can eat a day’s loaf\nMy bitches love me, I know so,  because they say so\nBroke nigga they got no job and shit paid for\nExcept for the ride that nigga “jig” got the age flow\nSecrets of bitch, but then again they get paid for\nThere need to be an exact dollar figure for the exchange services that would not hold up to court of law\nNo No\nI heard it that's the truth\nI want to tell you this\nSail on boat fit for a bond villain\nSometimes you need to play the part right?", "[Verse: J.I.D]\nYeah, I know you got a question, you looking for answers\nLook at the passion I possess\nThe pain manufactured a champion\nStamp the game\nMy name lasts forever\nThe rain is coming\nThe thunder's crashing\nFire-breathing dungeon dragon\nTake a chance\nInspire the kids that never had it\nOwn the chaos and you own the magic\nThen say, \"Why not?\" to anybody who asking\n\n[Bridge: J.I.D & Russell Westbrook]\nI know you got a question, you looking for answers\nI only have one answer...\nOwn the chaos and you own the magic\nTo all the questions you ask me...\nThen say, \"Why not?\" to anybody who asking\nWhy not?", "[Intro]\nLet's celebrate\nLet's celebrate\nA chicken birthday, a chicken birthday\nLet's have a bo'party, a bo'party, a bo'party\nLet's have a birthday\nLet's have another birthday\nYeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\n\nCheck, check, check, check\nCheck, check, check, check\nOne twice J.I. uh\n\n[Verse 1: J.I.D]\nPussy nigga proceed with precuation\nI don't even want you in my orbit\nYeah I got the hand but I really hate to force it\nJ.I.D don't take no shit, I'm not a toliet\nMore like the target\nI spill, I spill, I spill\nI fuckin' faucet\nForce feed the truth hear voices\nTryna get a trophy over my head I can hoist it\nBe inside trapped by this pink pussy poison\nOh lord speak to me I hear you real noisy\nI'm smoking my weed I can't stop I enjoys it\nSmoking out the room of course they would call it poison\nLong fucking story\nAnyway shawty say get money the bitches are comin\nShe never lie\nBehind a great man's a bad bitch rollin her eyes\nSnappin her fingers givin me 'tude\nShe hella rude but it's cool\nJ.I.D\n\n[Chorus: Tylon Matthews]\nNow it's been a minute and I ain't speak to you\nI see your ass whenever you call\nBut when I don't see you I know your doing good\nI'm on whatever you ever you\nI'm on whatever you on\nI'm on whatever you ever you\nI'm on whatever you on, on\nI'm on whatever you on yeah\nI'm on whatever you ever you\nI'm on whatever you on\nI'm on whatever ever you\n\n[Verse 2: J.I.D]\nPussy ass nigga I don't know what to tell you\nAll I can say is I've never been a motherfuckin' failure\nUsed to be a football player never went on to the NFL\nNo pressure bitch because I'm barely five sev'\nA buck 40 soakin' wet\nFast but I smoke too many blunts to try and hit LeGarrette Blount\nPussy boy dunce\nThey bumpin' our shit in fronts\nYou talkin' special teams go and cover some punts\nYou niggas cunts\nI guess it's kinda cliche that you only live once\nBut I'm reincarnated\nDouble play cause the pavement with Cartiers\nStar blazing take the bump off the cross of your necklace\nTake a shot too\nMoonshinin' it's all cool\nGo and pick your girl up\nIt's a threesome in the carpool\nSwaggin' in her ear that bitch cummin' on the bar stool\nGiven that bitch lower then the bar this is law school\nPlease remove your bra and your shwawl too\nHaha\n\n[Beat switch]\n\n[Verse 3: J.I.D]\nI'm goodie like Cujo but my name ain't Boris\nGive your girl a chestnut but my name ain't Morris\nY'all ain't none of my brothers\nShit I got enough of them\nCouple associates, friends\nYou don't fuck with me fuck em\nA lot of rappers not even cuttin' the mustard\nMore like cuttin' the cheese\nCut them down to they knees\nThey eye level with my niece\nDome shots say please\nOkay squeeze then\nLeave with your girl make her queef\nSheesh I'm the underwater hotel Fiji eating fried zucchini\nYou keep me playin' my leading ladies say J.I.D just want the whole meeting\nMeaning up with a kiwi\nShe freaky so she get me up\nGet her off then get shit off\nNasty\n\n[Refrain: J.I.D]\nAhh\nMake it real, make it real\nMake it real, make it real nasty\nI make it real ah\nMake it real, make it real nasty\nMake it real, make it real\nMake it real, make it real ah\n\n[Chorus: Tylon Matthews]\nNow it's been a minute and I ain't speak to you\nI see your ass whenever you call\nBut when I don't see you I know your doing good\nI'm on whatever you ever you\nI'm on whatever you on\nI'm on whatever you ever you\nI'm on whatever you on, on\nI'm on whatever you on", "[Verse 1]\nI never made my bed when I wake up\nI never had a job and if I did, I'd quit it after the pay cut\nSwinging on the branches, a gorilla in the night\nDon't wanna wake up the lions, tell your boys [Tread light and step soft.]\nWake up the kush with the iced coffee\nI often dissolve diluted rappers with dissolvent\nBallsy young brawler jaws clenched snarling\nGrowling a hundred and fifty pounds of astounding\nThrow my E's Up from Cali to stone mountain\nCan't my mind on my dome\nDammit if I stood on my money, I'd shrink a little bit\nBeing broke make you think a little bit\nNot a bit about the shits\nIf you with it, then how you gon' get it\nHigh in the kitchen dodging cop shots and the swastickas\nShorty all fine and provocative, for now I need oxygen\nBut later we could get it popping, Mary Poppins\nCause you all fly and you popular\nThe “X” man.] tripping\nHe outside of the Waffle House, he's got the choppers out\nPut down that bacon where all that beef you that you was talking bout\n\n[Verse 2]\nScrews missing maybe\nScrews losse [?] I'm missing daily\nAin't no time to waste now, I'm out [?] the pavement\nPlaying on the phone, what you want you ain't finna play me\nOrders raised, oh well, the first is on the [?]\nTryna meet me where I'm staying, just meet me where I tell you\nShow me love on the scale bruh, you get just what I sell you\nI'm stressed out, I used to do a lot, I do less now\nSo when niggas scheme and plot, I get left out\n[?]\nGot niggas asking how he rap so good\nCause niggas [?] cause they act so good\nEvery track identical from front to back, I can't listen\nIt's wack, don't be offended, it's just a nigga's opinion\nCause maybe if my shit ain't hitting when they hear my shit\nAnd maybe my shit make [?]\nI smoke chronic, I'm bout to show niggas how I'm a problem\nAnd the ying-yang gon' wonder why I talk I talk, bitch\n\n[Verse 3: Mike G]\nI made it my life's purpose to put rappers in hearses\nAnd move around this earth to acquire what I deserve\nI got rhymes that will make beats need [?]\nAll these bitches should know my intentions\nI'm playing hopscotch [?] these hot shots\nSince we playing Scarface, [?] is my block\nI promise I will never stop going in\nTell anyone who questions to guess again\nAnd congratulations to whoever is next to win, but\nI get love, sometimes I'm feeling like the President\nThese rappers are actors that should take five, go hide\nI said [?] bring 'em alive\nHard enough to play this game called life try to survive\nAnd knowing you get hate, you should take it and strive\nNow I'm strolling through the south and I'm rolling through backwoods\nI can bring [?] the world out the house\nI can come out with purple rain in the drought\nHow could you live without this\nI'ma show you all we gotta do is the best you could\nTo think like the most than your mind, I'm that good", "[Verse]\nNot that I'm the shitter\nI just made me a Twitter\nYour bitch hit me up and now I'm poking in her liver\nShe say her man real, but really I'm much realer\nYou had her smoking mid and I'm a purp dutch filler\nNow let's talk about my skrilla\nYou see how fast the car go\nGot so much bread I got robbed my Wells Fargo\nI hit it like Harpo, I spill off in the Vette\nOn the way to my private port bout to leave in my private jet\nGot a couple private bitches, privately getting badder\nAnd they mad cause I'm not touching on they privacy\nI'll rolling up, mama lay back, lay back in my Maybach\nLay back in my Maybach as I crack open up this eight pack\nLay back in my Maybach as I crack open up this eight pack\nAnd stop touching on my eight back\nI see through you just like Apex\nDVD recorder, J.I.D immortal\nCan't buy love, but I promise I can afford you\nThe way the shoes and the shirt fit so cordial\nThe [?] sit high, the scents on fire\nThe tint so fly, did I mention that I'm high\nI can't explain on all the money that I spent on I\nWell just explain all the money that I managed to acquire\nYou saying that I ain't hot, you's a motherfucking lier\nYou let the gay new boys get signed off \"You're a Jerk\"\nYou can't tell me that a man with my flow should not be heard\nBar for bar, word for word, I'm so disturbed\nAnd I'ma be on top of my shit so I'ma turd\nKeep your ears to the street, you nerd\nDownload it", "[Verse 1]\nAlright\nNiggas be half-mad and a man paralyzed\nCan't even use his legs and thighs, ready to ride\nI'm ready to die's a lie, I gotta live\nNice ride, machete inside, you gotta chill\nNighttime, spaghetti and fries, we make a meal out whatever's in the fridge or some shit I done pilfered\nSend a dick pic to ya chick, no filter\nToo much swag, I could sell a house to a realtor\nRealtor\nReal talk\nI'm on my real ting shit\nA king of oneself, on my clothes, in my mink set\nMy mindset\nBad white girl and a fine set of twins on her chest and her kids\n745 Benz, left her old man\nSimply, cause I put that endi in Fendi\nAll by my lonesome, I'm lookin' for an Olsen\nTwin, there I go again\nSlow-mo approachin' a Benz\nWindow rolls, and the smoke billows from the ocean wind\nMakin' a (?)\n\n[Chorus]\nNigga, let that snub nose sneeze like achoo!\nHe can make that snub nose sneeze like achoo!\nI can make the snub nose sneeze like achoo!\nI could make the snub nose sneeze like achoo!\nYoung nigga blessin, blessin, blessin, blessin\nNigga, let that snub nose sneeze like achoo!\nYou can let that snub nose sneeze like achoo!\n\n[Verse 2]\nAlright, y'all would keep it cool if you knew the shit that I knew\nI know, but you ain't gon' listen for your survival\nYou just a cool guy, accompanied by a fly hoe\nWho just a fly hoe, she'll fly away on bottles\nCouple nights in Cabo, bottles, come swallow\nShe with another man on that same shit tomorrow\nYou with another chick, she flew you in from Chicago\nShe wanna be where you go, where I go\nI'm J.I.D Leonardo\nDiCaprio, put a cap in yo soul in an arrow\nMo' 4, 5-0\nWoah, woah, drive slow\nThat's only cause nobody's on top of us\nWe know they watchin' us, bifocal binoculars\nOn clock and they clockin' us\nSkin black so they lock us up\nFuckin' debauchery\nI wrote this, on Absolut and obsolete\nBlunt full of Socrates\nModern-day me\nThe comparisons is cool, but it stops at the door\nNigga, locks and the Glocks and the dogs\nTake off yo shoes and yo cool\nMatter fact, don't move, just join the movement\nThe Spill-Vill revo-fuckin-lution\n\n[Chorus]\nNigga, let that snub nose sneeze like achoo!\nHe can make that snub nose sneeze like achoo!\nI can make the snub nose sneeze like achoo!\nI could make the snub nose sneeze like achoo!\nYoung nigga blessin, blessin, blessin, blessin\nNigga, let that snub nose sneeze like achoo!\nYou can let that snub nose sneeze like achoo!\n\n[Outro]\nThe Spill-Vill revo-fuckin-lution", "Lyrics from Snippet\n\n[Chorus: JID]\nI shot the sheriff\nKilled the deputy, spared the reverend\nSmack your parents, split the marriage\nSlash the niggas, he with the sheriff\nI'm with the four-fifth, the pistol carriage\nI give you the click-click, I look in the barrel\nI give you the click-click, I look in the barrel\nI point it right at you, I point it right at you\n\n[Verse: JID]\nBack up, that's a warning shot\nNext niggas gettin' domed and dropped\nAnd niggas beefin' on their phone and plottin'\nAnd I can see you really love hip-hop\nWell I can make you meet Biggie and Pac\nTell 'em how the game miss 'em a lot\nSo if you thinkin' it's an issue, it's not\nPeople entitled to opinions they got\nYou're a product of the friends you got\nSo if you're poppin' shit then your friend get shot\nAt the eight or nine or ten o'clock\nBut when it pop in his top and he drop, let it rock\nI been on the fuckin' star track like Spock\nGlock clocked on the block, workin' on my chakra\nIt's been the same since a runny nose with the snot\nAnd my niggas run into your home with the choppa\nGimme what you got, do you really want the problem?\nTryna make a milli off the rock, but them cracks in the chicken\nNigga, pot, watch it, nigga, watch\nNiggas on the block spit bones in the pocket\nLil partner was poppin', finna hit him with the rocket\nYeah, your main bitch was prolly tryna top me\n'Cause I'm handsome, I'm fly, and a fungi like shiitake\nNigga, you really jockin' tryna Andy Milo-knock me\nI'ma rock it, hell nah, pulled up on the [?]\nMy nigga told me, [?]\n\n[Chorus: JID]\nI shot the sheriff\nKilled the deputy, spared the reverend\nSmack your parents, split the marriage\nSnatch the necklace, he went to Jared's\nI'm with the four-fifth, the pistol carriage\nI give you the click-click, I look in the barrel\nI give you the click-click, I look in the barrel\nI point it right at you, I point it right at you\n\n[Verse: Erick the Architect]\nMoney be the motivation\nThis the kinda of payment that forever be indebted to you\nSend you to the medical\nWas reachin' the pistol on the pedestal, the metal\nGot a blicky on the end, gotta win with the JID\nDug with the jugg, dug with the crooks\nHeard he loose with the jar but I love the way it looks\nMy mind's in the matrix, underground\nBut my mind talks in the basement\nWay I got my patience up, I'ma keep the kid close\nNot about the insults, boutta throw my dawg\nThank those for the info\nYou should see the ten, bro the tens on\nRun the gang, with the purple rain like the Prince song\nFinicky, niggas change waves for the industry\nListen to me tellin' on the way for the enemy\nOn the way, did you see the wave? And it's killin' you\nPull up the anchor for the day that we sent it to you\nIncinerate the main ones, the flame on\nGot the prophet in my pocket, not obliged to the process\nSo how they poppin'? I got some options\nMy optic start a mosh pit up in the projects\nApostles, like the top two, hit the volume\nI'm all black, now record that, not a costume\nZombies, the real ain't vomit, while you require it\nRemind me, just run it by me, them niggas grimy\n\n[Chorus: JID]\nI shot the sheriff\nKilled the deputy, spared the reverend\nSmack your parents, split the marriage\nSnatch the necklace, he went to Jared's\nI'm with the four-fifth, the pistol carriage\nI give you the click-click, I look in the barrel\nI give you the click-click, I look in the barrel\nI point it right at you, I point it right at you", "[Intro: Doctur Dot]\nNiggas ask me how I'm living, I tell ’em to ask my ancestors\n\n[Chorus: Doctur Dot]\nIntroduce that man, left lane lining\nDead brain shawty\nSpirits bounce they head at the back of the party\nLeft lane lining\nDead brain shawty\nSpirits bounce they heads in the back of the party\n\n[Verse 1: Doctur Dot]\nOkay, my man you still boulevard, I avenue, zone who?\nI'm off the southern coast of France reading Sun Tzu\nOcean views, paper in the morning with my orange juice\nSpit that nasty language to her she becoming foreign too\nI solo, I need a mil' to hold ’em up like like some pyramid doors and i mean seriously -\nHold up, hold up, bruh\nPussy started drippin' like a mango when I bit it\nAnd I got that hammer times a hunnid whoever you been with\n\n[Interlude]\nPurple paradise baby, take the panties off that grape soda and put your face in those [?]\nThe face of God is seen clearly, better keep your distance\nSet your expectations\n\n[Verse 2: Johnny Venus]\nMy DNA contains some strains of everything\nEverybody's fingerprints, all the blood is in my veins\nI could beat you running backwards ain't nobody in my lane\nI'ma keep keepin' on 'till the beacon shone\nFrench glass dope [?]\n[?]\nTappin' on the pussy I’ma bash it in\nAnd get some practice in\nUh I’m Uh fearless, rockin' some weird shit I ain’t famous enough to wear yet, It's duly noted\nThen I started with a problem, then I turned it to an opportunity\nLook at me when I'm talking to you, son, please\nYou don't like me when I’m silent you gon' hate me when I speak so it's best you keep your distance and investigate your seat\nLearn to take advantage of my circle stances\nToday you're standing, tomorrow vanished\n\n[Verse 3: Stillz]\nBig [?], big pockets, big bank, bent wallets\nBeen had it, you just got it, Henny mixed with my hypnotic\n6'4, hydraulics, you pussy niggas want no problems\nNo gold teeth just gold Pradas\nWe drive phantom, ghost riders\nGhost riders, we drive phantom, ghost riders\nLean back and they profile us, cut the cheque they wan' co-sign us\nSo fly we need co-pilots, not freestylin' I'm co-stylin'\nThis hard work meets mo' talent\nWe the best nigga, no Khaled\nGift-wrapped, my flow should come gift-wrapped\nNo roadblocks, no setbacks, my moral cleared, my meds had\nThat OG be my jetpack, my wrist cost about ten stacks, she looks good but her friends wack\nAll black and them rims match\nHomicide I kill tracks, bet you bitches gon' feel that\nIt's so real she relax and she realise this real's back\nNigga, pressy\n\n[Interlude]\nPurple paradise baby\nPurple paradise baby\nPurple paradise baby\n\n[Verse 4: J.I.D]\nMy dick so polite it stand up and let lil shawty have a seat, a-sit down leave the workin' to me\nI fulfil her needs and leave when I am ready, but pay me my couple G's, dope dick delivery incorporated\nYou see, that's a side-job I been up on my crime mob, fly boy pouring Sean Don on a bitch, huh pause\nAnd listen to these niggas best I kill 'em with some side bars\nBesides, y'all know I been kickin' shit inside your iPods\nTakin' food off they plate, they losin' weight, niggas checkin' they thyroids, examination, on this shaky slate\nI just got my style on, poker face, Kobe face\nAfter this shot is shot, in your face, pick your lip up\nThen-then-then I tell the squad to pick a brick up I don't get my hands dirty I quit that at 12:30\nI can give you my man number who serve all the birds, he just keep the 45 but he worth the customer's service\nMy paradise is purple", "[Intro: J.I.D & Chiiirp]\nSystem overload (Overload system)\nWatch the throne (You'll get overthrown)\nAt the bar drunk (Overthrown)\nUnder the influence (In the overcoat)\nRoll up that kill (I'm tryna oversmoke)\nWord to Mr. Willie Nelson (Now tell me what's a weed head overdose)\nI'll wait (Let me know)\nI got the flow (But I want all of the boatload)\nSo let me go\n\n[Verse 1: J.I.D]\nI told niggas, I ain't no rookie\nI ain't no punk bitch and I ain't no pussy\nI know pussy like a gyno\nYou are what you eat, treat the pussy like a gyro\nDuckin' duckin' shots, duckin' cops, like the 5-0\nSwerve on the beltway I drive with a blindfold\nI unfold truth, palm reader just spittled\nEyes low, nigga tote a smith like Milo\nNiggas act pussy, I thought you niggas was guys though\nAbsent dad, they need guidance, I spilt like a broke fire hydrant\n\"How you's a bitch?\" My bitch shout when she spot 'em\nShawty a miss but there there she's a rider\nRidin' through the city with my nigga right beside me\nAnd my bitch that I just scooped from pilates\nThe same one that popped at ol' boy, who shot ya?\nSeemed kinda monotonous ol' boy, yo' posse\nStart resemblin' pasta, pussy ass kids\nMake me sick like shrimp, crab and lobster\nLife is a film needin' a dope porn oscar\nDick chopper, blocka blocka\nYoung niggas hop off the block and fuck the block up\nJust to get locked up and seen by the balls they got\n'Cus by the bar and the law they talk\nIt's already and to owe a nigga menage a trois\nI look up to the sky and thank God I are\nA reflection of himself set inside my flaws\nSet aside my sins, set aside my love\nSilly bitch get inside my car\n[?] bitch\nGotta go bitch\nB-b-bitch\nJ.I.D bitch, uh\n\n[Verse 2: J.I.D]\nAll black on at my wedding, bucket ass naked at my funeral\nCan't 9 to 5 in no lil' ass cubicles\nBoss yellin' at me, say it's weed in my cuticles\nPut it on the scale, the rap shit lookin' beautiful\nStretch my palms into the atmosphere, I fear nothing\nI hear I hear nothing, fuck a tear for buckets\nWarren Buffett, buffet rap, dinner for lunches\nDelightful, y'all seem spiteful\nI too used to be a little bit like you\nNah who I'm lyin' to, if I was ever like you\nI would need some pills, a knife, prob'ly a rifle\nSomethin' I could die to\nAnyways, they shine, I wan' shine too\nLet the diamonds blind you\nWhile the blood of the child who mined- never mind\nI'm diggin' through your mind, do you mind? Whatever's fine\nYou very fine and I can't pay you no never mind\nLight skin girl transform to decepticon\nI'm tryna catch mine like megatron\nBut she don't hear me on the megaphone jack\nThis make a uhh hella bomb\n\n[Outro: Marian Mereba]\nInside\nYou're all in a twisted mind\nOther bright then go misfit ride\nOn your feet when you hear the sound\nInside\nThe diamond of mind of mine\nWhat a find\nThere are no ordinary thoughts\nIn an extraordinary mind\nMind\nAre no ordinary thoughts\nIn an extraordinary mind", "[Verse]\nI told you fuck niggas proceed with precaution\nEverybody in here's a target\nEven your girlfriend, watch me aim with my sausage\nUnload the clip then reload the monster\nInhale the ganja, wack emcees get to the back\nThey tried to step to the mack, and they got jacked\nRolling through the east looking for the man with the pack\nNot Pac-man, the damn cornerback, fucking goofies\nKinda sorta, finna Kama Sutra with your boo-ski\nOnly if its Tuesday, she might be in love, only in the movies\nShe only prolly want me cause of the diamonds and the rubies\nOverseas in the jacuzzi, eating pussy, I fucked her, what a doozy\nI tell the coach put a nigga in, let me spin like I'm Poopie\n\n[Bridge]\nMiles Davis\nI'll play the drum to your heart, even the bongo\nHit the bong slow, now I'm Dumbo\nA hit is what you want, no\nA hit is what you don't know\nIt's hitting what you\n\n[Outro]\nYo, dikky di dikki di dikky da\nYo, I tell you the rest on the day that we die\nYo, dikky di dikky di dikky dikkity da\nAnd I'll tell you the rest on the day that we die", "Lyrics from Snippet\n\n[Intro]\nLook (Mmm), look, okay\n\n[Verse]\nPush the fuckin' pack off of the porch or break a pound down\nGet the strap, if it happen to blow, it makes surround sounds\nMakin' house rounds, throwin' hands like Antwerp argles\nThrew a roundhouse, kick her jaw loose (Thank you)\nWhere my dawgs? \"Roof\"\nWe bite, no bark, shit\nWe ain't arguin', we don't talk to him, but let me talk to him\nShit, his homie died, we could part to him\nSorry, guys, I'm in a dark mood like a horror movie\nAnd I know the ending like I saw the movie\nRap game, shark harpooning (Thank you)\nNiggas ain't...", "[Verse]\nI'm with a bunch of stupid niggas, did I stutter?\nI don't speak before I think so I means every letter\nLil' rat nigga was hiding in the gutter\nCouldn't find where he was at so we fucked up his brother\nSomeone must suffer for somethin' dumb\nThis summer the sun bring out buns, the guns ring out funds\nThe feds, the fuzz, shooting up the fucking club\nA bunch a young niggas, shit\nSo to be or not to be a nigga?\nTry to rise above the fuck shit\nI don't know cause they could pull up at my door\nTalk coals and can't call it dog holes\nI don't show hands, Lohan's held\nMy land see more bands, my prayers answered\nIdle time is the place the devil dance at dark-night\nFuck a Batman I'm Gatman but robbin' on sight\nFor your sack you could get sacrificed\nBut that's some bad advice\nSkrap it tight into your seat and take a trip with J.I.D\nBetter get yo ass up off yo ass\nTold yo ass \"It's time to eat!\"\nClean the bag and pack the bags, roll the weed\nTake a shot cause I can't drink, because I'm driving\nTrippin' through my mind\nHad some time to think about the time\nBlurred vision couldn't see the sign and beneath the lies\nAnd from my youth I've seen the truth will come and demonize\nRealize that everybody blind but tryna lead the blind\nEyes on God gathering minds til' we redefine\nReminded refine wood plottin' formaldehyde\nGentrifying my hood, my juug tryna galvanize, good!\nMy mama got this shit up out the mud\nMy sister had the baby with the plug\nMy pops was in the 80's off the drugs with a .38 slug\nMaybe yo daddy push the pack and had the strap in yo hood\nMy family black as fuck and black is love\nI've been faded back to black it ain't no good for me\nBut better than it could be, I'm stupid as fuck\nBut all my niggas stupider\nMy shooter could pull out a Ruger for your arugula\nIrregular triggering thoughts\nOut the blue, red lights on, flickering off\nCheck the mirror and move! Gun shots just a spiritual tune\nOn some nights niggas bored they ain't got nothin' to do\nNo opportunity community centers for after school, you can cool at\nFuck it they goonin', grab a tool my nigga move that\nFuck is you doin' let him cook it on the spoon, now he spoon-fed\nDope fiends howling at the moon from balloon bags", "[Verse 1: L.E.]\nAs I looked at my watch and try to gather my thoughts\nThat was locked in a box, outside, the reflect of the clock\nThat was on my wall, aw dog, you been thinkin' a lot\nDrinkin’ a lot of the lean and smokin' the pot\nHeather swallowed my dick and called it her black cock\nAnd said that she'll be back so don’t tax for the crack rock\nAnd I'm like, \"you could bet not,\" better get you some snapshots\nIn your mind of some type 'cause I'm a stand up type of guy\nYou'll be surprised what these bitches'll do\nKeep my blunts rolled, pronto, even give me they soul\nIf you don't know then I know what you didn't befo’\nAre you convinced that I’m the prince that told that y'ain’t know?\nSorry, didn't mean to fool ya, but yeah I'm the manure\nCan I get a Hallelujah? Baby it's Michael Jr\nSorry, didn’t mean to fool ya, but baby I'm the manure\nCan I get a Hallelujah? 'Cause bitch it's Michael Jr\n\n[Chorus: J.I.D]\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la\nI wrote this shit when I ain't have a dollar mane\n\n[Verse 2: J.I.D]\nYeah, I seen your face real big on the poster\nWalled you out, now it serves as a coaster\nLive mixtape, download it to a folder\nPlay it, delete it, shit was slowin' up my modem\nHope you quick enough to dodge the shots niggas throwin'\nHead, shoulders, arm, back, stomach, scrotum\nOh, but we ain't done yet, we bustin' 'til the sunset\nLet's get a little deeper, we ain't even havin' fun yet\nL.E. said I'm humble as fuck and I could stunt\nBe loud, smellin' myself, shit, I'll leave it to my blunt\nOnce I'm done with this flow, I'll leave it to a dust\nLet 'em fuck it up, cocaine your nose with a uppercut\nFuck is up? Feelin' so anti-sober\nIn NY looking for leaf like a clover\n[?] pronto [?] what you wan' do\nDo what your mind can't do, finna go on the run though, holla\n\n[Chorus: J.I.D]\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la dang dang\nI wrote this shit when I ain't have a dollar mane\nWa da la dang\nWa da la\nI wrote this shit when I ain't have a dollar mane\n\n[Verse 3: Hollywood JB]\nBang, bang, whoever thought you'd find\nA iller group of niggas who was rollin' in the same gang\nBeen goin' balls to the walls, now it's time to let my nuts hang\nAnd I'm still hustling, niggas still tryin' to jock the slang\nAnd they bitch is lookin' for a cock to swing on\nGo up and down, get they stock exchange on\nThe ride get rough so hang on, and I just do me\nAnd I'm so Lati' I could fuck around and get my sang on\nAh Ahem, like\nU-N-I-T-Y, and we all equal but if you and I was ever tied\nThen I prob'ly wasn't doin' somethin' right\nLike when I piss and hiccup at the same time\nAnd then I hit your chick up like, \"What you doin' tonight?\"\nAnd then she send me pictures of that ass, so that ass in disguise\nYou know she doin' the plank on the vine\nWhere you plank on the wood while the guy's in recline\nI think it's called the ride to the sky\nI ain't really sure, I just heard it was tight\nDamn, what's with the evil eye?\nI'm chill, no I'm not a evil guy\nNot a fan of lettin' all that bullshit fly y'all jump on\nI just like to lead, want to follow? Then come on\nY'all chose the same path, I found another to run on\nAnd when I get on top I got a lot of niggas to stunt on", "[Intro]\n(Grade A, Grade A, Grade A)\nTake a bitch shoulder\nFinna introduce y'all to Lil Reuben\nAKA Mr. G6, G Swig, me swig\nTalk to ’em bro\n\n[Verse 1]\nNigga, I'm clean as in detergent\nStunting on purpose\nThrow out on some cocky shit, nigga I'm perfect\nPussy, you peep it, the red, black, green shit\nMarc Jacob glasses ’cause I'm e-classic\n(This is a Tay James exclusive)\nFly so classic, pocket full of plastic\nGetting active with a actress who loves shagging\nMagnums, baggage, Louis, ooh\nHe fruity, stupid\nJury on, taking pictures with a groupie\nI move smoothly into the club like what the fuck up\nBars getting bought by me and I'm bout to roll up\nSo what's the hold up?\nAnd there ain't enough liquor in this club\nFor me to intoxicate a female\nYou gotta give it up\nTell her tricks alive, so she believe\nJust enough to do exactly what I say\nWhen I'm about to catch my nut\nBut my money on, my money is extra on\nAnd if you ain't getting paper, this is not where you belong\nThe life I'm living, rockstar bitch (Fly rockstar bitch)\nCarseat and hash ’cause I sparked up\nRetarded stacks, I’m heat balling\nDisplay in the clutch, I'm Chris Paul-ing (Bake)\n’Cause he balling and everybody know it\nIt's lit in the club, plus everybody smoking\nEverybody drinking, psyched out, choking\nMoney in my pocket and everybody knows it\nSo what's frozen, the neck or the G Shock\nThe kush green diamonds, the necklace is on detox\nShawtie look bad, maybe I could hit her g-spot\nHer man look lame, a bugle boy, he's the Rebox\n3 shots down the drain and I’m rolling\nWhere the fucking waitress at, with my potion?\n'Cause this potent, mixed with this potion\nCould have a nigga dazed for days and I ain't joking\nIf it ain't the purple haze or blaze, they ain't smoking\nI don't do the mid by kid, I hate choking\nFocus, back to me, myself, I\nLittle room, dressing room, the kid remains fly\nI'm doing my thing, I am truly insane\nTry to play me in vain, I'm removing your brain (Haha)\n\n[Interlude 1]\nYou gotta go man\nFor real bro, go in bro\nAlright\nGo in bro, show 'em what time it is\nChill, chill\n\n[Verse 2]\nI got the respect from the hood, the hood from respect\nThat's why whenever they make a move I be at they neck\nI feel so analystic, statistics analyzed\nThat's why my percentages come correct when baking pies\nMaking it, take it live\nI fuck a bitch, kill a guy\nNigga just give me the bird and the boss is taking mine\nBut slut, I'm on my grind like sex work\nThat's why she hang off my every word like tax work\nCall me Mr. Mister, fucked her with her sister\nTell the boy to roll the gun and go buy my elixir\nDranking little sips, that's why I got temper\nProblems, I'll probably murk them as soon as they enter\nA hot-boy, hot-boy, but colder than the winter\nWood grain, hood lane, touch it get a splinter\nI am just a winner, an easy bullet lender\nYou can have it, you can have it, nigga go hit her\n\n[Interlude 2]\nGrade A, gangster\nThese niggas starvin' now\nMurder everything now\nThat's lil' roof\nIt's lil' somethin', you feel me? I'm out here\nSo I'm bouta go, I'ma talk about bitches\nWhat I tell a bitch?\nGo bruh, lay it on\nNigga, shit\n\n[Verse 3]\nMight shed the amor, this door awaits\nWaits to see how many whores this floor can take\nFate is victim to take place in times erased\nTaste is remember to spread the love all over your face, face\nI come from flyness, I'm fly as a pilot\nNo style, style just comes to me\n'Cause if the shirt match the shoes\nAnd the shoes match everything I got on\nThen bitches, they just come do me\nAnd I'm back up on the track like your ass right?\nYou niggas think you could have the fucking last laugh (Nah)\nI'm in the black jack, blood cock, black ass\nShoot him in the head and now the nigga dead\nBlack bag\n\n[Outro]\n(Grade A, grade A, grade A)\nThat's all I gotta say\nLike I told them bruh\nIt's the monster, aka Mr. fancy swag\nThis man right here and I am KC\nThese are your soldiers\nWe take it here, we don't lie\nWe got him, we got him\nAnd my lil' bruh, he tearing this shit apart\nLil, lil boy, lil' boy\nFuck niggas taking over the station\nWow\nAnd we the flyest niggas doing this shit, man\nSee over here, see them, them\nHey, like I said\nThis man, JID, goddamn, we boys around\nCrush all you fuck niggas, fuck nigga\nFuck with us, fuck nigga\nI'll say anything, check the chain\nCheck the wrist, check the feet\nGoddamn\nHey what it do, it's your man Rosco\nNow, you're tuning into the sound of DJ James, man", "[Intro]\n\n[Verse 1]\nI'm hella inconsistent when it come to some bitches this A.K.A fuck me over I'ma fuck some of her sisters\nAnd this shit's already twisted 'cause I fucked some of her sisters, I opened it up, dicked in, and I stretched it like a gymnast\nShe said she wanted to end it 'cause she wants us to have friendship, she said that via text and that's hell of a way to end shit\nAnd then I felt silly 'cause I let Siri read it to me\nIt's a bad feeling inside my tummy put some loud to it\nExpress my pain through my music, let the crowd do it\nThey all like my style because I'm wild foolish\nI hit a bitch with a smile and tell her I'll do the honours of being your bone jumper\nUgga ugga, a caveman descended of slave damn, who used to grow that weed in the cotton fields nigga amen\nBrought my grandparents greats used to wake and bake, so for them, I'ma take a [?] to the face\nYou scrape, You scrape\n\n[Interlude]\nYo, what's good?\nOh so now you wanna answer the phone? Where the fuck have you been in?\nI've been waiting on yo' ass, where have you been?\nDon't even answer that 'cause I don't want a goddamn answer I'm over this shit now\nI was waiting on yo' ass last night, in the house, in the bed [?]\nFuck that, and fuck you, and fuck everything you're about, you ain't ever gonna be shit, you ain't shit 'till the day you die nigga your momma ain't shit, your daddy ain't shit, your uncle ain't shit your auntie ain't shit, your whole family ain't shit\n\n\n[Verse 2]\nUh\nTypical night, invisible white, my visions entice my delights [?] the fucking lights\nAnd salt's getting thrown like rice after the invite\nSo the join of two beams you ain't feeling what I'm seeing so I'm leaving\nAnd I won't leave with no fucking demons, so I'ma place all my sins on the damn table, in front of God and whoever able to see the fables I created\nLies, imagination, and hatred\nDeath to making love, without really actually love making, faking it just to get you naked, flexin' and flakin'\nI'm a filthy nigga face it, but not just too complex to fuck with someone basic, That's a overstatement", "[Skit]\nEvil\nEvil\nEvil\nBaby, evil\n(What'd you say)\nBaby! (Huh?)\nEvil (I can't hear you)\nBaby, baby, Route you know you hear me talkin' to you\nBaby (Heyyy, damn)", "[Chorus: Ari Lennox]\n[?]\nI'm standin' here callin' your name\n[?]\nYou stay treatin' me the same\n[?]\nI'm goin' out of the way\n[?], you stay\n\n[Post-Chorus: JID]\nOkay I'm losin' my brain when I be fuckin' with you\nYou want me to stay but you don't act like you do\nAs soon I walk away you start to act like a fool\nNow tell me, what should I do?\nNow tell me, what should I do?\n\n[Verse 1: JID]\nWoah, I been doin' what I have to do\nI was never really mad at you\nWe should focus on the factuals\nActually this shit was magical\nActually I'm pretty mad at you\nNow that I think I got the attitude\nY'all been goin' down crazy roads\nMake a right at truth avenue\nPass passion, go down a few\nThis is madness you passed it\nYou glad 'cause you passed it\nRun of the gas and you had me\nShawty we lost now, where are we?\nTell a nigga not to worry\nDrivin' this like a Ferrari\nWhy you in such a hurry?\nCould it be you are hurting, so you find the pieces tryna hurt me?\nLord have mercy in emergency\nIt's gon' take for me to [?]\nJust so we can see it, take a breather\nHate the feeling, feeling so defeated\nSay you wanna change but don't believe it\n[?]\n\n\n[Chorus: Ari Lennox]\n[?]\nI'm standin' here callin' your name\n[?]\nYou stay treatin' me the same\n[?]\nI'm goin' out of the way\n[?], you stay", "[Part I]\n\n[Verse 1: J.I.D]\nI know y'all thought it would be a minute before I got back at you\nPara Tu's a classic, and I knew that\nBut y'all got me confused with the new cats\nAnd the third member of that group with the other two cool cats\nAnd that's cool, 'cause I knew that\nBut who thought I was coming with them cool raps\nYou should be boom-bapped in two slaps\nI just light the flame, I'm J.I.D, I'm a new match\nWild and untamed, and I do the same to your boo, snatch\nI'm in it like I'm Smith, Emmitt\nLil' Venice need money\nI'm Trumping out the apprentice\nTell the judge, \"Fuck a life sentence\"\nIf I die, my casket should have a mic in it\nDoing my drugs like I'm Hendrix\nI'm Jimi, grabbing my Jimmy\nWho am I offending\nFuck a prosecutor, judge, come yell the defendant\nWhole court fucked up so I ain't fuckin' with it\nSo fuck it, I'm spilling like what's good pimpin'\nHeard niggas throwing shots, I'll flick it\nThat's a big bill for a midget\nBut to a big deal, that shit smaller than a chicklet\nBack to the digits, I ain't got enough time to sit and wait\nI got too much on my plate, too much to say\nSo that Para Tu 2's on the way\nMy partner came with the pair of new-news in the J\nMaybe six or like seven, I don't know, it was an eighth\nAnd some Hen with the chaser, but that was for the ladies\nNow what the fuck I'm saying, I'm a fuckin' lightweight\nTakin' shots like, \"Wait, wait, wait\"\nI'm good now, then I take a 40 to the face\nYou singin' 40s to next like Reed Dollaz\nHim pop on them rappers like Matt Hoffman\nNo problem, I done shot him, got a shotta, next they like\nGuadalajara, Guatemala, Idaho, I don't know\nJust somewhere to get me away if the feds on my chase\n'Cause I sprayed it\nI pray it never happen, But if occasion turn to fate\nI'm punching niggas in the face, straight up\nSo follow the fuckin' leader, I'm kickin' my fuckin' feet up\nLookin' for competition outside of E-G, Mereba\nAnd you see who on the feature\nThen you featured in the bleachers\nAnd I'm still fuckin' teachin'\nAnd I'm still waitin' on that shit from Money Makin' Nique\nHe told you niggas you shouldn't sleep, I agree so\nEvery fuckin' rapper or record, I'ma eat, no feast\nYou niggas can join me so that's word to the Lion King\nI'm on to some giant tings\nI'm slaying Goliath, David, Goliath, them giant tings\nConsultin' with Mayans, them niggas high in they lion things\nThis J.I.D, baby, and the \"I\" is for \"I\" in team\nSpillage Village, killin'\n\n[Interlude: Sy Ari da Kid]\nDoc, this Sy Ari\nThis why they call me the best, B\nYeah\n\n[Verse 2: Sy Ari da Kid]\nWelcome to genocide\nAnd then aside, it's J.I.D and Sy\nDon't live a lie, just live alive\nIt's riverside, fool\nMemorize then put the pen aside\nThe remedy to your enemy\nI'm a friendly guy, who\nThese niggas is not your brother\nThey'll leave a nigga scarred like Mufasa brother\nYou got to love her\nNigga, that's from the block unguttered\nWatch your mother, she purchasing a box of rubbers\nI'm taking after her favorites\nI'll leave my number on a old pic\nThen erase it after she save it\nI'm chasin' after the latest at my earliest convenience\nAbe(?) vs. Cole(?), surely it's anemic\nGot a girlie up in Phoenix\nGarglin' my sons\nCouple hunnid like some Instagrams\nShe modelin' for fun\nPut the hollows in the gun\nShoot for the stars, biatch\nShe ain't even know it, Amber gave me the Reeboks, yeah\n[?], you was tripping, you assisted in them hoes\nCool it now, new edition (Woo)\nYeah, I'm sexist, talkin' so rude to bitches\nTellin' hoes, \"No, you can't watch the game with me, do the dishes\"\nWho the richest, well, let the broke niggas tell it\nYoung nigga moves make the old niggas jealous\nYou won't get the message if your nose didn't smell it\nSniff, sniff, sniff, yeah, don't, Cinderalla, don't choke\nNiggas better go [?] for whatever\nThose olks didn't measure, oh no, this shit never was me\nWho knew my favorite letter was G\nWho knew I'd take 'em back to the city like Metta World Peace\nLet's cease, Sy Ari, yerr, ho, no bum sauce\n\n[Part II]\n\n[Interlude: Harry Belafonte]\nPeople count on people who can only count to one\nGenuine imitation life\n\n[Verse: Doctur Dot]\nStupid revolution every [?] music\nKeep my finger on the trigger, keep the temper for my niggas\nHoppin' out of the mosquito like the coldest winter\nInterior dashiki on the flows and fixers\nY'all niggas must've missed it\nSee, you gon' have to get our 1-2-6-9\nAll of them senses, check into remissions\nDodgin' niggas like it's washing liquid floatin' in the park\nPeaceful as a treaty with the sun and a thousand other stars\nGot hand on the bum, other hand on the heart\nLeaves [?] as we layin' in the night\nYour pussy [?] up, she discussing human cycles\nSteppin' at the same [?]\nLeaves in my hair now, she's in my hair now\nRidin' like two trains destined for the stare down\nTook me ten minutes just to get here\nTake my time walkin' down the stairs now", "[Refrain: JID]\nRemember they always told me you would lie to me\nI could have anything that I want\n'Cause I'm a little weak when it come to you\nSit down, lay on my shoulder, you can cry to me\nYou could have anything that you want\n'Cause I'm a little weak when it come to you\n[?] what the beat say\n\n[Chorus: JID]\nI'll probably never change the way I feel about you\nThe feelings that I have, they'll probably never change\nI just ignore the things that they be saying 'bout you\nThen make the one without you really feel a way\nIt's crazy how you make the people feel around you\nYou make 'em think it's power runnin' they veins\nI know a couple niggas that will kill about you\nThere was time I probably woulda did the same\n\n[Verse 1: JID]\nEven before I met you, already knew you was evil\nCrazy because you had a thing, you would do to the people\nI was barely a [?] begin to build ideas and thoughts\nStart bearing my crosses\nMy path is often, misguided\nWhen I listen or look into your eyes, I either get lost in it or see somethin' disheartening\nHeart livin' on my sleeve, it's harder to breathe\nWithout you but with you I bleed\nFollowed by screens, followed by demons\nI've tried to run but it's not about speed\nIt's not about you, it's all about me\nAll of my dreams in total freefall or fittin' in the breeze\nBecause I'm freeballin' in some basketball shorts, wait\nSee you here now, but tell me are you here to stay?\nYou never showed your face 'round here initially\nSun down, they on the prowl just to get the taste\nGun 'round, don't get gunned down\n\n[Chorus: JID]\nI'll probably never change the way I feel about you\nThe feelings that I have, they'll probably never change\nI just ignore the things that they be saying 'bout you\nThen make the one without you really feel a way\nIt's crazy how you make the people feel around you\nYou make 'em think it's power runnin' they veins\nI know a couple niggas that will kill about you\nThere was time I probably woulda did the same\n\n[Verse 2: Bas]\nWell not for me\nLife is cheap, I been sellin' for a quarter p\nI can't speak on it, on recordin' 'cause authority\nWant the D, [?] can't afford the B word\nI'm in Dover street shoppin', guess I landed feet first\nSwitch up my [?]\nMix match my Gucci with the Kenzo\nIt all depend who you depend on\nI ain't lettin' me down, slow the beat down, hit my tempo\nRun up on me, catch a beatdown\nShawty want a nigga beat down on it, I'ma need tongue first\nSaid she want a lil' relief, I got her swimmin' like it's Dunkerque\nWith no regard, I'm no life guard\nTake a bust on your balloons, but I'm realer when I puncture\nDon't you die on the job, I know life's hard\nBut it's lethal when they leave you\nCan appeal like Ezekiel\nWhen I peel back on your speak, I see [?] and a snake\nWord couldn't hide the stench\nHer, better find a bench\nBas life until the bank now, I'm back now\n\n[Refrain: JID]\nRemember they always told me you would lie to me\nI could have anything that I want\n'Cause I'm a little weak when it come to you\nSit down, lay on my shoulder, you can cry to me\nYou could have anything that you want\n'Cause I'm a little weak when it come to you\n[?] what the beat say\n\n[Chorus: JID]\nI'll probably never change the way I feel about you\nThe feelings there, they'll probably never change\nI just ignore the things that they be saying 'bout you\nThen make the one without you really feel a way\nIt's crazy how you make the people feel around you\nYou make 'em think it's power runnin' they veins\nI know a couple niggas that will kill about you\nThere was time I probably woulda did the same\n[?] what the beat say\n\n[Verse 3]\nHoney fuckin' up the...", "[Intro]\nAh\nChewy\nLook\n\n[Verse]\nAlright its been time for war we got to get to it pronto\nI hear the bongos in the Jungle\nThey let that horn blow\nHungry like biombo from the Congo\nThat thing \"PLATT\" like mutambo from the console\nYou know the boy's brought the drumsticks for the drumroll\nBra-brum-brum-pum the gifts come to your front door\nFuck that chimney dumping\nThat .40 viv intill its empathy no sympathy\nQuite whining whimpering\nFucking simpletons\nI walked through the valley of shadows\nEscaped out of the gallows\nBlood streams and puddles remain shallow as howling Gwen poutro\nSmoking on indo\nSmell like out though\nMan I gotta find a better plug in the south\nI've been sleeping on this couch\nI was up when niggas sleeping screaming \"Demons won't get out!\"\nPlease leave when I play\nAll your records be faeces\nWave that febreeze\nBET trying to get of this EBT\nBBC rocket\nMy niggas clocking\nYou see we see\nWe peep you sleep and we creep\nLeave 'em leakin' so easily\nP-90 four fivey one shawty one thotty\nWe outtie on niggas heads who be on instagram countin' his bread\nYeah you heard what he said\nI'm on a paper route\nQuick to take a neighbor out\n.40 with the laser weight\nFor you meet your maker wipe that makeup of your face and mouth\nYour circle been real out of shape\nJust take a look around", "[Chorus: JID]\nI shot the sherrif\nKilled the deputy\nSpared the reverend\nSmack your parents\nSplit the marraige\nSnatch the necklace, [?]\n[?]\n[?]\nI give it a click-click\nI look in the barrel\nI give it a click-click\nI look in the barrel\nI'm pointin' it at you\nI'm pointin' it at you\nI'm finna-\n\n[Verse 1: JID]\nBack up, that's a warning shot, next nigga gettin' domed and dropped\nAnd niggas beefin' on they phone and plottin'\nAnd I can see you really love hip-hop, well I can make you meet Biggie and 'Pac\nTell 'em how the game miss 'em a lot, so if you thinkin' its a issue it's not, people entitled to opinions they got\nYou probably good as friend as you got, so if you poppin' shit and your friend get shot at the-\nAge of 9 at 10 o'clock, but when he pop, at his top, and he drop, let it rock\nI been on a fuckin' star trek like Spock\nGlock cocked on the block workin' on my shot\nBeen the same since a runny nose with the snot\nThen my nigga run into your home with a choppa like \"gimme what you got do you really want the problem?\", tryna make a milli off the rock\n[?]\nWatch a nigga watch, niggas on the block fake phones in the pocket\nLil partner was poppin' finna hit him with the rocket\nThen your main chick tryna take me, probably 'cause I'm handsome, fly, and a fun guy like Shiitake\nNigga you really jockin' tryna Andy Milo-knock me off my rocker hell nah, partner, partner, hell nah\nMy nigga told me not to tell y'all but I'ma tell y'all\n\n[Chorus: JID]\nI shot the sherrif\nKilled the deputy\nSpared the reverend\nSmack your parents\nSplit the marraige\nSnatch the necklace, [?]\n[?]\n[?]\nI give it a click-click\nI look in the barrel\nI give it a click-click\nI look in the barrel\nI'm pointin' it at you\nI'm pointin' it at you\nI'm finna-\n\n[Verse 2]", "[Intro]\nGrade A, Grade A, Grade A, Grade A\nUh\n\n[Verse]\nOne time for Jack Swain (Huh)\nTwo times for Tay James\nThree times for me\nFour times for Tay James\nFive times for Jack Swain\nSix times for zone six\nThis is my motherfuckin' cake walk\nMy thoughts, my everything\nI gave it to you, you feel me, this my mixtape\nI'm doin' this thing, welcome to my building\n\n[Outro]\nThis is my cakewalk\nDJ Tay James (Whoo), haha\nBoy, they can't see shorty", "[Verse 1]\nLook, yeah\nTime is of the essence I'm progressively improving\nProgress and I'm chillin' [?]\nYou second guess my movements\nFirst to the bullshit\nWho tryna hang with me, I brought the nooses\nI draw the stainless like you draw conclusions\nIt's a ball of confusion\nThe writings on the wall was all illusion\nI got the drip but your shit all pollution\nYou brought the- and had another for the audible\nAll the bullshit aside boy I got plenty time\nI've been ready for whatever anytime\nFrom a city where niggas don't kill in time\nIn your pockets for nickels, penny, dimеs\nSave your shot but shit it got minimize\nWe was living by ma would go insidе behind the window, hide\nFee-fi-fo niggas slide, tryna dodge bullets from a dodge\nGod left when the winter came then the summer died\nRain rain come another time\nI be rappin' til' I'm mummified\nTell your favorite rapper it's pajama time\nHe a ugly [?] but a son of mine\nIt's over for you but it's underlined\nI go before you with a humble mind\nAnd a stomach round, plus I smell foul\nTaking big shits from the humble pies\n\n[Chorus: Kenny Mason]\nWoke up at 6\nPray to a 9, 12\nWas already runnin' from 12\nA nigga was flying\nAyy I got the time today bitch, I got the time\nI got the time today bitch, I got the time\nAim at the moon, shoot up the sky\n2:45, bought two .45's\nAyy I got the time today bitch, I got the time\nI got the time\n\n[Verse 2]\nWhat a time to be alive\nNiggas be alive, niggas on another time\nI ain't gotta  [?]\nSummarize  [?] on color time\nA lotta color people die\nMotherfucker I ain't saying it did color lines\nAnd my cousin a killer kamikaze cool nigga and he-", "[Verse]\nNigga don't worry 'bout me\nJust worry about yourself\nYou better grab your pockets 'cause I'm coming for that wealth\nAnd I be aiming for the chop, and I'm not talking about no shelf\nAnd I be blowing on some shit they say that's bad for your health\nAnd I can do it by myself, I don't need nobody\nBut I need my team to blow and that's word to young Roddy\nAnd my words so crack, calling me a young Bobby\nAnd everybody gone know me 'cause everybody gone watch me like Houston we got a problem\nThey know I'm from Richmond so they think I'm gone rob 'em\nBut they right, get 'em from my rights, I got problems\nThey know what I hold, but they think i'ma fold\nI need money for shows, you use money on clothes\nI pay attention to business, you pay attention to hoes\nI said your mind on the wrong things\nTell 'em fuck the unncessary and small things\nNiggas killing for territory and drug claims, it ain't the same thing\nIt ain't the same game, but I play my position so I can maintain\nThese niggas stuck in the traffic up in the same lane\nI think smarter, but nigga we got the same brain\nI use it different, I stress my people to listen\nI'm telling you cause I lived it\nDon't hesitate, go and get it\nI'm talking to myself and all my niggas that's with it\nSo we can be better than niggas that did it\nIntelligent and I'm gifted, you better watch your back\nIf you close to edge, you better watch that crack\nMy niggas close to that bread so they keep that MAC\nIt's a lot of bad apples, better watch that batch\nIt's like a movie, truly up in the making\nYou can see it for yourself like you was watching the Matrix\nDon't take a pause, I'm telling niggas be patient\n\n[Outro]\nNow let's start the show\nNow let's start the show\nNow let's start the show\nNow let's start the show\nNow let's start the show\nNow let's start the—", "[Verse]\nConfidence is the food to a wise man and liquor to a fool\nTrue, I had the jewel since a little bitty yute\nThe liquor root that grew manuver the manure\nThe poop, the press, the prob, the prayers, the proof\nI shook a loose on everything I thought I knew\nHad to unlearn, rewire cause the fires regrew\nI've been aloof, I've been alone and now it's time to regroup\nLook at the time and rhyming is simplе as tying a shoe\nThey say the dеvil's in the dirt, I found diamonds\nMy momma say the devil's in the church but you'd be preaching with the zeal of the converted\nYour purpose got a purpose, you been on the search\nYou've been hurt by people that's been hurt who could do worse\nOne person-black man, first earth birth\nEvil lurking in the curtain, squirting at your work shirt\nIt's know [?] if you undergo the turf\nYou a cowardly dog I wouldn't encourage it\nCertainly pertinent information observing the surface got me berserk\nThat nigga caught the dirty .30 and he poppin' that perc\nBut breaky, lunch, dinner, dessert\nBut smirch the good name of the family, mom was always at work\nHe went to rob another robber that got found in the dirt\nHe got it poppin', shot a cop, the partner thought he was turk\nGoogle search a nigga's service was [?]\nUpper class, middle class, attracted to the bad shit\nRunnin' rampant, do you blame it on some rap shit?\nIt's lies in the library, they cappin' in the captions\nFasten your seat belt, fascism is just a fashion that's formidable for you to walk the hell until your feet melt\n\n[Chorus]\nRun baby, run baby, run til' they get you\nAww man they got you, now snap for the picture\nAll better run 'fore they gun [?] for they coming for you\nRun baby, run baby, run for they get you\nAww man they got you, now smile for the picture\nRun better run from they gun cause they coming for you ooh", "[Intro]\nElegant asshole\nYou elegant asshole\nElegant asshole\nAsshole, asshole, asshole\n\n[Verse]\nUh, bad taste in my mouth from a lad tate\nBut how this taste\nEat the plate, eat the cake\nHow it make out for your satisfied face, make you wanna slap your mom and break a vace\nShit, I mean't a voss\nValentine's day, sent a condom in the cart to your broad\nI took a leap of faith, I'm J.I.D frogger\nShe knew I was the shit when the tolied bowl clogged\nI could spot an ant on a tree in the fog\nSo easily I could see the bullshit in niggas talking\nTwitter celebrities and pussy ass bloggers\nIf you knew the folks you said you knew, you probably wouldn't be talking\nI told ya'll this shit was getting awkward, now this shit awful\nI used to have one bitch, now I got a coffin\nUsed to have to cough, now I sip lean, so I'm snoring\nFeeling like a brand new man in the morning\nYawning, howning, hungry\nShawty making eggs, waffles, and cornbeef hash\nAnd I'm bout to go smash it after I smoke\nAfter I smoke, then I'ma smash her\nAnd she wants more after, but i gotta abracadabra\nGotta go, gotta dip, gotta go, got shit to do\nAnd I know that probably don't mean shit to you\nBut no pressure, I could have her on the leash if I let her have her way\nBut I know it's something out there better\nAnd mama told me never settle for the lessers (never ever)\nNever, unless you\nYour such a afradite\nYour such a goddess\nI probably knew a UFO in the orbit\nBut I ain't finna fuck around with the shwty\nWhat you mean, bro?\nI'm finna cool cous', I'm finna cool it\nThat's all I got, that's all I got\nElegant asshole\nAsshole, asshole\n\n[Outro]\nElegant asshole\nYou elegant asshole\nElegant asshole\nAsshole, asshole, asshole", "[Intro: Tony Touch and JID]\nYeah Yeah Shade 45\nYou know what it is\nIt's talker Tuesdays\n(Yeah)\n\nGot my man from the A over here, J.I.D\n(Aight)\nWe gon' get into some shit\n(Let's do this shit)\nSup Jay\n\n[Verse: JID]\nLook, uh, check\n\nAlright the time was just perfect\nThe moment was just right\nI'm conjurin' up a formula\nThe mean time tryin' it, damn\n\nMad scientist mixed wit' a strong Vicodin\nVitamin, vital information\nChicken scratch\nWritin' it pleh\n\nI guess I wasn't speakin' too clear\nOr I'm talkin' some bad English in here\nThey lookin' at me like my zipper down\nOr I whipped out my penis in here\nI must be crazy or sumn'\nI guess I'm crazy or sumn'\n\nDamn baby you sexy as fuck\nWhy you ladies be up frontin'\nActin' like I'm not amazing or sumn'\nI'm just dodgin' the Fugazi\nLately, niggas act like ladies or sumn'\nIt's in the water to drink more\nBut make sure that it's clean and pure\n\nBoy, boy, owe me the money you couldn't hide it\nBore bore, bro I'm Dora the Explorer for the dough\nFour-door hoppin' out the Ford Explorer for the dough\nWit' the .45 or the .44\nMore dying more slow, oh\n\nAnything to get this cheddar and step my bread up\nSocrates nigga I could charge by the letter\nShe like \"JID, you been dat nigga, you know it's a set up\"\nShawty was like a fat physic, a four-chin teller\n\nThanks for the lesson, that's love, illogical blessings\nAs I take another pull from the evidence, I'm so irrelevant\nButt kick shit wit' the best of dem\nGive heart and intestines\nSpit phlegm on the mic' when the record spin\n\nI been listenin' to the niggas y'all say that's dope comin' up\nWell calm the fuck down, there ain't no shit comin' up after us\nStraight out of the mud, I slap bugs in the aqueduct\nWit' the same niggas used to jump the train tracks wit' us\n\nNiggas get slain if he hoppin' on any track wit' us\nSimple and plain, niggas is lame\nWho you know, yo' name makin' some bills rang\nBut the light at the end of your tunnel is a train\nSo splat on the track again\n\nI want the gold, no Young Bird\nMy dreads like Whoopie\nMy heart cold bitch, penguin pussy\nI swear it's not me, she tried to give me the pussy\nI just be coolin' and kickin' it\nSpittin' and rippin' it\n\nHead bob, I knew you was feelin' it\nWho is I'm diggin' a grave for\nFuck yo' label, who is I'm bein' as slave for\nI go crazy, I then rob the baker\nGive me ya' cheese, ya' bread, and sprinkle some basil\n\nIt's amazing how the fuck I just go crazy on the beat\nJI- uh oh whatever\n\n[Outro: Tony Touch and JID]\nAy yessuh hah\nI'm chillin' I'm chillin' haha\nThat's what I'm talkin' bout man", "[Chorus]\nDo you worry what the fuck I got done\nI'm on some dope shit\nWorry 'bout the women I'm fuckin'\nGo get your own bitch\nWorry 'bout who paper you [scrape?]\n[Who bread the longest?] / But\nShe ain't worried when them shots\nRing out in the club (*puh puh puh puh puh*)\nWorry when we walk on the scene\nMy team the strongest\nTeam strong as us\nYour bitch bitch belong with us\nYea in paper we trust\nWe on some strongest\nWe on the stongest\nWe on some strong shit\n\n[Verse 1: J.I.D]\nThree things you know about me\nI'm with a South bitch on South Beach in South Beaches\nThese hoes hang offa the words that the mouth preaches\nSo I give their ass king shit (*king shit*) bass head and benz shit\nImma be shit like 36 and YellaBlack\nBut as early as before that nigga got hella fat\nLittle Dante down the street had hella gats\nSo you live and you die like that, that's a fact\nRest in piece, smoke a blunt, fuck a black\nLittle ass gangsters, tough ass niggas need spankin'\nMama ain't hug you, niggas all tough\n'til the pressure hit the fan, little nigga be a man\nBig paper gon' stand in the courthouse\nWish you had a fatty ass uncle that went to [?]\nHe could be a lawyer, get the boy out\nBut nah you got a public defender\nSpend all your bread givin' money to women\n\n[Chorus]\nDo you worry what the fuck I got done\nI'm on some dope shit\nWorry 'bout the women I'm fuckin'\nGo get your own bitch\nWorry 'bout who paper you [scrape?]\n[Who bread the longest?] / But\nShe ain't worried when them shots\nRing out in the club (*puh puh puh puh puh*)\nWorry when we walk on the scene\nMy team the strongest\nTeam strong as us\nYour bitch bitch belong with us\nYea in paper we trust\nWe on some strongest\nWe on the stongest\nWe on some strong shit\n\n[Verse 2: V]\nMy niggas hit the club and put on bottles by the cases\n1800, Rémy, Patrón I need a waitress\n[?], Jägermeister, we goin' crazy\nInsane, sick outta [?] they pay me [?]\nWe can pull out the drawers and play a cadence\nNow the whole club take off like planes racin'\n[?] first class like the bosses\nTeam stronger no fuckin' on [?]\n[?] wit' your hoes you feel assaulted\nSkip the line [off this trigger where?] what it cost me\nPassport stamped in overseas [bars?]\nWalkin' through the back [?] in kitchens in calamari\nHotel suite accros the street from Ferrari\nAutobahn in my own lane they can't stop me (screech)\n[?] watch how many niggas gonn' die\nSame fool's tryin' to get in free like you got me\n\n[Chorus]\nDo you worry what the fuck I got done\nI'm on some dope shit\nWorry 'bout the women I'm fuckin'\nGo get your own bitch\nWorry 'bout who paper you [scrape?]\n[Who bread the longest?] / But\nShe ain't worried when them shots\nRing out in the club (*puh puh puh puh puh*)\nWorry when we walk on the scene\nMy team the strongest\nTeam strong as us\nYour bitch bitch belong with us\nYea in paper we trust\nWe on some strongest\nWe on the stongest\nWe on some strong shit\n\n[Verse 3: M. P]\n(MP!) Return of the mack\nI'm back the walkin' heart attack\nI take your bitch and give her back\nOoo I meant sell her back\nI'm sellin' bitches, sellin' pack\nSwear I been to hell and back\nAll these bitches on their knees\nThank God I was hella strapped\nI'm talkin' gold [?] and gold pistols\nNo fuckin' 'round I tried to buy some gold missiles (gold missiles)\nCatch you in the club on your favourite fight song\nShots ring out, bet they turn the lights on\n(buh buh buh buh buh)\nCatch me with the lights on dressed light\nNo ice on, 'bouta million blunts all strong, all rolled long\nI'm strong team the long way, my high [?]\nSmokin' nothin' less than an [?]\nHell yea\n\n[Outro]\nDo you worry what the fuck I got done\nI'm on some dope shit\nWorry 'bout the women I'm fuckin'\nGo get your own bitch\nWorry 'bout who paper you [scrape?]\n[Who bread the longest?]\nBut she ain't worried when them shots\nRing out in the club (closin')\nWorry when we walk on on the scene\nMy team the strongest\nTeam strong as us\nYour bitch bitch belong with us\nYea in paper we trust\nWe on some strongest\nWe on the stongest\nWe on the strong shit\nWe on the stongest\nWe on the strong shit\nWe on the strong shit\nWe on the strong shit\nWe on the stongest\nWe on some strong shit", "[Verse]\nDamn, hella unfortunate\nFortunate fame is not the same\nWhen your phase is important but lame\nGotta take this rap shit in small portions\nI'm like Mike, who the fuck is up on the court with\nI'm attacking the paint because I smell endorphins\nPocket check, pussy boy, I smell endorsements\nThem shucking and jiving, JID jumped off the porch\nI'm tired of being poor and begging for porridge\nI need a Porsche and a crib in the forest\nIf they try to pop me, watch my eyes squint like Forrest Whitaker\nHit you from a distance\nGood riddance, good day, and good business\nGet on your [?] while the good is good\nGod gave me the jewels and I been on my juug with it\nThe rules be used and abused for you to lose\nTo lose the choice, don't choose, you in the blues\nI move like a criminal, smooth\nThat can walk on the moon\nThey waiting for me to pop like bubble gum or balloons", "Lyrics from Snippet\n\n[Intro: JID]\nGet your ass up\n[?]\nI wanna say rest in power and send love to anyone who lost anybody to aggression, depression\nGun violence, human injustices, all of that shit\nProtect yourself, my nigga\n\n[Chorus: Kenny Mason & JID]\nStick, stick (Stick), stick, stick (Boom)\nStick, stick, stick, stick\nI got a new stick (Bitch), I got a new stick (Boom)\nI got a new stick (Boom), I got a new stick (Boom)\nStick (Bitch), stick (Bitch), stick (Bitch), stick (Bitch)\nStick (Bitch), stick (Bitch), stick (Bitch), stick\nI got a new stick (I got a brand new stick)\nI got a new stick (I got a brand new stick)\nI got a new stick (I got a brand new stick)\nI got a new stick (I got a brand new stick)\nIf I see that nigga, I'ma wet his ho ass up\n\n[Post-Chorus: Kenny Mason]\nRoll down the window, roll up the window\nRoll down the window, roll up the window\nRoll down the window, roll up the window\nRoll down the window, roll up the window\n\n[Bridge: Kenny Mason & JID]\nStick and the shell, pick up the shell\nLit up the air, niggas in here\nStick and the shell, pick up the shell\nLit up the air, niggas in here\nStick and the shell, pick up the shell\nLit up the sh-, niggas in here\nStick and the shell, pick up the shell\nLit up the air, niggas in here (Yeah, uh, okay)\n\n[Verse: JID]\nHand on my dick and my hand on my gun\nOne is for shootin' and one is for fun\nNiggas trippin' off of 151\nBlack & Mild burnin' under the sun\nBlack and brown kids, young or they dumb?\nSet the town, where you momma 'nem from?\nGather 'round, runnin' all of your shit\nBut what did you get? New stick\n\n[Chorus: JID & Kenny Mason]\nI say it's [?] (New stick)\n[?]", "[Intro]\nRight now boss\nWelcome to my building\nThis is my shit, uh\nUh, this is my real shit\nGrade A, grade A, grade A, grade A\nThis is my shit\nWelcome to my building\nThis is my shit, uh\nThis is my shit, aye\nJI motherfucking D\nMotherfucking D\nThis is my shit\nStraight up\nEast Atlanta\nCheck it, uh\n\n[Verse 1]\nThis is my shit, uh, point blank, period\nI’m sitting here in this Smith, as I’m sipping on some syrup (Uh)\nThis is my shit, uh, point blank, period\nThis is my shit, uh, point blank, period\nI’m sitting here in this Smith, as I’m sipping on some syrup\nThat means Ciroc, I speak kind of different\nYou understand my flow, so that’s of my spirit\nThis is my shit, point blank, period\nI’m sitting here in this Smith, as I’m sipping on some syrup\nThat means Ciroc, I speak kind of different\nYou understand my flow, so that’s of my spirit\nGod knows, fear it, relax just hear it\nSavagely in check, the track like I fear it\nNo one finna like me and J. because I different\nThrow a \"A\" before the \"I\" and now I feel it\nHa, I'm silly, nah, I'm serious\nMy wrist is a crime, I should be arrested\nBy a chain out the crib, I'm such a damn statistic\nMy broker and my pen is looking at me like I'm ignant\nUh, that means ignorant\nShe call, I ignore it\nShe wonder how I'm doing like the bitch up out of Norbit\nI always been a winner, never had to forfeit\nThe flow comes natural, I never hit the course\nHa, and I get flow like the Nile\nDriving it out like the hotel in Dubai\nHoes want to fuck me, I bring them to my house till\nI throw ones like a stripper, till they strip out there Aeropostale\nRoll up the Mary, Mary it's the new G on the rosta\nNo dreads in my head, Jack Swayne the barber\nJack Swain producer, REO is the DJ\nAnd every song that we make, we pon de replay\nIt's money over every bitch, and everything that we say\nYou not talking cash, no hable the ingles\nYour cellphone is prepaid, I never seen green Jays\nNigga you are fake, born as a mistake, uh\nHold on nigga, wait, uh\n\n[Interlude]\nLet me get my shit right I'm bout to get it right back\nYeah, JID, the flow never stop nigga\nI got bars for days\nYeah, I got shit, uh\nYeah, uh\n\n[Verse 2]\nCheck it, you know you got to hit when the besties involved\nIt's so close, pay attention, it's a lesson involved\nAnd I speak some cash shit, no recession involved\nAnd I'm raw, roll deep like a Mexican dog\nI'm usually too lax in money, so just send me a dog\nI'm with a redbone bitch, I'm caressing her bra\nShe get wet, creak, it's sick, as I ride in my car\nShe give me mouth, lip stick, on my testicles, balls\nI be on some other shit, I ain't messing wit y'all\nI was in some fresh shit, no refreshing it dog\nMoney over every bitch, it's a message and law\nSo admit, I'm on my shit, don't you step in it (aw)\n\n[Outro]\nFuck\nHaha", "____", "[Intro]\nChristo\nAs we stand together in solidarity\nVolatile villains, we violate voluntarily\nTruth or dare me, no stereo, too aware, too prepared\nSue me, yeah, uhh\n\n[Verse]\nI'm a motherfuckin' NASA scientist with the pen\nHalf Leviathan strength, half giant\nIntense criminal intent, big gentleman, big genitals\nBig pendulum swing, pitch a tip of the ring\nSharp tongue spark gun fight, niggas is slain\nBlood trickles [?] in pain, dang\nA little pistol such a pivotal thing\nMix it with liquor and some chemical strains\n[?] never pardon that individual\nSin him or kill him, give me the max or the minimum\nPull the trigger, kill as many millenials\nIn a minute, take the ball from the pen, tossed it, lost in the wind\nOff with your favorite rapper head, we'll start with the limbs...", "[Intro]\nThis is beautiful\nWhat is that, velvet?\n\n[Verse 1]\nPardon me, but this shit might come out a little retarded\nBut I have to put my heart in it, give the orderlies orders\nHere's an organ\nAccording to the war these niggas started, I have to go abortion\nKilling niggas and broads like, Tam, Tammy, and even little Toya\nPut a baby crib in front of my Ford Taurus and fucking floor it\nMight as well cause these bitches is dumb as hell\nHaving a baby with males and raising them by themselves\nThese niggas is all in jail, the streets are on some tweet shit\nKicking up they feeds, kids got nothing to eat shit\nThese bitches is on some street shit and I ain’t cheat bitch\nBut if you think I'm tricking then Ctrl, Alt, Delete bitch\nGet up off the seat, snap, snap\nCause you gotta show me something other than pretty face and features\nAnd it would be cool to say I drop bars for features\nBut nah, I been kicking dope shit since a fetus\nNa I don't need your rap bars on my remix\nTurn Soulja Boy tell ’em into Soulja Boy teethless\nAsk about the kid, J.I.D, older boys preaching\nTeaching the opposite of squealing\n\n[Break]\nEast Atlanta breath\nAnd my breath is never stink\nI just smoked a blunt, high as hell\n\n[Verse 2]\nAnd If every you was to act foolish\nOne call, that's all, nigga, [?]\nI ain't saying I'm goonin, but I been through it\nAnd them two, plus you, equals three stooges\nYou got the mind, nigga use it\nGot two strikes, finna be your third time losing\nYou fucking stupid, I'm cooling\nBlowing some earth, wind, and fire\nI use my Bic to ignite it\nWhere I'm from niggas glorify the rims and the tires and then recycle the swag along with cans and bags\nEverybody goes green if not that, then beans or Xans, codeine, lean\nSome doing the Charle Sheen\nAnd the boys come and take them away like Charline from Aunt Chamberlain\nScrambling for Benjamins and everything equivalent\nSending M&Ms and chilling with women friends who's friend's friend resemble them\nHundred grand, all tens\n\n[Outro]\nYou already know what it is\nOh these boys got us too flexed up", "[Intro]\nCut the lights, close the blinds\nCut the lights, close the blinds\nHow peculiar? (Haha)\nHow peculiar?\nCut the lights off\n\n[Hook]\nHow peculiar? It's as if the whole world isn’t moving\nAre you thinking what I'm thinking?\nIs it me? Nigga nah\nHow peculiar? It's as if the whole world isn’t moving\nAre you feeling what I'm feeling\nIs it serious? Nigga nah, nah\n\n[Bridge]\nYou can't be serious, nigga (How peculiar?)\nYou can't be serious, nigga (How peculiar?)\nYou can't be serious, nigga (How peculiar?)\nYou can't be serious, nigga (How peculiar?)\nYou can't be serious, nigga (How peculiar?)\n\n[Verse]\nYeah, I love her hair, I love her flavor\nShe just waiting on a nigga to save her\nShe was waiting on a nigga to chase her\nAnd when my niggas not around, I probably will face her\nShe look so small and mouth so loud\nShe stuck sometimes, but that's her style\nAnd whenever I’m in another nigga town I browse and look around til that pretty bitch found\nCali girl, she came from the Westside (the Westside, the Westside)\nAnd I’m from the Eastside like Reggie Brown\nAnd all I smoke is the medical\nAnd all I smoke is the medical\nLet a fool drink, let a fool smoke\nLet 'em do shrooms, let ’em do coke\nNiggas on pills, birds got gills\nFish got wings, snakes on feet\nEverybody say, everybody say \"cut your fucking grass\"\n'cause everybody say\n(Aye y'all niggas ain't high like me)\n\n[Hook]\nHow peculiar? It’s as if the whole world isn't moving\nAre you thinking what I'm thinking?\nIs it me? Is he serious? Nigga nah\nHow peculiar? It's as if the whole world isn't moving\nAre you thinking what I'm thinking?\nIs it me? Is he serious? Nigga nah, nah\n\n[Outro]\nMy verses are impetuous, my rhymes impregnable\nI want to eat your children\n\"—eat your children\"", "[Intro: Chris Brown]\n(Gangster shit)\nYo what's good people, this your boy Chris Brown right now\nAnd I'm chilling with my main man KJ\n\n[Verse 1: JID]\nI got the red bitch, got swag like Kimora\nMarc Jacobs suit, as I stun in my fedora\nI got a lot of holes, I fuck like the majority\nLove hospital dick down the orderly\nBut my bitch, she been sheisty lately\nSlowly fading, everyday she changing\nStrangely does shit, I can't fuck with a maybe\nShe cheating 'cause I ain't beating no plus\nSo I stay shut, quiet but I've been high and suspicious\nIt's prolly one of my niggas, mister or mistress\nAnd now I'm mad as fuck, so I'm mister vicious\nIt's all in love with women, can't live with bitches\nShe had no heart, she got a clit, she's dickless\nShe's kinda like tiny, without cliff, she's tipless\nI just bury bad bitches, starting to get on my shit list\nJack Swayne the jury, Euro people's the witness\n\n[Chorus: Euro Pure Gold, JID]\nOk, he witnessed\nI witnessed, certified pimp shit\nWishing that my nigga never hooked me up with this bitch\nBut this bitch\nBut this bitch was on some very slick shit\nJack Swayne the jury, Euro people's the witness\n\n[Verse 2: Euro Pure Gold]\nHa, everytime I pass em by I rewind my\nVideo to escape all the visions that's in my timeline\nAbout a month ago, she got too comfortable\nI offered to buy her throat , she offered me tongue and throat\nNow, who am I to pass out a chewy ride\nI asked you to keep the change and asked for you to be mine\nExcuse me, Ty, don't you have a man\nHe bought you Gucci and elation, and that Prada damn\nAnd for me, you've been an addict, Dennis Rodman\nI'm playing number two with you, miss I am not a fan\nBut when the chips hit it, remember this bitch did it\nPlay the part as a man, now you added to this picture\nYou never know a winner until you put him under pressure\nShe was covering two, back to back handled the interception\nYou never know a winner until you put him under pressure\nShe was covering two, back to back handled the interception\n\n[Chorus: Euro Pure Gold, JID]\nOk, he witnessed\nI witnessed, certified pimp shit\nWishing that my nigga never hooked me up with this bitch\nBut this bitch\nBut this bitch was on some very slick shit\nJack Swayne the jury, Euro people's the witness\n\n[Verse 3: J. Jenae]\nHuh, ok he mad I fucked the homie\nBut just make it clear, this nigga don't know me\nBecause I like dope, you see\nAnd his boy was tossing dollars\nSo it would have been a gizmo, at least if I ain't holler\nAnd I know that that's your friend\nI'm trying to make my ends meet\nYou wasn't trying to skin\nSo I moved to the next G\nNow you Carl Thomas, you wish you never met me\nBut my pussy tight, so I know you won't forget me\nSo go ahead and be hasty\n'Cause it ain't gon' faze me\n'Cause nigga I'm just trying to get paid, see\n'Cause that's the way it is whne you're handling your buis\nTake a sip, roll a split, but don't talk a lot of shit\nAnd I see you tryna fake, like you ain't got another bitch\nBut you foul too, that hoe be rolling with my clique\n\n[Chorus: Euro Pure Gold, JID]\nOk, he witnessed\nI witnessed, certified pimp shit\nWishing that my nigga never hooked me up with this bitch\nBut this bitch\nBut this bitch was on some very slick shit\nJack Swayne the jury, Euro people's the witness", "[Intro]\nI need me a fat blunt\nSmoke something\nHumble as a mumble\n\n[Verse]\nLong day at the office and when I get home\nShe find some bullshit to pick out, trip on\nTalking about who this chick that just sent a pic to your shit phone\nI know who she meant, but I act as I don't know shit\nI don’t know shit holmes\nThat bitch on my dick, that's probably why she sent a pic\nMy chick don't know ’cause if she did, she would trip\nAnd tell her friends to come and get, come and get, come and get\nCome and get, I don't know shit\nShe don't believe me so I'm leaving\nTell my niggas to grab a bag of weed\nBut that don't make sense 'cause 'bout a hour and thirty minutes later I'm hollering \"baby, please, baby\"\nYou son of a bitch\nYou gone piss on me and tell me it’s rain\nWhat, do I look like a lame?\n\n[Outro]\nFuck, you just always, fuck\nNagging and whining\nShe always nagging and whining\nYeah\nI told her just stop nagging and whining\nNagging and whining and crying", "[Intro]\nWe in the time of our life\nEast Atlanta, yeah\nWord to Casey, yeah\nTurn the music up\nPrimetime\nThat nigga Smoove will say Slimetime\nI'ma call this shit Slimetime\nUh\n\n[Verse 1]\nSavage JID, a maverick\nI grab a bitch up 'til I have somethin'\nShe said, \"Can you make the bed rock?\"\nI do on my yabba dabba shit\nBut now I got the abracadabra\nFind these funny actor rappers\nMigo told me to chill, you could easily beat 'em\nShit, JID, don't feed into the bull\nThe rage of a bull with cajun eyes locked in a cage\nFilled with hatred and you hatin', speakin' this fugazi\nAnd thinkin' it's gon' phase me?\nFuck nigga, no pressure\nI'm fly in my G6 but there is no Ke$ha\nI'm 'bout to hit the homerun, where the fuck is the catcher?\nI got beef with a burger, mustard, ketchup\nFive mixtapes in, please niggas catch up\nPlease niggas step up, p-please niggas step up\nAnd not to imitate ya, I ain't the DJ for Justin Bieber\nDid two of my mixtapes so I can make you a believer\nIf you don't know, been where you wanna be\nI'm in where you won't go\nThe little nigga cry wolf, but the wolf won't show\n'Til it get time and that wolf get hungry\nNow yo ass screamin' wolf, but nobody ain't comin' muthafu-\nPrimetime, my nigga Smoove will say Slimetime\nAnd when you turn on the tube, I'm like Bron Bron\nA nigga turn on some tunes, he like, \"Momma don't cry\nI be back in a while.\" That nigga feelin' like I\n\n[Refrain]\nAy JID\nNiggas out her fakin' and paper macheing\nGovernment issued social security checks\nOut generation, bruh\nHatin' niggas never prosper\nNiggas takin' shots?\nYou done fucked around and shot yourself, bruh\nDamn, career suicide\nIt's over\n\n[Verse 2]\nOrigami, original game guru\nDestin Route's the name, JID there the voodoo\nI'm too cool and smoother than a woodgrain Ruger\nIt'll put your ass to sleep so soothin', it's not no movie\nNo cameras shootin', cameras watchin'\nFeds and paparazzi\nI make his girl give me some head and say grazi\nAnd more shot like a Nazi\nSo confident plus cocky, I don't give a fuck\nI'm knockin' boots with the hottest of hottest\nAnd we go to dinner, she only order broccoli\nShe workin' on her diet, I'm like why?\nWith that ass, you like a buck-0-5\nAnd I'm so high, I could eat up everything in the sky\nNow that's funny, I could buy up everything in the store\nNow that's money, and money that's comin' but I ain't seen yet\nAin't really got a team, just a couple niggas I fuck with\nAnd a million bitches that fuck with us, nigga don't fuck with us\n\n[Outro]\nSee, the problem is\nNiggas wanna take shots\nVia social networks\nNigga who the fuck you supposed to be, Zuckenberg?\nYou ain't got racks\nYou ain't got millions\nAll you got is a pack of newports, short!\nNigga that's what your money is\nGet right", "[Intro]\nUh\nLook\n\n[Verse 1]\nYou could tell a nigga like me ain’t never had shit\nR.I.P. I miss my dogs like Mike Vick\nZombies and at midnight fall them bars sick\nGon' fall victim to a gun brawl started over some bitches\nNiggas trippin they takin’ whatevers givin’\nThe irony when a nigga starvin’ gotta grip a pigskin\nJump the fence, empty all the dishes out ya kitchen\nIf ya witness it then [?] spill the grits, spill the kid\nFuck a crack catch, kill him, who tryna take the hit\nFirst take, go to first base, Stephen A. Smith Wes\nOn the hip, talkin’ shit like Skip\nOr Shannon Sharpe shootin’ off the top of the cliff\nI gotta bring it to you cowards then its gonna bе sick\nPut in my ten thousand hours while the clock still tick\nZonе 6, five fingers with the [?] bust her lip\nFeel the pressure like a bus pipe drip\nBlood red, rum sippin’ they ain't cut like this\nMama said\nI ain’t got cheeseburger money make a sandwich\nWhy you bein’ bad?\nBad kids in the caravan\n\n[Verse 2]\nYou can tell a nigga like me, ain’t met a nigga like me\nMetaphysical things seen and dream what you believe\nYou bleed, I bleed, then draw blood\nIm a fucking artist, Artest with the gun\nI can give my world peace, give your world ether\nBig dick or grief, I can give your girl either\nShe could be the, could be the collapse of the kingdom\nBut Kings gotta peep the [?], word to Caesar\nRemind me to keep receipts, y’all shit weak\nAnd I’m sorry that your bullshit leaked\nSee the volume it speaks to your broke speakers\nNiggas breakin’ they back tryna promote some shit that ain’t even dope\nThey ask for my coat when I walk through the door\nGod flow, I don’t walk on the floor\nGod knows yall hoes, yall shows ain’t packing the door\nCrackin’ the floor, I don’t need no niggas rappin no more", "[Intro: Leslie Wright]\nI don't think the summer ready for this one\nPut the seat back, let the windows down\nRide out, champagne music\n\n[Chorus: JID]\nLights flashing, paparazzi pulls up with the camera flashing\nI must be the next shit, Kardashian asses\nSweet ass cheeks, Yves Saint Laurent glasses\nChampagne Music\nLights flashing, paparazzi pulls up with the camera flashing\nI must be the next shit, Kardashian asses\nSweet ass cheeks, Yves Saint Laurent glasses\nChampagne Music\n\n[Verse 1: JID]\nGive me a round of applause, it's all in the wrist\nA couple of years too, and you'll ball like this\nI'm all like, kiss the diamonds on my dick\nEither way you pussies envy, 'cause I ball like swish\nAnd she all like (she all like), and we all like shit\nWith her funny talking ass, my little D.C. bitch\nBut little pretty girls in here like Wale in this bitch\nBut little Jiddy came through, with the A in this bitch\nSo you already know boy\nThe flow is nasty like chlamydia and the cold saw\nI fuck with Earthgang, reside in the zone for\nBut I'm an East side nigga, we use the chroma\nI'm at your dome like Shae's because you're fade\nI'm shady because they hated\nBut at the end of the day, I knew I would fake and make it\nThey came around with the crown\nAnd I knew I would fucking take it\nLike twelve year old ass and a forty year old rapist\n\n[Chorus: JID]\nLights flashing, paparazzi pulls up with the camera flashing\nI must be the next shit, Kardashian asses\nSweet ass cheeks, Yves Saint Laurent glasses\nChampagne Music\nLights flashing, paparazzi pulls up with the camera flashing\nI must be the next shit, Kardashian asses\nSweet ass cheeks, Yves Saint Laurent glasses\nChampagne Music\n\n[Verse 2: JID]\nI told the world I'm coming, so tighten up like a boa constrictor\nI'm making my rap homicide, and you were the victim\nThe first forty-eight, I put two in the witnesses\nAnd the same happen to you, if you happen to witness\nI'm on this track like (track like) yeah I'm deeper or something\nAnd I do give a damn, like a beaver or something\nWait, 'cause I ain't fronting\nThis money and weed that make sure that a nigga function\nThis is real talk, do away with all assumptions\nBaby I'm the best, from Atlanta to Jumanji\nAsk Robin Williams, your uncle or your auntie\nCole in the junky, chunky, either way I'm getting money (Uh)\nMoney make her come, money make me chase it\nSo if you get in the way, you can get a\nLike potato that is baked with a steak\nOr gourmet made sandwiches on a plate\nIs your stomach growling over there? It's not mine, I just ate\nI'm fly so I hate tattoos, I'm 5'8\"\nI'm straight, go nuts like cashew\nI just smoked a purp and I don't want to have to whack you\nNiggas be acting childish, I don't want to have crack you\nThe one who have to pack two kisses\nSo I can whack two niggas\nIt's champagne music, what the fuck am I doing\nYou niggas all getting burned, so who the fuck am I screwing\nI really do this, I really do this\nI told you, it's champagne music\n\n[Interlude: Leslie Wright]\nGet the waiter\nGet the mo' weight Dom Perignon or Ace of Spades\nHa, don't forget the spot is at the top, you dig\nChampagne Music\n\n[Chorus: JID]\nLights flashing, paparazzi pulls up with the camera flashing\nI must be the next shit, Kardashian asses\nSweet ass cheeks, Yves Saint Laurent glasses\nChampagne Music\nLights flashing, paparazzi pulls up with the camera flashing\nI must be the next shit, Kardashian asses\nSweet ass cheeks, Yves Saint Laurent glasses\nChampagne Music", "[Lyrics will be finished upon release]\n\nRain vision\nNot a typical picture, the same\nAin't nobody [?] the chained prison\nI'm trembling, niggas be tripping\nI'm feeling like most of you niggas be slipping\nI'm giving you tips and nigga just went with it\nFlip it, I'm saying you stupid, but hella reminiscing\nNever stupid nigga, what they do to niggas?\nKill and shoot a nigga (Damn!)\nYou recruit a nigga, blued and suit a nigga\nSend 'em to the other side\nIs you gon' buckle up for the ride?\nNiggas is fucking tough till its bucking time\nThen they motherfucked, better buckle down\nCause I'm coming up, nigga, hella money\nAnd you know my lady puff hella chronic\n\"Hey, J.I.D, hey!\" what's up, shawty?\nBeen the word around, ooh, yeah, let me tell ya 'bout it\nKeep this shit clean, [?]\nRead between shit, met her probably\nThis the money, make me feeling' something, is it jealous?\n[?] caught hella bodies (post robbery)\n\"I love that nigga, no problem!\"\n[?]\nI'm calling everybody home court, I never played like boy toy\nAnd I'm busy inside the laboratory, meeting [?] like a labadior\nQuit the bullshit, I'm a matador\nIn the pull pit like God's son\nLotta thing things, boy, carnivore, carnivore\nReady for any war, send me for fifty more, plenty more\nGetting more, see me lord?", "_______", "[Intro: DJ Drama]\nAye, yo check it out\nIt's the one and only, Barack O'Drama\nMr. Danksgiving\nAKA Mr. Gangster\nCalls himself DJ Drama\nYou're rocking with Hampton University's own\nDJ Tay James\n(Grade A, Grade A, Grade A)\n\n[Verse 1: JID]\nFuck\nSipping like the doctor on medicine\nMurdering your track, just listen, here's the evidence\nRiding with a bitch that I'm fucking like having Amphetamine\nMoney like George Jefferson\nBright like Thomas Edison\nMoney make easy revelations of relevance\nNever look back, futuristically George Jefferson\nDenzel with the money for niggas who never getting it\nCome up a little short, I see you, George Peshimam\nChecking it, I'ma attack just like Marques Colston\nGet in my way, look at you dumb like Greg Olson\nUgly placement, try to get your ass wet like the ocean\nSmoke a bag of that shit, that stink so potent\n\n[Pre-Chorus: JID]\nBack to my grizzly, my hustle is so focused\nRiding in something, can't see 'till 20006\nOh shit, hear comes a little more sick\nThen a patient in hospitals living with no dick, oh shit\n\n[Chorus: JID]\nCrazy as a bitch, there's something wrong with my atrium\nI'm crazy as (crazy as) something wrong with my atrium\nCan't control me, why the fuck you was gon' play with him\nCan't control, can't control, (can't control him)\nCrazy as a bitch, there's something wrong with my atrium\nI'm crazy as (crazy as) something wrong with my atrium\nCan't control me, why the fuck you was gon' play with him\nCan't control, can't control, (can't control him)\nCan't control me, why the fuck would you go play with him\nCan't control me, why the fuck would you go play with him\nI'm crazy as (crazy as) something wrong with my atrium\nI'm crazy as (crazy as) something wrong with my atrium\n\n[Verse 2: JID]\n(Grade A, Grade A, Grade A)\nYeah, I'm serious, you can see me plotting fearless\nGotta go dumb, can't escape like pescetarian\nMy brain is near the moon, my mind is still sailing\nIt's obvious to see, or just admit I'm an alien\nInvading them, and raiding them\nGotta get away from them\nWatch you little nigga's adore me\nWatch they pray to him\nPray for him\nSickening flow is so amazing\nCrazy as a bitch, there's something wrong with my atrium\nI can't control me, why the fuck was you gon' play with him\nShoot him in his dome, so (blow) take out the stadium\n(Grade A, Grade A, Grade A)\nLooking at my reflection in the mirror, you can't be staining him\nI need to see my father, 'cause he just might be an alien\nMaybe he's a martian, maybe an arcadian\nMaybe I'm just human, or maybe I'm just maybe-ing\nOr saying this for nothing, maybe I'm just filleting\nThis discussion for nothing, so fuck it\nTuck it, little pussy\n\n[Chorus: JID]\nCrazy as a bitch, there's something wrong with my atrium\nI'm crazy as (crazy as) something wrong with my atrium\nCan't control me, why the fuck you was gon' play with him\nCan't control, can't control, (can't control him)\nCrazy as a bitch, there's something wrong with my atrium\nI'm crazy as (crazy as) something wrong with my atrium\nCan't control me, why the fuck you was gon' play with him\nCan't control, can't control, (can't control him)", "[Intro: JID]\n(Grade A, grade A, grade A, grade A, grade A)\nYeah, uh, uh\n\n[Verse 1: JID]\nShe pretty as a diamond but I ain't tryna buy her\nFly little youngin, get whatever she require\nShe know that I require diansese to be flyer\nThe any kind of girl, who's buying from my supplier\nI investigated hardness, little bit MacGyver\nIf her pussy is the ocean, I'm the deep sea diver\nSo uh, she is flyer than the any guy's girl but shit she with me\nFrequently freaking me\nAnd it seems when we together, she don't be discreet about it\nPeople see us in public and begin to tweet about it\nPaparazzi speak about it\nAnd shorty we are big\nAnd the world is our playground, which island do you pick\nAre you dying to sit, sit\nWhile I puff on this piff in my whip\nUh, you're opinion shit\nYour European trousers cost me ten thousand\nHad to levy a steak in my brother's store smiling\n\n[Chorus: Jordan Johnson, JID]\nI won't stop when I see you\nMaybe we should slow up, maybe we act grown up\nGot me wondering like is it through\nI won't let it be true, 'cause if you feeling me too\nAnd I wanna do right by you\nYeah maybe I do, but it's not the time\nIt's going over me\nShorty, right now is not the time\nShorty, right now is not the time\nShorty, right now is not the time\n(Grade A, grade A, grade A, grade A, grade A)\n\n[Verse 2: JID]\nI love it in your life, if you did me baby\nStay close before, never sweat me baby\nDo things so you never gon' forget me baby\nHave you sprung since the first time that you met me baby\nUh, give me your number and we can keep in touch\nBut I don't want to look for you\nAll this rush, it's like if everything in line\nBetween love and lust\nWhether it's either or, me and her gon' be touching\nSmelling like Burberry, fucking on Versace\nDay 26, goddamn it, she got me\nI tried to fight it, she reminded me of Rocky\n'Cause everytime I see her, my heart start knocking\nWe took off like a rocket\nI gave a bitch a locket\nThat said, \"You can have it all but don't go in my pockets\"\nNah, no profit for you my boo\nI ain't pay you to fuck, that's what you supposed to do\n\n[Chorus: Jordan Johnson, JID]\nI won't stop when I see you\nMaybe we should slow up, maybe we act grown up\nGot me wondering like is it through\nI won't let it be true, 'cause if you feeling me too\nAnd I wanna do right by you\nYeah maybe I do, but it's not the time\nIt's going over me\nShorty, right now is not the time\nShorty, right now is not the time\nShorty, right now is not the time", "[Interlude: Leslie Wright]\nI'll be your fantasy\nLoud when you want it, quiet when you need it\nAnd screaming if you really need it\nPut the record on repeat and I'll say your name\nOver and over and over and over again\nMy name is music\nI love the attention, but am I getting played?\nYour body moves to the things that I do\nEntranced by the voodoo of my voice\nAnd yet I can't help but wonder\nDo you love me? (Do you love me?)", "[Intro]\nHold on Jack Swain\nI forgot the most important shout out, Jack Swain\nShout out to this mother fucking money we about to make, god damn\nShout out to all this guala guala stupid dollar bills we about to make, god damn\nShout out to everything we doing, you feel me?\nThis J.I.D, wag effortless\nShout out Tay James\nShout out to god damn my brother\nShout out to everybody I fuck with\nIf I don't fuck with you then fuck you\nJ-I-motherfucking-D\nThat shit recording? Alright\n\n[Verse]\n’Cause my True Religion jeans look better with the holster\nAnd I'ma show you mine if you get any closer\nEastside soldier, big blunt roller\nIntroduction to me, can you scoot the fuck over\nElbow room, please\nGrab the Glock, squeeze\nSorry did I sneeze, wipe it on my sleeve\nMotherfucker, I'm me to the death\nAnd the game was slowed up, so we had to kill the ref\nChoke him with his own whistle right after he take a breath\nI’m the shit, cook it up, I'm the chef, believe that\n'Cause see that the green stacks in the safe\nAnd If you fuck with me, I'ma have to go Planet of the Apes\nKing Kong shit\nMurder you then smoke out of my green bong, shit\nCut off your dick, your balls for ping pong shit\nBut we on shit, stacks on stacks\nAnd if my mixtape, it's gone be stacks on that\nAnd if that don't go well, we can come up with some tracks\nAnd if all else fails, nigga crack on tax\nStraight up, yo me and [?] been had our weight up\nI'm always doing work in my LV gators\nKeep the AK in the trench for the haters\nYou talk shit now, your ass sure will die later\nYou feel me? You feel me?\nPull up with the semi, I pull up in a semi\nI pull up and they hear me, then leave in a Bently\nI don't think they feel me and I don’t think they hear me\nThey tried to offend me and now I’m full of Remy\nMy temper [?]\nQuick, quick with the grand slam\nBitch, I'm Kenny Lofton\nOprah the flow, why does he keep talking?\nI call my heat often\nOr in, my case the money comes often\nListen up, pay attention, I’m talking\nSo listen up, pay attention, I'm balling\nAll over the court\nAll in the night time, morning keeps talking\nI keep talking, I'm hearing\nI'm tired of hearing this track\nTherefore I’m off it", "[Verse 1: JID]\nShit, I’m a ol’ gutter ass boy\nI beat your whore to the floor out her Christian Dior\nWhy? Ha, ‘cause I don’t like beef\nAnd if I feel like a nigga don’t like me, suck a dick, fight me\nYou walk a tight rope, it’s on a weak string\nAnd you’re going to be sleeping while we’re creeping\nAnd we will break your front screen, put the gun beam\nTo your fore frontal, nigga say uncle\nGive me back my mind back, give me back my brain\nI tend to lose these things when I’m going insane\nIntellectual male but bad to the bone\nYou faking, please cut it out, Joey Gladstone\nBack up, give me my, uh, so give me my room\nSo as I light my blunt and jump over the moon\nAnd if you not give me my room to see me go boom\nSee me go boom, see me go- see me boom\n\n[Chorus: MIA]\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\n\n[Verse 2: JID]\nAs I take a puff out the bong, many things that I do wrong\nBut at the same I do right, it’s hard being black\nWhen niggas living off the white, feds on sight\nSo I take the Kanye approach and say what I like\nBut not always the right thing depending on the timing\nShit, or the place, nigga get out my face\nIs what Taylor Swift should have said when Mr. West had disrespected\nBut she can’t say the n-word, that’ll get her dentures\nJID, temper, temper, sorry I’m deranged\nAll you need’s a roller, then you got your way to the fame\nLong as your flow’s on point and your beats by Jack Swing\nNiggas gettin’ money, shoutout to Young Money\nShoutout Grand Hustle, shoutout to Interscope\nJust tryin’ to get inside the game so I can get in niggas’ throats\nYou rappers should kill yourself, guess who selling the rope?\nAnd I came a long way from variations of dope\n\n[Chorus: MIA]\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\n\n[Outro: DJ Khaled]\nHampton University’s own\nDJ Tay James\nTay James, what it does?\nIt’s DJ Khaled, the don dada\nBig dog, Pitbull, Terror Squad\nAKA the beat nova cane\nAKA we the best", "[Intro]\nGrade A, Grade A, Grade A\n\n[Interlude]\nThis is my motherfuckin' cakewalk\nOne more time again, I call it my motherfuckin' cakewalk\nMotherfuckin' is not in the title, but I call it shit\nMy motherfuckin' cakewalk, 'cause it's a cakewalk, you feel me\nI'm out here, shout out to, uh\nShout out to Carlo Terevani, my white boy\nUp there in Canada doin' your thing\nShout out to Tay James, one time for Tay James\nNo, no no, two times for Tay James\nAnd ten times for goddamn Jack Swain\nWe out here, we doin' this thing, you feel me\nThis is my cakewalk", "Inception\nWhat happens to a dream, infer, make the connection\nThey say that hip-hop needed to be resurrected\nWell here's my best effort, bitch here comes the resurrection\nResurrected like that, I'mma make this shit [?}\nGet high jump over the moon and [?] gimme some room\nI think I'm finna get in the zone listening to tunes\nWhile my nigga stay up floating, fly like a balloon\nAnd the weird pants sagging, appearance of a goon\nThen again, they fit, can't just bag 'em when your shit cost a grip\nAnd I can't lose grip just like a fumble or a slip\nTryna be stuck in the game, locksmith, and your girl's a [?]\nSo wonder where have [?]] make-believe rules, number 5 on this dick\nOn some funny shit, I'm tryna make it like really make it\nTake a bath in my cash like is he really naked?\nBut I'm just sayin'", "_________", "(Unreleased Confirmed Song)"]}