{"artist": "Nate Dogg", "songs": ["[Produced By Bink!]\n\n[Intro]\nI got love... I got love...\nI got love... I got love...\n\n[Verse 1]\nI got love - I, got, love, for, my homies who be rollin wit me\nPlay no game - play, no, games, cause, ain't nobody playin with me\nI got love - I, got, love, for my niggas on my family tree\nI got love - love for the ghetto, down for whatever\nIf you was down before, then you still gon' be down with me\nI got game - I, got, game, cause, the game was given to me\nSay my name - say, my, name, cause, ain't nobody tighter than me\nGive it up - give, it, up, if, you like the way I'm rocking this beat\nI don't know - know nuttin better, chasin my chedder\nIf you in love with a whore -- you ain't never listened to me\n\n[Break]\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh\n\n[Verse 2]\nCaptain save - cap-tain, save, a, hooker cause she hangin on me\nShe can't hang - she, can't, hang, cause I ain't lookin fo' a wifey\nJust in case - just, in, case, I, better take a weapon wit me\nAnd these hoes - hoes keep cover, down for whatever\nIf she stress me some more, I have to leave her dead in the street\nRun me how? Run, me, how? Cause, haters they be all in the mix\nAnd they know - where, they, go-in, ain't gon' get no better than this\nCan't they see? Can't, they, see, we, ain't some niggas they wanna diss?\nD.P.G. - though I'll love a trick never, treat a bitch never\nI told you before, so you better not be fuckin with me\n\n[Break]\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\n\n[Verse 3]\nPlatinum chains - plat-inum, chains, is, all you ever see on my neck\nDiamond ring - dia-mond, rings, as, long as I can keep her in check\nAll the same - all, the, same, as, long as you don't ever forget\nI was taught in the ghetto, wear the tight bellow\nIf she head for the stash, I always got this pistol with me\nConstantly we bustin' to a hell of a beat\nThen we came - then, we, came, cause, the bass'll knock you off of your feet\nJust that deep - just, that, deep, I, betcha we be movin ya feet\nVoice kinda mellow, place from the ghetto\nIf you still want some more, go and get the fuckin CD\n\n[Outro]\nI got love... I got love...\nI got love... I got love...\nI got love... I got love...", "[Verse 1]\nHey OG\nCould you tell me how to find some good weed\nI need it homie oh so bad\nThat last bag was the best weed I've ever had\nBass so deep, I can't even seem to feel my feet\nGirls so fine, I can't help it got to make this one mine\nI hit em with my, gangsta lean\nThey can't separate my music from me\n\n[Hook]\nMusic and me\nMusic, my music and me\nMusic and me\nMusic, my music and me\nMusic and me\nMusic, my music and me\n\n[Verse 2]\nTime does change, but the music it remains the same\nI hit em with the music from the slaves\nOh my goodness, what my ancestors gave\nI don't want you to think I don't know\nThey taught me how to reach deep down and touch the soul\nWithout my music, where would I be?\nYou thought me how to cry and still remain a G\nYou keep a lot of soldiers at ease\nAnd together the next level proceed\n\n[Hook]\nMusic and me\nMusic, my music and me\nMusic and me\nMusic, my music and me\nMusic and me\nMusic, my music and me\n\n[Verse 3]\nMusic and me\nGo together, perfect harmony\nSoft and mellow\nOr so hard it'll make your speakers explode\nStay with me\nAnd together we will live out this dream\nMy music and me\n\n[Hook]\nMusic and me\nMusic and me\nMusic and me\nMusic and me\nMy music and me\nMusic and me\nMusic and me\nMusic and me\nMusic and me\nMy music and me", "[Intro: Nate Dogg]\nNobody does it better\nNobody does it better\n\n[Chorus: Nate Dogg]\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah yeah\nWe just tryin' make you see\nNobody does it better\n\n[Verse 1: Warren G]\nI'm sittin' here trippin', my mind is blocked\nNate Dogg just spit it so it's “Time To Concoct\"\nNo one can do it better like this two man crew\nHey say we one-hitter quitters, now what cha'll gonna do?\n\n[Verse 2: Nate Dogg]\nAlways into somethin, that's my name\nOnly out for money, hey cause that's the game\nPeople always ask me why I'm out for scratch\nHe who had the most is he who won the match\n\n[Verse 3: Warren G]\nStrike one, me and Nate Dogg is a match\nStrike two, leave 'em standing still in their tracks\nStrike three, you can call us two one three\nIt's the L and the B that makes me act like a G\n\n[Verse 4: Nate Dogg]\nMy exhibition started back in '93\nWhen wasn’t nobody listenin' but Warren and me\nTo all the nonbelievers, now I bet you see\nNobody does it better than me\n\n[Chorus: Nate Dogg]\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah yeah\nWe just tryin' make you see\nNobody does it better\n\n[Verse 5: Warren G]\nThey call me ‘Geezy the Spark Plug,\" keepin' it licked\nThere is no accident for these platinum hits\nSo when we make it to show love, bangin' in your club\nHangin' with your thugs, givin' up G love\n\n[Verse 6: Nate Dogg]\nDo you remember back on the east side?\nWhen all of us niggas used to love to ride\nWe didn't care what we did\nTime was nothing to us, we were just kids\nTimes are different now, but you still get stuck\nI'm not a kid no more, I just don't give a fuck\nSo if you really think you wanna step to me\nKeep this is mind: nobody does it better than me\n\n[Chorus: Nate Dogg]\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah yeah\nWe just tryin' make you see\nNobody does it better\n\n[Verse 7: Warren G]\nWow, make you say go now\nHot rap singles on the charts now\nGot a baby, so I'm breakin' hearts now\nOn your mark, get set, it starts now\n\n[Verse 8: Nate Dogg]\nAll you pimp playin' hustlers, now ya know\nYou can't keep me out once you crack the door\nEither join a team or it's best you flee\nNobody does it better than me\n\n[Chorus: Nate Dogg]\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah yeah\nWe just tryin' make you see\nNobody does it better\n\n[Outro: Nate Dogg]\nNobody does it better\nNobody does it better", "[Verse: Eve]\nCould neva' claim to be a gangsta nigga, just gangsta\nNow take a sip 'a something, let me entertain ya\nThis funk is for them rowdy niggas liable to shank ya\nA cock back blast, wit no questions asked\nSo just, hold tight, don't let the liquor run your whole night\nDon't let a sucka into courage fuck up your whole life\nI play the cut and analyze the view\nPush up my glass just to acknowledge the chosen few\nCause I don't fuck wit many\nEspecially the tough ones off a glass of Henny\nEspecially the ones always frontin' that don't have a penny\nI run wit niggas that demand respect\nAnd I'm a boss bitch, most y'all can't handle that\nAll you can do is watch your glide\nIt take a special type 'a nigga\n'Bout something that can stop a stride\nCause I can't respect a nigga that's soft\nAnd I bet ya'll neva' seen it comin'\nMe and my nigga Nate Dogg, uh\n\n[Hook - 1]\nAll the girls get up (get up, get up)\nTake it to the floor (take it to the floor)\nSpeakers 'bout to blow (c'mon, c'mon)\nTurn it up some more (turn it up some more)\nAll my dogs get down (get up, get up)\nLet me see you boogie (let me see ya dance)\nAll the girls get up (get up, get up)\nLet me see you move it (get up and get down)\n\n[Verse: Nate Dogg]\nI'm on my way to the liquor store\nWith E-V-E and my nigga Roast\nGot too much game to be slippin' on\nI let you know if you didn't know\nNever will you be able to fuck wit me\nNever will I ever stop bustin' I'm making heat\nWhenever I retire I'm a still be making beats\nShit that keep yo head bobbing, keep moving your feet\nShake that baby, drivin' me crazy\nI want that thang no if, and's, or maybe's\nI just might keep it if you could keep a secret\nBest believe I know how to please it\nTwist and turnin' got my body burnin'\nShe ain't a pro yet but homie she learnin'\n\n[Hook - 1]\nAll the girls get up (get up, get up)\nTake it to the floor (take it to the floor)\nSpeakers 'bout to blow (c'mon, c'mon)\nTurn it up some more (turn it up some more)\nAll my dogs get down (get up, get up)\nLet me see you boogie (let me see ya dance)\nAll the girls get up (get up, get up)\nLet me see you move it (get up and get down)\n\n[Verse: Nate Dogg]\nIt's 4 o'clock, club is lettin' out\nMet in the club now we playin' house\nI'm drunk as hell so I'm showing out\nPut on my glove then I knocked it out\nI'm so cold, way too smooth\nGirls they know, what to do\nShake that baby, drivin' me crazy\nI want that thang no if, and's, or maybe's\nI just might keep it if you could keep a secret\nBest believe I know how to please it\nTwist and turnin' got my body burnin'\nShe ain't a pro yet but homie she learnin'\n\n[Hook - 2]\nAll the girls get up (get up, get up)\nTake it to the floor (take it to the floor)\nSpeakers 'bout to blow (c'mon, c'mon)\nTurn it up some more (turn it up some more)\nAll my dogs get down (get up, get up)\nLet me see you boogie (let me see ya dance)\nAll the girls get up (get up, get up)\nLet me see you movin'\n\n[Bridge]\nI know, you came to have a fuckin' party\nI know it's about time to get shit started\nYou know, that I'm a bad man\nNobody can do this like I can\nNate gon' make ya get up\n\n[Hook - 3]\nAll the girls get up\nTake it to the floor\nSpeakers 'bout to blow\nTurn it up some more\nAll my dogs get down\nLet me see you boogie\nAll the girls get up\nLet me see you movin'", "[Intro: Nate Dogg]\nSexy, sexy\nSexy, sexy\nSexy, sexy\nSexy, sexy\n\n[Verse 1: Nate Dogg]\nMe and my niggas we roll\nLike each and every day\nKeep my heat beneath my seat\n'Cause other niggas don't play\nMe and my niggas we ride\n'Cause we know no other way\nOne deep breath before I step\nAnd now it's time to play\nNow tell me who is that girl\nSee her standin' 'cross the way\nWatch me mack with eye contact\nWatch her become my slave\nBaby girl it's me\nYeah that crazy nigga Nate\nI want that so don't talk back\nLet's just be on our way\n\n[Chorus: Nate Dogg]\nYou make me go crazy baby\nWhen I see a sexy girl\nI really go crazy baby\nWhen I see a sexy girl\nYou make me go crazy baby\nWhen I see a sexy girl\nYou make me go crazy baby\nWhen I see a sexy girl\n\n[Verse 2: Big Syke]\nSay suga you look like a winner\nLet's have dinner tonight\nEscape your troubles and take a flight overnight\nTo the land of the hot and the sticky\nI know it's sticky but the best part's the mystery\nAnd leave the misery behind put this dick on your mind\nExtra freaky it ain't worth my time\nI gotta get mine, I'll make sure you get yours\nBody doin things you never did before\nHave you beggin for more\nBody all over the place\nCan't wait to see the expression that's on your face\nWhen you cum, are you cummin? Are you c-cummin?\nAnd I'ma ask you is it runnin, baby?\nYou ain't never had the shit til you got dug by a thug\nAnd fucked doggy style on a bear skin rug\nUp and down stairs in the back of a limo\nOn Interstate 5 on the way to San Francisco\n\n[Chorus: Nate Dogg]\nYou make me go crazy baby\nWhen I see a sexy girl\nI really go crazy baby\nWhen I see a sexy girl\nYou make me go crazy baby\nWhen I see a sexy girl\nYou make me go crazy baby\nWhen I see a sexy girl\n\n[Bridge: Nate Dogg]\nYou make me, hmm\nYou make me go\nYou make me, hmm\nYou make me go\nYou make me, hmm\nYou make me go\nYou make me, hmm\nYou make me go\nI'm having a ball, watch out for I fall\nI'm headed for the girl that's standing on the wall\nNo flashing no bills, just testing my skills\nI'm looking for a sexy girl so we can peel\n\n[Chorus: Nate Dogg]\nYou make me go crazy baby\nWhen I see a sexy girl\nI really go crazy baby\nWhen I see a sexy girl\nYou make me go crazy baby\nWhen I see a sexy girl\nYou make me go crazy baby\nWhen I see a sexy girl", "[Hook: Nate Dogg]\nYour wife, my bitch\nYour love, my trick\nHer mouth, my dick\nI fucked, that's it\n\n[Verse 1: Nate Dogg]\nAll night long, I had her on her back in my Cadillac Brougham\nYou should of heard her moan, same old song\nI made her throw her back out, then I sent her home\nFor better or worse she's\n\n[Hook: Nate Dogg]\nYour wife, my bitch\nYour love, my trick\nHer mouth, my dick\nI fucked thats' it\nStraight pimp, no shit\nGave me your chips\nI drove, your whip\nIt's true don't trip\n\n[Verse 2: Dr. Dre]\nWhat's my name, my name is Mr. Game\nWest coast big change Mr. Fame\nBad bitch scooped her up same ol' same\nFuckin in the drivers seat while I'm switching lanes\nGettin brains Long Beach, Compton thang\nShit ain't changed thats how we do the damn thang\nDraws down nuts platinum, let em' hang\nWife missin 5 AM, who's to blame\nI'm the reason used magnum is in your range\nAnd while she bounced out wit me before you came\nFuckin lame you be handcuff sluts I banged\nI trippin take em' back shit my nuts is drained\nOn everything this dick is shootin novocain\nHave a bitch waitin bus stop, in the rain\nSimple and plain cuz we's be off the chain\nNigga Nate Dogg, pimp game, please explain\n\n[Verse 3: Nate Dogg]\nRing or no ring\nA ho gon' be a ho\nWhile you sleepin'\nShe be creepin' out the back door\nComin' to meet me at my honey comb\nSmokin' and drinkin', dyin' to please me\nWhile real playas keep playin' on\n\n[Bridge: Nate Dogg]\nPlayas play on\nKeep playin on\nLadies playin on, play on\nKeep playin on\nPlayas play on, play on\nLadies play on, play on\nKeep playin on\nYour wife, is my bitch\nYour love, is my trick\n\n[Hook: Nate Dogg]\nYour wife, my bitch\nYour love, my trick\nHer mouth, my dick\nI fucked thats' it\nStraight pimp, no shit\nGave me your chips\nI drove, your whip\nIt's true don't trip", "[Chorus: Nate Dogg]\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claimin' Dogg Pound?\n\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claimin' Dogg Pound?\n\n[Verse 1: Nate Dogg]\nI believe I got good skills\nWe been makin' music since we were kids\nThats all I wanna do for life\nKeepin it real until the day I die\nObstacles get in my way\nContinue to mash and don't forget to pray\nI keep my hand on my steel\nBecause I love my life and I always will\nWhatever people say to me\nI take it in stride I'm thinkin' negro please\nIf you really don't know me\nThen you best back up, I suggest strongly\nYes sir this is DPG\nUntil the day I D-I-E\nFor my L-I-F and E\nNo matter where I look that's all I see\nAnd I know...\n\n[Chorus: Nate Dogg]\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claimin' Dogg Pound?\n\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claimin' Dogg Pound?\n\n[Verse 2: Nate Dogg]\nMany women cling to me\nIs it 'cause they see me on BET?\nEverybody knows my name\nAll the police think I'm serving cane\nJealous niggas call us out\nBut I don't worry long as I hear their mouths\nIf ever they decide to kill\nYou better be prepared because I know I will\nOne thing I can guarantee\nYou don't wanna be standin' next to me\nBefore my final curtain call\nI feel safe sayin' it won't be long\nSo if we bump heads in the street\nOr even at some party\nYou niggas really can't see me\nMy request is that you stop trying\nBefore I let go...\n\n[Chorus: Nate Dogg]\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claimin' Dogg Pound?\n\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claimin' Dogg Pound?\n\n[Verse 3: Daz]\nEveryday, the 4-5 stays on deck for whoever\nI'm bustin' takin down, bowin' down never\nGotta watch my back for these coppers\nAs well as these niggas that I kick it with\nThey stick you faster than these bitches will\nSince I'm pimpin' everybody wants my riches\nAnd I can't keep a dime from buying weed, yack, and every time\nI smoke constantly, it comforts me\nFrom committin' the murders so I chill and puff the herb\nWho gots my back nobody\nLittle John Gotti's layin niggas down at the homie's party\nAll be goin' crazy I guess we are bein' who we are\nReally say the nigga gotta be a star\nI gots to get mine and if I blast then it's my destiny\nIf I die then it was meant to be intentionally\nWarrior stressin', no guessin', no confession\nAnd when the murder take place, it was self protection\n\n[Chorus: Nate Dogg]\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound?\n\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound?\n\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound?\n\nThese days, you gotta be strapped\nI'm already knowin' ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound?", "[Verse 1]\nWill the hardest man please stand, the homie stood right up\nSagging pants, gat in hand, the nigga was a nut\nLooney low key, O.G., been banging from the jump\nDressed in all black, ready to jack, and he still don't give a fuck\nA friend of mine, he used to be, before I got caught up\nHe used to roll with me, way back in '93, when I was broke as fuck\nBe prepared to blast, that's all that he ask, if he's to ride with you\nWe gonna make some cash, and dash, you can toss him when you're through\n\n[Refrain 1]\nThe hardest man in town\nThe hardest man in town\nThe hardest man in town\nThe hardest man around\n\n[Verse 2]\nLittle big man, don't you see me lyin' here - pick me up, if you dare\nI'll make your life easier, cause I'll be pumpin' fear\nDisrespect, you don't have to take\nIf you see him comin', just wave me in his face\nBut you ain't the only one that got a friend like me\nSo hurry up, let's go, I'm kind of tired of being broke\nI know you gotta get paid, I can show you the way\nSo take me home, polish the chrome\nLoad me up, and put me to his dome\nI got a lot work to do, so toss me and be gone\n\n[Refrain 2]\nYou're a big man now\nYou're a big man now\nYou're a big man now\nYou're a big man now\n\n[Bridge]\nI told you once before I'm pumping fear\nNobody's gonna step to you, let them know I'm here\nAnd if you have questions in the corner of your mind\nPull the trigger, and leave your questions behind\n\n[Refrain 1]\nThe hardest man in town\nThe hardest man in town\nThe hardest man in town\nThe hardest man around\nThe hardest man in town\nThe hardest man in town\nThe hardest man in town\nThe hardest man around\nThe hardest man in town\nThe hardest man in town\nThe hardest man in town\nThe hardest man around", "[Hook: Nate Dogg]\nWhen your days get lonely (days get lonely)\nWhen your nights get cold (nights get cold)\nWhen the rain starts pouring (rains starts pouring)\nWhen your man ain't home (man ain't home)\nYou can call me baby (call me baby)\nYou can let me know (let me know)\nYou ain't had none lately (had none lately)\nLemme in your backdoor (let me in your backdoor)\n\n[Verse 1]\nMeanie walks out the door\nMeanie act like he dont want you no more\nYou can do the same thang\nTwo can play at this game\nWith his love and you bored\nHe got you doing his chores\nMinus will be with me\nYou ain't nobody's slave\nWhen your days get lonely\n\n[Hook]\nWhen your days get lonely (days get lonely)\nWhen your nights get cold (nights get cold)\nWhen the rain starts pouring (rains starts pouring)\nWhen your man ain't home (man ain't home)\nYou can call me baby (call me baby)\nYou can let me know (let me know)\nYou ain't had none lately (had none lately)\nLemme in your backdoor (let me in your backdoor)\n\n[Verse 2]\nHe ain't never gone change (change)\nHe still be playing them games\nYou can do the same thang\nGirl I won't say a thang\nIf you dont tell, I won't tell (won't tell)\nWe gave in life, what the hell\nWe both want the same thang (same thang)\nAin't no need to complain\nWhen your days get lonely\n\n[Hook]\nWhen your days get lonely (days get lonely)\nWhen your nights get cold (nights get cold)\nWhen the rain starts pouring (rains starts pouring)\nWhen your man ain't home (man ain't home)\nYou can call me baby (call me baby)\nYou can let me know (let me know)\nYou ain't had none lately (had none lately)\nLemme in your backdoor (let me in your backdoor)\nWhen your days get lonely (days get lonely)\nWhen your nights get cold (nights get cold)\nWhen the rain starts pouring (rains starts pouring)\nWhen your man ain't home (man ain't home)\nYou can call me baby (call me baby)\nYou can let me know (let me know)\nYou ain't had none lately (had none lately)\nLemme in your backdoor (let me in your backdoor)\nWhen your days get lonely (days get lonely)\nWhen your nights get cold (nights get cold)\nWhen the rain starts pouring (rains starts pouring)\nWhen your man ain't home (man ain't home)\nYou can call me baby (call me baby)\nYou can let me know (let me know)\nYou ain't had none lately (had none lately)\nLemme in your backdoor (let me in your backdoor)", "[Hook]\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\n\n[Verse 1]\nJust passin' through to let you know that I remember the times we shared\nYour mother prayed for us both night and day\nI guess this is what she feared\nThe picture in my room keeps your image sharply in my head\nAll in my head\nI just can't let go of the memories I had; will this madness ever end?\n\n[Hook]\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\n\n[Verse 2]\nSometimes I wonder if it's better to be free or be in jail\nIncarceration at this time to me is better than heaven or hell\nI often wonder if you'd still be here if you had worn your vest (worn your vest)\nYou most likely soon see me we'll all be a memory\nIf we don't change this mess... change it or we gone y'all\n\n[Hook]\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\n\n[Bridge]\nHi, passing you through to let you know\nPassing you through to let you know\nThat I, gonna tell everyone I know\nGonna tell everyone I know\nHow we, used to send them to the floor\nUsed to send them to the floor\nHave we, have we forgot to mourn\nOhh, how long, how long, how long will they mourn\nOhh, how long, how long, how long will they mourn\n\n[Hook]\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)\nWhy did my homie have to die? With tears in my eyes\nI came to say goodbye (say goodbye)", "[Chorus: Nate Dogg & Val Young]\nNever leave me alone, never leave me alone\nLeave me alone never leave me alone\nNever leave me alone\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\n\n[Verse 1: Nate Dogg]\nThey tell me that temptation\nOoh, is very hard to resist\nYou tell me that you want me\nI tried to hide my feelings, D-O-G's ain't supposed to feel like this\nYou can call it what you want to\nBut I don't even know what it is\nYou've got me singin' in the morning\nYou bring me breakfast in my bed and when it hurts you rub my head\nI'll ask you one time only, baby\nWon't you be there when it's hectic, when I don't have a hit record\n\n[Chorus: Nate Dogg & Val Young]\nNever leave me alone, never leave me alone\nLeave me alone never leave me alone\nNever leave me alone\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\n\n[Verse 2: Nate Dogg]\nI've traveled so many places, I've seen so many faces\nAnd there were times I didn't think I'd make it through alone\nI went through so many phases, that got me so many cases\nThree strikes you're gone, then what you gonna do?\nI guess I'll call my lady, and tell her to kiss my baby\nThey tell me that crime is all I know how to do\nNever leave me alone\nTell him his daddy's sorry, alone\nLet him know all about me\nThere's one more thing I'd really like you to do\n\n[Chorus: Nate Dogg & Val Young]\nNever leave me alone, never leave me alone\nLeave me alone never leave me alone\nNever leave me alone\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\n\n[Verse 3: Snoop Dogg]\nMan, somebody was naughty when they snitched on me\nAnd the judge just sentenced me to do about a century\nI'm mobbin' through the county mainline\nBack in 9500 just tryin' to handle mine\nSpittin' game at the homies about the good ol' days\nAs we try to pass time waiting for the chain to Chino\nI see no reason to cry but I miss my baby boo\nAnd my nigga Spanky too\nIt's true that the dirt I did from an O.G. to a snotty nose kid\nGot me caught up in the rapture like maze, days gone by\nAnd real G's gon' cry\nBut I try to walk the yard with my head to the sky\nAnd hope my baby boo ain't fuckin' niggas on the outside\nBut what's the chance that it ain't crackin'?\nIf I was out and she was in I'd probably be mackin'\nI can't lie so I say I would, now my girl in a world of playa hood\nA playa should show a nigga love and look out\nBut the niggas I know would probably turn your ass out\nSo keep away, better yet stay away\nAnd hope I get out one day, okay\nBut if I don't, I guess this is home\nMy girl is trippin' she got a block on her phone\n\n[Chorus: Nate Dogg & Val Young]\nNever leave me alone\nWill I be left alone, all alone, on my own\nLeave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nLeave me alone, never leave me alone\n\n[Chorus: Nate Dogg & Val Young]\nWill I be left alone, all alone, on my own\nNever leave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nNever leave me alone, never leave me alone\n\n[Chorus: Nate Dogg & Val Young]\nWill I be left alone, all alone, on my own\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nNever leave me alone, Leave me alone\nNever leave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone\nWill I be left alone, all alone, on my own\nNever leave me alone, leave me alone\nNever leave me alone, never leave me alone", "[Chorus: Nate Dogg]\nMe and my homies loc\nYou know we kick it like every day\nMe and my homies, kick it like every day\n\n[Verse 1: Nate Dogg]\nBut I'm alone in my room\nAnd I don't have no one to talk to\nI catch a girl with my phone\nAnd 'cause some folks who know what I go through\nAfter I smoke a joint, come on\nTo keep my temper low, I parlay with my friends\nThere's really nowhere else to go\n\n[Chorus: Nate Dogg]\nMe and my homies loc\nYou know we kick it like every day\nMe and my homies, kick it like every day\n\n[Verse 2: 2Pac]\nI ain't shit without my homeboys\nRather be buried, then see us parted\nKeep it close to my heart\n'Cause we the ones that got the shit started\nYou recollect we used to bust on snitches\nNobody come before my niggas, fuck all y'all bitches\nAll my homeboys are self-sufficient\nSo we suspicious of your scandalous tricks\nGot the police takin' our pictures\nLove to hang out on the corner but we known to ride\nMe and my muthafuckin homeboys down to die\nFor each other, 'cause we closer than brothers\nIt's like we kin we're known for getting the party poppin'\nWhen my squad walks in\nThrow up your hands baby buy me a drink, stop actin' phony\nDon't forget to bring something for all my homies\nTo know me is to love a thug nigga to the fullest, duckin' bullets\nSnatchin' guns when the trick niggas pull it\nHandle my business like a professional, the whole world know me\nBut I ain't shit without my fuckin' homies\nMe and my fuckin' homies\n\n[Chorus: Nate Dogg]\nMe and my homies loc\nYou know we kick it like every day\nMe and my homies, kick it like every day\n\n[Bridge: Nate Dogg & Nancy Fletcher]\nMe and my homies\nConstantly we mash\nMe and my homies\nGotta make that cash\nMe and my homies\nThere's no need to ask\nMe and my homies\nWe are still the best\n\n[Break: Nate Dogg]\nThat's my homie\nThat's my homie, DPGC only\nAll my homie\nThat's my homie, DPGC only\nThat's my homie\nThat's my homie, DPGC only\nAll my homie\nThat's my homie, DPGC only\nThat's my homie\nThat's my homie, DPGC only\nAll my homie\nThat's my homie, DPGC only\nThat's my homie\nThat's my homie, DPGC only\nAll my homie\nThat's my homie, DPGC only\n\n[Chorus: Nate Dogg]\nMe and my homies loc\nYou know we kick it like every day\nMe and my homies, kick it like every day\nMe and my homies loc\nYou know we kick it like every day", "[Hook - Lil' Mo and Nate Dogg w/ variations]\n[Both]\nA gangsta's born every day\n[Mo]\nSo make sure that you keep it, G-A-N-G-S-T-A\n[Both]\nAnd now that I know the game\n[Mo]\nI'll make sure that I keep it, G-A-N-G-S-T-A\n\n[Nate Dogg]\nMe in the ghetto where the poor people hang\nPlease pay attention they do ghettoish thangs\nOne out of three, yep a third of 'em bang\nThe other motherfuckers they be slanging that 'caine\nAlways out for money cause the money's the game\nEastside homey it's a Long Beach thang\nYou heard me right nigga this is DPG\nWith the superwoman standin' claimin' CPT\n\n[Lil' Mo]\nI-I, promise I'mma keep it G\nRep my south team, keep my hands in the street\nRecognise game, and they recognise me\nCause a G like me comes naturally\nTho-ose, haters try to hate on me\nBut they got no choice but to do right by me\nThere's no way you're dividin' me\nCause my OG's in the streets gon' ride for me\nI-I, promise to do ghetto things\nCause I'm the closest thing to ghetto in this industry\nThat's why I be chillin' when it's 90 degrees\nWhile ya keep shit poppin' how I ride this beat\nAnd people always saying to me\nHow can I tell I'm really a G?\nCause an OG told a gangsta\nA gangsta told a playa\nA playa told Nate\nAnd Nate just said to me\n\n[Hook - Lil' Mo and Nate Dogg w/ variations]\n[Both]\nA gangsta's born every day\n[Mo]\nSo make sure that you keep it, G-A-N-G-S-T-A\n[Both]\nAnd now that I know the game\n[Mo]\nI'll make sure that I keep it, G-A-N-G-S-T-A\n\n[Xzibit]\nNate Dogg reppin'\n(Look!) X to the Z\n\nI'm shifty, verses runnin' a buck 50\nTryin' to get large enough bank to get Britney\nI'mma do Britney like Bobby did Whitney\nFuck her whole life off, donate my kidney (Yeah!)\nWake up to vodka, crash with the whiskey\nMy name holdin' to much weight, you can't lift me\nCame from my first out ghetto with King Tipsy\nHold a torch over my city, you can't miss me\nNiggas say fuck me but can't fuck wit' me\nTwist this shit, make your finger tips sticky\nI need me a wify, shit I mean wifey\nI'm so fucked up I couldn't read my own writin' (Heh)\nClash of the titan, (Yeah!) no propaganda\nBig Sauce, I'm comin' for you, Tony Montana\nT-shirt, khakis, tux and bandanas\nLivin' amongst the most scandalous on the planet (Yo!)\n\n[Hook Lil' Mo and Nate Dogg w/ variations]\n[Both]\nA gangsta's born every day\n[Mo]\nSo make sure that you keep it, G-A-N-G-S-T-A\n[Both]\nAnd now that I know the game\n[Mo]\nI'll make sure that I keep it, G-A-N-G-S-T-A\n\n[Both]\nA gangsta's born every day\n[Mo]\nSo make sure that you keep it, G-A-N-G-S-T-A\n[Both]\nAnd now that I know the game\n[Mo]\nI'll make sure that I keep it, G-A-N-G-S-T-A", "[Nate Dogg]\nUnless my memories fade (Unless my memories fade)\nWasn't that long ago (Wasn't that long ago)\nCame out \"Regulated\"\nAin't no fun if your girl don't go\n\nAnd I love to love ya babe\nI love to love ya (Love to love ya)\n(yeah yeah yeah yeah yeah yeah)\n\nI'm on the team cause I'm a playa (Team cause I'm a playa)\nAnd you can't fit in this shoes\nOh no (Nah, nah, nah, nah nah)\n\nI want you all up on the floor so go on and get on your feet\nI wanna know what you about, I wanna take you with me\nGirl as long as you wit me, see you can be who you be\nI want you all to understand that I can never be beat\n\n[Hook: Nate Dogg]\nWoah, oh, oh\nKeep it coming (Keep it coming)\nKeep it coming\nOh yeah\nKeep it coming (Keep it coming)\nKeep it coming\nWoah, oh, oh\n\n[Rob Stricklong]\nYo I'm broke as a bum on side of the freeway\nSinging hey Mr. DJ, gimme your replay\nSo I can receive pay, and live comfortably\nGot women huntin' me, wantin' my company\nTrying to pump me, full of *censored* I stay level\nRecognize the devil, when he messin' with the rebel\nI'm more then metal, ready to bring it to 'em strong\nRob Stricklong, make sure my name lives on\nAnd last long, number one with every song\nRock a mic phone, even if my sight gone\nMan you're wrong, say you was hot as me\nBetter chance in the lottery\nMake a mockery, If you ain't bringing it real\nLacking the skill, average run of the mill\nWhat ever you feel, homey we can handle this\nGet it on from the bricks back to Los Angeles\n\n[Nate Dogg & Rob Stricklong]\nKeep it coming (We keep it goin' non stop y'all)\nKeep it coming (All the way to the top y'all)\nKeep it coming (We keep it goin' non stop y'all)\nKeep it coming (Armed Rob and Nate Dogg y'all)\n\n[Nate Dogg]\nI can't stop, no not if I wanted too\nI'm goin' to the mat with you\nBe kicking up dust for you\nOne on one oh I can roll yo' whole crew\nLet's take it to the concrete too\nLeave you all black and blue\n\nI can't stop, no not if I wanted too\nI'm goin' to the mat with you\nBe kicking up dust for you\nOne on one oh I can roll yo' whole crew\nLet's take it to the concrete too\nLeave you all black and blue\n\n(Nate Dogg keeps On singing \"Keep It Coming\" in the background of the second\nOf these two verses above)\n\n[Hook: Nate Dogg]\nKeep it coming (Keep it coming)\nKeep it coming (Keep it coming)\nKeep it coming (Keep it coming)\nKeep it coming (Nah, nah, nah, nah, nah)\n\nWoah ohh oh oh\n\nWoah ohh oh oh\n\nWoah ohh oh oh", "[Chorus]\nNo matter where I go\nI'm lettin' people know\nNo matter where you go the grass is always green\nNo matter what you say\nYou gotta' release the chains\nI think it's time I set my spirit free\n\n[Verse 1]\nNo matter where I go\nI'm lettin' people know\nThat the pace is never stalling\nEven if the sky is falling\nI'll never be afraid\nAs long as I keep my faith\nEven if I am still crawling\nWon't be mad cause some are balling\nBut man without the trust, without the loyalty\nWhen you watch your dog  just starving\nDon't get mad when they start barkin'\nHere's a suggestion man\nWhy don't we just wash our hands\nCause I'm peepin' other pastures\nI think it's time I'm my own master\n\n[Chorus]\nNo matter where I go\nI'm lettin' people know\nNo matter where you go the grass is always green\nNo matter what you say\nYou gotta' release the chains\nI think it's time I set my spirit free\n\n[Verse 2]\nLong ago I told my homie\nSome people are so damn phony\nSure as the wind blows\nThey'll try to take your dough\nOn and on man they just keep comin'\n'Til I'm dead man I'm never runnin'\nFear I just don't know\nIf it's your time you gotta' go\nBut what about the trust what about the loyalty\nWhen the have no respect for you\nIt's fuck 'em or call your lawyer\nHere's a suggestion man\nWhy don't' we just wash our hands\nCause I'm peepin' other pastures\nI think it's time I'm my own master\n\n[Chorus]\nNo matter where I go\nI'm lettin' people know\nNo matter where you go the grass is always green\nNo matter what you say\nYou gotta' release the chains\nI think it's time I set my spirit free\n\n[Bridge]\nHere's to my family\nHere's to the ones I really love\nHere's to the inmates\nAnd that's who made Death Row #1\nHere's to the foundation\nAnd that's where, where it started from\nHere's to real freedom\nThey tell me makin' music's fun\nWhen you got no shackles on your feet\n\n[Chorus]\nNo matter where I go\nI'm lettin' people know\nNo matter where you go the grass is always green\nNo matter what you say\nYou gotta' release the chains\nI think it's time I set my spirit free", "[Hook]\nI, pledge alle-giance\nTo all my hom-ies who may ne-ver\nLo-ove a ho and ne-ver will..\nI, give my bo-dyyy\nAnd I give my so-ulll to the funk\nMay the funk, never end\n\n[Verse 1: Nate Dogg]\nI pledge allegiance, to paper chasers\nTo hustlers who be steady pulling capers\nPeace and blessing, may the sun always shine on you\nI'm serving paper, see ya later\nI guess that's one mo' thing, I can't be faded\nYou can test me, get discombobulated\nAin't no question I'm gon' fuck with this\nI do it for the funk of it\n\n[Hook]\n\n[Verse 2: Nate Dogg]\nI pledge allegiance to my - homies who keep it gangsta\nFuck all the haters they can't stop this groove\nI pledge allegiance to the - game cause it got me balling\nGame don't wait so I'm not stalling\nI'm still dissing, she's still calling\n\n[Verse 3: Pharoahe Monch]\nUhh, what, what, yeah\nUhh, check it out now, uh\nSee this is front line, no turning back now\nI'm about to score, this is war on the track now (woo!)\nGive me my vest and my ammo and my mac now\nI'm 'bout to spit it, and Lord I'mma get it\nIn the worst WAYYY, slay - competition\nMove the opposition, back wake the fuck up! (uh-huh)\nCause when I get beyond enemy lines\nI might snipe that ass like John Kennedy's mind\nThou shall not get caught, that's the remedy\nDisinfect gun wounds on my last bottle of Hennessy\nBleed to let the seeds remember my memories\nIt's killed or be killed here son that's the penalty\nRIDE for the funk, CRY for the funk\nIn the heat of the night, I DIE for the funk\nPharoahe, when I'm six feet deep there's no greiving\nSalute the noblest troop and pledge allegiance cause\n\n[Hook] *\n\n* 1st half alone, 2nd half mixes with Nate Dogg's [Verse 2]\n\n[Hook]", "[Intro: Nate Dogg]\nNobody does it better\nNobody does it better\n\n[Hook: Nate Dogg]\nThey can come closer than close, yeah\nOriginal they never will be\nWe bumpin' from coast to coast, yeah yeah\nWe just tryin' make you see\nNobody does it better\n\n[Warren G]\nI'm sittin' here trippin'\nMy mind is blocked\nNate Dogg just spit it so it's time to cock\nNo one can do it better like this two man crew\nThey say we're one hitted quitters\nNow what cha'll gonna do?\n\n[Nate Dogg]\nAlways into somethin, that's my name\nOnly out for money, hey cause that's the game\nPeople always ask me why I'm out for scratch\nHe who has the most is he who won the match\n\n[Warren G]\nStrike one\nMe and Nate Dogg is a match\nStike two\nLeave 'em standing still in their tracks\nStrike three\nYou can call us two one three\nIt's the L and the B that makes me act like a G\n\n[Nate Dogg]\nMy exhibition started back in '93\nNo one, nobody listenin' but Warren and me\nTo all the nonbelievers, now I bet you see\nNobody does it better than me\n\n[Hook]\n\n[Warren G]\nThey call me DJ and the spark plug\nKeepin' it licked\nThere is no accident for these platinum hits\nSo when we make it to show love\nBangin' in your club\nHangin' with your thugs\nGivin' up G love\n\n[Nate Dogg]\nDo you remember back on the east side?\nWhen all of us niggas used to love to ride\nWe didn't care what we did\nTime was nothing to us, we were just kids\nTimes are different now, but you still get stuck\nI'm not a kid no more, I just don't give a fuck\nSo if you think you really wanna step to me\nKeep this is mind: nobody does it better than me\n\n[Hook]\n\n[Warren G]\nWow, make you say go now\nHot rap singles on the charts now\nGot a baby\nSo I'm breakin' hearts now\nOn your mark, get set, it starts now\n\n[Nate Dogg]\nAll you pimp playin' hustlers, now ya know\nYou can't keep me out once you crack the door\nEither join a team or it's best you flee\nNobody does it better than me\n\n[Hook]\n\n[Outro: Nate Dogg]\nNobody does it better (2x)", "[Intro: Narrator]\nWe would like for you to help us welcome\nA very distinguished speaker\nHe hails from the DPG\nWould you please stand and welcome the one, the only\nOG Nate Dogg\n\n[Verse 1: Nate Dogg & Singers]\nNow I was about eight when I caught my first case\nMy mother she turned her back and bowed her head in disgrace\n(Eye-eye-eye-eye)\nNow I didn't do a thing\nI was just standin' by (just standin' by)\nHere's a message to the youngsters today\nStandin' by: you can die\n(Eye-eye-eye-eye)\nUsually I'm in the house but today I snuck off\nAnd when I walk down the Long Beach streets\nWhat a lesson they taught\n(Eye-eye-eye-eye-eye)\nWhile walkin' to the corner store a big mistake was made\nMy big homie I was walkin' with decided he needed to get paid\nSo he loaded up his .32 and walked right in the store\nHe said, \"Dear God, forgive me, please, but I can't be broke no more.\"\nNow remember, I was just eight\nI thought this was a joke\nWhat I'm sayin' I ain't playin'\nIt was funny 'til that nigga got smoked\n(Eye-eye-eye-eye)\nCan you guess who that could've been quite easily?\nBut it wasn't, so I'm lucky to be standing right here to see\n(Eye-eye-eye-eye)\n\n[Chorus: Nate Dogg & Singers]\nOne more day, one more\nOne more day\nOne more day, one more\nOne more day\n\n[Verse 2: Nate Dogg & Singers]\nOne more day, I'm hangin' around so I can see\nLittle Nate have a pocket full of money just like his daddy\nEveryday I'm sellin big dope, it's all that I know\nI ain't workin and I got a baby so don't ask me what for\nOne more day, gather round everybody and listen to me\nI gotta another story about the penitentiary\nOne more day, see while I was servin cavi I forgot to think\nSay for instance they catch me, little Nate'll never see\nNow remember I'm sellin' big dope but I'm packin' my thangs\nAnd every corner police watchin'\nI ain't crazy so I'm leaving the game\nBut I guess I waited too late cause they just caught me\nNow I'm locked up, every morning I am praying for my son's safety\nOne more day\nI'd like to thank you for watchin over my D-O-double G's\nAnd would you keep an extra eye on Nate Dogg especially\nI guess I'll just continue lifting from day to day\nAnd if I live to see tomorrow\nThank you for one more day\n\n[Chorus: Nate Dogg & Singers]\nOne more day, one more\nOne more day\nOne more day, one more\nOne more day", "(ya know)\n\n[Chorus]\nG is for the gang of money I make\nF is for the gang of fools I break\nU is for the undisputed champ\nN is cause you never gonna get the mic back\nK is for the niggas that I knock on they back\nDamn it feels good to see Long Beach on the map\n'Til the day I'm dead I'm gon' keep that shit real\nNow you niggas know G-Funk's for real\n(ya know)\n\n[Verse 1]\nTo those people who don't believe in G-funk\nTry to take my style and make a quick buck\nHere's a message to one and all\nYour pass is revoked\nAnd man I'm havin' a ball\nAny questions come and see me\nThe king of G-Funk the one and only (ya know)\nCongratulations you sound like Nate\nYou took my old hook and got me paid\nHey...\n\n[Chorus]\nG is for the gang of money I make\nF is for the gang of fools I break\nU is for the undisputed champ\nN is cause you never gonna get the mic back (ya know)\nK is for the niggas that I knock on they back\nDamn it feels good to see Long Beach on the map\n'Til the day I'm dead I'm gon' keep that shit real\nNow you niggas know G-Funk's for real\n\n[Verse 2]\nSome people are nothin' but clones\nSome people have styles of their own (ya know)\nSome people are copycats\nThese people can't get the mic back\nCan you feel me, one-hitter quitters?\nYou can't copy me, I'm one in a million\nCall any expert and you can ask him\nCopy machines can't copy platinum\nHey... (ya know)\n\n[Chorus]\nG is for the gang of money I make\nF is for the gang of fools I break\nU is for the undisputed champ\nN is cause you never gonna get the mic back\nK is for the niggas that I knock on they back\nDamn it feels good to see Long Beach on the map\n'Til the day I'm dead I'm gon' keep that shit real\nNow you niggas know G-Funk's for real\n\nG is for the gang of money I make\nF is for the gang of fools I break\nU is for the undisputed champ\nN is cause you never gonna get the mic back (ya know)\nK is for the niggas that I knock on they back\nDamn it feels good to see Long Beach on the map\n'Til the day I'm dead I'm gon' keep that shit real\nNow you niggas know G-Funk's for real\n\n[Bridge]\nWhen you feel like some cavy G-Funk\nYou need some music to bump in your trunk\nI got a baseline, a gangsta tune\nPut on the classics and your head will be movin' soon\nHey... (ya know)\n\n[Outro]\nThat's what G Funk means to me\nIt's alright\nThat's what G Funk means to me\nYa know\nYa know", "[Nate Dogg]\nI need me a bitch, with some big old thighs\nI need me a fine ass mothafuckin' bitch with some pretty ass eyes\nI need me a bitch, like I need some cash\nI need me a bitch so I can floss that ho and make my ex mad\nI need me a bitch, ain't no need to lie\nI need me a bitch so when I do some dirt she be my alibi\nI need me a bitch, like I need a 6-4\nI need me a bitch that'll shine my rims up and open my door\nI need me a bitch, who is all of that\nI need me a bitch cause I'm a fly ass mothafuckin' nigga who was born to mac\nI need me a bitch, like neva before\nI need me a bitch and I couldn't care less if the bitch is yours\nI need me a bitch\n\n[Rob Stricklong]\nI gotta fuck wit cheeks, got a house up on the beach\nEveryweek she call me just to beat up the peach\n'Til she reach a climax, scratches on my back\nHit it from the back, baby told me she like that\nInfact, you the first one to make it feel right\nI knew she wasn't lyin', knew the cat was real tight\nAnd afta tonight, you gone remember me\nArmed Robbery, put my love up there where your liver be (Haha)\nI told her never speak on me (Damn)\n'Less ya want your burnt out friends ta creep wit' me, go ta sleep wit me\nI hit her frequently, take them women off the chain\nCan duck game, eva see the bitches run the train (Uh-uh)\nIt ain't the same (Uh-uh), afta I knock it out the frame\nYou wonder why just now ya start gettin' brain\nI knock 'em out, pull chickens wit'out a doubt, fo' clout\nAsk Nate Dizzal what I'm all about\n\n[Nate Dogg]\nI need me a bitch (Ahh, ahh, ahh, ahh, ahh, ahh)\nI need me a bitch (Ahh, ahh, ahh, ahh, ahh, ahh)\nI need me a bitch, who ain't hard ta please\nI need me a fine ass mothafuckin' bitch with some sored up knees\nI need me a bitch, who ain't scared ta flirt\nI need me a bitch in the middle of the grocery store she'll lift up her skirt\nI need me a bitch, like I need my crew\nI need me a bitch to pass on to my boys soon as I get through\nI need me a bitch, this I can't deny (I can't deny)\nI need me a bitch I love when she wallin' out cause she still look fly (Fly)\nI need me a bitch, and a Coup Deville\nI need me a bitch a car with a big back seat so I can make her squeal\nI need me a bitch, like I need a drink\nBitch who can hold her breathe real good, its either swim or sink bitch\nI, I, I, I need a bitch\nI, I, I, I need a bitch\nI, I, I, I need a bitch\nI, I, I, I need a bitch", "[Verse 1]\nWhen the cat's away the mice will play\nThat's what the people say\nAll I know is Doggs play anyways\n'Cause I play every day\nYou do it too, don't lie\nSoon as you're out my sight\nI seen you creepin' by\nWhile I was creepin' mine\nWhile I was checkin' out\nI saw you checkin' in\nI shoulda knocked you out\nBut I was with your friend\n\n[Chorus]\nBecause I got a girl, don't mean we can't talk\nBecause I got a girl, don't mean I won't break you off\nBecause I got a girl, don't mean we can't talk\nBecause I got a girl, don't mean I won't break you off\n\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n\n[Verse 2]\nBack in the days I used to like bitches\nBut I tell you nowadays bitches ain't shit\nAnd if you wonder why I say this\nI've had a few bitches and bitches think they slick\nRunnin around, playin' all my niggas\nTryin' to split a brother from his grip\nGot all these busters watchin' me\nBut I tell you right now hoe, I don't slip\nI'd like to give a shout out to my favorite girl\nBut I won't. You know why? Because she's a trick\nAnd if I give a shout out to a sneaky bitch\nI got to give a shout to the nigga she's sneakin' with (and all my homies say)\n\n[Chorus]\n(Come on) Because I got a girl, don't mean we can't talk\n(Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it)\n(Come on) Because I got a girl, don't mean I won't break you off (Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it)\n\n(Come on) Because I got a girl, don't mean we can't talk\n(Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it)\n(Come on) Because I got a girl, don't mean I won't break you off (Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it)\n\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n(Come on) Come on girl let me hit it\nMeet me at the Telly that's if you’re wit' it\n\n[Outro]\n'Cause I have never met a girl\nThat I love in the whole wide world", "[Chorus]\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\n\n[Verse 1]\nWake up early in the mornin' man\nRunnin' kinda' late I gotta' catch my plane\nFeelin' kinda' funny from the weed and thangs'\nKinda' glad I woke up so I can't complain\nI really need a break from this paper chase\nBut my girl ain't gonna' wait for the diamond ring\nMy son ain't got to wait for no proper clothes\nSo I'm gone take a trip and do a couple of shows\nSo many different things be runnin' through my head\nIt's mandatory that I keep my family fed\nOn come the stompin' boots and I'm out there again\nSeems like this crazy pace is never gonna' end\n\n[Chorus]\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\n\n[Verse 2]\nI'm on a mission man, I'm fired up\nThey let me taste it man\nAnd now I'm hooked\nAin't nobody standin' on the wall\nI bust the way I bust because the feel it y'all\nPeople got opinions all about me y'all\nGot a lot of girls so they call me dog\nConstantly around me is friends and foes\nSay the wrong thing bet I bust your nose\nI gotta' give it up to niggaroes\nEven though at times we fuck the same hoes\nAll the other niggas I'mma let you know\nAin't no player hatin' go for what you know\nAnd if you see a girl that I'd like to lay\nFeel free to send her my way\n\n[Chorus]\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\n\n[Bridge]\nIf I call you baby would you swing my way tonight\nI got somethin' for you that I'm sure you're gonna' like\nIf I call you baby would you swing my way tonight\nI got somethin' for you that I'm sure you're gonna' like\nAnd we can do it all night\nI bet I hit it just right\n\n[Chorus]\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day\nJust another day", "[Verse 1: Nate Dogg & Barbara Wilson]\nI've been lookin' for a girl\nSomeone to share my world\nFor maybe just a day or two\nYou've been actin' so stingy\nI know you wanna' see\nIf I can do the things you heard\nActually I'd rather be out with my girls and weed\nI guess that goes go to show you don't know me boy\nIf you really want to creep\nThen talk to me with cheese\nOr just don't even talk at all\n\n[Chorus: Nate Dogg]\nShe's strange and I like it\nGirl when your walk you don't know what you do to me\nI got game\nSo don't fight it\nAll around the world she's just a sexy girl\nStrange\n\n[Verse 2: Nate Dogg & Barbara Wilson]\nYou be actin' like you cool\nLike you don't want to do\nThe things I know you want to do\nAre you tryin' to come up\nOr maybe just get fucked\nWhatever girl I'm down like you\nIf you wasn't so damn cute\nI wouldn't even shoot\nBut yet you choose to shoot me down\nActually it's time I leave\nYour girl is jockin' me\nI hope she's not another tease\nListen here I'd like to know\nWhy you keep actin' strange\nI got no time to chase a hoe\nBut I'd like to know your name\nAll I got is game to give\nAnd it's gonna' be cryin' shame\nIf you choose to disregard\nAnd pass up on this game\n\n[Chorus: Nate Dogg]\nShe's strange and I like it\nGirl when your walk you don't know what you do to me\nI got game\nSo don't fight it\nAll around the world she's just a sexy girl\nStrange", "[Hook]\nI'm from the jungle with the concrete streets\nYou don't wanna rumble wit the real O.G.'s\nMan I'll plant ya like a chronic seed\nAnd ya girl done ran away wit me\nI can show you how to catch these freaks\nI can show you how to beat these streets\nI can show you how to crack that safe\nLet me show you how to break that bank\n\n[Nate Dogg]\nAin't a damn thang changed\nStill rollin on Dana Danes\nStill packin steel claimin DPG\nI always keep my thang\nAlways got weed on my brain\nAlways got a dime piece wit me\nI'm gone let yo roll call\nI'm gone ball till I fall\nKeep it gangsta just for all of ya'll\nBe what you want me to be, Nate D, O, double G\nBangin from the west to the east\n\n[Hook]\n\n[Nate Dogg]\nNo need to fight it baby\nI know you want it lady\nI can tell by the way you watch me\nI like the way that you walk\nI like the way that you talk\nOoh what that accent does to me\nYeah I still claim 213\nYeah I still bang DPG\nHang wit Nate, Snoop, and Warren G\nYeah I got hoes that love me\nGot gangstas bangin my beats\nI got hoes from here to overseas\n\n[Hook]\n\n[Nate Dogg]\nI need a gangsta lady\nOne from around the way\nI need a girl that likes to play everyday\nShe said her friend wants to see\nShe said her friend is nasty\nI say you get your friend and come right away\n\n[Hook 2X]", "[Jermaine Dupri]\nCmon\nDance with me baby girl x2\nCmon\nDance with me baby girl x2\n\n[Verse 1: Nate Dogg]\nMan I was dancing, prancing, laughing, bouncing, swinging\nMoving, grooving, cause the music's booming\nMacking, tryna get some action, packing, acting\nManish, drinking, tweaking, winking, peeping\nSeeking a freak for the evening, really feeling way too horny\nReaking from the weed I'm token, choking, smoking, real doping, hoping\nMy nights wide open, knowing that my girl's at home\nSnoring, boring, ignoring, warning that my girl was coming\nSudden mood interruption, busted my girl in the club\n\n[Hook]\nRing the alarm (oh oh)\nYour woman has just been sighted (uh)\nRing the alarm\nHow'd she get in if she wasn't invited? (I dunno)\nRing the alarm\nShe's headed this way like lighting (yeah)\nRing the alarm\nI'm not tryna be ducking and diving (cmon)\nRing the alarm\n\n[Verse 2: Nate Dogg]\nHeaded, top speed for the exit\nDamnit don piece can't grab it\nA habit like chasing my cabbage\nMagic, time to disappear fast with\nThis chick, who I slept last week with\nReal trick, I like her cause she real slick\nLet's dip, I don't care who you came with\nNo lip, got no time for some bullshit\nShe went, that she all in the backpen\nTime spent, now it's time to hit the pavement\nTwo sense, got no time for your comments\nDon't trip, do you know where my girl went?\n\n[Hook]\nRing the alarm (oh oh)\nYour woman has just been sighted (uh)\nRing the alarm\nHow'd she get in if she wasn't invited? (I dunno)\nRing the alarm\nShe's headed this way like lighting (yeah)\nRing the alarm\nI'm not tryna be ducking and diving (cmon)\nRing the alarm\n\n[Verse 3: Jermaine Dupri]\nListen, I'm in the club, nowhere I ain't even supposed to be\nDrinking with a girl all close to me\nI'm all up in the air, telling her some superfly shit she need to hear\nThinking can't nobody see us cause we in the rear\nAll I'm tryna do is get a number then I'm up out of here\nCause my girl ain't home, she out with a friend\nIta be just my luck this the spot they in\nNot the place for her to spot me in\nYou know especially when I'm supposed to be at the studio\nI take one step, what do I see my girl coming through the door but she don't see me\nNow I'm ducking, now I'm dodging, hiding, praying to god that she don't come find me\nWhat was I thinking of, I should have never parked my car in front of the club damn!\n\n[Hook 3x]\nRing the alarm (oh oh)\nYour woman has just been sighted (uh)\nRing the alarm\nHow'd she get in if she wasn't invited? (I dunno)\nRing the alarm\nShe's headed this way like lighting (yeah)\nRing the alarm\nI'm not tryna be ducking and diving (cmon)\nRing the alarm\n\n(ambulance siring)", "[Intro: Snoop Dogg and (Nate Dogg)]\nYo yo yo, what's up Nate Dogg?\nNiggas just chillin' here with the homie Warren G\n(Friends, how many of us have them?)\nReminiscin' on some real friendship man\nA lotta kids don't know what that word means\n(Friends, how many of us have them?)\nHomeboys, ya know what I'm sayin', misusin' their words\nFuck a homie, I'm lookin' for a friend\n(Friends, how many of us have them?)\nThat's what I'm 'bout\n(Friends, how many of us have them?)\nUh\nHow y'all doin'?\n\n[Verse 1: Snoop Dogg]\nEver since I could remember, I had friends I could depend on\nClothes to lend 'em, money to spend on\nBut as time went by my life got a little strange\nAnd the rules in this game seem to change\nTrust, honesty, and devotion\nAnd money, money, money is the poison potion\nThere's no way that I can even say\nThat this game has been good to me, or even bad to me\nIt had to be 'cause tragically the way this shit\nCracked off for Doggy Dogg was magically\nAnd now I'm gettin' everything I'm supposed to get\nBut my friendship with niggas always ends up as bullshit\nI listen to my momma though (my momma though)\nShe always tried to prepare me and warn me for the drama, love\nBut how could she do what I? I mean I'm do or die\nBut my life on the streets, that shit is suicide\nSo to cope I got a dogg and a locc\nAnd keep my heat close in case these jokes go for broke\nI'm mashin' with the clique 2-1-3 that is (that's right, that's right)\nThey my homeboys ever since kids, real friends to the end\n\n[Chorus: Nate Dogg]\nHangin' out with my homies\n(How many of us have them?)\nAnd I'm feelin' just fine\n(How many of us have them?)\nI've been ponderin' lately, lately\n(How many of us have them?)\nA lot of different things on my mind\n(How many of us have them?)\nIt seems lately my friends list\n(How many of us have them?)\nDone took a slight decline\n(How many of us have them?)\nAnd if you wanna know the truth man, man\n(How many of us have them?)\nThem wasn't no friends of mine\n(How many of us have them?)\n\n[Interlude: Warren G]\nYou ain't no muthafuckin' friend of mine punk\nSnitch\n\n[Verse 2: Warren G]\nYou jackin' me up, you takin' my cash\nAll my life L-B-C, for my city I mash\nAll those OGs and BGs and wannabies and L-O-Cs\nThe only friends I got is my 2-1-3s\nThat's my nigga Snoop D Woop and my nigga N-A-T-E\nI can't forget about my nigga H to the Dizzy\nPressure and strikes, don't wanna take no lives\nBut these jaws, cracks, and hood cracks will make you break some bizzacks\n\"Wassup homie, can I borrow some cash?\"\nLast week I gave you 500, so kiss my ass\nI got a baby to feed, a family to see through\nAnd shake busta snitches tweekin' like yizzou\nHomies and friends, that's what they is fizzor\nStayin' tight and money right and bustin' with a 44\n\n[Chorus: Nate Dogg]\nHangin' out with my homies\n(How many of us have them?)\nAnd I'm feelin' just fine\n(How many of us have them?)\nI've been ponderin' lately, lately\n(How many of us have them?)\nA lot of different things on my mind\n(How many of us have them?)\nIt seems lately my friends list\n(How many of us have them?)\nDone took a slight decline\n(How many of us have them?)\nAnd if you wanna know the truth man, man\n(How many of us have them?)\nThem wasn't no friends of mine\n(How many of us have them?)\n\nHangin' out with my homies\n(How many of us have them?)\nAnd I'm feelin' just fine\n(How many of us have them?)\nI've been ponderin' lately, lately\n(How many of us have them?)\nA lot of different things on my mind\n(How many of us have them?)\nIt seems lately my friends list\n(How many of us have them?)\nDone took a slight decline\n(How many of us have them?)\nAnd if you wanna know the truth man, man\nThem wasn't no friends of mine", "[Chorus: Nate Dogg & Isaac Reese]\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight\n\n[Verse 1: Nate Dogg]\nYou must be a special lady, I know\n'Cause everywhere we go\nYou always bring attention to me\nYou gotta be a special lady, fo' sho'\nI know, I love the way you makin me tweek (Ooooh baby)\nLove the outfit you're wearin', that's dope\nJust as sure as chronic makes me choke\nGirl I never ever want you to leave (Heeehay lady)\nWould you like to go and see a movie? Let's go\nI hope we can make another movie tonight (Ooooh baby)\nFirst we'll get in the jacuzzi, no clothes\nI know, in a minute I'll be lickin' you dry (Heeeeey)\nThe next scene is really amazing, no joke\nYou prone, girl it's on\n\n[Chorus: Nate Dogg & Isaac Reese]\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight (I said it's going down tonight)\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight\n\n[Verse 2: Isaac Reese]\nThe love I'm tryin' to give\nIs better than a one night stand\nThey say you're a hell of a woman\nWell I can be a hell of a man\nThe way you stole my heart\nI'd even cook you breakfast in bed\nAnd you don't have to move a muscle\nJust lay back and relax, chill\n\n[Chorus: Nate Dogg & Isaac Reese]\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight\n\n[Verse 3: Danny \"Butch\" Means]\nIt seems like only yesterday\nI first met you\nGrey skies turned blue\nI wish I knew\nWhy do you always hesitate?\nWhat did I do?\nAll I wanna do is be with you\nBaby can it go down\n\n[Chorus: Nate Dogg & Isaac Reese]\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight\nIt's going down tonight\nI'll do your body right\nIf you have the time\nIt's going down tonight", "[Intro]\nBlack people don't have no, nowhere to go\nYou know, all we got to do is kick it\nWe gonna kick it in our hood, you know\nWhat we gonna do, we might\nWe might go kill a couple of niggas mane\nYou know, go in they hood and do a drive-by\nThen come back in the hood and laugh about that stuff\nYou know, its just a thing\nOnly how you really gonna get deep into it\nIs when one of your friends die\nJust like when my partners died\n(we got some problems)\nHow do we solve our problems?\n\n[Refrain: Nate Dogg]\nFirst we pray, then we ride\nFirst we pray, then we ride\n\n[Verse 1: Nate Dogg]\nHe was my brother\nLoved him like no other\nTo top it off\nI introduced him to this game\nI knew his mother\nLoved her like my mother\nA part of me is gone\nWhy’d you take my brother home?\n\n[Bridge: Issac Reese & Nate Dogg]\nWhat're ya gonna do?\nWhen the trials come\nAre ya gonna run?\nAre you gonna run?\nWhat're ya gonna do\nFirst I'm gonna pray\nAre ya gonna run?\nYou muthafuckin' right\n\n[Refrain: Nate Dogg]\nFirst we pray, then we ride\nFirst we pray, then we ride\n\n[Verse 2: Kurupt]\nI ain't got nothin' but love for you Locs and hogs\nAnd I ain't got nothin' but love for my muthafuckin' dogs\nIn the mist of the war zone, its on site\nDaylight tonight the heat held close and tight\nBeware here I come with the DPG on my chest\nHeat gonna spit like Elliot Ness\nIn the darkest zone you feel alone and on your own\nAnd after I bust, niggas call me Kurupt Corleone\nAll I'm about is money, loot and cash\nHomies in the DPG Nate, Snoop and Daz\nNow with these emotions how you approach yourself\nKnowin' you all about your wealth and as it is to health\nFirst I pray, get my thoughts intact\nAsk for forgiveness cause I'm 'bout to lay this nigga flat\nCan you adapt, can you feel me? I doubt it\nCause the closest you see it, is when niggas write about it\nI can't live without it and it ain't shit I could do\nBut stay down with the homeys in grey and blue\nSo just keep the heat close in hand\nCause I done see niggas get shit while they homeboys ran\n\n[Verse 3: Nate Dogg]\nHeavenly father shine your light on me\nI know I promise to slow down on this weed\nSeems I remember someone used to say\nOne life gets taken, if you take one life away\n\n[Bridge: Issac Reese & Nate Dogg]\nWhat're ya gonna do?\nWhen the trials come\nAre ya gonna run?\nAre you gonna run?\nWhat're ya gonna do\nFirst I'm gonna pray\nAre ya gonna run?\nYou muthafuckin' right\n\n[Refrain: Nate Dogg]\nFirst we pray, then we ride\nFirst we pray, then we ride\nFirst we pray, then we ride\nFirst we pray, then we ride", "[Intro/Chorus: Nate Dogg]\nRound and round we go [2X]\nRound and round we gooooooo\nRound and round we go\nRound and round\n\n[Nate Dogg]\nWhat goes up [echoes] must come down\nWhat goes round [echoes] comes back around\nStronger lover [echoes] it can not be found\nWhy do we [echoes] keep on goin round and round and round\n\n[Chorus]\n\n[Nate Dogg]\nIn and out [echoes]\nGirl I love the way you sex me without doubt\nThe way you scream and shout! [echoes]\nAlmost makes me explode just thinkin about it\nThe way you call my name [echoes]\nCan easily make me forget all my woes\nSo I won't complain [echoes]\nI'll be careful not to step on nobody's toes\n\n[Chorus w/ a few ad libs]\n\n[Nate Dogg (unnamed female harmonizer)]\nRound and round makin me dizzy\nAnd we can be how we used to be\nWe used to talk but we hardly speak\nI wanna stay but you're pushing me\nRound, and, rouuuuuuuuund\nRound and round and round, round and rouuuuund\nRound, and, rouuuuuuuuund\nRound and round and round, round and rouuuuund\n\n[Chorus - repeat 2X]", "(Chorus x2)\nI'll bring the bag of weed\nYou can bring the bottle of wine\nCall me whenever, we can get together\nAnd have us a real good time\n\n[Nate Dogg]\nIts still morning\nI'm still yawning\nOutside my window\nSomeone's calling\nHer name was Nicky\nHabits freaky\nShe liked to do me\nHer and her homies\nDid I mention\nThat I'm balling\nRollin on gold ones\nThats right, crawling\nThats why she's jocking\nEarly this morning\nI'm feeling under the weather\nI'll soon be feeling better\nDon't forget the paper next time\n\n(Chorus x2)\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n\n[Tray Dee]\nCall me whenever, but never ever after 10\nCuz I got to be at home with my bitch and my kids\nI hit the skin flip the twin lips of love apart\nGet to diggin in ya ligaments then bust ya heart\nCuz from the start, soon as we sparked the bag I brought\nI seen you chokin through the smoke noticed your titties was taut\nYou caught, up in the game that I came to spit\nI cracked the hennessey and entered DP gangsta shit\nYou wanna get with this, or is you in to twist\nThe game up and make me cum just to say you came up\nAnd gained what another strike on your rap\nWhen you coulda kept your mouth shut and right on the step\nWith the program knowin damn well you wrong girl\nCuz I shook you and took two of your homegirls\nYou played yourselves so I had to leave\nBaby shoulda just chilled off this bag of weed\n\n(Chorus x2)\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n\n(Bridge x6)\nI can bring the fat ass bag of weed\nI just now left the spot\nYou can bring the cold ass bottle of wine\nAnd make that your first stop\n\n(Chorus x3)\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time", "[Snoop Dogg]\nNate Dizzle, Fred Rizzle\nPut the pieces to the Pizzle!\n\n[Chorus: Nate Dogg]\nAll the ladies who like sex like I do\nCome up to my room\nI'm gon' give it to you\nAll my homies who make chips like I do\nThis ones for you\nDitty Dum, Ditty Doo\n\n[Verse 1: Snoop Dogg]\nYeah, got the freak on it\nFreak, freak on it\nYeah, I speak on it\nLast week on it, Snoop D-O-double-G\nI'm on the mic, doggone it, you want it\nHere we go again, 'bout to flow again\nTake you out, cuz I'm bout to bust a ho again\nGot the flow again, throw it in\nMix it, cook it, gumbo, jumbo\nIt just don't quit, get them chips\nMac that bitch, keep it on the under\nMake 'em wonder, do it wit' no blunder\nSnoop D-O-double-G gets the job done\nNo matter what they say about me\nThey doubt me, they can't fuck with the\nD-O-double, yes indeed that's I\nThe pizzi, I do it till the day I dizie!\n\n[Chorus: Nate Dogg]\nAll the ladies who like sex like I do\nCome up to my room\nI'm gon' give it to you\nAll my homies who make chips like I do\nThis ones for you\nDitty Dum, Ditty Doo\n\n[Verse 2: Tray Deee]\nWe keep this poppin', still hit droppin'\nComin' strong just as long as the beat knockin'\nLookin' at the clock won't do no good now\nEverybody party 'cause we out of the hood now\nFred Wreck hit, Goldie on the duece-way\nTell him it's crackin' and see what Snoop say\nThe coupe lay boomin' in the parkin' lot\nAnd I'm pullin' dime pieces off of the top\nEshine, Evine, Candy, Pam\nMaisha, Tisha, Sandra, Ann\nSo last call for alchohol, close the bar\nWe Dogghouse deep and we rollin' hard\n\n[Bridge: Nate Dogg]\nAll through the night\nBetter hit it all day\nEvery girl in the car\nGonna get it same way\nYou say you wanna turn me on\nWell you did, lets play\nYou wanna share it wit a friend\nJust admit it, 3-way\nOoh, 3-way, on the freeway\nThe G way, fuck what he say\n\n[Chorus: Nate Dogg]\nAll the ladies who like sex like I do\nCome up to my room\nI'm gon' give it to you\nAll my homies who make chips like I do\nThis ones for you\nDitty Dum, Ditty Doo\n\n[Verse 3:  Goldie Loc]\nDo I like it? (Yes)\nDo I mean it? (No)\nLet me hook this double thing up\nReal quick, \"ILUVIT\"\nPussy always make my day flows move\nIf I don't get me done\nI have a fucked up attitude\nBack off a jack off, we far\nFrom playin' games\nWe some pimps, pardon bitch\nNo need to explain\nNow look at little mama right there\nShe strain, suck dick and she don't even care\nMan, I'm all about breaking these hoes\nShaking these hoes, make a trick\nTake off here clothes\nShoot it in her nose\nMoney fingling, and jingling toes\nMe and peep game, \"I Got Pros\"\nCunt love cock, and cock love cunt\nI be feeling like its sex in my blunt\nHey Casey! Where Tracy at?\nShe said \"Daddy, she in the front washin' up the 'lac\"\nJumped in my shit, hit the switch, start smashin'\nHeaded to another spot to fuck some more asses\nAll my niggas like doin' the damn thing\nHappy beat it up like my nigga Pootietang\nHell yeah, I love sex\nBecause after I'm done I'm like \"NEXT!\"\nWith my dick on hard, church to them hoes\nThat be fuckin' superstars!\n\n[Chorus: Nate Dogg]\nAll the ladies who like sex like I do\nCome up to my room\nI'm gon' give it to you\nAll my homies who make chips like I do\nThis ones for you\nDitty Dum, Ditty Doo\n\n[Snoop Dogg]\nDum ditty dum da dum\nDitty dum ditty dum\nDum ditty dum da dum\nDitty dum ditty dum\nDum ditty dum da dum\nDitty dum ditty dum\n\n[Nate Dogg]\nDitty Dum Ditty Doo\n\n[Snoop Dogg]\nSay it, Say it\nSay it brothers\nSay it, say it brothers\nWessyde!\n\n[Nate Dogg]\nDitty Dum Ditty Doo\n\n[Snoop Dogg]\nSay it bubba\nYeah, yeah yeah\nNate Dizzle, Fred Rizzle\nPut the pieces to the pizzle!", "[Chorus: Nate Dogg]\nI'm just a man\nI'm just a man\nI'm just a man\nI'm just a man scared of love\n\n[Verse 1: Nate Dogg]\nWhen they asked me\nWhy I don't like love\nOr why I don't have a lady\nMaybe its because I know\nAs soon as I tell her\nHow I feel about her\nAs soon as I act like\nI love her she's gone\n\n[Chorus: Nate Dogg]\nI'm just a man (scared of love)\nI'm just a man (is why I don't have a lady)\nI'm just a man\nI'm just a man in love\n\n[Verse 2: Butch Cassidy]\nI really was so into you\nBut you don't know what I'm going through\nYou say you really care for me\nBut in love there's no guarantee\nSo, I think I outta take my time\n'Cause love ain't no friend of mine you see\nDon't let me get you too confused\nYou're the friend I don't want to lose\nIf I made a choice it's you I choose\nBut my heart's a tad bit through\nSo, I try to get you off my mind\nBut a remedy I cannot find for you\n\n[Chorus: Nate Dogg]\nI'm just a man (scared of love)\nI'm just a man (is why I don't have a lady)\nI'm just a man\nI'm just a man in love\n\n[Verse 3: Butch Cassidy & Nate Dogg]\nI'm never gonna try to find\nAnother I'm just out for mine\nI left so many far behind\nBut traces they'll never find\nNo, I can cover all my tracks (all my tracks)\nWon't be nothing gettin' back to you\nNow don't think that I'm being rude\nBecause I won't commit to you\nAnd other women want to screw\nWhat's a player supposed to do\nSo, I'll be slippin' on my hat\nI won't be bringin nothing back to you\n\n[Chorus: Nate Dogg]\nI'm just a man (scared of love)\nI'm just a man (that's why I don't have a lady)\nI'm just a man\nI'm just a man in love\nI'm just a man (scared of love)\nI'm just a man (that's why I don't have a lady)\nI'm just a man\nI'm just a man in love", "[Verse 1]\nOh no, they call me Nate Dogg\nGame don't wait but the girls all pause (You know me)\nBitch please, fall down to your knee\nKeep That lovin' coming don't you take your love from me\nOh no, (oh no), look at who they let in the backdoor\nLong Beach California but I think they already know\nSame team, (same team), D-O-Double-G\nStill roll with my doggs and yeah my doggs still roll with me\nMaintain, (maintain), chiddy chiddy bang bang\nBusy chasin' paper tryin' to fill my house up with grain\nLame dames, (lame dames), always fuck with my brain\nI can find another women you can find another somebody like...\n\n[Chorus]\nDon't you wish you have you somebody\nDon't you wish you could find you somebody\nDon't you wish you have you somebody\nDon't you wish you find you somebody like...me\n\n[Verse 2]\nShe's a wild thing, kind of girl you can't change\nYou don't want to meet her father they say Lucifer's his name\nShe's strange, (she's strange), really hard to explain\nCan't get caught up in this madness, can't get caught all up in this game\nBitch please, (bitch please), fall down to your knee\nBeen around the movie baby you can blow on me\nAin't right, (ain't right), I think you gonna be done at this time\nIf i'm not gettin' sex I think this time we're sayin' goodnight\nI'm from Dogg Pound California where they always keep good smoke\nSeed of Mississippi and I'm doin' this one for my folk\nHomey, if you dissin' listenin' you might fucked around and get choked\nI hoped you paid attention cause I won't be back no more\n\n[Chorus] - 4X\n\n(Somebody like me, somebody like me, somebody like me, somebody like me\nSomebody like... somebody like me) {*echoes*}", "[Redman]\nI react like a dog when ya move his food\nI'll turn your blocks upside down like Rubik's Cube\nI need a bad girl to make a nigga lose his cool\nBut in the heat of the battle she'll pull his tool\nI take 'em - skinny, dumb, blind, crippled and crazy\nOr even five-hundred pounds sweatin' gravy\nYou know, she cooks cover, not with Maybelline\nSo \"Next Friday\" she hunt you like Baby D\nI told her I'm not big, I'm tight with money\nTight nigga, stay shittin' with a diaper on me\nNiggas throw on your gators, I'm the type that's bummy\nStayin' around the hood keep me nice and hungry\nShe said \"I like your style\", I complimented\nHer ass like a garden, I gotta dig it\nNiggas better duck when baby squeeze\nBad girl, bad girl from L.A.P.D. nigga\n\n[Nate Dogg]\nI, I know that I shouldn't, I\nShouldn't buy into this lie\nI know that she got 2 or 3/4 guys\nI, I know that these girls all fly\nAnd they know that I'm that guy\nWho can make all these girls come alive\nWhy? Because I got my eye\nGot my eyes on them thighs\nAnd she got her eyes on this bad guy\n\n[Hook: Nate Dogg]\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\n\n[Nate Dogg]\nI, I got a nasty mind\nAnd she got a big behind\nI gotta make that bad girl mine\nWhy? She likes to play all night\nKnows how to move just right\nI better slow down before she pass me by\nTonight, I'mma show her tonight\nWon't let her go tonight\nLook at her shake it, my-my-my\n\n[Redman]\nEy yo Nate, that bad girl ain't Platinum, she a Diamond to me\nShe got a car door that open, ninety degrees\nOr how 'bout them women, that's outdoor 'til the mail come\nFirst of the month, they toes and nails done\nWorkin' three jobs just to feed her children\nAnd to fuck me on the beach at Hedonism\nShe smoke like I do, ride like I ride\nShe's that bad girl that'll ride 'til I die\nFool, nigga, say ya seen what?\nBad girls all gettin' stuck in here\nYo, bad girls, they gettin' stuck in here\nYo, these bad girls gettin' stuck in here\n\n[Hook: Nate Dogg]\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)", "[Nate Dogg]\nAnother short story\nWhen he be acting bad, don't he make you mad\nWanna kick his ass, when he already showed ya\nHe ain't no good and that's a fact\n\nAnother sad story\nShe constantly says she adores me\nGirl I'm all dog in love don't leave here anymore\n\nAnother short story\nHer love was beginning to bore me\nIt doens't take long for my love to fade\n\nAnother sad story\nI only call when I'm horny\nBut she acts like we kick all day\nIt's a quarter pass midnight\nDon't he make you mad, you can't find his ass\nSeven hours past, since he called you last\nOnly to you he can do no wrong\nFunny how time flies\nEspecially when you live a whole life\nLooking for love is already gone\n\nAnother short story\nAlready gave you a warning\nA one night stand homie look what I done\n\nAnother sad story\nThis girl was so soft that's so lovely\nI cannot stay cuz she's to sprung\nI keep my mind on my money\nAnd everything else is just find someone else to play her game\nI like new skirts yeah like bees like honey (honey)\nYou can have some if you want, hey no kissing\nOooh no, another short story\nHer love was beginning to bore me\nIt doesn't take long for my love to fade\n\nAnother sad story\nI only call when I'm horny\nBut she acts like we kick all day\n\nAnother short story\nAlready gave you a warning\nA one night stand homie look what I've done", "[Hook 2x]\nDolla doll\n[Verse 1]\nThe love of money is the root of all ills\nChromed out 24 inch wheels\nWill he break a bitch, he damn sure will\nHow do you think he made his first mill\nIf you're all about your cash, lets go\nGame recognize game, we all know\nSome niggas in the game too bold\nDumb niggas play the game too slow\nThe love of money is the start of all pain\nSome niggas get caught up in the game\nDolla bill, keep it simple and plain\nKeep cheddar in your pocket mane\n\n[Hook]\nThey call it dolla, they call it dolla dolla bill\nDolla dolla bill, they call it dolla dolla bill\n\n[Verse 2]\nThe love of money have you laying on your back\nKnees hurt 'cuz you're looking for some crack\nDon't know where your baby momma at\nDolla bills send her straight to the track\nIf she all about her cash, she'll go\nGame recognize game, she know\nSome women, the streets get cold\nA scared women ain't gon' make no dough\nThe love of money will have you laying in the grave\nRich niggas got some funny ass ways\nI can give it to you niggas, straight no chase\nCould've been a doctor, couldn't wait for the pay\n\n[Bridge]\nIf they ask you why I did it\nI did it for the dolla bill, yes I did\nIf they ask you why I did it\nI did it for the dolla [4x]\n\n[Hook]\n\n[Outro]\nDid it all, the love\nDid it all, the dolla dolla [4x]\nTrying to get that paper, everything gon' be alright\nPull off them capers, fucking up my whole life\nGot me a girlfriend, But the bitch wouldn't act right\nGot rid of my girlfriend, party party all night [4x]\nDolla dolla bill, they call him dolla", "[Chorus: Nate Dogg]\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down\n\n[Verse 1: Nate Dogg]\nMan I been thinkin' lately\nAbout the way the world just be changin'\nIs it a sin to be chasin' paper?\nI can't count the niggas dyin' lately\nIt's the grave or incarceration\nI know you hurt but you can't replace em\nYou go and dig a hole then erase em\nYou just created a smaller nation\nA jail cell is all that's waitin'\nLook at all the progress you're makin'\nI really hope you're kinda patient\nYou facin' 25 no probation\n2 for 1 is multiplication\nYour freedom is all they're takin\nIs it best to be dead or pacin'\nAll 'cause you couldn't take it\n\n[Chorus: Nate Dogg]\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down\n\n[Verse 2: Danny \"Butch\" Means]\nHow can I concentrate\nWith all the problems that I face\nI often ask myself if there's a place\nWhere I can get away (Where I can get away)\nI keep my head to the sky\nAnd try to maintain my pace\nIf I don't then I'm gone\nSomebody gone take my place\nNo need to go too fast\n'Cause I know a little time it takes\nBut my situation's bad\nI'll be jackin' soon at this rate\nI ain't tryin' to make you mad\nIt's a plain and simple fact you face\nIf you're broke you hurt most\nFrom all the bullshit you take\n\n[Chorus: Nate Dogg]\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down\n\n[Verse 3: Nate Dogg]\nLately I've been feelin' like givin' up (Don't give up)\nThe pain inside makes me wanna reach out and touch\nSomeone, anyone who feels that I ain't been hurt enough\nYou best duck or get stuck\n'Cause man I been hurtin' for months\nNo more, no more, no more, no more\nI've been hurtin' a while\nNo more, no more, no more, no more\nAnd I don't wanna hurt no more\nNo more, no more, no more, no more\nDon't wanna hurt no more\nBut the rain keeps comin' down\n\n[Chorus: Nate Dogg]\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down\nI don't wanna hurt no more\nI don't wanna hurt no more\nI don't wanna hurt no more\nI, but the rain keeps comin' down", "[Warren G]\nOh yeah, I chill with Nate like I did as a youth\nIt's still 213, ain't nothin different with Snoop\nMusic is the tool I used to leave the hood with\nBecame my own man, I wish you would BITCH\nI been around the world and back\nTwo times, ain't nuthin like home, it's crackin\nAfter all the women, the money and the TV shows\nI'm not really tryin' to see these hoes\n\n[DJ Quik]\nNow AMG said her eyes are the index to her soul\nBut when I look at her face, all I see is her hole\nWe sex playin with the Hennessy, and she in the mood\nWhile y'all see her as a broad, dude, I see her as food\nTake her back up to the bar to get her cigarette lit\nI told her, \"I be buyin' liquor like it ain't shh...\"\nShe told me I'm a player motherfuu..\nForget about it, she know the scam\nAnd now she belly dancin' to that Indian Jam\nSo hell, I'mma let her get a little more buzzed\n'Til she starts to get to slurrin' and forget where she was\nTake her purse out to her buddy car and back to the bar\nFor another round of drinks with a pla-ti-num star\nI'm getting conceited a little bit, the game owe me\nI've been humble since my first hit, but back to baby\nI'mma rub her on her belly, make her scoot down the couch\nLook her right up in her eyes, and take some food out her mouth\nShe want it\n\n[Chorus: Nate Dogg]\nThere she goes\nThe kind of girl that I wanted always\nMy favorite pro\nFeminine but she got gangsta ways\nI thought you should know\nThe way I want it, I get it that way\nCan't stand it no more\nNobody does it better than she\n\n[Nate Dogg]\nWhen I wake up in the morning\nFresh up outta my dream\nI ain't even finish yawning\nStill as hard as I can be\nEven tho I haven't found her\nI seen her when I was asleep\nI'm pretty sure that she is out there\nI'm pretty sure that there is someone else for me\n\n[Bridge: Nate Dogg]\nHey ho, hey ho, now that I found you\nI won't look any further (further)\nHey ho, hey ho, now that I found you\nI won't look any further (further)\n\n[Chorus]\nThere she goes\nThe kind of girl that I wanted always\nMy favorite pro\nFeminine but she got gangsta ways\nI thought you should know\nThe way I want it, I get it that way\nCan't stand it no more\nNobody does it better than she\n\n[Nate Dogg]\nThe first time I ever saw her\nI couldn't look her in her face\nI tried hard to ignore her\nBut I couldn't walk away\nWhen I finally got the courage\nI couldn't think of what to say\nTo make a long story shorter\nI better bust a different way\nI was at the park one day, that's when I saw her face\nShe was kinda cavi to me\nHad some nigga hanging on, I sent that busta home\nAnd now she ridin' with me\nTHERE SHE GOES!!!\n\n[Chorus 2X]\nThere she goes\nThe kind of girl that I wanted always\nMy favorite pro\nFeminine but she got gangsta ways\nI thought you should know\nThe way I want it, I get it that way\nCan't stand it no more\nNobody does it better than she", "[Chorus]\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\n\n[Verse 1]\nIf this were my world you know what I'd do\nTake a million dollars out the bank, would you\nGive a half a million to the chronic man?\nYes I would do it, cause I can\nIf this were my world you know who I'd screw\nAll the motherfuckers that be screwin' you\nNot that I'm trying to get elected man\nI would set trip because I can\nIf this were my world the holidays would be\nOne for famous black folk and one for me\nJust in case you don't know who I be\nMake a holiday for the G-Funk king\nIf this were my world things would go my way\nEvery single day I'd have one more day\nAnd if ever anybody got in my way\nAll I can say is first we pray (first we pray)\n\n[Chorus]\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\n\n[Verse 2]\nIf this were my world you could bet I'd clown\nHave a mini mansion in every town\nFan mail comin' in from all around\nAsking me where did I get that gangsta sound\nIf this were my world it would only be me\nStandin' on the top of the industry\nBouncin like a baller over tight-ass beats\nRemind yourself that can't nobody can bust like me\nIf this were my world every day there'd be\nAnother young brother claimin' D.P.G\nRaised from the gutter taught to make money\nWhy do niggas talk about what they can't see?\nIf this were my world I'd take my gangsta name\nSet it at the top right next to fortune and fame\nFinally I got myself up out of them chains\nIf they lock you up don't let 'em capture your brain\n\n[Chorus]\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\n\n[Bridge]\nIf this were my world, you know what I'd do\nBuy me a spaceship and a condo on the moon\nIf this were my world, I'd have a low low crew\nWe'd go roll your hood and do what gangstas do\nIf this were my world\n\n[Chorus]\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world\nIf this were my world (If this were my world) My world", "[Chorus]\nI'm gonna make\nI'm gonna make my (my) money (money)\nI'm gonna make\nI'm gonna make my (my) money (money)\nI'm gonna make\nI'm gonna make my (my) money (money)\nI'm gonna make\nI'm gonna make my (my) money (money)\n\n[Verse 1]\nFrom the time that I was only seventeen\nI knew I loved to write, I knew I loved to sing, I've seen\nI've seen about my friends and all the gangsta things we did (we did)\nBack in those days there was some who always said\nYou'll never make it no, you'll never get ahead (but I)\nI kept on goin' for mine, contrary to what they said and I did\nThis is just to let you know\n\n[Chorus]\nI'm gonna make\nI'm gonna make my (my) money (money)\nI'm gonna make\nI'm gonna make my (my) money (money)\nI'm gonna make\nI'm gonna make my (my) money (money)\nI'm gonna make\nI'm gonna make my (my) money (money)\n\n[Verse 2]\nNo matter what they say to me, I'm gonna make my money\nAnd anyone who don't believe, best stay away from me\nBeen on a mash for currency, since 1993\nThere ain't no way you stopping me\nI'm determined as I can be\nAnd if my funds get low again one thing I guarantee\nYou catch me by the corner store sellin' badass bags of weed\nNot because I think it's cool, or because I think it's neat\nIt boils down to one simple fact, me and mines have got to eat\n\n[Chorus]\nI gonna make\nI'm gonna make my money (money)\nI gonna make\nI'm gonna make my money (money)\nI gonna make\nI'm gonna make my money (money)\nI gonna make\nI'm gonna make my money (money)\n\n[Bridge]\nTell me have you ever heard G-Funk?\nTell me have you ever heard?\nTell me have you ever heard G-Funk?\nTell me have you ever heard?\nTell me have you ever heard G-Funk?\nTell me have you ever heard?\nTell me have you ever heard G-Funk?\nTell me have you ever heard?\nNate Dogg and Warren G had to regulate\n\n[Chorus]\nI gonna make\nI'm gonna make my money (money)\nI gonna make\nI'm gonna make my money (money)\nI gonna make\nI'm gonna make my money (money)\nI gonna make\nI'm gonna make my money (money)", "[Intro: Snoop Dogg]\nDogg, Pound, Gangsta, nigga\nNate Dogg, D-O-double G... ha ha, '98\nCheck this out y'all\nFor all the gangstas out there\n\n[Verse 1: Snoop Dogg]\nAll I know and all I do is\nD-P-G with the rest of my crew\nWe through with milken Milli Vanilli\nSilly niggas who be rappin' but they really be actin'\nI'm smackin' niggas in they face for the '9-8\nMy DJ Warren G and my homeboy Nate\nThe game won't wait, so we paper chase\nAnd watch out for them suckas who paper hate\nTry to drop some shit to keep ya straight\nI keep my niggas on a mission and the suckas keep wishin'\nBut my success, oh yes it's fresh\nHere's a toast to the Eastside, L.B. for lizie\nYou can call me what you wanna\nOr you can catch me in the Navigator bendin' a corner\nI'm representin', just like Billy Clinton\nI smack a bitch and make my chips, then dip\nFor Dogg Pound Gangsta click\n\n[Chorus: Nate Dogg]\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville\n\n[Verse 2: Nate Dogg]\nOnce upon a time in the land of the foolish man\nThere lived a man who claimed to be holdin' aces in his hand\nHe played wrong once and played 'em twice\nAnd played 'em wrong again\nNow it's my turn to play the game\nAnd I guarantee I'll win\nVery best I have to be and I hope you understand\nI got my game from Gangstaville\nEastside of gangsta land (come with me)\n\n[Chorus: Nate Dogg]\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville\n\n[Verse 3: Kurupt]\nWell you can give me half your loot, nigga\nOr else I'ma shoot, nigga\nI do what G's do, I ride, I slides, I dips\nDouble for us fool, where's the clips?\nYou'll find I hit your spine and shake your hips with hollow tips\nIt's the modern day me, with the state of art modern day heat\nMotherfuckin' modern day G\nNo good, fo' sho' good\nPut this nigga on the hood\nThen let me put him back the fuck off, like that\nYou fuckin' with the Kobe Bryant of rap\nWith a mack 11 cocked back ready for sure, ready for war\nFor real, enter if you will\nIn the land we call Dogg Pound Gangstaville\nAll we do is smoke, and just so you know -\nMy motto is \"fuck you bitch and fuck a ho\"\n\n[Chorus: Nate Dogg]\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville\nDon't you wanna come with me to Dogg Pound Gangstaville?\nWe can give you what you need in Dogg Pound Gangstaville", "[Nate Dogg & (Nas)]\n(All star baby)\nYoung quick see (F-U-B-U)\nLately all I see is D-P-G\n(Q-B, L-B-C niggas)\nWhen I turn the radio on keep hearin' me (All day, everyday)\nLivin' the good life, good life uh huh good life (Braveheartz)\n\n[Nate Dogg & (Nas)]\nSure as the world is turnin' round and round (Shit is real yo)\nThere's these niggas, bitches, snitches tryin' to bring you down\n(Fucked up) But I don't know why I mention\nAnd if I don't pay no attention I'm cool (Real niggas do real things)\n(Real niggas do real things)\nSure as my chronic is the best in town [* Inhale and coughs *]\nThose who trippin' slippin' listen, we ain't stoppin' now (Can't stop)\nWe won't even pause, y'all can lick my balls (Bitches)\nWe livin' the good life, good life, good life\n(Livin' the good life baby)\n\n[Hook]\nYoung quick see (Come on, come on)\nLately all I see is D-P-G (Nate Dogg)\nWhen I turn the radio on keep hearin' me (Still, still, still)\nLivin' the good life, good life uh huh good life (We livin' the life)\n\n[JS]\nIt ain't nothin' but a paper chase\nBut even when ya paper straight\nEvery stage just another way to see cake\nBut niggas still gotta die hate\nWell fuck it, I'mma do it cause the streets put me to it\nSee y'all niggas is late\nSee it's big face, big livin'\nBig dogs and big pimpin'\nGame played with nothin' but precision\nMoney, cars, and women\nSee niggas hatin' cause they on the outside\nWishin' they could find a way in it\nYou see the rims spinnin' all black tinted\nWith the niggas who'll bring it to ya brain\nIf it's fuckin' with change\nFifty-four nigga remember the name\nRitz, glitz only when we empty clips\nAnd dismember your brain\nCause I remember pain, gain pain, this winner reign\nBut now it's high tech out here in the center lane\nSee we got the world respectin' the slang\nThe good life, hit the studio, the club, straight to the plane\n\n[Hook]\n\n[Nas]\nYo, yo, yo\nPass you cowards, classical rap mix form power\nYasser Arafat, I'm stormin' with lead showers\nAnd I'm murderous, common is formerly Nastradamous\nI'm goin' for the top regardless\nPretty Boy Floyd, the rotten tooth king\nGhosts of my dead friends linger\nI toast to you lover, blunts lit, wish I was hittin'\nCock back, four pound, let six in the air\nRock that raw sound, gettin' wet to this year\nCause of the projects Hannibal Lec, hand on my tec\nIn front the White House, my ice out demandin' respect\nBraveheartin' to the grave darlin' wavin' my sterling\nFrom out the black Bentley it's off, spray till y'all fallin'\nEast to West Coast ballin'\nNate Dogg, Nas, and Kurupt, liven it up, dimes in the cut\nSizin' us up, y'all wanna fuck, gin and tonic my cup\nAnd we live the good life, still chronic it up\n\n[Hook]", "[Verse: Nate Dogg & (Nanci Fletcher)]\nNow life for me (Life for me)\nLivin on the streets (On the streets)\nUsed to be, hectic, scandalous (Scandalous)\nThe people I meet (people I meet)\nWhen I'm on these streets (On these streets)\nThey can be, crazy, and dangerous (And dangerous)\nWhen you're broke as you can be\nAnd you're on them streets\nYou have to be, cunning, homey\nKeep your hand (Keep your hand)\nOn the Hardest Man (Hardest man)\nOr you may be, a dead man\n\n[Chorus: Nate Dogg]\nCrazy, dangerous\nCrazy, dangerous\nCrazy, dangerous\nCrazy, dangerous\nCraa-azy, dangerous\nCraa-azy, dangerous\nCraa-azy, dangerous\nCraa-azy, dangerous", "Consider this an invitation to my Gangsta Nation\n\nNa na na na na na na na\n(Westside)\nNa na na na na na na na\n(Ohh, ohh)\nNa na na na na na na na\n(What? What?)\nNa na na na na na na na\n\nNa na na na na na na na\n(Yea)\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\n\nAnd in five years I'm comin' up\nFools talk real loud but don't run up\nWhen we come through they'd run it up\nWe still right here so what the fuck\n\nNigga, I'm tired of these niggas barkin' like shit talkin' like shit\nFrom the concrete when they chalkin' like shit\nAnd there he goes and a trick pose and a throw back\nHoldin' a gat ain't gonna bust and know that\nIt's a dub S C thang dub C brain\n(w)\nAnd we don't fuck with niggas and khaki jeans strains\nI'm fucked movin', I'm clearin' the crowd\nIt's the who bangin' bandana criminal\nThe original\n\nEvacuate the building, bitch, here come a plane\nNo, it's the bad ass Westside Connect Gang\nAnd fuck what you plain, nigga, this who bang\nWith enough game to drive a swear bitch insane\nAnd we number one gunners, no, we ain't stunners\nIt's real with us homie, killaz and drug runners\nAnd Mack need a beat now in a H2 Hummer\nLookin' hotter than a mothafuckin' L.A. summer\nLet's go\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\n\nAnd in five years I'm comin' up\nFools talk real loud but don't run up\nWhen we come through they'd run it up\nWe still right here, so what the fuck\n\nWhat the fuck is Ice Cube talkin' about?\nThat's how you get these nuts parked in you mouth\nWestside bitch, the same old shit\nI don't conversate with pussy, I ain't gon' get\nI don't holla at these hoes that sing like Ashanti\nBody like Beyonce, face like Andre\n(Uhh)\nBitch, you kinda scrangay\nBut I'm rich so my Andre got to be bomb rate\n\nHave you seen us, naw, haters can't see us\nConnect Gang we the G'est nigga\nCountless calls and countless charges\nStreet niggas makin' blunts out of Cuban cigars\nBig by the linnas sip notic by the liters\nWith a flock of pros on us 'cuz the cronic is a grennes\nAnd to my G's incarcerated and on probation\nI'ma stay bagin for the whole G Nation nigga\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\n\nAnd in five years I'm comin' up\nFools talk real loud but don't run up\nWhen we come through they'd run it up\nWe still right here, so what the fuck\n\nIt's a Gangsta Nation if you in you a G\nAnd the whole world influence by the C in the sea\nNow tell the truth rappers, you don't ball like me\n'Cuz I'm really from the gang ya'll is industry\nAnd while I'm servin' up and comin' young hustlers and cluckers\nBangin' for the hood causin' havic and ruckus\nYou fools actin' label kissin' up ass suckers\nAnd your trick solder down when you piss muthafucka\n\nOne thing I do know I ain't the uno\nBig puno rap sumo on pruno\n(You know)\nI'd like to thank the congregation\nIn my affiliation to the Gangsta Nation\nI'm hard on them, yeah, I'm ruthless\nYou like a sick pussy, nigga you useless\nYou know the side trick, better get up on it\n'Cuz it must be a single with Nate Dogg singin' on it\n\nNa na na na na na na na na na na\nNa na na nna na na na na na na na\nNa na na na na na na na na na na na\nNa na na na na na na na na na na na na\n\nLook, check this out man\nWe got a Gangsta Nation goin' down over here\nSo ya'll might as well say fuck it and join this Westside thang man\nCause once you get with this nigga\nYou as G as can muthakuckin' be, believe' that homeboy\nIt's like that, Fred Red, what I'd tell you homey\nIt ain't a hit till Nate Dogg spit\n(Na na na na na na na na)\n\nThis game right here is rough as fuck\nThese hoes out here about the bucks\nThese fools out here afraid to bust\nI have no fear, afraid of what\n\nAnd in five years I'm comin' up\nFools talk real loud but don't run up\nWhen we come through they'd run it up\nWe still right here, so what the fuck\n\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na\n(Consider this an invitation to my Gangsta Nation)\n\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na\nNa na na na na na na na", "[Verse 1]\nI can't hold back I feel like something's going on\nIt's been a week and we keep walkin' round like nothing's wrong\nMaybe I should just pack my shit and just move along\n\n[Chorus: Unknown Female Singer]\n(Why don't we just, try to discuss, what happened to us, or leave it alone?)\n\n[Verse 2]\nAnd I swear that I can't understand why\nSometimes you like leaving\nAnd sometimes for no reason\nOne day you just stop believing\nBut this time you're gon' see, when I'm gone\n\n[Chorus: Unknown Female Singer]\n(Why don't we just, try to discuss, what happened to us, or leave it alone?)\n\n[Hook: Nate Dogg + Female Singer]\nLove don't love nobody\nLove don't come for free\nAnd if you love somebody\n(Why don't we just, try to discuss, what happened to us, or leave it alone?)\n\n[Verse 3]\nRemember the time, when we was in Mamma's bed with no clothes on?\nWe was O so wrong!\nAnd nobody could tell us shit because — back then we thought that we were inseparable\nAnd now it's just so easy, to watch you go\nNo more confrontations\nNo more constant pages\nI'm sick and tired of always changing faces\nOooh! And it seemed like a life-time\nBut I think it's the right time for me and you to leave it alone\n\n[Chorus: Unknown Female Singer]\n(Why don't we just, try to discuss, what happened to us, or leave it alone?)\n\n[Hook: Nate Dogg + Female Singer]\nLove don't love nobody\nLove don't come for free\nAnd if you love somebody\n(Why don't we just, try to discuss, what happened to us, or leave it alone?)", "Xxplosive\nWest coast shit\nMy nigga-ish ways attract girls that used to turn they back\nCausing me to yank they arm and pose like I would do them harm\nNow I'm saying thank you cause they tell me\nMy shit's the bomb\nXxplosive\nFor my niggas drinking Cognac\nSmoking weed, always pack\nMore than one firearm, chrome rims, riding on\nChronic in your system, let me know my shit's the bomb\nXxplosive\n\nWest Coast shit nigga\nOverdosage imperial pistols ferocious\nFuck a bitch don't tease bitch, strip tease bitch\nEat a bowl of these bitch gobble the dick\nHoes forgot to eat a dick can shut the fuck up\nGobble and swallow a nut up\nShut up and get my cash\nBackhanded, pimp-slapped backwards and left stranded\nJust pop ya collar, pimp convention, hoes for a dollar\nSix-Deuce in a plush, six-deuce impala\nPimping hoes from Texas to Guatemala\nBitch niggas paid for hoes, just to lay with hoes\nRelax one night, and paid to stay with hoes\nCaptain Save'em all day, well save this dick\nBitch nigga, you more of a bitch than a bitch\nYou ain't into hitting pussy or hitting the switch\nYou into hitting bitches off of the grip\nYou punk bitch\n\nAll my real doggs still kick it with me\nAll my down hoes still tricking with me\nAll the true gangstas know\nNate ain't never love no ho\nAll the hoodrats still shake it for me\nAll my true fans still check it for me\nAll the real smokers know\nNate ain't passing nothing but dope indeed\nReal trees, chronic leaves, no seeds\nWhen I met you last night baby\nBefore I blew your mind\nI thought we had a chance, lady\nNo more, now that I'm sober you ain't that fine\nDon't wanna treat you wrong\nDon't wanna lead you on\nHere baby, hit the bong\nWhile the west coast rolls along\nWhile we still making gangsta hits\nYou'll be still jocking gangsta dicks\nDamn girl, you think you're slick\nSomebody better get this bitch, this bitch\n\nI got these freaky hoes\nClapping they hands, stomping they feet\nEvery now and then they put they mouth on me\nNowadays a G like me can't even call it\nA 23-year old pussy fiend and freakaholic\nPimping bitches on the regular, I put that on the G\nA hustler and a player, nowadays it pays to be\nLet me drop some shit about this bitch I used to know\nShe gave your boy the head and said don't let nobody know\nA bonafide pro, I had to grab the ho\nShe got freaky in your sixty-four, I skeeted in her throat\nBeen knowing the ho for four days, pimpin repays\nAnd I bet you didn't know that she go both ways\nShe ate her best friend, I left them hoes at the mote'\nThey be beeping me and shit, but we don't kick it no mo'\nThem hot hoes is fiending, they on the nuts\nBut bitch, I'm out your pussy when I nut, fo' real\nXxplosive", "1 1, 2 2, 3 3, hold up\n\nHere's a story about a man\nA simple man\nA man with a dream\nTo do the world some good\n\nHere's a story for rich and poor\nFor young and for old\nAbout a man from the hood\nTryin' to do the world some good\n\nHere's a story about a man\nAn everyday man\nA man with a dream\nTo be the head of state\n\nHere's a story about a man\nAn eveyday man\nA man with the dream\nTo be the head of state, (state, state) (fade away)\n\nHe feels bad, mighty low\nGot nowhere to go\nWhat can you do when your feeling low\nMan I wanna know\n\nHe feels bad, mighty low\nGot nowhere to go\nWhat can you do when your feeling low\nAnd your car just got repoed\n\nThis is messed up, this realy sucks\nEveytime you do the hood trouble just pops up\nHe doesn't know what he's gonna do\nHe doesn't know what he's gonna do\n\nThis is messed up, this realy sucks\nKeep your head up there's no respect\nLet's just hope the elections not through\nLet's just hope the elections not through\n\nHe feels good things are goin' his way\nIt just might be things are goin' his way\nHe feels good things are goin' his way\nIt just might be things are goin' his way\n\nLook at him now man ain't this great\nBiggest man in town he's the head of state\nThey come from all around just to one hand shake\nLook at him now he's the head of state\n\nTo be the head of state, (state, state) (fade away)\nTo be the head of state\n\nHere's a story about a man\nA simple man\nA man with a dream\nTo do the world some good\n\nHere's a story for rich and poor\nFor young and for old\nAbout a man from the hood\nTryin' to do the world some good\n\nHere's a story about a man\nAn everyday man\nA man with a dream\nTo be the head of state\n\nHere's a story about a man\nAn everyday man\nA man with a dream\nTo be the head of state, (state, state) (fade away)", "[Verse 1: Nate Dogg & (Barbara Wilson)]\nHomie it's rainin'\nTen below zero\nKinda cold outside (Kinda cold outside)\nYes it is cold (Kinda cold outside)\nTornado, hurricane, and high tide\n(And a high tide, and a high high tide)\nI tell you why homie\nHad a homeboy, down with me\nOr so he said (Or so he said, that's what he said)\nYes he did homie\nBut as it turned out\nHe wasn't down with Nate Dogg (No, no)\nHe was down with bread (He was down with bread, all for himself)\n\n[Pre-Hook: Nate Dogg]\nYou know what's wrong\nYou, need to take your bad ass home\n\n[Hook: Nate Dogg]\nIt's never too late, to go back\nTo where you come from, oh homie\nIt's never too late, to go back\nTo where you come from, mmm\n\n[Verse 2: Nate Dogg & (Barbara Wilson)]\nDo you remember home? (Do you remember home?)\nHas it been that long (Has it been that long?)\nSince you been gone? (Since you been gone)\nWon't you come back home\nSeems like it was yesterday (Yesterday)\nWhen you lost your way (When you lost your way)\nAnd let your homies hang (Let your homies hang)\nAll the while you got paid\nDo you respect family?\nDo you know what that mean?\nTo give everythang and not expect to receive\nI gave all I had (All I had)\nIt really makes me mad (Makes me mad)\nTo think I've been had (I've been had)\nLet's forget about the past\n\n[Pre-Hook: Nate Dogg]\nYou know what's wrong\nYou, need to take your bad ass home\n\n[Hook: Nate Dogg]\nIt's never too late, to go back\nTo where you come from, oh homie\nIt's never too late, to go back\nTo where you come from, mmm\n\n[Verse 3: Nate Dogg]\nI will lift my voice\nAnd forever sing\nMusic gives me joy\nMay we always reign\nAnd if I lose my way\nMay my family place\nA foot where I can taste\nA bittersweet embrace\n\n[Pre-Hook: Nate Dogg]\nYou know what's wrong\nYou, need to take your bad ass home\n\n[Hook: Nate Dogg]\nIt's never too late, to go back\nTo where you come from, oh homie\nIt's never too late, to go back\nTo where you come from, mmm", "[Verse]\nJust in case you didn't know, I blow (I blow)\nConstantly for dough\nI'm sittin' next to my heat (my heat)\nFuck peace, as I listen to the beat\nWe came to rock your body, ding ding dong\nWe came to rock your body, all night long\nWe came to rock your body, ding ding dong\nWe came to rock your body, until we go\nWay back in the days when the hottest thang was Jherri curls\nWhen you could always spot a gangsta\nBy the way his hair outgrew his girl's\nThere lived a little boy who wore khakis every day\nHe never would be broke he swore, always to get paid\nUp jump the boogie the bang the bang boogie\nGot them same ol' gangsta ways\nUp jump the boogie the bang the bang boogie\nAnd I ain't the one to get played\n\n[Chorus]\nWho's playin' games? Man I really hope you burn\nWho's playin' games? When I'm gonna get my turn\nWho's playin' games? I don't wanna be left out\nWho's playin' games? You playin'", "[Hook]\nCan't nobody\nDo you like we do\nCan't nobody\nDo you like we do\n\n[Kurupt]\nPistols and penitentiaries\nGangstas on a worldwide hunt for head huntin\nSpead dumping lead busting\nTell me you wanna be done\nIt's so many thangs on these streets\nGang bang on these streets\nHeat holders\nThat hug wit slugs\nAnd it's the thang to be either crips or bloods\nNate show these niggas how it was\nAnd how nobody do it like we does cuz\n\n[Nate Dogg]\nSomething about the west coast\nMakes me bang the beats\nSomething about the west coast\nMakes me run them streets\nSomething about the music\nMakes me wanna sing\nSomething about this chronic\nKnocks me off my feet\nThat's real chronic baby\n\n[Hook]\n\n[Bridge]\nI know you never thought these niggas could be this good\nWe'd be bumping in your system from hood to hood\nI know you never even though we would last this long\nYou were dead wrong\nHomie this is Nate he's a double O.G\nAll up in the place Kurupt\nBetter ask your girl why she staring at me\nLeave me alone\n\n[Kurupt]\nCalicos\nWe ready for the get down\nYou ready to have a sit-down\nBitch nigga sit-down\nRunning in and out ya house\nRunning in and out ya spouse\nDon't say shit or I'll be running in and out your mouth\nGangstas get the party cracking\nHit a land and get it crunk\nNate Dogg and Kurupt\nYeah nigga that's wussup\nNow I gotta show y'all how the west coast rock shit\nConcoct and plot shit\nDogg pound oxes\n\n[Hook]\n\n[Kurupt]\nDPGC\nThe greatest on this earth\nGangsta that was taught shoot before you converse\nGo against the grain and we convert to the worst\nTake flight like eagles\nPuncture like needles\nTouch him without even bein present\nThe greatest on this earth west coast presents\nThe Dogg Pound muthafucking gangsta nigga\nOn all gold feet\nYeah them all gold D's\nWe double O.G.'s\n\n[Nate Dogg]\nSomething about the west coast\nMake me bang the beats\nSomething about the west coast\nMakes me run them streets\nSomething about the music\nMakes me wanna sing\nSomething about the chronic\nKnocks me off my feet\nThat's real chronic baby\n\n[Hook 2X]", "[Hook: Nate Dogg]\nI'm a real P-I-M-P\nAnd I love the way the ladies shake that thang\nFrom a real G-A-N-G\nAnd the haters know this Dogg Pound Gangsta' gang\nNigga you can't fuck with me\nFrom the jump I told you I cannot be faded\nNever been no mystery\nNever took no shit and always got my thang\n\n[Nate Dogg]\nLet me teach you the game man, homie wit' this\nWhen he rockin' ya brain man, gimme a visit\nLet me show you the ropes loc, would she be missin'\nGoin' to smoke you some endo, we keep it pimpin'\nNiggas playin' that hate game, we keep it pimpin'\nNiggas movin' that weight man, we keep it pimpin'\nBitches shakin' that thang man, we keep it pimpin'\nGot one comin' wit' me man, I got love\nI got love for my niggas who be watchin' my back\nNo I ain't got love for hoes who play them games\nYou can check my gangsta files\nI been putting in work since 1985\nGot an angel by my side\nAll my demons always beggin' me to ride\n\n[Ludacris]\nUh, now ever since rappa's had riches, Luda's had bitches\nPimp, get more gums then baby pictures\nMenages wit sisters, veins poppin' out like shrimp, lobster\nA-Town mobster, garage full of 6's, what can I say?\nIf something don't smell right, what can I spray?\nTech-9 incense, say for instance\nSee you in the distance, hit 'em in an instant\nWe so crummy, countin' mo' money\nBut stay strapped up like crash test dummies\nPut 3 to your tummy, 2 to your throat\nAnd bulletproof cars, we ride like the pope\nJust in case, you don't make it home\nYou better super glue grip the chrome\nCause you was talkin' that yap and got put in the bed\nNow it's a frog in ya throat like Ms. Piggy givin' head\n\n[Hook: Nate Dogg]\nI'm a real P-I-M-P\nAnd I love the way the ladies shake that thang\nFrom a real G-A-N-G\nAnd the haters know this Dogg Pound Gangsta' gang\nNigga you can't fuck with me\nFrom the jump I told you I cannot be faded\nNever been no mystery\nNever took no shit and always got my thang", "[Chorus: Nate Dogg and Pamela Hale]\nPeople, where are you going?\nPeople, where are you going?\n\n[Verse 1: Nate Dogg and Pamela Hale]\nEverybody wants to play the game\nBut nobody wants to lose\nI see my people die every day\nThat's why I sing the blues\nNow tell me who wants to roll with me\nTake a look at my world\nI see some problems\nMaybe you can help me solve them\nTurn boys to men\nAnd make women from girls\nI see my loved ones turning to drugs\nAlmost every day I lose another one\nWhere are you going? I ask you one and all\nAnyone can answer\nI betcha' they don't know\n\n[Chorus: Nate Dogg and Pamela Hale]\nPeople, where are you going?\nPeople, where are you going?\n\n[Verse 2: Nate Dogg]\nWhat if I could save my nation?\nWhat if I could save my friends?\nIf I had the whole worlds attention\nWhat if people were really listening?\nI would tell them that I'm no good without them\nI would tell them together we can stand\n(Oh together we can stand)\nAnother message to brothers, colors bother\nI'd introduce them to the hardest man in town\nSomebody tell me please\n\n[Chorus: Nate Dogg and Pamela Hale]\nPeople, where are you going?\nPeople, where are you going?\nPeople, where are you going?\nPeople, where are you going?\n\n(Somebody tell me please)\n\n[Outro: Pamela Hale and (Nate Dogg)]\nWhere are you going? I ask you one and all\n(Where are you going?)\nAnyone can answer\nI betcha' they don't know\n(Where are you going?)\nWhere are you going? I ask you one and all\n(Where are you going?)\nAnyone can answer\nI betcha' they don't know\n(Where are you going?)\nWhere are you going? I ask you one and all\n(Where are you going?)\nAnyone can answer\nI betcha' they don't know\n(Where are you going?)\nWhere are you going? I ask you one and all\n(Where are you going?)\nAnyone can answer\nI betcha' they don't know", "[Hook: Nate Dogg]\nI got game, more game then you can ever conceive\nI don't play, better not be playing with me\nI got hoes (From sea to sea) all around the world (In different area codes)\nI'm so tight, just pass me the Hennessy\n\n[Nate Dogg]\nUp jump the boogie to the bang bang boogie to the rhythm of the boogie dee beat\nI can't imagine all these other motherfuckers think that they got more game than me\nI been all around the world, had every kind of girl, it takes a lot to impress me\nUp jump the boogie to the bang bang boogie, hope you know you're going home with me\nI got pro's from East to West, when I flow I flow the best\nAsk the first motherfucker you see\n\n[Hook: Nate Dogg]\nI got game, more game then you can ever conceive\nI don't play, better not be playing with me\nI got hoes (From sea to sea) all around the world (In different area codes)\nI'm so tight, just pass me the Hennessy\n\n[Snoop Dogg]\nPass me the Henn dogg...yeah\nG-A-M-E that's my thang, and it ain't no rules when you in this game\nFo real, like Shaquille, cause you know the deal, 213 in your motherfuckin grill\nIt's still, D.P.G. now I'm living well off\nDespite a few homies fell off\nI'm on the right track cause I'm the foefather\nBite you on your ass like a motherfuckin Rottweiler\nFlip a new style and reshape and refolder\nHold easy cause it's that ea-sy, believe me\nSnoop D-O-Double-Gee-zee, fall off in the party\nGoing solo and then I leave 'em four bree-zee\nLet's take 'em back to the spee-zee\nThe honey come hide out off the church for the evening\nGood Evening, ladies and gents, players and pimps\nShame on a nigga I run game on a bitch\n\n[Hook: Nate Dogg]\nI got game, more game then you can ever conceive\nI don't play, better not be playing with me\nI got hoes (From sea to sea) all around the world (In different area codes)\nI'm so tight, just pass me the Hennessy\n\n[Rob Stricklong]\nNiggas be talking shit like they got the gift\nTrying to keep up with the Jones's the Yester Smith\nLike a stick shift switch fast on a fag, rucate rap, style ran up the ass\nI'm a give you a pass cause I now that you'sa bitch\nBut next time you trip I'm a prepare the big ditch\nAnd you and a punk should call you're team\nI ran the machine named you off the team\nYou live in a dream nigga picking you to pieces\nOne tech shot leave your crop in love pieces\nSo recognize royalty, poetry in motion, roast MC's like chronic bud leafs\nNothing but thugs and G's when I come around\nMess around put you in a hospital gown\nYou'sa clown, you're sound you're whole shit's plain\nIt all sound the same, nigga you need game\n\n[Hook 2X: Nate Dogg]\nI got game, more game then you can ever conceive\nI don't play, better not be playing with me\nI got hoes (From sea to sea) all around the world (In different area codes)\nI'm so tight, just pass me the Hennessy", "[Intro]\nAnd can no hood fuck with gangsta shit\n\n[Chorus]\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\n\n[Verse 1]\nHey let's party y'all\nAll I wanna do is have a good time\nTonight it's goin' down\nHey just roll it up\nIt don't matter who's at the party\nSomebody's leavin' with me\nHey let's set it off\nI see the girl that I want (that I want)\nI see the girl that wants me\nHey it's gettin' hot\nBut before my body gets bothered\nLet me tell you this about me\nMomma kicked me out when I was sixteen\nWoke up the next mornin' with some D-O-G's\nI felt a little bad but I had money\nWent and bought some dope and some blue khakis\nWhile you were hangin' out in the promised land\nI was growin' up on the Long Beach sand\nSo if you're intentions were to leave with me\nRemember when I'm satisfied\nI'm just as cold as can be, stone cold\n\n[Chorus]\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\n\n[Verse 2]\nDamn this is a cavi beat\nI feel like takin' time on this beat\nTo smash you all\nBut teachers are supposed to teach\nSo I'ma teach and you gon' listen or else you got to fall\nTo battle that's a thing that I've always done\nNever lost a battle that means I'm number one\nDon't hang with cowards cos they always run\nIf you be rollin' with cowards don't forget your gun (ahhhh)\nDamn I really love to compete\nAnother victim I would love to delete\nCome one come all\nTaste the agony of defeat\nBut I know how sneaky niggas can be\nWhen e're they fall\nSome niggas try to take my cash\nDumb niggas try to make me blast\nThese days it's kinda hard to laugh\nI gotta host of new friends I never had in the past\nSome niggas try to take my cash\nDumb niggas try to make me blast\nThese days it's kinda hard to laugh\nI gotta host of new friends I never had in the past\nStone cold\n\n[Chorus]\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\nStone cold baby\nStone cold baby\nStone cold baby\nAs cold as can be\n\n[Outro]\nHey let's party y'all\nAll I wanna do is have a good time\nTonight it's goin' down\nHey just roll it up\nIt don't matter who's at the party\nSomebody's leavin' with me\nHey let's party y'all\nAll I wanna do is have a good time\nTonight it's goin' down\nHey just roll it up\nIt don't matter who's at the party\nSomebody's leavin' with me", "[Verse 1: Daz]\nI ain't got no time for no bitches, I gotta clock my dough\nClownin', hittin' switches in a green 6-4\nWith the drink in a on deck and the bombest indo\nA car full of gas and nowhere to go\nI gets a call on the phone, \"What's happenin'?\"\nPimpin', chillin' with bitches drinking Silver Satin\nIs them bitches on deck, on deck to the fullest\nGots that type of game and I'm know just to pull 'em\nNow as I stroll and as I pass by\nI'm maxin' with my doggs feelin' dandy and high\nIs that looney muthafucka that they call Kurupt\nBallin' out the house with some Gin in his cup\n\n[Verse 2: Kurupt]\nNow I found myself blowin' out smoke\nBombed out looney and locced\nOpen up them doors let me see some of them hoes\nIt's Kurupt and I'm liable to fuck three or four\nI'm hittin' hoes like I'm hittin' licks\nBut I don't love that trick bitch\n'Cause bitches gettin' niggas dick sick\nI don't pay rent, my rent gets paid\nI pimp hoes like silky train\nOn and on it goes\nI thought these muthafuckas knew, but now you know\n\n[Chorus: Snoop Dogg]\nLove, puppy love\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nLove, puppy love\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\n\n[Verse 3: Nate Dogg]\n1975 I was just a young pup\nTryin' to learn to be a dogg\nBut in the process steadily gettin' fucked\nI met this lil' sexy dame\nY'all before I knew, all the rules to the game\nIt ain't no need to lie\nA lil' nigga like me got played, and if she left me\nI thought I'd die\nY'all don't ask, I don't the reason why\nThought she was sent from the heavens above\nY'all it's just a bad taste of puppy love\n\n[Chorus: Snoop Dogg]\nLove, puppy love\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nLove, puppy love\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\n\n[Bridge: Nate Dogg]\nSometimes I sit and think of how I used to be\nBefore I got converted to a D-O-double G\nI'd like to thank that girl from way back in the days\n'Cause if it weren't for you I wouldn't pimp this way\n\n[Chorus: Snoop Dogg]\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nPuppy love, call it what you want, biatch\nLove, puppy love\nLove, puppy love\nLove, puppy love\nLove, puppy love\nLove, puppy love\nLove, puppy love\nLove, puppy love\nLove, puppy love\nLove, puppy love\nLove, puppy love", "Nate Dogg (echo)\n\n[Chorus: Nate Dogg]\nI think she's tryin' to hide it\nI know she's so excited\nTime for some bump and grindin'\nI think she wants to ride it\n\n[Chorus: Girl]\nYou think I'm tryin' to hide it\nYou think I'm so excited\nWell boy I can't deny it\nAllthough I'm tryin' to fight it (She can't deny it)\n\n[Rob Stricklong]\nThis chick is thick\nShe got a fat ass rub it back and forth from the tip of my dick\nHead, horse and thick with real big titties\nThe finest one I done seen in three cities (I know)\nShe's a pro, lovin' this bomb diggy\nGot plans of makin' her my kiddie\nBut she don't understand, I come from a land\nThere's program to show bitches no pitty\n\n[Nate Dogg]\nEverytime I walk down the street\nA bunch of women lookin' at me\nCould it be my F-A-C-E\nOr could it be my fuckin' money\nEverytime I open my door\nMan I swear I see another hoe\nI didn't see them hoes when I was broke\nI'm really glad I got some indo\n\n[Chorus: Nate Dogg]\nI think she's tryin' to hide it\nI know she's so excited\nTime for some bump and grindin'\nI think she wants to ride it\n\n[Chorus: Girl]\nYou think I'm tryin' to hide it\nYou think I'm so excited\nWell boy I can't deny it\nAllthough I'm tryin' to fight it (She can't deny it)\n\n[Rob Stricklong]\nDon't fight the feelin'\nMy stick ain't to short, I be in there like a Newport\nGivin' me sky cap, don't try to hide that\nDeep though, bust a no got my gym hat\nArmed Rob in the swiftlah of slim cat\nYou can catch me in the spot we're the tens at\nPull the tightest one, before the night is done\nI'll be back, where here friends at\n\n[Nate Dogg]\nFuck Halloween main this ain't no prank\nShow me your way to make me some bank\nMilitarian she got no rank\nShe in control, yeah that's what she thank\nShe thank she tight but she ain't\nShe act like a coochie, don't stank\nI keep it real cause I ain't no fake\nGive me a bad girl, drank and some dank\n\n[Chorus: Nate Dogg]\nI think she's tryin' to hide it\nI know she's so excited\nTime for some bump and grindin'\nI think she wants to ride it\n\n[Chorus: Girl]\nYou think I'm tryin' to hide it\nYou think I'm so excited\nWell boy I can't deny it\nAllthough I'm tryin' to fight it (She can't deny it)\n\n[Rob Stricklong]\nListen up baby, I'm a lieutenant\nAnd me and Nate Dogg will shake y'all in a minute\nIf we ain't gettin' in it, it's a done deal\nAnother spot to feel, runnin' the mill\nI keep my rubber, you stay on a pill\nRockin', non stoppin', keep lockin'\nIn the bed got the headboard knockin'\nI like a chick that'll do what she feel\n\n[Nate Dogg]\nWhatever you do girl don't get drunk\nAlready used a bad excuse once\nShe fillin' up better grab her damn cup\nShe gonna find Hennessy ain't no punk\nShowin' out just to get what she wants\nDon't even drink girl hear it this one\nI know you smoke so you don't need to front\nNate dogg about to beat this thang up\n\n[Chorus: Nate Dogg]\nI think she's tryin' to hide it\nI know she's so excited\nTime for some bump and grindin'\nI think she wants to ride it\n\n[Chorus: Girl]\nYou think I'm tryin' to hide it\nYou think I'm so excited\nWell boy I can't deny it\nAllthough I'm tryin' to fight it (She can't deny it)\n\n[Nate Dogg & Girl]\nI think she's tryin' to hide it (She can't deny it)\nYou think I'm tryin' to hide it (She can't deny it)\nI know she's so excited (She can't deny it)\nAllthough I'm tryin' to fight it (She can't deny it)", "[Verse 1]\nI was almost head over heels\nI was almost the man of your dreams\nAnd you almost had me sprung\nYou were almost my only one\n\n[Chorus 2]\nJust about had me hooked, 'til I had to take a second look\nAlmost in love\nJust about had me hooked, 'til I had to take a second look\nAlmost in love\n\n[Verse 2]\nGirl you almost made me change my code\nAnd you almost made my pockets grow hoes\nNot only did you almost\nMake me buy you gold\nDowntown you almost make me go\n\n[Chorus 2]\nJust about had me hooked, had me dippin' in my pocketbook\nAlmost in love\nJust about had me hooked, 'til I had to take a second look\nAlmost in love\n\n[Refrain]\nAlmost in love\nAlmost in love\n\n[Verse 3]\nThe roses we picked just yesterday\nSeemed to have wiltered away\nAnd we've been on the ground\nLooking for a four-leaf clover but there's been no luck\nBaby I guess it's over\nBut we almost make it to the finished line called love\nAlmost and there's no need to raise our voices\nUnless we're singing in harmony\nBut we're not cause there's no harmony\nBut we almost make it Almost\n\n[Outro]\nAlmost in love\nAlmost in love\nAlmost in love\nAlmost in love", "[Nate Dogg:]\nI Don't know about tomorrow\nWho can say what it brings\nI do know that it's Christmas (know that it's Christmas)\nAnd I can remember the joy that Christmas brings\n[Butch Cassidy:]\nWhat better day to spend with your family\nBring your present we'll trade\nLittle children around me\nSince we're gathered here together won't you help me sing (help me sing!)\n\n[Chorus:]\nFa la la la la la laaaa fa lalalalaaaa\nFa la la la la la laaaa fa lalalalaaaa (oooohewooo)\nFa la la la la la laaaa fa lalalalaaaa (noooow)\nBe Thankful for the gifts your receive (yeeaaaah)\n[Butch Cassidy:]\nBlessed are those who receive\nAll of their Christmas dreams\nI can't complain\nAnd I'm hoping that's the way it remains\n[Nate Dogg:]\n(all the pain) all of the pains life brings\nSometimes we need to sing\n'Till the day we finally leave\nTogether if you sing along, the pain will ease! (ease the pain)\n\n[Chorus:]\nFa la la la la la laaaa fa lalalalaaaa (today)\nFa la la la la la laaaa fa lalalalaaaa (oooohewooo)\nFa la la la la la laaaa fa lalalalaaaa (noooow)\nBe Thankful for the gifts your receive (yeeaaaah)\n\n[bridge: Nate Dogg]\nBe Thankfuuuuul (everyday of your lives)\nBe Thankfuuuuul (give thanks)\nBe Thankfuuuuul\nBe Thankful for the gifts you receive! (yeeeaaahhh)\n[Nate Dogg:]\nThis morning I woke up with a reason to (falalalalala) sing (reason)\nThis morning I woke up, to an ugly (falalalalala) Christmas Tree (come on)\nThis morning I woke up, (falalalalala) no presents were there for me\nBut This morning I woke up and could breeeeeeath!! (need to learn to thank him don't we)\n\n[bridge (over first Chorus): Nate Dogg]\nBe Thankfuuuuul (I don't feel the pain no more)\nBe Thankfuuuuul (today)\nBe Thankfuuuuul\nBe Thankful for the gifts you receive! (yeeeaaahhh)\n(Need to learn to thank Him don't we)\n\n[Chorus:]\nFa la la la la la laaaa fa lalalalaaaa\nFa la la la la la laaaa fa lalalalaaaa (oooohewooo)\nFa la la la la la laaaa fa lalalalaaaa (noooow)\nBe Thankful for the gifts your receive (yeeaaaah)\n[fades out]", "[Chorus: Nate Dogg]\nI'll bring the bag of weed\nYou can bring the bottle of wine\nCall me whenever, we can get together\nAnd have us a real good time\nI'll bring the bag of weed\nYou can bring the bottle of wine\nCall me whenever, we can get together\nAnd have us a real good time\n\n[Verse 1: Nate Dogg]\nIt's still morning\nI'm still yawning\nOutside my window\nSomeone's calling\nHer name was Micky\nHabits freaky\nShe liked to do me\nHer and her homeys\nDid I mention\nThat I'm balling\nRollin' on gold ones\nThat's right, crawling\nThat's why she's jocking\nEarly this morning\nI'm feeling under the weather\nI'll soon be feeling better\nDon't forget the paper this time\n\n[Chorus: Nate Dogg]\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n\n[Verse 2: Tray Deee]\nCall me whenever, but never ever after 10\n'Cause I got to be at home with my bitch and my kids\nI hit the skin flip the twin lips of love apart\nGet to diggin' in ya ligaments then bust ya heart\n'Cause from the start, soon as we sparked the bag I brought\nI seen you chokin' through the smoke noticed your titties was taut\nYou caught, up in the game that I came to spit\nI cracked the Hennessey and entered DP gangsta shit\nYou wanna get with this, or is you in to twist\nThe game up and make me cum just to say you came up\nAnd gained what another strike on your rap\nWhen you coulda kept your mouth shut and right on the step\nWith the program knowin' damn well you wrong girl\n'Cause I shook you and took two of your homegirls\nYou played yourselves so I had to leave\nBaby shoulda just chilled off this bag of weed\n\n[Chorus: Nate Dogg]\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n\n[Bridge: Nate Dogg]\nI can bring the fat ass bag of weed\nI just now left the spot\nYou can bring the cold ass bottle of wine\nAnd make that your first spot\nI can bring the fat ass bag of weed\nI just now left the spot\nYou can bring the cold ass bottle of wine\nAnd make that your first spot\nI can bring the fat ass bag of weed\nI just now left the spot\nYou can bring the cold ass bottle of wine\nAnd make that your first spot\nI can bring the fat ass bag of weed\nI just now left the spot\nYou can bring the cold ass bottle of wine\nAnd make that your first spot\nI can bring the fat ass bag of weed\nI just now left the spot\nYou can bring the cold ass bottle of wine\nAnd make that your first spot\nI can bring the fat ass bag of weed\nI just now left the spot\nYou can bring the cold ass bottle of wine\nAnd make that your first spot\n\n[Chorus: Nate Dogg]\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time\n(Somebody's calling)\nI'll bring the bag of weed\n(outside my window)\nYou can bring the bottle of wine\n(somebody's calling)\nCall me whenever, we can get together\n(outside my window)\nAnd have us a real good time", "Yeah bitch\nWhere go the blaze at?\nThat's right, yeah\nRide with me, yeah\nWalk a block with me\nOn the heist with me\nRepresent with me\nYo, ride with me\nWalk a block with me\nOn the heist, with my heist with me\nRepresent, yo\n\nWhen I wake up in the morning, when I get up out of my bed\nAt all times I remain a hustler, at all times I be chasing my bread\nSince this one's for my people, I'ma make sure you heard what I said\nDaddy say speak loud and clearly, daddy say aim for the head\nI think we all to cool to lose it, I say we all stay leveled instead\nI say still we tame the hookers, I know we still eluding them feds\nWe make this one for the Negroes, and for the Caucasians who care\nThey say they treat us like we equal\nI say they treat us like we just don't care\n\n[Chorus]\nWhen I wake up in the morning\nWhen I get up out my bed\nI will always be a hustler\nI will always chase my bread\nSince this one's for my people\nI'ma make sure you hear what I said\nI'm gon' speak so loud and clearly\nI'm gon' aim straight for yo head\n\nYo, I wake up late but still got currency\nDreams, snooze button no I'm trying to sleep\nI got bill and the ends ain't trying to meet\nSo I'm pressed for cash and I'm out of my league\nYa' see, times ain't the greatest and I ain't Ali\nSo my hours are nine to five and my job's the street\nI'm in a low position trying to hope these mission\nCrenshaw when exposition feeling holiday wishin'\nAnd the block West stat and the spot we sure have\nRallies on Manchester, Inglewood on Saturdays turn to night\nShade always been the type to show love to those whom always doin' right\n\n[Chorus]\nYo, it don't matter where you from\nNot knowing not where you been\nCan't go to sleep a child expect to wake a man\nYo, life is a lesson niggas who don't study\nEnd up failing test and blame it on me\nBut see Sheist only gets what he claiming to be\nA real quiet motherfucker with his heart in the streets\nHot in these beats, flow sell a lot in a week\nSo even Billboard couldn't drop my highest of peaks\nI'm with the breaks so you knowin' what they saying to me\nI'm impressed how many people end up hating on me\nLike a disease Shade hittin' wit' a new vaccine\nI leave 'em comatose falling asleep\n\n[Chorus]\nReal talk\nReal thangs\nReal people\nWake up", "[Intro/Chorus: Nate Dogg]\nOne to the other, other two to the three\nOn the mic is N-A-T-E D-O-double-G\nStill chasin paper, still runnin them streets\nI never trust a hoe because I know what they be\nOne to the two to the three to the fo'\nBaby when you need let me come in the back do'\nShe's still a bad bitch but I don't love her though\nOnce I hit it once I'd rather leave her alone\n\n[Memphis Bleek]\nUhh! Aiyyo I'm worldwide respected\nYou know the G4 flies international, niggas flyin domestic\nI been around the world, seent many faces\nBut better yet I got head from difference races\nAnd I don't trust 'em as far as I can throw 'em\nI murder with no motive, I hit 'em and don't know 'em\nI just, sneak, and send 'em right back home\nThat's Bleek, not your hubby ma, I'm not like home\nBut dig it, the truth hurt, they be addicted to the didick\nI dig in it, they one shot and live with it\nBut mami vacate premises\nThe head straight chiller man invite all my niggas in\nNate and Free, I might make you my lil'\nDrug hoe if you can take a D\nMami, and run with it cause I had my fun with it\nIt's S-P, D-G-L and Nate we done with it\n\n[Chorus]\n[Freeway]\nYeah, me and Nate Dogg just skate off\nWith two chicks and they both freaks eager to bone, yeah\nI'm tryin to scrape one and split, she tryin to get to my home\nShe got a thing for rap stars and athletes\nShe tryin to chill with the clique, wantin to hop on the phone\nAll in her men's truck, callin her friends up\nBut Free don't go for that, or go for chicks\nThat hang at clubs, ball games and track meets\nFree don't like no groupie-ass bitches\nSo if you got your eyes on my digits better keep goin\nKeep mo'n, and if you tryin to with Freeway\nKeep paper, and when you give met, keep goin\nWe smokin, backwoods keep rollin\nThat's why a nigga higher than the skyscraper\nOne to the two and three to the four\nIf you fuck with the raw I'll tie your neighbors up\n\n[Chorus]\n[Young Chris]\nYeah, you rockin with with the R-O-C\nWhat you coppin ma it's all on C\nYou can call on me when you havin hard times\nI hustle at all times, you welcome to all mine\nThat's only wifey though, the rest of y'all triflin hoes\nDon't get a dime, get your mind right your mic and go\nOne to the two to the three to the four\nMami it's one to the two to the three in my Porsche\nAnd me, we tryin to see if you can take on us all at once\nAnd stay P ma, you breakin us off for free\nI holla back ma, it's Free, Weezy, easy\nYoung gunna, Nate Dogg a wild on track\nMy niggas is skeetin, we hittin we leavin\nY'all, love 'em and hug we forget 'em and flee 'em (that's right)\nWe don't need 'em if they ain't breakin with the team\nCause they ain't nothin fuck 'em relationship a misdemeanor\n\n[Chorus - repeat 2X]", "[Intro: (Nate Dogg)]\n[Cough] How much money do you have, baby?\nCount it out, count it out\nOh no, a-ain't no marriage in this\nShe too broke\n\n[Verse 1: (Nate Dogg)]\nOne to the two to the three to the four\nWhen you see the big dog, Give the doggy his bone\nCouple fucking lines and they're mind is blown\nI'm just making sure the fucking mic was on (1,2... 1,2)\nBig Dick Willy standing next to you\nAfter meeting me, ain't nothin' you won't do\nYou like the crazy sexy little things I do (Like a)\nSmokin' weed while I'm sexting you [cough, cough]\nNigga's won't [?] so I r'ic r'ic row\nNigga's won't bust cuz they ain't that poor\nTake the hottest nigga's girl cuz I'm just that cold\nNigga's talk shit so I s-st-stole\nNow a nigga callin' on my cellular phone\nMad at a nigga cuz his couchie is gone\nMad Doggin' me like his bitch ain't grown\nHad a bad bitch but her hair wasn't combed\nI really didn't need her so I let her go\nEven though I could've stomped a nigga, word is bond\nI keep saying to my self, \"I got a million hoes\"\nPlus, she really wasn't worth it so I just moved on\n\n[Verse 2: (Armed Robbey)]\nWho wanna get it?\nWhen I grab the mic, I give it\n100% Every fuckin' time when I spit it\nI dropped a load and got ya'll thinkin' that I shitted, (Ooohweee)\n[?], If it's funky then I did it\nMy style is rough, full of bumps and dibits\nYa'll be talking, I think, while I live it\nI visit some cheap hotels, most exquisite\nTravel like a P-Ball player movin' his pivot\nWhere the pirate of Philly cap? It was fitted. (Nigga)\nForever to the streets, I'm commited\nMy business of being number one, is real vivid\nYa'll know the truth even though you won't admit it. (Nah man)\nYou got a problem on our ride, you better quit it\nI'm ludacris, I throw a bow like I'm Riddick\nAnd watch the blood go down from your head from when I split it\nAnd guarantee that when I'm charged with it... I'm a quit it\n\n[Verse 3: (Xzibit)]\nXzibit, made from the best up in the Universe\nI bust first and make the crowd disperse\nThe worst thing you ever seen in your life\nLike seein' a pregnant bitch buy rocks and hit the pipe\nIt ain't like I have tried to tell ya. (shhh)\nMisery love company, keeping the wrong company brings failure\nI got a billion lies to tell ya\nCuz ya'll can't handle the truth, here's the proof\nNobody sings better than Nate (Heeey Ohhh)\nIt's a mistake when you hate and disrespect the golden state\nI go straight for the jugular vein\nWho got game like a castrated man that you cannot hang\nAnd havin' no nuts is a fucked up thing\nGet your head outta you're ass and use your brain\nIt's a short ride to the top and a long way down\nRoll it up, take a few puffs, and pass it around\n\n[Chorus: (Nate Dogg)]\nI like that ass, so back it up (Heeey Ohhh)\nIf the boys start acting up\nGive them what they want (Hey Oh, Hey Oh)\nWhat they want (Hey Oh)\nThey want (Hey Oh)\nThey want ([3x:] Hey Oh)\nYou know all day we be givin' it up (Heeey Ohhh)\nBig drawers, Big Dreams, we be livin' it up\nGive them, what we want. (Hey Oh, Hey Oh)\nWon't stop now, we'll never stop ([x3:] Hey Oh)\n[2x:] Heeey Ohhh, Hey oh, hey oh, hey oh, hey oh, hey oh, hey oh", "[Intro: Daryl & Kevin]\nKevin, this is Daryl from Long Beach\nMan uh, I was wondering if you could uh, play a song for me\nMe and my lady goin' through a few thangs, see\nAnd I'm not feelin' very well right now\nYeah, I hear ya, I know how you feel\nI've been there, hell we've all been there\nFor you and all you playaz who got bumped off the playin' field\nThis is the song for you\n187.4 on your FM dizzal, WBALLZ\n\n[Chorus: Nate Dogg]\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\n\n[Verse 1: Nate Dogg]\nPimpin', hustlin', playin' hoes is all I know\nWith my homeys on the mash and a pocket full of cash\nWhat more can a nigga ask for\nWith my strap in my lap and my niggas back to back\nA muthafucka didn't wanna see me\nThen along came his girl, finest woman in the world\nThat broad been to my knees\n\n[Chorus: Nate Dogg]\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\n(Now I, don't trust no hoe\nAnd do you, know that's how it goes\nI never thought you were the one\nThat would try to get a nigga like Ms Spunk)\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\n\n[Bridge]\nI know you're all in big ones from the start\nI really didn't need to, play your heart\nBut you still have the good looks, DPG blood\nYou're the only one that, I love\nMake me wanna climb up DPG\nMake me wanna moan, make me wanna scream\nMake me wanna climb up DPG\nMake me wanna moan, make me wanna scream\nMake me wanna climb up DPG\nMake me wanna moan, make me wanna scream\n\n[Interlude: Big Pimpin Delemond]\nSee as I say it, something about the power of the pussy\nIt even breaks gangstaz down\nBitch tricked me out of my playaz license\n\n[Chorus: Nate Dogg]\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\nA dirty ho's drawls\nThat was the cause of it all\n\n[Outro: Nate Dogg]\nI'll get over you\nI gotta get over you\nBefore I've been a fool\nI gotta get over you\n(Dirty ho's drawls)", "[Intro: Fabolous]\nYeah, recognize and realize\nThis is serious pimpin goin on\nThe game ain't ready, for Nate D-O-double-G\nLil' M-O, Fabolous\nWe 'bout to pimp the damn thing\nLike it's never been pimped before, you feel me?\nYeah, uhh\nFrom the Westside, to the Eastside\nTo the Dirty South, to the Midwest\nC'mon, let's ride, peep game\nYell at 'em Mo!\n\n[Chorus: Lil' Mo (Nate Dogg)]\nI'm gon' treat this game like a hoe\nAnd this trick better have my money fo' sho'\nI'm a player, gangster, pimp and a rolling stone\nAnd I ain't gonna let it go, that's why\n(I'm gon' treat this game like one of my pros)\n(Wanna be number one so anything goes)\n(But my tactics they just can't be exposed)\n(Can't be exposed)\n\n[Fabolous]\nYeah yeah uhh yeah uhh yeah ghetto\nThis kid was enforced by strict parents\nDon't flow for nuttin less than a cross and sick earrings\nA Porsche with sick steering\nNever mind the cost to get clearance\nFor me, if you ask what I cost an appearance\nI'm a pimp, of course your chick's sharin\nI got lawyers, who never lost in fixed hearings\nI need seven figure offers to sign\nCome out your pockets like your needs will be officer blinds\nI send the Street Family and your offer's for mine\nWith blocks, that look like police officer Conn\nIslip's a author of mine, once these slugs is in your head\nDoctors won't be able, to get 'em off of your mind\nHow they gon' take me off of my grind\nThese yellow and white stones glowin somethin awful in mine\nEven if they don't understand the flow, they understand the dough\nTell 'em I said they don't get a hundred grand then go!\n\n[Chorus]\n[Icarus]\nUh-huh, uhh, Icarus, Bushwick, GMG, yo\nNate got all the chickenheads from Medina on the weiner\nCause I hide the nina, inside the Beamer\nI'ma treat this game like a hoe on Hunt's Point\nThey don't have my dough I'ma snipe 'em gunpoint\nMy name Icarus, game ridiculous\nGet in your house quicker than St. Nicklaus\nMe rockin Nate like we need bitches\nCome through lookin evil, three 6's\nGMG, king of the remixes\nAnd music pah is broke we fix it\nAnd we equipped with (what) heat that if we squeeze\nIt'll bring police from three districts\nN.Y. to L.A. we get chicks\nThat smoke haze and drink Ih liquid\nY'all know the flows I be sick with\nIca the Don, trick I be pimpin\n\n[Lil' Mo]\nCause I got this game, right where I want it\nAnd it better have my money\nOr it's gonna get ugly\nYes it's gonna get ugly, that's why\n\n[Nate Dogg]\nThe game is to be sold, not told\nThe tattletale will always be broke\nYou live and learn, just live by the code\nIf you, don't already know\nThat's what it takes now\nRaise the stakes now\nDon't be fake now\nKeep it real (keep it real)\n\n[Outro: Nate Dogg (Lil' Mo)]\nI'm gon' treat this game (you better have my money)\nLike I beat this game (you better have my money)\nWon't leave this game (I'm a player...)", "[Intro/Chorus]\nIt's a party y'all, tear the roof right off\nBounce with the double O-G\nAlllllllll night looooong\nGet off the wall, all of y'all\nWake up all the people who sleep\nAlllllllll night looooong\n\nLet's grooooooove lady\nI don't wanna sleep with you, but maybe later on I do\nToo smoooooooth baby\nC'mon let me dance with you, girl I like the way you move\n\n[Interlude]\nHome after a hard day's work\nI wanna see the mini skirt\nTonight I wanna take you out\nI wanna know what you about\nI need to grab some juice and gin\nI need to call a couple friends\nI want to see you shake it and\nI hope this party never ends\n\n[Chorus]\nWhere else would I go? What else would I do baby?\nIt's a party with you lady, ahhhhhhh\nI know you want to, it's all up to you baby\nWe can party all night baby, ahhhhhhh\n\n[Interlude]\n\n[Chorus]\nThis party won't stop (all night long)\nLet's take it to the top, all night long (all night long, all night long)\nThis is where I wanna be, my loved ones and me\nAll night long (all night long, all niiiiight)\nGo ahead get off the wall, tear the roof right off\nAll night long (all night long, allllll, all night)\nWelcome one, and welcome all, to the city by the deep blue sea\nWhere they party all night long, all night long\n\n[Chorus]\n[Outro]\nAll night [5X]", "[Skit]\nGuard: Right this way, ma'am. Lockdown's on the other side of this cafeteria here, just stick close to me. Anybody looks at you strange, you just let me know, OK?\nWoman: OK\nGuard:Hold on a second. Y'all just shut the Hell up. You want a 115 be a lockdown all week? Yeah, that's what I thought. Right this way, ma'am. It's right this way. Welcome to Death Row, This is the last stop for all the scum of the Earth. These people ain't worth a damn in here. Oh, here's your guy's vacation spot right here. Step right in\nWoman: By myself?\nGuard: Aww, don't worry about it, we always keep chains on these Death Row boys and plus I'll be right outside here\nWoman: Mr. Nate Dogg, may I call you Nate? I just wanna ask you a few questions, do you mind if I record this conversation?\nNate: No, I don't mind at all\nWoman: I don't know if you're aware of this or not, but I'm a pretty big fan of yours and I've been following your career since you were sentenced to Death Row\nNate: Right\nWoman: And I've noticed a lot of people starting to jump on the G-Funk bandwagon, um...\nNate: Haha, that's right\nWoman: ...proclaiming to be from the G-Funk generation. How would you like to address that?\nNate: Well, you gotta do what you gotta do to eat\nWoman: Hehe, Nate, I hope no offense is taken by this next statement, but it doesn't look like you'll be around much longer and in my opinion, when you're gone, it's going to be very difficult to ever get the true meaning of G-Funk. So as a last request for the millions of people who love and respect your music, could you please give us the true definition of G-Funk?", "[Verse 1: Nate Dogg + Timbaland]\nWhen I stepped off in the club (when you stepped off in the club)\nMy system full of bud {nigga what?}\nThey say the big Dogg's in the house (the big dog's in the how-house)\nNate Dogg 'bout to turn this part out (c'mon, c'mon)\nWhen I crept up on the scene (when you crept up on the scene)\nLookin real fresh and clean, know what I mean? (I know what you mean boy)\nGirls just cain't resist (naw, naw, naw)\nThey wish they had a baller just like this (f'real)\n\n[Hook 2X: Nate Dogg]\nI ain't slept for two days\nThat's right, day befo' yesterday\nI got caught all up in this game\nAnd I never will be the same - it's a gott damn shame\n\n[Verse 2: Nate Dogg + Timbaland]\nWhile I'm livin this ghetto life, livin this ghetto life (this ghetto life)\nWhile I'm livin this ghetto dream, this ghetto dream (ge-ge-ghetto dream)\nI'm lookin fo' a ghetto wife (huh, ghetto, ghetto wife)\nI'm lookin fo' a ghetto queen, you know what I mean?\nNow her friend told her I'm the mayne - her friend told her I'm the mayne\nShe lookin at my platinum chain, it's a shame - a God damn shame\nShe got her eyes all on the prize, I wonder why (I wonder why)\nShe wanna soak up some of this game (some of this game)\nIt's a God damn shame\n\n[Hook]\n\n[Verse 3: Nate Dogg + Timbaland]\nWe about to have a ball (have a ball) have a ball\nShe's gotta have it y'all (have it y'all) don't stall\nCome and get it if you want - come and get if you want\nI know you fine but I'm the boss, take it off (take it off girl)\nI'm gonna say it one more time (one, mo', time)\nTake it off or I can find another dime (another dime)\nShe's lookin at my Gucci watch (my Gucci watch, my Gucci watch)\nWhile her friend is lookin at the bulge all in my crotch\nIt's a God damn shame\n\n[Hook]\n\n[Verse 4: Nate Dogg + Timbaland]\nYou know we do it just cause we can - just cause we can\nNate Dogg and Timbaland (Timbaland) God damn~!\nSmooth like Silky Slim (yeah, c'mon)\nTwenty-fo' inch rims, they still spin - it's a God damn shame\nIt's the only way to roll; only way to roll (say what, say what)\nStrapped up and 'bout to go - way too cold (what'd you say boy?)\nNobody does it like we does (naw, nope!)\nBut it's gon be what it is, what it was (know what it was)\nI don't care what those other people say (naw, naw)\n(I don't care)\nI shall remain a Dogg Pound Gangster the rest of my days\n(I don't care)\nAnd when them silly-ass women get to standin in my face\n(Naw) They all in my face\nI give 'em what they came here for and send 'em on their way\n(Beat it girl, beat it girl)\nIt's a God damn shame!\n(Just leave me alone, and let me be to myself)\n(Just leave me alone, and let me be to myself)\n(C'mon, you know what I'm sayin girl?)\n(Beat it, Nate Dogg, Timbaland)", "(feat. Snoop Doggy Dogg, Warren G)\n[Nate Dogg]\nFriends, how many of us have them\nFriends, how many of us have them\nFriends, how many of us have them\nFriends, how many of us have them\n[Snoop Doggy Dogg]\nEvery since I could remember\nI had friends I could depend on\nClothes to lend 'em\nBut as time went by\nMy life got a little strange\nAnd the rules of the game seem to change\nTrust, honesty and devotion\nAnd money, money, money is the poison potion\nThere's no way that I can even say\nThat this game has been good to me\nOr even bad to me it had to be\nCause tragically the way this shit\nCracked off for Doggy Dogg was magically\nAnd now I'm gettin' everything I'm supposed to get\nBut my friendship with niggas always ends up as bulshit\nI listen to my momma though\nShe always tried to prepare me\nByt how could she do what I\nI mean I'm do or die\nBut my life on the streets\nThat shit is suicide\nSo to cope I got a dogg and a locc\nAnd keep my heat close in case these jokes go for broke\nI'm mashin' with the click 2-1-3 that is\nThey my homeboys ever since kids-\nReal friends to the end\n\n[Chorus (Nate Dogg):]\nHangin' out with my homies and I'm feelin' just fine\nI've been ponderin' lately\nA lot of different things on my mind\nIt seems lately my friends list\nDone took a slight decline\nAnd if you wanna know the trith man, man\nThem wasn't no friends of mine\n[Warren G]\nYou jackin' me up, you takin' my cash\nAll my life L-B-C, for my city I mash\nAll those OGs and BGs and wannabies and L-O-Cs\nThe only friends I got is my 2-1-3s\nThat's my nigga Snoop D Woop and my nigga N-A-T-E\nI can't forget about my nigga H to the Deezy\nPressure and strikes\nDon't wann take no lives\nBut these jaws, cracks and hood cracks\nWill make you break bizacks\n\"Whussup homie, can I borrow some cash?\"\nLast week I agve you 500, so kiss my ass\nI got a baby to feed\nA familly to see through\nAnd shake busta snitches tweekin' like you\nHomies and friends that's what they for\nStayin' tight and money right\nAnd bustin' with a 44\n\n[Chorus (x2)]", "[Skit]\nPriest: Heavenly Father, I bow before you today to ask you to forgive this man for his sins. For it was you who said, Father, \"For all have sinned and come short of the glory of God.\" Oh Lord, grant him a pass into your kingdom, into your kingdom, Father. Give him the strength to walk through The Valley of Death, directly into your arms. In Jesus name pray, Amen\nGuard: Alright, let's go\nPrisoner 1: Hey dog, that's fucked up what you doin' to Nate, man. Y'all ass will never get me like that\nPrisoner 1: You ain't seen nothin' yet\nPrisoner 2: Hey Nate, stay up dogg\nPrisoner 1: Yeah\nPrisoner 2: I'll see you soon\nPrisoner 1: You sure will\nPrisoner 3:  Save me a spot up there Nate\nGuard: Right. Be sure to smile for the camera. Excuse me, move to the side, move to the side. Right this way, come on, move out, move out, move out. Alright, hold on, let's get these chains off of him. Have a seat. Yeah, you ain't got One More Day no more, do ya? Just sit on back and relax. It'll be over real soon. Well son, nothin' left to do now. You got any last words?\nNate: Yeah, I got some last words", "(Chorus) x2\nThese days, you gotta be strapped\nI'm already knowin ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound\n\n[VERSE 1: Nate Dogg]\n\nI believe I got good skills\nWe been makin music since we were kids\nThats all I wanna do, for life\nKeepin it real until the day I die\nObstacles get in my way\nContinue to mash and dont forget to pray\nI keep my hand on my steel\nBecause I love my life and I always will\nWhatever people say to me\nI take it in stride I'm thinkin negro please\nIf you really dont know me\nThen you best back up, I suggest strongly\nYes sir this is DPG\nUntil the day I D-I-E\nFor my L-I-F and E\nNo matter where I look thats all I see\nAnd I know...\n\n[HOOK (2x)]\nThese days, you gotta be strapped\nI'm already knowin ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound\n\n[VERSE 2: Nate Dogg]\n\nMany women cling to me\nIs it cause they see me on BET\nCuz everybody knows my name\nAll the police think I'm serving cane\nJealous niggas call us out\nBut I dont worry long as I hear their mouths\nIf ever they decide to kill\nYou better be prepared because I know I will\nOne thing I can guarantee\nYou dont wanna be standin next to me\nBefore my final curtain call\nI forsake save hen and won't be long\nSo if we bump heads in the streets\nOr even at some party\nYou niggas really can't see me\nMy request is that you stop trying\nBefore I let go...\n\n[HOOK (2x)]\nThese days, you gotta be strapped\nI'm already knowin ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound\n\n[VERSE 3: Daz]\n\nEveryday, the 45 stays on deck for whoever\nIm bustin takin down, bowin down never\nGotta watch my back for these coppers\nAs well as these niggas that I kick it with\nThey stick you faster than these bitches will\nSince I'm pimpin everybody wants my riches\nAnd I can't keep a dime from buying weed actin everytime\nI smoke constantly, it comforts me\nFrom commitin the murders so I chill and puff the herb\nWho gots my back nobody\nLittle John Gotti's layin niggas down at the homey's party\nAll be goin crazy I guess we are bein who we are\nReally say the nigga gotta be a star\nI gots to get mine and if I blast then its my destiny\nIf I die then it was meant to be intentionally\nWorry stressin I'm guessin no confession\nWhen the murder take place set yourself protection\n\n[HOOK (4x)]\n\nThese days, you gotta be strapped\nI'm already knowin ain't nobody got my back\nThese days you gotta be down\nWho said it was easy claiming Dogg Pound", "[Intro]\nThis is dedicated to the niggas that was really down from day one\n*Cell door opens*\nSo much for Death Row", "I pledge allegiance, to all my homies\nWho may never love a hoe, and never will\nI give my body and I give my soul\nTo the funk may the funk never end", "(All star, baby)\nYoung, quick, see\n(F U B U)\nLately, all I see is DPG\n(QB, LBC niggas)\nWhen I turn the radio on, keep hearing me\n(All day, everyday)\nLiving the good life, good life\nUh, huh, good life\n(Braveheartz)\nSure as the world is turning round and round\n(Shit is real, yo)\nThere's these niggas, bitches, snitches trying to bring you down\n(Fucked up)\nBut I don't know why I mention\nAnd if I don't pay no attention, I'm cool\n(Real niggas do real things)\n(Real niggas do real things)\nSure as my chronic is the best in town\nThose who tripping, slipping, listen, we ain't stopping now\n(Can't stop)\nWe won't even pause, y'all can lick my balls\n(Bitches)\nWe living the good life, good life, good life\n(Living the good life, baby)\nYoung, quick, see\n(Come on, come on)\nLately all I see is DPG\n(Nate Dogg)\nWhen I turn the radio on, keep hearing me\n(Still, still, still)\nLiving the good life, good life, uh huh good life\n(We living the life)\nIt ain't nothing but a paper chase\nBut even when ya paper straight\nEvery stage just another way to see cake\nBut niggas still gotta die hate\nWell fuck it, I'ma do it 'cause the streets put me to it\nSee y'all niggas is late\nSee it's big face, big living, big dogs and big pimping\nGame played with nothing but precision\nMoney, cars and women\nSee niggas hating 'cause they on the outside\nWishing they could find a way in it\nYou see the rims spinning all black tinted\nWith the niggas who'll bring it to ya brain\nIf it's fucking with change\nFifty-four, nigga, remember the name\nRitz, glitz, only when we empty clips\nAnd dismember your brain\n'Cause I remember pain, gain pain, this winner reign\nBut now it's high tech out here in the center lane\nSee we got the world respecting the slang\nThe good life, hit the studio, the club, straight to the plane\nYoung, quick, see\n(Come on, come on)\nLately all I see is DPG\n(Nate Dogg)\nWhen I turn the radio on, keep hearing me\n(Still, still, still)\nLiving the good life, good life, uh huh good life\n(We living the life)\nYo, yo, yo\nPass you cowards, classical rap mix form power\nYasser Arafat, I'm storming with lead showers\nAnd I'm murderous, common is formerly Nastradamus\nI'm going for the top regardless\nPretty Boy Floyd, the rotten tooth king\nGhosts of my dead friends linger\nI toast to you, lover, blunts lit, wish I was hitting\nCock back, four pound, let six in the air\nRock that raw sound, getting wet to this year\n'Cause of the projects Hannibal Lec, hand on my tech\nIn front the White House, my ice out demanding respect\nBravehearting to the grave, darling wavin' my sterling\nFrom out the black Bentley, it's off, spray 'til y'all falling\nEast to West Coast balling\nNate Dogg, Nas and Kurupt, liven it up, dimes in the cut\nSizing us up, y'all wanna fuck, gin and tonic my cup\nAnd we live the good life, still chronic it up\nYoung, quick, see\n(Come on, come on)\nLately all I see is DPG\n(Nate Dogg)\nWhen I turn the radio on, keep hearing me\n(Still, still, still)\nLiving the good life, good life, uh huh good life\n(We living the life)", "[Intro]\nYou ready?\nI don't have no words, I need to put some down\nI need you to push your record button\nI'm on it Nate\n\n[Chorus]\nSometimes I wanna spend the day\nAlone without nobody, nobody\nEven lovers need a holiday\nSometimes you gotta get away, from everybody\n\n[Verse 1]\nSee some people want you to do better\nJust not better than them\nIt's the game I got from my godfather\nThe infamous [?]\nA fake friend in the shadow only come around when the sun is shining\nThat's why I want you to stay on the grind\nMindin' yo' buisness and keep grindin'\nFrom [?] to the [?] LA Pomona to the [?]\nEven in Inglewood and Compton we listened to yo' daddy [?]\nAin't no way in the world I could put all this here in sixteen doors\nAnd just doing this with Lil Nate Dogg is makin' this shit twice as hard\nBut I'ma [?] you expect me to be and take a toast\nAnd thanks to Snoop Dogg a big person [?] my daughter, I'll sign em' both\nIt's been puff puff pass radio stations the news and all that\nAnd I bet you and 2Pac got something to do with the west gettin' [?]\nIt's still [?] foundation on my Nate Dogg, I ain't forgot shit\n[?] got a lil' brother called Salam, now he cuttin' all the hits\n[?] locals and dirty OG but we still Pomona city ridin'\nNow It's long beach Pomona city movement with Snoop Dogg beside us\n\n[Chorus]\nSometimes I wanna spend the day\nAlone without nobody, nobody\nEven lovers need a holiday\nSometimes you gotta get away, from everybody\n\n[Verse 2]\nSometimes I just wanna chill with pops\nSit back, have a couple laughs\nTake back a few Henny shots\nRoll up , burn it down\nTalk about sky boxin'\n[?]\nLil' nigga eatin' on things we talk about\nI just smile, look up [?] to the clouds\nNow you lookin' down, we'll be alright\nI could hear you sayin' now\nHell boys our last name comes with the crowd\nThis a legacy we all ways gon' hold down\nI'm just livin' life, one day at a time\nI'm in here with Pimpin laughin' bout' good times\nIt's so crazy he say I'm you in disguise\nI reply I'm Lil Nate, now pass me that fire\nI sit back and reminisce\nSo [?], boy those days was lit\nI miss you pops, you know I'm gon' represent\nAnd today I swear my mood like this\n\n[Chorus]\nSometimes I wanna spend the day\nAlone without nobody, nobody\nEven lovers need a holiday\nSometimes you gotta get away, from everybody\n\n[Pre-Chorus]\nBitch you said you love me, but you could never show it\nBitch I gave you money and all you do is blow it\nThe truth is what I'm sayin' and bitch you really know it\n\nBitch you said you love me, but you could never show it\nBitch I gave you money and all you do is blow it\nThe truth is what I'm sayin' and bitch you really know it\nHeyy..\n\n[Chorus]\nSometimes I wanna spend the day\nAlone without nobody, nobody\nEven lovers need a holiday\nSometimes you gotta get away, from everybody", "When my heart starts achin\nKinda hard to keep breathin\nI take comfort in knowin\nOne day I'll be right back (right back where you are)\nI keep starin at your picture\nLord knows I really miss ya\nI wanna hug, I wanna kiss ya\nCan't wait until I get back to (right back where you are)\nI wish I had another chance too\nAll the things that I would tell you\nOut of sight I'd never let you\nTell me how I can get to (right back where you are)\n\n[Chorus: repeat 2X]\nRight back, right back, right back, right back [2X]\nRight back where you are\n\nI remember how we used to\nSit and talk until the day's through\nNow I've got no one to talk to\n'Til I can get back to (right back where you are)\nSometimes I wonder did I tell you\nHow much I really love you\nI know I'll get another chance to\nWhen I'm standin right beside you (right back where you are)\nSometimes I wonder if I'm selfish\nBut if God would give me one wish\nI'd wish you back into this world with\nMe so I could be back (right back where you are)\n\n[Chorus]\nWhat a wonderful day\nWhen my troubles are erased and\nI'm so tired of waitin\nMy God I'll be facin\nThat wonderful day\nMy heart starts to racin\nNo more attempts at payin\nStandin next to my savior, and (right back where you are)\n\n[Outro]\nRight back where you are\nWhere you arrrrrre\nRight back where you are\nWhere you arrrrrre\nOh God where you are\nRight back where you are\nWhere you are, where you are\nRight back where you are...\nRight back where you arrrre\nRight back where you are", "[Nate Dogg]\nI won't tell your boyfriend [7X]\n(Now don't tell my boyfriend)\n\nI ain't never gon' tell yo' next boyfriend that youse a hoe\n(Never gon' tell)\nI ain't never gon' tell yo' brand new man yo' ass is broke\n(Never gon' tell)\nI ain't never gon' tell how you licked me oh from head to toe\nI ain't never gon' tell your brand new man how you swallow\n\n[Chorus]\nIf he needs to know\nI won't tell your boyfriend [2X]\nIf he has to know\nI won't tell your boyfriend [2X]\nIf he wants to know\nI won't tell your boyfriend [2X]\nIf he's gotta know\nI won't tell your boyfriend\n(Now don't tell my boyfriend)\n\n[Nate Dogg]\nI ain't never gon' tell yo' next boyfriend where I'd like to go\n(Never gon' tell)\nI ain't never gon' tell his ass not to mad dog me no mo'\n(Never gon' tell)\nWhen he look into my eyes he know I can show him better if he go\n(Cause I ain't never gon' tell)\nI ain't never gon' tell his next of kin where his body's roped{?}\n(If he needs to know)\n\n[Chorus]\n[Nate Dogg]\n(I ain't never gon' tell)\nI ain't never gon' tell yo' man first date I took you home\nI ain't never gon' tell him what you did in the back of my Rolls\n(Never gon' tell)\nI ain't never gon' say a word, you can show him when you all alone\n(Never gon' tell)\nI ain't never gon' tell yo' next boyfriend the girl I met was a pro\n\n[Chorus]\n[Knoc-turn'al]\nYou can link up with me (and creep after midnight)\nK-N-O-C (keepin my game tight)\nI like the fact that you like girls and like guys\nAll at one time (I won't tell your boyfriend)\nLookin for something just to get into\nAnd creeping low on a mission (smash it)\nDown the avenue\nAin't got much time baby girl so hop in\nAnd then, a quarter of two, sex rendition\nDo ya thang but I (won't tell ya boyfriend)\nKnow that I don't sing a sad hymn\nNo mockingbird in I, that ain't him\nSo findin out about me is real slim\nMy name in your phone ain't Knoc, my name's Tim\nI won't testify, I'm gon' ride my whole life\nSee me spin on chrome rims\n\n[Nate Dogg]\n(I ain't never gon' tell)\nWhen we first met homegirl you was young, beautiful and bold\n(Never gon' tell)\nI ain't never gon' tell your man youse a freak like Anna Nicole\n(Never gon' tell)\nI ain't never gon' tell him about that time you came to my do'\n(Never gon' tell)\nLate night, Trump tight, midnight, just right, trenchcoat, no clothes\n\n[Chorus]\n[Outro: Nate Dogg]\nI ain't never gon' tell\nI won't tell your boyfriend [7X]\n(Now don't tell my boyfriend)\nI won't tell your boyfriend [7X]\n(Now don't tell my boyfriend)\n(I won't tell your girlfriend) [7X]\n(Now don't tell my boyfriend)", "C'mon\nDance with me, baby girl\nDance with me, baby girl\nC'mon\nDance with me, baby girl\nDance with me, baby girl\nMan I was dancing\nPrancing, laughing, bouncing, swinging\nMoving, grooving 'cause the music's booming\nMacking, tryna get some action, packing\nActing, manish, drinking\nTweaking, winking, peeping\nSeeking a freak for the evening\nReally feeling way too horny\nReaking from the weed I'm token\nChoking, smoking, real doping, hoping\nMy nights wide open\nKnowing that my girl's at home\nSnoring, boring, ignoring\nWarning that my girl was coming\nSudden mood interruption\nBusted my girl's in the club\nRing the alarm\nYour woman has just been sighted\nRing the alarm\nHow'd she get in if she wasn't invited?\nRing the alarm\nShe's headed this way like lightning\nRing the alarm\nI'm not tryna be ducking and diving\nRing the alarm\nHeaded, top speed for the exit\nDamnit don piece can't grab it\nHabit like chasing my cabbage\nMagic, time to disappear fast with\nThis chick, who I slept last week with\nReal trick, I like her 'cause she real slick\nLet's dip, I don't care who you came with\nNo lip, got no time for some bullshit\nShe went, that she all in the backpen\nTime spent, now it's time to hit the pavement\nTwo sense, got no time for your comments\nDon't trip, do you know where my girl went?\nRing the alarm\nYour woman has just been sighted\nRing the alarm\nHow'd she get in if she wasn't invited?\nRing the alarm\nShe's headed this way like lighting\nRing the alarm\nI'm not tryna be ducking and diving\nRing the alarm\nListen, I'm in the club\nNo where I ain't even suppose to be\nDrinking with a girl all close to me\nI'm all up in the air\nTelling her some superfly shit she need to hear\nThinking can't nobody see us, 'cause we in the rear\nAll I'm tryna do is get a number then I'm up out of here\n'Cause my girl ain't home, she out with a friend\nIta be just my luck this the spot they in\nNot the place for her to spot me in\nYou know specially when I'm suppose to be at the studio\nI take one step, what do I see my girl\nComing threw the door but she don't see me\nNow I'm ducking, now I'm dodgeing\nHiding, praying to God that she don't come find me\nWhat was I thinking of, I should of never\nParked my car in front of the club damn\nRing the alarm\nYour woman has just been sighted\nRing the alarm\nHow'd she get in if she wasn't invited?\nRing the alarm\nShe's headed this way like lighting\nRing the alarm\nI'm not tryna be ducking and diving\nRing the alarm\nRing the alarm\nYour woman has just been sighted\nRing the alarm\nHow'd she get in if she wasn't invited?\nRing the alarm\nShe's headed this way like lighting\nRing the alarm\nI'm not tryna be ducking and diving\nRing the alarm\nRing the alarm\nYour woman has just been sighted\nRing the alarm\nHow'd she get in if she wasn't invited?\nRing the alarm\nShe's headed this way like lighting\nRing the alarm\nI'm not tryna be ducking and diving\nRing the alarm", "[Chorus: Nate Dogg]\nSpecial part of me\nSpecial part of me\nSpecial part of me\nSpecial part of me\n\n[Verse 1: Psyke]\nI love it when you thug from out the driveway\nStraight down the Ave. swervin' my way\nYou gotta a nigga blessin' my heart it's rushin'\nSo you blew me and kissed me no doubt I'm fuckin' (really doe)\nAcknowledge the fact with your point\nContemplate the sex with Hen and fat joints\nIt's just another day in me and my life (so special)\nAre you the one for my wife\n\n[Chorus: Nate Dogg]\n\n[Verse 2: Nate Dogg]\nGirl I gotta know\nHave you ever said I'm goin' out with my girl\nNever made it home\nHave you ever went about as far as you go\nThen you went some mo'\nHave you ever did somethin' oh so bad\nBut oh it felt so good (so good, so good)\nHave you ever been hangin' out with your friends\nAnd wished it never would end\nI need to know\nCan you handle this, I hit my sixteen switch\nHalf of the way home (home, whole way home, home, home, home)\nHave you ever seen, the way this gangsta leans\nTo come and swerve with me\nDon't let nobody worry me\nAll there's always be, in the back of my jeep\nThe night was filled with ecstasy\nI mean literally, but my weed has seeds\nDon't let nothin' worry me\nI know I'm interesting, it's that Hennesey\nAnd I give you a bit\n\n[Chorus: Nate Dogg]\n\n[Verse 3: Psyke]\nJust you're beautiful face alone\nIt's what I'm thinking while I'm puffin' in a zone\nSo I call just to see if it's on\nTick, tock when I clock she ready to bone\nAllnight until the early morn\nWake up baby girl I'm takin' you home\nIn fact get in back of the escalade\nYou won't track like that it's time to get paid (paid)\n\n[Chorus 2X: Nate Dogg]", "I, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI, give my body\nAnd I give my soul to the funk\nMay the funk, never end\nI pledge allegiance, to paper chasers\nTo hustlers who be steady pullin' capers\nPeace and blessing\nMay the sun always shine on you\nI'm servin' paper, see you later\nI guess that's one mo' thing, I can't be faited\nYou can test me, get discombobulated\nAin't no question I'm gonna fuck with this\nI do it for the funk of it\nI, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI, give my body\nAnd I give my soul to the funk\nMay the funk, never end\nI pledge allegiance to my homies who keep it gangsta\nFuck all the haters they can't stop this groove\nI pledge allegiance to the game 'cause it got me ballin'\nGame don't wait so I'm not stallin'\nI'm still dissin', she's still callin'\nSee this is front line, no turnin' back now\nI'm about to score, this is war on the track now\nGive me my vest and my ammo and my mac now\nI'm 'bout to spit it, and Lord\nI'm a get it in the worst way\nSlay, competition move the opposition\nBack wake the fuck up 'cause when I get beyond enemy lines\nI might snipe that ass like john Kennedy's mind\nThou shall not get caught, that's the remedy\nDisinfect gun wounds on my last bottle of Hennessey\nBleed to let the seeds remember my memories\nIt's killed or be killed here son that's the penalty\nRide for the funk, cry for the funk\nIn the heat of night, I die for the funk\nPharaoh, when I'm six feet deep there's no greivin'\nSalute the noblest troop and pledge allegiance 'cause\nI, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI give my body\n(I pledge allegiance to my homies who keep it gangsta)\nAnd I give my soul to the funk\n(Fuck all the haters they can't stop this groove)\nMay the funk, never end\n(I pledge allegiance to the game 'cause it got me ballin')\n(Game don't wait so I'm not stallin', I'm still dissin', she's still callin')\nI, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI, give my body\nAnd I give my soul to the funk\nMay the funk", "(Chorus)\nI'm just a man\nI'm just a man\nI'm just a man\nI'm just a man scared of love\n\nWhen they asked me\nWhy I dont like love\nOr why I dont have a lady\nMaybe its because I know\nAs soon as I tell her\nHow I feel about her\nAs soon as I act like\nI love her she's gone\n\n(Chorus)\nI'm just a man (scared of love)\nI'm just a man (is why I dont have a lady)\nI'm just a man\nI'm just a man in love\n\n(Butch Cassidy)\nI really was so into you\nBut you dont know what I'm going through\nYou say you really care for me\nBut in love there's no guarantee\nSo, I think I outta take my time\nCuz love ain't no friend of mine you see\n\nDont let me get you too confused\nYou're the friend I dont want to lose\nIf I made a choice its you I choose\nBut my heart's a tad bit through\nSo, I try to get you off my mind\nBut a remedy I cannot find for you\n\n(Chorus)\nI'm just a man (scared of love)\nI'm just a man (is why I dont have a lady)\nI'm just a man\nI'm just a man in love\n\n(Butch Cassidy)\nI'm never gonna try to find\nAnother I'm just out for mine\nI left so many far behind\nBut traces they'll never find\nNo, I can cover all my tracks (all my tracks)\nWon't be nothing gettin back to you\n\n(Nate Dogg)\nNow dont think that I'm being rude\nBecause I won't commit to you\nAnd other women want to screw\nWhats a player supposed to do\nSo, I'll be slippin on my hat\nI won't be bringin nothing back to you\n\n(Chorus) x2\nI'm just a man (scared of love)\nI'm just a man (thats why I dont have a lady)\nI'm just a man\nI'm just a man in love", "[Nate Dogg]\nAaliyah\nLeft Eye\n2Pac\nBiggie\nMy homeboy Lefty\nEazy-E\nAnd Jam Master Jay\nWe miss you and will see you soon\nThis song's for you", "Right this way, ma'am. Lockdowns on the other side of this cafeteria here. Just stick close to me\nAnybody looks at you strange, you just let me know, OK?\nOK\nHold on a second. Y'all just shut the Hell up. You want a 115 be a lockdown all week?\nYeah, that's what I thought. Right this way, ma'am. It's right this way. Welcome to Death Row\nThis is the last stop for all the scum of the Earth\nThese people ain't worth a damn in here\nOh, here's your guys vacation spot right here\nStep right in\nBy myself?\nAww, don't worry about it, we always keep chains on these Death Row boys and plus I'll be right outside here\nMr. Nate Dogg, may I call you Nate? I just wanna ask you a few questions, do you mind if I record this conversation?\nNo, I don't mind at all\nI don't know if you're aware of this or not, but I'm a pretty big fan of yours and I've been following your career since you were sentenced to Death Row\nRight\nAnd I've noticed a lot of people trying to jump on the G-Funk bandwagon, um...\nHaha, that's right\n...proclaiming to be from the G-Funk generation. How would you like to address that?\nWell, you gotta do what you gotta do to eat\nHehe, Nate, I hope no offense is takin by this next statement, but it doesn't look like you'll be around much longer and in my opinion when you're gone, it's going to be very difficult to ever get the true meaning of G-Funk. So as a last request for the millions of people who love and respect your music, could you please give us the true definition of G-Funk", "I, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI, give my body\nAnd I give my soul to the funk\nMay the funk, never end\nI pledge allegiance, to paper chasers\nTo hustlers who be steady pullin' capers\nPeace and blessing\nMay the sun always shine on you\nI'm servin' paper, see you later\nI guess that's one mo' thing, I can't be faited\nYou can test me, get discombobulated\nAin't no question I'm gonna fuck with this\nI do it for the funk of it\nI, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI, give my body\nAnd I give my soul to the funk\nMay the funk, never end\nI pledge allegiance to my homies who keep it gangsta\nFuck all the haters they can't stop this groove\nI pledge allegiance to the game 'cause it got me ballin'\nGame don't wait so I'm not stallin'\nI'm still dissin', she's still callin'\nSee this is front line, no turnin' back now\nI'm about to score, this is war on the track now\nGive me my vest and my ammo and my mac now\nI'm 'bout to spit it, and Lord\nI'm a get it in the worst way\nSlay, competition move the opposition\nBack wake the fuck up 'cause when I get beyond enemy lines\nI might snipe that ass like john Kennedy's mind\nThou shall not get caught, that's the remedy\nDisinfect gun wounds on my last bottle of Hennessey\nBleed to let the seeds remember my memories\nIt's killed or be killed here son that's the penalty\nRide for the funk, cry for the funk\nIn the heat of night, I die for the funk\nPharaoh, when I'm six feet deep there's no greivin'\nSalute the noblest troop and pledge allegiance 'cause\nI, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI give my body\n(I pledge allegiance to my homies who keep it gangsta)\nAnd I give my soul to the funk\n(Fuck all the haters they can't stop this groove)\nMay the funk, never end\n(I pledge allegiance to the game 'cause it got me ballin')\n(Game don't wait so I'm not stallin', I'm still dissin', she's still callin')\nI, pledge allegiance\nTo all my homies who may never\nLove a ho and never will\nI, give my body\nAnd I give my soul to the funk\nMay the funk", "Ladies and gentlemen\nPimps and playas\nDoggs and bitches\nNate Dogg", "Ladies and gentlemen\nPimps and players\nDogs and bitches\nNate Dogg!", "There's a party going on (Like all night)\n'Til the break of dawn (Yeah, that's right)\nD-O double-G (Is in the house)\nNate D-O double-G (Gon' turn it out)\nThere's a party going on (Like all night)\nBring all your friends\nBring a case of St Ides\nThat's how you're getting in (Yeah, that's right)\nHomies having fun (With no fights)\nThat's how it is\nWhen you're living in the Beach (Your whole life)\nThe best place to live (Now that's right)\nSo if you're over 21 (You heard right)\nDon't hesitate\nBring a hundred of your friends\nAnd make sure they bring their case\n(St. Ides, St. Ides, St. Ides, St. Ides, St. Ides, St. Ides, St. Ides)", "Subscribe my channel."]}