{"artist": "Ol’ Dirty Bastard", "songs": ["[Intro]\n\"Aw, I don't want to fuck you. You can't even sing!\" You had to sing, or something, to get some pussy\n\n[Chorus 1]\nOoh, baby, I like it raw\nYeah, baby, I like it raw\nOoh, baby, I like it raw\nYeah, baby, I like it raw\n\n[Verse 1]\nShimmy, shimmy, ya, shimmy, yam, shimmy, yay\nGimme the mic so I can take it away\nOff on a natural charge, bon-voyage\nYeah, from the home of the Dodger Brooklyn squad\nWu-Tang killer bees on a swarm\nRain on your college-ass disco dorm\nFor you to even touch my skill\nYou gotta put the one killer bee and he ain't gonna kill\nNow chop that down, pass it all around\nLyrics get hard quick cement to the ground\nFor any emcee in any fifty-two states\nI get psycho killer, Norman Bates\nMy producer slam my flow is like bam\nJump on stage dunduhduhDUNduuuuuh\n\n(I like the way you talk)\n\n[Chorus 2]\nOoh, baby, I like it raw\nYeah, baby, I like it raw\nOoh, baby, I like it raw\nYeah, baby, I like it raw\nOoh, baby, I like it raw\nYeah, baby, I like it raw\nOoh, baby, I like it raw\nYeah, baby, I like it raw\n\n[Incomprehensible backwards verse incorporating part of Verse 3 (Extended version)]\n\n[Verse 2]\nShimmy, shimmy, ya, shimmy, yam, shimmy, yay\nGimme the mic so I can take it away\nOff on a natural charge, bon-voyage\nYeah, from the home of the Dodger Brooklyn squad\nWu-Tang killer bees on a swarm\nRain on your college-ass disco dorm\nFor you to even touch my skill\nYou gotta put the one killer bee and he ain't gonna kill\nNow chop that down, pass it all around\nLyrics get hard quick cement to the ground\nFor any emcee in any fifty-two states\nI get psycho killer, Norman Bates\nMy producer slam my flow is like bam\nJump on stage dunduhduhDUNduuuuuh\n\n[Outro 1]\nShi-shimmy shimmy ya, yeah\nShi-shimmy shimmy ya, shimmy yam\nShi-shimmy shimmy ya shimmy yam, shimmy yay\nShi-shi shimmy shimmy ya shimmy yam, shimmy yay\nShi-shimmy shi-shimmy ya shimmy yam, shimmy yay\n\nGive me the mic so I can take it away, shimmy shimmy ya\n\n[Outro 2]\nYou can't even sing. You have to sing or something to get some pussy\n\nADDITIONAL EXTENDED VERSE\n\n[Verse 3]\nSee, when a nigga say he likes it raw\nKeepin' it dirty, down to the floor\nSee my name is the ODB and I'll beat your ass\nFor the ladies who know me tell them who the fuck I be\nFor the niggas who know me tell them who the fuck I be\nMy style comes down on y'all like rocks\n(Sitin' on the dock of the bay) By the dock!\n(Aiyaiyaiyaiyaiyaiyaiy...) Umm by the flock\n(Don't goooooo) By the creak by the flock\nGot east coast locked down padlocked\nMy Zoo be all all down by the flock\n\n[Chorus 1]\nOoh, baby, I like it raw\nYeah, baby, I like it raw\nOoh, baby, I like it raw\nYeah, baby, I like it raw\n\n[Verse 1]\nShimmy shimmy ya, shimmy yam, shimmy yay\nGimme the mic so I can take it away\nOff on a natural charge, bon-voyage\nYeah from the home of the Dodger Brooklyn squad\nWu-Tang killer bees on a swarm\nRain on your college-ass disco dorm\nFor you to even touch my skill\nYou gotta put the one killer bee and he ain't gonna kill\nNow chop that down, pass it all around\nLyrics get hard quick cement to the ground\nFor any emcee in any fifty-two states\nI get psycho killer, Norman Bates\nMy producer slam my flow is like bam\nJump on stage dunduhduhDUNduuuuuh\n(I like the way you talk)\n\nYo, y'all know the lyrics, come on, sing with me\n\n[Chorus 1]\nOoh, baby, I like it raw\nYeah, baby, I like it raw\nOoh, baby, I like it raw\nYeah, baby, I like it raw\n\n[Produced by RZA]", "[Produced by True Master & Ol' Dirty Bastard]\n\n[Intro]\nShit. Word. I bust that nigga ass right now\nAin’t no–none of them niggas can’t fuck with me\nWhat? Nigga you could never fuck with me, my nigga\nI’ll fuck you up right now! What?! What?! What?!\nBust your motherfucking ass boy!\nI ain't no motherfucking joke, you know who you talking to?\n(Word up, bust that nigga ass, word up)\nOl' Dirty Bastard, you know what I’m sayin'?\nI fuck you up right now\nYeah! What?! What?! What?!\n\n[Verse]\nI'm the one-man army, Ason\nI never been tooken out, I keep MC's looking out\nI drop science like Cosby dropping babies\nEnough to make a nigga go crazy\nIn the G-Building, taking all types of medicines\nYour ass thought you were better than\nA-son, I keep planets in orbit\nWhile I be coming with deeper and more shit\nEnough to make you break and shake your ass\nAs I create rhymes good as a Tastykake makes\nThis style, I'm mastered in\nNiggas catching headaches, what? What? You need Aspirin?\nThis type of pain, you couldn't even kill with Midol\nFuck around, get sprayed with Lysol\nIn your face like a can of mace, baby\nIs it burning? Well, fuck it, now you're learning\nHow I don't even like your motherfucking profile\nGive me my fucking shit: CH-CH-BLAOW!\nLast seen and heard, no-one knows\nYou forget: niggas be quiet as kept\nNow you know nothing\nBefore you knew a whole fucking lot\nYour ass don't wanna get shot\nA lot of MC's came to my showdown\nAnd watched me put your fucking ass low down\nAs you can go, below zero\nWithout a doubt I never been tooken out\nBy a nigga, who couldn't figure\nYo by a nigga, who couldn't figure\nYo by a nigga, who couldn't figure (Brooklyn Zoo)\nHow to pull a fucking gun trigger\nI said \"Get the fuck outta here!\"\nNigga wanna get too close, to the utmost\nBut I got stacks that'll attack any wack host\nIntroducing - yo fuck that nigga's name\nMy Hip Hop drops on your head like rain\nAnd when it rains it pours, cause my rhymes hardcore\nThat's why I give you more of the raw\nTalent that I got will r-iz-ock the spot\nMCs I'll be burning, burning hot\nWhoa-hoa-hoa! Let me like slow up with the flow\nIf I move too quick, oh, you just won't know\nI'm homicidal when you enter the target\nNigga get up, act like a pig trying to hog shit\nSo I take yo ass out quick\nThe mics, I've had it my nigga, you can suck my dick\nIf you wanna step to my motherfucking rep\nCH-CH-BLOAW! BLOAW! BLOAW! Blown to death\nYou got shot 'cause you knock knock knock\n\"Who's there?\" Another motherfucking hardrock\nSlacking on your macking 'cause raw's what you lack\nYou wanna react? Bring it on back\n\n[Hook]\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bastard, Brooklyn Zoo!", "[Intro: Ol' Dirty Bastard]\nI dedicate this to all the pretty girls\nAll the pretty girls in the world\nAnd the ugly girls too\n‘Cause to me you're pretty anyway, baby\n\n[Verse 1: Ol' Dirty Bastard]\nYou give me your number, I'll call you up\nYou act like your pussy on interrupt\nI don't have no trouble with you fucking me\nBut I have a little problem with you not fucking me\nBaby, you know I'ma take care of you\n‘Cause you say you got my baby, and I know it ain't true\nIs it a good thing? No it's bad, bitch\nFor good or worse, makes you switch\nSo I walk on over with my Cristal\nBitch-ass niggas, put away your pist-als\nDirty won't be having it in this house\n‘Cause, bitch, I'll cripple your style!\nNow that you heard my charming voice\nYou couldn't get another nigga, coochie won't get moist\nIf you wanna look good and not be bummy\nGirl, you better give me that money! Aow!\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Verse 2: Ol' Dirty Bastard]\nSo I glanced at the girls, girls glanced at me\nI whispered in their ear: \"Wanna be with me?\"\nYou wanna look pretty though, in my video\nOl' Dirty on the hat and I let you all know\nJust dance if you caught up in the holy ghost trance\nIf you stop I'ma put the killer ants in your pants\nI'm the O-D-B as you can see\nF.B.I., don't you be watching me\nI don't want no problems, ‘cause I'll put you down\nIn the ground where you can not be found\nI'm just Dirt Dog trying to make some money\nSo give me my streaks and give me my honey!\nRadios play this all day, everyday\nRecognize I'm a fool and you love me!\nNone of you, NUH, better look at me funny\nNUH, you know my name, now give me my money!\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Over the hook]\nSing it! Sing it, girls!\nJust shake it right now!\nIf Dirty want his money\nI think y'all should give him his money\nThat's how I like you, girl!\n\n[Verse 3: Ol' Dirty Bastard]\nNigga playing in the club like this all night\nBitches put your ass out, let me hold it tight\nYou looking at my wrist saying \"It's so nice!\"\nThe price bitch is diamonds, shining disco light\nWell, you better help me solve my problem\nOr I'ma get this money and rob them\nLucky Dog when I won the Lotto\nRan up on my car for carrying Rollo\nBut hold on, you can call me Dirty\nAnd then lift up your skirt\nAnd you want some of this Dirty\nGod made Dirt and Dirt bust your ass\nStop annoying me! Yeah, I play my music loud\nIt takes the Bastard – Ol' Dirty – to move the crowd\nThey say, \"He had his dick in his mouth.\"\nEddie Murphy taught me that back in the house\nNow give me my money!\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Outro: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!", "[Intro: Ol' Dirty Bastard + (some Caribbean woman)]\nYeah! I wanna let all y'all niggas know in here tonight\nThat this is that Wu-Tang shit\nThis that shit that's gonna get you high\nSee when you stimulate your own mind for one common cause\nYou see who's the real motherfuckers\nSee what you see is you what you see\n(You nuh see it? Wu-Tang a-run tings!)\nBe the original G\nRhymin' on timin' in the place to be\n(Run blood claat tings!)\nLadies love seein' me!\n\n[Verse 1: Ol' Dirty Bastard]\nYou're a crossbreed, I'm a knowledge seed\nI want action! That's what I need\nI never put doubt on my mind\n'Cause I know when I touch the mic it's the rhyme\nSee murder which is caused\nWhen you fuck with the negative and positive charge\nThen they came up out my garage\nWith the hit that's gonna be large\nTired of sittin' on my fuckin ass\nNiggas I know be runnin' around with mad fuckin' cash\nWho the fuck wanna be an emcee\nIf you can't get paid to be a fuckin' emcee?\nI came out my momma pussy, I'm on welfare\nTwenty-six years old – still on welfare\nSo I gotta get paid fully\nWhether it's truthfully or untruthfully\nWith my Boston bloodthirsty posse\nP-E-A-C-E\n\n[Chorus: Method Man]\nMove 'em in, move 'em in\nMove 'em out, move 'em out\nStick it up {*whip sound*} raw hide!\n\n[Verse 2: Ol' Dirty Bastard]\nYeah, gotta come back to attack\nKillin' niggas who said they got stacks, 'cause I don't give a fuck\n{*inhales*} I wanna see blood, whether it's period blood\nOr bustin' your fuckin face some blood!!\nI'm goin' out my fuckin' mind!\nEverytime I get around devils {*breathing hard*}\nLet me calm down, you niggas better start runnin'\n'Cause I'm comin', I'm dope like fuckin' heroin\nWu-Tang Bloodkin, a goblin, who come tough like lambskin\nImagine, gettin' shot up with Ol' Dirty insulin {*sucks air*}\nYou bound to catch AIDS or somethin'\nNot sayin I got it, but nigga if I got it you got it!!\nWhat!?\n\n[Verse 3: Raekwon the Chef]\nYo, check the bulletproof fly shit, strong like Thai Stick\nThen I'll remain to tear your frame while I freaks it\nLike some fly new sneaks and shit\nNow eat my shit, bitch tried to creep and got hit\nNow regulate, and I'll be out to set up a date\nWu-Tang is bangin' like a Ron G tape\nRZA pump the shit just like a shotty\nWatch me run it like John Gotti\nCollidin' on the track like gin and watty\nCheck the calendar, I warn any challenger\nTo step up {*whoosh*} feel the blast from the silencer\n\n[Chorus: Method Man]\nMove 'em in, move 'em in\nMove 'em out, move 'em out\nStick it up {*whip sound*} raw hide!\n\n[Verse 4: Method Man]\nComin' soon to a theatre near you it be the Wu\nYeah, find yourself in the square and see it's true\nActual facts to snack on and chew\nMy positive energy sounds peace to you\nA wise man killed one horse and made glue\nWicked women puttin' period blood in stew\nDon't that make the stew witches brew?\nI fear for the eighty-five that don't got a clue\nHow could he know what the fuck he never knew?\nGod-Cypher-Divine come to show and come to prove\nA mystery god that's the work of Yacub\nThe Holy Ghost got you scared to death kid boo!!\n\n[Outro: Ol' Dirty Bastard]\nYeah, we always gotta keep it fly\nFly for you to feel what you wants to feel\nSee Wu-Tang'd like to thank, all the people across the country\nAll the people in America, all the people outside of America\nFor listenin' to our music\nWe gotta keep it fly for ya!\nSee this ain't somethin' new\nThat's just gonna come out of nowhere, no!\nThis is somethin' old! And dirty!\nAnd dirty!\nYeah", "[Intro: Ol' Dirty Bastard]\nSee let a nigga come through with that bullshit\nAny time you pop that shit nigga\nI'ma tell you you can suck a dick, you can suck a pussy\nI know, it'll come to what? Say what?\nNow I'ma let all you motherfuckers know\nSee them knows that this is something you can't fuck\nWhether you from Brooklyn, whether you from Manhattan\nYou from Queens nigga\nI don't give a fuck, where you be motherfucker!\nWhere you reside... motherfucker!\nHow you live? How you seeeeeeee\n\n[Ol' Dirty Bastard]\nSort the stack outs, this one's the blackout\nThree-fifty-seven to your mouth, blaow!!\n\n[Buddha Monk - Brooklyn Zu]\nDirty, can you hear me? Rawness I’m inflicting\nIt's that G type slang that makes this real sickening\nIgnite the styles, I got my hand upon the trigger\nStarts from the smallest and hits the bigger nigga\n\n[Prodigal Sunn - Sunz of Man]\nYo, straight out the lava by them hell fires\nA known mental killer, born thriller, assassin of terror\nA hot bloody fatal mixture of carbon and water\nHomicidal manslaughter, death is the order\nStart the mission, travel like the speed of wind\nThrough the valley of sin, I step to ville and murdered many men\nServing justice in my vicinity\n\n[Zu Keeper - Brooklyn Zu]\n(This is, Brooklyn, Zu!!)\nZa-za-za, za-za-za\nZuh-za-zah, z-zz-zz-z-z-zz-zz-z-dah-duh-dnn-duh\n\n[Murdoc - Brooklyn Zu]\nI get down, I get down, I crack your fucking crown\nLay around and watch some real niggas break ground\nI can't shop cause every bro blowing up the spot\nHit rocks and niggas know\n\n[Killah Priest - Sunz of Man]\nYo! Niggas grab the mic like the bites of a scorpion\nNervous, that's why the Zu brought me in\nNow bring em forth, like the tortures at the courts\nBefore the case begin, first break me in\nHis brain! And make sure he can't maintain the calmness\nYa harmless, watch how I bomb this\nStage light now appears to be the Moon\nNow your Posse is your fucking Platoon\nStale sound just flows through the air\nI'm like a ninja, once I send ya cold stares\nThen I get furious, imperious, the lyricist with the clearest rhyme\nErupt to deduct your fucking mind\n\n[12 O'Clock - Brooklyn Zu]\nFuck shit up on the hurry-up\nKnown for burying ducks through more styles than a monk\nWarning you chump, brain is out for lunch\nGiven the power punch, soon to be paid like Donald Trump\nNever fall victim to no bitch\nJerked my dick, but still got more hoes than a pimp\nAnd score more points than Shawn Kemp\nKeeping powerfully strong like the center on the Knicks\n\nHut one, hut two, hut three, hut!!\nOl Dirty Bastard live and uncut\n\n(Shame on a nigga who tried to run game on a...)\n\n[Shorty Shit Stain - Brooklyn Zu]\nGot more props than the President\nMy hardcore represent\nBlowing niggas back who never had this\nCause I'm gifted, so you can gift wrap the shit\nI'm kicking and send it to your moms for Christmas\nAnd tell her Shorty Shit Stain sent it\nSoon to have more green than the Jolly Green Giant\nCause niggas rap styles just down, it's expired\nYou should've stayed home instead of picking up a microphone\nBut if you wanna run on up, like you tough\nI call your bluff and blow you down with my hardcore stuff\nI shine like twenty-four carat, niggas know...\n\n[Ol' Dirty Bastard]\nRoll and stroll with the party scene\nNigga wanna know me as Mr. Clean\nWza-wza-wza-wza-Wu-Tang, flip the script and\nTest my skill niggas, you're tripping\nDrugged up from sniffing, you're the one who's riffing\nI'm not Opie, save that old shit for Andy Griffith\nStart to flip, slip cause you're slipping\nWhile you sleep I be the God on point, with Scottie Pippen\nAs I jump on stage, flip rip a show\nStrip and rip a ho, wayyy like Bo\nJackson while I'm still taxing maxing\nRelaxing sitting back, silly attraction\nAgain and again when I rock the jam\nWanna see em up in the air, throw up your hand\nIntroducing one-man band in town\nIt's wild, more the style couldn't stand nigga\nWhen the jump stepped to the center\nOf the rhyme inventor, MCs' tormentor\nYou get dap slapped, across the MC map\nYour ass that's your ass on a whore shot\nCome on through I black and blue your whole crew\nThen I get Rudy with the Hong Kong Phoo'\nOl Dirty Bastard, MC killer\nMoney maker, Brooklyn, Shaolin style\nThat I lay down like tile, then I get higher\n\n[60 Second Assassin - Sunz of Man]\nHere comes the illlll, type ruffer\nStyle be untouched I'm leavin broken down grammars on the pen\nWho who what? What brings it? Tighter than your anus\nChambers this name is for the deepest trainers\nKeep it stainless, steel, on time it is the windmill\nDeadly venom kills, at the last of the Sam's Mill\n60 Second, nucleus, attack on your set\nHit you with the blast (yo close the door)\nShabazz!!\n*gun blast*", "Now number two, practiced the snake style\nHe was known as the snake spirit\nHe had the speed of a snake\n\n[Intro: Killah Priest]\nNiggas is like serpents out there\n[Snake style, no one could compete]\nSerpents will bite\nLay outside, and then they roll back into they holes\nThey slither, in the streets of Brooklyn, New York\nSlither in the streets, of Manhattan\nIn the streets of Queens, streets of the Bronx\nStreets of Staten Island\nWherever you see em they slither\nWhoever... yo\nFearsome shit... check it out\nYo, yo\n\n[Verse 1: Killah Priest]\nIt broke me up when they pat me on my shoulder\nSaid stay strong 'cause his life is now over\nI flash back to the heathens that he roll with\nThey shot him up and down nobody knows shit\nMy peers, little ears\nCame up to me with a eye full of tears\nLast night we was shootin' dice and gettin' nice\nKid rolled us, played us for our merchandise\nWe were in the hallway all day\nMe, Steve and Little Ray\nProbably at first they tried to rob me\nBack me in the lobby, pull out the shotty\nThen came Scotty, fragile body\nMy first impression, he returned from a party\nHe would just stagger, smellin' like Bacardi\nThe Dragon, braggin', how he was fuckin' mad hotties\nPressed on the elevator button, then all of a sudden\nHe licked off, about a dozen\nSlugs from the cannon, that ripped through my cousin\nNobody was standing when the nigga started bustin'\nBlood started to flood the floors by the elevator doors\nThat's the last thing that I saw\nDamn, we planned to make grands and buy a home\n\n[Number two]\n\n[Verse 2: RZA]\nJagged edge, rock head hard as Stonehenge\nPledged whoever crossed his path get scrapped with a sledge..\n..hammer, he didn't give a damn about the manner\nAnd on the block he was called by the momma's\nAnd the grandma's, 'indecent', 'heathen', 'juvenile delinquent'\nHis weekends was frequently locked inside the precinct\nHis most recent cape for catchin' papes\nWas snatchin' up snakes on a roof butt-naked hang em off like drapes\nThen ask what's the combination to the safe, with the brace\nAnd those who didn't reply they fell straight to their face\nRazor blade sharp who invades the dark\nAnd raid more spots than Spays and NARCS iron heart like Tony Starks\nA fierce lion, who never leave the crib without the iron\nAnd on the block he be slingin' rocks and duckin' from the sirens\nGreetin' niggas he loved with a pound and a bear hug\nThose who wanted life, they catch a slug from the snub\nA Five Percent, who all knew was one to ten\nHe loved the Gods with his heart but his brain was filled with sin\nAnd when he came through niggas be lookin' out\nHopin' he gets shot or tooken out or locked the fuck up in Brooklyn House\nIn PC on a liquid diet, but he was louder than a riot\n\n[Number two, the snake]\n\n[Verse 3: Masta Killa]\nDo the knowledge to a nigga named Trigga\nBad rudeboy from the land of Jamaica\nWith visions to venture to the U.S\nTo receive the gold that he couldn't achieve\nIn his country, even though he sold mad weed\nFor the next man, who was the Don of the clan\nNiggas acting like they got the block locked\nLike I can't sling drug raps and eat food\nBut I be the rudest, bad boy stepping gun toting\nShots lash out like a violent explosion\nAt the nigga, who tries to stop my production\nIntervene the scene and slow up the cream\nNone of that black, East New York, gun talk\nNiggas I extort from Baltic to Boardwalk\nMemories of injuries, wounds and burns\nWalking through the streets of Medina I stand firm\n'Cause I know this, which means I can hold mine down\nWithout a doubt, niggas who front get snuffed out\nJustice must be born there's no escape\n'Cause a snake can't be reformed so why wait\nComing in the name to proclaim your fame for protection\nAnd you don't know no fuckin' lessons?\n\n[Number two, the snake]\n\n[Verse 4: Ol' Dirty Bastard]\nBad, bad, Leroy Brown\nBaddest man in the whole damn town\nBadder than the deep blue seaaaaa\nBadder than you and meeeeee\nNiggas coming through the trees like a salamander\nBiting like a piranha\nBut I'm biting you back, like a black panther, the style I'm ampin' the...\nFuck my name, who I be?\nFuck the game, it's all about the money!\nOwahhaerahh\nSometimes I get high with the Meth then I turn to the Killah Priest\nWhen it comes 12 o'clock! I turn into the demon beast\n\nYo, yo fuck that shit!\n\n[Number two, the snake]\nYO! SHOW THESE MOTHERFUCKERS WHAT TIME IT IS\n[Number two, the snake] Rawwrarrrah\nRahhwarwaahauh, rawwaroar!!\nWHO's THE BAD-ASS? *rawharrah*\nWHO's THE BAD-ASS?\n[Now number two] Rawwwaahrah\n[He practiced the snake style\nHe was known as the snake spirit] YEAHhhhhh\n\n[Verse 5: Buddha Monk]\nLyrics, never waiting, twelve days penetrated\nWhen I come with the roughness, mad niggas try to rush this\nSlip into my killings, then I slays and you're helpless\nWhen I try to stay sick, it's Yakub grafted six\nCalm for the kill, knowing the style that's ill\nWhen I drop the greatest skills, brothers say, 'Buddha chill!!'\n\n[Outro: Ol' Dirty Bastard]\nI don't need to rhyme no more, niggas know, yo!\nTo all the Wu-Tang Clan members\nThe Ghostface Killah, the GZA, the RZA, the Ol' Dirty Bastard\nThe Method Man, the Chef - Raekwon, Inspectah Deck, U-God\nYo!!!", "[Intro: Ol' Dirty Bastard]\nYo, are you taping baby?\nBaby are you taping?\nOhh yeahhahhahheeyahhhyahhhhohhhyahhhh\nBaby baby c'mon, baby c'mon, baby c'mon\nWhat the fuck anybody wanna do?\nRight motherfucking now!\nAhhahhahhhah\n\n[Verse 1: Ol' Dirty Bastard]\nI'm the god who's the head of the Lords\nDirty Bastard from the Wu-Tang squad\nCan I get raw? Yes, I get Dirty to the floor\nRhymes, hitting on your mind, you could never ignore\nHip-Hop to me is like a place to be\nMy specialty from me to you is MC\nSay what you wanna say, baby say\nI flip the microphone-ah, any day\nI'm mad swift because I got that gift of gab\nNiggas get mad, your ass never had\nThis talent that I got will riz-zock the spot\nMCs, you got paid a lot\nYou ever notice a black man damn mostly slams\nWhen it come to the money, yo it ain't funny\nIt's what you gotta do what you got to do\n\n[Bridge: Ol' Dirty Bastard]\nC'mon, can I get a Wu-Tang\nWu, Tang, Wu, Tang, Wu, Tang, Wu, Tang\nWu, Tang, Wu, Tang, Wu, Tang, it's on your brain\n\n[Verse 2: Ol' Dirty Bastard]\nI get riggy diggy raw when it's time to get\nOn the dance floor shotgun kill the shit\nBlaow, then you won't step to me\nThinking is he really raw as he said he'd be\nIf I wasn't really raw, standing here on the floor\nYou'd be like, \"Booooo! He ain't hardcore!\"\nNiggas play like they live but won't survive\nJumpin up and down ticklin that jive when you ticklin gab\nI'm an average man, G-O-D fan\nLet it be known who's the champ, Wu-Tang Clan!\nIt's coming through and WU, boy it's bad too!\nThrow your hands in the air, if you don't care\nWHO, the Ol Dirty Bastard be\nOh me on my, you be hoppin on my shit just like a fly\nBZZZZT, all around\nThe dirtiest stinkin sound down to the ground\nWhat, what, what you wanna do?\nWhat you wanna do when I'm coming for you?\nI'm gonna give it to ya, bayyybah, bayybah\nBayybahhhahahahahahahahahahah...", "[Intro]\n(Say peace) Peace!\nDirty, Ol' Dirty Bastard\n(Say it, say it again)\nThe Genius! Genius (The Genius)\nThe Genius, the Genius\n\n[Verse: Ol Dirty Bastard & GZA]\nI'll grab the mic and I'll damage ya\nCrush your whole stamina\nHere comes the medical examiner\nOne verse then you're out for the count\nBring the ammonia, make sure he sniffs the right amount\nWake him up and then ask him\nWhy did he attend this --\nCompetition to get ass kickin' so tremendous\nBoy you know you shouldn't bother this\nLeave me alone like the son said G or he'll be fatherless!\nI got the asiatic flow mixed with disco\nRoll up on the scene like the Count of Monte Cristo\nAnd MCs start to vanish\nI stepped up to a jet black kid, started speakin' Spanish!\nYo he wasn't from Panama\nAsked him how he get so dark, the nigga said suntanama!\nHe responded so fast, he made me laugh\nHa-ha-ha, HARARRRH then I scared-his ass!\nKicked the hundred strongest rhymes\nI brought out the punk in him\nCaught him with a strong five deadly venom\nTold him enter the Wu-Tang\nWitness the Shaolin slang, that'll crush the shit you bring\nAnd watch your ass take a big fall, why?!\nMy Main Source is like a friendly game of stickball\nAnd as you step up to bat man and I play the riddler\nTry to do me for a rhyme and I'll change to Hitler\nGo out like a Nazi; you'll be wishin' your fuckin' ass stayed home and played Yahtzee!\nOr watchin' Happy Days sweatin' Potsie\nWith Ralphie and Richie Cunningham, Joni and Chachi\nWu, who? Me gettin' wrecked so I'm through\nLike a ten and a half foot gettin' in a seven shoe\nNow picture that with a Minolta\nHave your ass doin' some Night Fever shit like John Travolta\nI come strong, I make knowledge born, I flip the script\nAnd rock on from P.M. past the fucking Dawn\nPass the Hammer you're broke down, English grammar, what, what\nCan't understand it here's the panorama\nA complete view of how I defeat you\nShould've stepped to those fuckin' kids who tried to beat you\nYeah, I bust that ass before\nYou ran to Texas and came back but forgot the chainsaw!\nAnd when I perform a massacre\nBetter be coming with some motherfucking shit that's spectacular\nCrush the personal vendetta, well you just better\nStart stepping to your raggedy ass jetta\nPut the pedal to the metal\nYou and your DJ change your name to Ma and Pa Kettle\nAs I pass the bone, kicks your every measure\nIt's not a Newport but it's still live with pleasure\nC'mon don't be silly, just a bag of sensimilli\nRolled up in a Motown Philly\nI used to write all the time when I smoked\nGrab the mic, then I like kinda went for broke\nWith visually concepts strongest rhymes and biceps\nLyrically speakin', three to four rhymes a choke\nSome think they be harmin' this, claimin' they be bombin' this\nBut they still remains anonymous\nI pull strings like Jimi Hendrix\nRhyme on beats that go backs to the days of Eddie Kendricks\nI teach the truth to the youth, I say, \"hey youth\nHere's the truth, better start wearing bulletproof\"\nArm yourself with a shield\n'Fore you get trapped up just like the children in the cornfield", "[Verse 1]\nPlease pull the plug if the drugs are winning\nCause the high will keep your world spinning\nWasted time, thought about the high with fam\nTrue the cash was there, and the stash was there\nAnd I thought that Forever that the Wu was there\nWasted time, on hoes, pussy and clothes\nI'm the Don of the rose, it's the life I chose\nBaby Mamas are the worst, bitches don't even work\nYet the Coach bag matches with your hat and your skirt\nSo I slept for no reason, disappeared for seasons\nRoom may be padded, but damn, it's more easy\nBeautiful girls tease me, they see the sleaze in me\nBut I'mma stay Dirty, accept the snake\nNo more will I waste the cake, no more will I run from Jake\nNo more will I make mistakes, no more will I waste the time\n\n[Hook]\nNo more will you spit in my drink, no more will you poison me\nI'mma climb real high, feel free with the thug inside\nNo more will I run and hide, wastin' time\nNo more will I taste the drugs, no more will I dodge the slugs\nI'mma climb real high, feel free with the thug inside\nNo more will I run and hide, no more will I run and hide\nNo more will I waste the time\n\n[Verse 2]\nI walk on a dirty trail of cash and L's\nRed Rose, you get high when I exhale\nJumped bail cause the judge promised my ass jail\nWest Coast couldn't hide me, the world's an audience\nPassed out from the high like Martin Lawrence\nHad me in the room next to Sarah Connor's\nBut my problem's much greater than any Terminator\nNot one visit from fam, just letters from fans\nSaying \"Dirt keep ya head up and fuck getting wet up\"\nThe Roc told me to sign on the dotted line\n\"Welcome home, Russell Jones, you've been wasting time\nRocked up a little, bling bling a little\nNow every roach in the cracks wanna jump in the Ac\nEvery cat in the front gotta ride in the back\nYou freaks in the Ford, I ride a Cadillac\nYou freaks in the Ford, I ride a Cadillac\nAt last\n\n[Hook]", "[Intro]\nMy beats are slamming\n\n[Verse 1]\nMy beats are slamming from the rugged programming\nMy man Bob Marley hey my man I'm jamming\nYou could never touch the stamina, while I'm ramming the\nHip-hop crowd makes me rrrah rrrah rrrah\nOther MC's got flipped with the ease\nBegging me for mercy, stop the music please\nNo cause I'm a pro, rap to the convo\nMake a crowd say ho, at a strip show\nRepresent, my name is Ason keep calm\nRhyme's too smoky, funky like a stink bomb\nBoom, blowing up niggas better than pulling the trigger\nSo you betta run for cover\nNiggas better loosen they ass, felt the glass\nA forty ounce bottle, yo yo yo money yo pass\nWoooh-woooh-woooh, I sweat it live\nIs he gonna live doc?, no the nigga dies\nThe max-imum of MC's are populating\nThe min-imum of those MC's are dominating\nNow all and together now, to what what who\nRhymes come stinky like a girl's poo-poo\n\n[Hook]\nHippa to da hoppa and you just don't stoppa\nHippa to da hoppa and you just don't stoppa\n\n[Verse 2]\nAhh shit, here I go once again\nRhymes get shitty from the time that I spend\nI come old like toe fungus mold\nAsk my grand-pop pop duke gave my soul\nThen I came with that old Al Green shit\nSaaa-die, taught me the ballistic\nI get you blurry in your eye with a high note\nDown, to the Brownsville, oops you got smoked\nThe shit I'm dropping is stinking up your area\nWhen I shoot it through like a messenger carrier\nI keep my breath smelling like shit so I can get\nFunky baby I'm not having it\n\n[Hook]\nHippa to da hoppa and you just don't stoppa\nHippa to da hoppa and you just don't stoppa\nHippa to da hoppa and you just don't stoppa\nHippa to da hoppa and you just don't stoppa\n\n[Outro]\nThe Hellfire style!\n(Sound of dragon breathing fire) Dragon Fist!\n(Sound of horse neighing and running.) Horse Fist!\nBastard, I didn't know who you were!", "[Intro: Ol' Dirty Bastard]\nHell\nRemember when we was young\nAnd we used to go\n(ahhhhhhhhhh) *repeated*\nAh, Punch Call!\nNo no, remember when we used to say who could do this the longest\n(ahhhhhhhhh) *repeated*\n*breaks down*\nAhhhh!!!!!!!! ahhhhhhhhh!!!!!!!!!!\nAll right, I'm about to put it\nGoin down, down\n\n[Verse 1: Ol' Dirty Bastard]\nI am the U-N-I, The Q-U-E, the G to the O-D\nI said I go by the unforgettable name of the man called Unique G\nWell, my name is known all over the world\nTo the foxy ladies and the pretty girls\nI go down in history\nAs the baddest brother that ever could be\n\nYou couldn't show me\nDidn't know me\nHow to be a true MC\n\nMy advantage on the M-I-C is the slang\nThat I manifest so you could never hang\nObviously you know my name by now\nI done thrown stupid parties all through your town\nDirt McGirt...that's my motherfucking name\nLove to flirt...that's my motherfucking game\nThey said \"Who wanna be an MC?\"\nI am the original G-O-D\nMaking young ladies scream's my specialty\nSee my style, different from yours\nMake young bitch wanna drop the drawers\n\n[Interlude: Icelene Jones]\nFuck that bullshit Unique\nYou my motherfucking husband\nI ain't got no motherfucking time for them bitches\nYou better come home with me\nYou better bring your motherfucking ass home tonight, motherfucker\nI ain't got no motherfucking time for no bitches calling my motherfucking house with that bullshit\nYou got three fucking babies to take care of\nFuck that shit\n\n[Interlude: Ol' Dirty Bastard]\nMatter of fact, I gotta song for you all:\nSOMEWHERE OVER THE RAINBOW\nWHERE BLUEBIRDS FLY\nSOMEWHERE OVER THE RAINBOW\nWHY OH WHY\n\nHEAR ME NOW!\n\n[Verse 2: Ol' Dirty Bastard]\nStyle funky, you know dat's me\nFear no evilllll whohoho one man army\nDown for mine when I go on tour\nThrow your hands in the air if you want more\nStyle is evil is like an wicked witch\nWith the mi-ca-phone spliggh! Funky as a bitch\nWhich is which, makes me nasty nasty\nNext on the mic is the rappin NUH\nYou want some of the Ason's gun\nShoot the nigga, BLAAOW, reaches no one\nThen you KNOW not to touch my HOE\nI like livin my own fuckin show", "[Intro]\nGirl 1: Oh cutie got it goin' ON!\nGirl 2: Cute? What? That dirty motherfucker?\nGirl 1: You buggin'!\nGirl 2: Ain't no buggin', he's some ugly motherfucker\nGirl 1: You buggin', yo -- look at his disposition, shorty gotta stride!\nGirl 2: What stride? Bummy motherfucker, he ain't shit\nGirl 1: See, that's my flavor, rough, you don't know nothin' about that\nGirl 2: You got mad sour flavor on girl, cuz that ain't shit at all...\nGirl 1: I'm -- yo G, I don't think he really realize. Look at him!\nGirl 2: Look at what? Dirty motherfucker, he ain't shit\nGirl 1: Hahaha, you don't see what I see, B\nGirl 2: I don't see nothing. You wear glasses so...\nGirl 1: Hahaha, True, true. Just look at him, personally-\nODB: (I like that mothafucka!)\nGirl 1: Just look at him...Homie's just dispositioned...\n\n[Verse 1: Ol' Dirty Bastard]\nApproach the school nine thirty, you're late\nThe time happy the solution was my date\nGet in your class, walk to your chair\nPop is all you see and then occasionally stare\nAt the teacher, or students who were clockin' you\nLean back at this girl who kept clockin' you\nStimulated from a sensimilla blunt\nTell the young girl \"Baby, you're the one I want.\"\nShe doesn't respond, pretends to ignore\nSo you say to yourself, it be her cold and sore mentally\nVisualize the aim on the board\nAs how to buy pussy you cannot afford\nThis girl who, was slim and trim\nWhispered in her friend’s ear quietly ‘I want HIM!'\nI took out my books to write the notes for my class\nBut I Kept fantasizing my dick in that ass\nSo I turned around to arrange a date\nSwinging episode, baby number one's gotta say it\nShe popped a gum, cold twist to come\nI said \"Baby, how you feel?\", She said \"chill\"\nThen I said \"chill\", I just found my thrill\nWear it in the classroom, know I'm Blueberry Hill\nCause what I said just bottled her hate\nShe put her face on the chest, this is what the bitch said:\n\"Because of you I ain't hurting, but within my within my heart\nCause no, I'm not right to be flirtin, but our relationship has to start\nYou're the one that I'm clocking, time for you could stop mockin'\nDon't want you to see me cry, this is why, this is why, this is why!\"\n\n[Verse 2: Killah Priest]\nI met a girl named Chandra, from way down yonder\nThe apple of my eye had a Snapple and some fries\nForgot the ketchup, that's when I pressed up\n\"I've been watching you mowing your lawn\"\nThe thoughts were flowin', while I'm holding her palm\n\"Hey what's that on your menu?\", from there we continued\nAnd talk about this and that we chit and chat\nSipped on the Coke then I stroked her back\nAs she giggled and I wiggled to the bra\nShe said \"nah!\", that's when I noticed her Pa\nBig Tank, who did nothing but the spank\nAt parties, drink Bacardi and didn't think\nJust act silly, with his brother Willy\nAnother hillbilly gettin' ill with the Philly\nAnd moonshine, but it's a new time of day\nOn the stoop doing the Patty Duke\nOK, it's like that old flip flaps through the shower caps\nThe platform shoes to Apple Jacks\nChub chub!!\n\n[Interlude: Ol' Dirty Bastard]\nYo, you niggas, niggas be actin like\nThey be lovin' them, them them fancy bitches\nI, I likes me a nasty bitch\nBitch that's willing to do anything at any given time\nBitch gotta be nasty cuz I'm a nasty nigga\nI do anything baby, I wouldn't give a fuck what it was\nI'll, ah, anything - I'm a nasty motherfucker girl\n\n[Verse 3: Ol' Dirty Bastard]\nI'm just sittin' right, in my class at a quarter to ten right?\nWaiting patiently for the class to begin right?, teacher says\n\"Open up your texts and read the first paragraph on oral sex!\"\nI said \"Oral sex!, what kind of class is this?!\"\nThe girl next to me said \"what's wrong with you miss?\nThis is a lesson that makes you feel fine\nKinda ease your nerves and relax your mind!\"\nI said \"Don't try to use no hypnotic spell!\"\nShe said \"Be my assistant, I'd sure rather tell!\"\nMy knees buckled heart started to drop\nMy dick grew to a size that my nerves couldn't stop\nI tried to run! She yelled out \"freeze!\"\nPulled down my draws, dropped to her knees\nRipped off my draws as if she had claws\nBroke the rules that defined sex laws\nShe responded quick, with a slick, welcoming kiss and a ice cream lick\nOh, I begged, I begged, \"Easy on my balls, they're fragile as eggs.\"\nPart 2 coming up...", "[Intro]\nOne two, one two -- you taping this?\nAll types of shit yo let that shit ride\nWord to mother, turn up the microphone!\nGet all that good shit, get all that good shit [one two, one two]\nOne two, one two, one two... one two\nNow niggas know\nSsssshhhit, yo yo check this out, check this joint\nThis is strictly for the radio, yo\nI just want all y'all to know\nThe reason why I curse is because my momma and my daddy\nThey grew up cursin\nSo please respect my style, please!\n\n[Verse 1: Ol' Dirty Bastard]\nI'll grab the mic and now I damage you, cut your whole stamin-u\nOhh, sssshit, nahh\nI'll grab the mic and now I damage ya, cut your whole staminuh\nHere comes the medical examinuh\nOne verse then you out for the count\nBring the ammonia make sure he sniffs... the right amount\nYa yo, I'm sorry, un-gah-e-gas-e-ya\n\nI'll grab the mic and now I damage you, cut your whole stamiNUH\nHere comes the medical examiNUH\nOne verse then you're out for the count\nBring the ammonia, make sure he sniffs the right amount\nWake you up and then I ask you\nHow do you attend this --\nCompetition to get an asssss kickin sooooo tremendous, RARRH!\nYou shouldn't bother this\nLeave me alone like a son he'll be fatherless!\nI got the asiatic flow mixed with disco\nRoll up on the scene like the Count of Monte Crisco\nAnd MC's start to vanish\nI rolled up on a jet black kid the nigga started speakin spanish\nYo! You wasn't from Panama!!\nI asked you how you get so fuckin dark, you said \"Suntanama!\"\nHe responded so fast, you made me laugh\nHa-ha-ha, HARARRRH scared-his ass!\nKick the hundred strongest rhymes\nThen I brought out the punk in him\nRoll up with the strong five deadly venoms\nTold HIM! Enter the Wu-Tang!\nWitness the Shaolin slang, that crush any shit you bring\nI watch your ass take a big fall, why?!\nMy Main Source, is like a friendly game of stickball\nAnd as you step up to bat man, I play the riddler\nYou try to do me for my nigga I'll change to Hitler\nI'll go out like Nazi, wish your fuckin ass stayed\nHome and play Yahtzee!\nOr watchin Happy Days sweatin Poxie\nWith Ralphie and Cunningham, Joni and Chachi\n\n[Yo Unique, yo kid\nCheck this shit out! Yo, yo]\n\n[Verse 2: Ghostface Killah]\nNinety-five niggas is wasted\nKeystone capered, and Wu kept the rap fiends basted\nFoamin out the mouthpiece, heads blown like geese\nMurderous police, I do shows and perform in Grease\nIt's not magic, gaming is the gadget\nWorld classic big national high attracts dear graphics\nLampin in my own zone, my physical show\nInhale bones Tony stuck, for the diamond in Rome\nHe's convincin, labelled one man rap convention\nThe nigga that'll gun down, eighty frenchmen\nLead vocalist, music specialist, rap arsonist\nI deal with sharpness plus spark the hardest individual\nI plant crimes inside vocals\nMy rap's like my passport, my life's my proof\nHit the sun roof, be out like a wanderin dream\nShuttle, and get startled off the verbal hygiene, my nigga\n\n[Sample of Damage]\n[Sample of Baby C'mon]\n[Sample of Brooklyn Zoo]\n[Sample of Drunk Game (Sweet Sugar Pie)]\n[Sample of The Stomp]\n\nShame on you when you step through to\nOl Dirty Bastard, Brooklyn Zoo!\nShame on you when you step through to\nOl Dirty Bastard, Brooklyn Zoo!\nWhat?!! My nuh\nShame on you when you step through to\nThe Ol Dirty Bastard, Brooklyn Zoo\nShame on you when you step through to\nThe Ol Dirty Bastard, Brooklyn Zoo\nTo the West coast!\nTo the East coast!\nTo the North coast\nTo the South\nWhen you take North, East, West, South\nPut it all together and it spell NEWS!\nThen you got the ol rhythm, bastard blues\nAnd ya don't stop\nSo keep your shit, motherfucker, fucker, fucker!\n\n[Live concert]\nWord up, louder\nRepresent, how do we do?\nPlease everybody\nYo #1 is the Brooklyn Zoo in the muthafucka house?\nYeah!!\nMan, come on man with that bullshit\nIs the Brooklyn Zoo in the muthafucka house?\nFuck is goin on, niggas from Brooklyn don’t fuckin scream like that\nNiggas don’t yell like that\nMuthafuckas is the Brooklyn Zoo in the muthafuckin house?\nShit, is Uptown in the muthafuckin house?\nHehehe, hehehe\nYo, fuck that shit\nIs my black niggas and niggarettes in the muthafucka house?\nShit is live here at the Two man\nBut yo, what I can't understand man, a nigga gotta get drunk\nOl' Dirty I got my Brooklyn Zoo niggas here tonight\nYouknowhatI'msayin\nThese niggas ain’t no muthafucka joke\nWhen Ol' dirty Bastard records\nWhat the fuck is down\nGimme some love nigga\nWhat these niggas?\nYo, check it out, yo\nI’m a get busy for y'all niggas and niggaretts tonight\nYouknowhatI'msayin, but\nA nigga is sober a reason gotta get drunk for\nSo y'all keep continuin this phat shit\nI wanna give nuff respect to everybody that’s comin here doin this shit\nYouknowhatI'msayin\nCuz my man, the Bandit over here\nHe gonna have shit goin for ya\nOn the real side baby\nNiggas gotta go\nKeep it real, niggas gonna get drunk, niggas gotta go\nLike I can really fuck a nigga up shit\nWhen you drunk, all you can see is fuckin light man\nThat’s all I know , that’s all i see\nLet me move the fuck over here\nYo yo, these niggas straight jacket and shit\nI give nuttin' but respect to niggas that got out here man\nYouknowhatI'msayin\nNiggas comin into this rap game and shit\nAnd muthafuckers actually think this fuckin rap game is a fuckin joke!\nLet me explain to yall about how tha fuck rap is\nSee rap to me, is like my bitch, right, my bitch\nShe fuckin up a nigga, and I get mad and I wanna kill the bitch and I wanna kill the nigga\nSee this is how we must step up to the muthafuckin microphone", "[Verse 1: Ol’ Dirty Bastard & RZA]\nHere it is. Where’s it at? In the back. Got a stack\nThe Dirty Bastard. Yo, you Bastard flip the phat track\nHere I go, here I go, whether friend whether foe\nLet them know that I flow over the rainbow\nHit the deck. Aw, yep, *ch-ch plow* from the Tek\nTakin’ heads, takin’ necks. What the fuck they expect?\nI don’t know! I don’t care! I won’t fall! I won’t stare\nAt a ho, ’less I know that I’m going to the mo-\nT-t-tel, ’cause I’m lousy, my technique is drowsy\nStop tryin’ to foul me, sayin’ that we're lousy\nBut I’m a tyrant, defiant, walkin’ New York Giant\nPresident of the Wu, but I’m also a client\nIt’s the Wu, what, you knew what, you do what, what, who, what, what\nI don’t give a flying fuck about a chump\nCause his heart only pumps Kool-Aid\nSnatch a kid by the braids, and cut his head off\n\n[Verse 2: Ol’ Dirty Bastard & RZA]\nRhymes is rugged like burnt buildings in Harlem\nThe Ol’ Dirty Bastard from the Temple of Shaolin\nDirty to the brain like drops of acid rain\nClang, clang, clang, rhymes pluckin’ at your brain\nSo take a sip from the cup of death\nAnd when you’re shaking my right hand, I’ll stab you with the left\n*Whirr, whirr, whirrr!* Red alert, red alert!\nAson comin’ straight from the dirt\nOnce I go berzerk, mad brothers got hurt\nNuthin’ new in ninety-two, it’s time to go to work\nTrills, watch them scream once I hop on the scene\nThey fear the return of the fatal flying guillotine\nMr. Milli, that means I’m also militant\nDon’t wear no suit and tie, I’m no gentleman\nGettin’ laid, takin’ heads, that’s my hobby\nPunch a brother in the face who call me Robbie\nI be the RZA, call me that cuz-I\nNever liked the name I received from my poppa\nDirty deluxe, yo, I’m huntin’ for ducks\nSnatchin’ devils up by the hair, then cut his head off", "[Intro: Russell Jones (RZA)]\nAhh ahh, I never saw so many people tonight\nI mean y'all all got it crowded up in here and that's good\nI'm glad that y'all givin it up for him, y'all givin it up for him\nThat's good -- y'all make me want to cry or somethin\nAlright ladies and gentleman, tonight is a special night\nFor one thing let me introduce myself my name is Mr. Russell Jones\nExcuse me for that one I had to let that one low ahh-hahhh\nAnd tonight, you're going to see something that you never seen before\nSomethin that, that nobody in the history of rap ever set theyself to do\nThis fuckin guy, that I speak to you about, is somethin' crazy\nHe's somethin' insane, he's the greatest performer every-since\nUhh, what's the guys name? (Ol' Dirty!!)\nAhh, da, ahh, James Brown, he's bad, and he's a cool guy\nAnd you'll really need him, I mean need to really get to know him\nLadies and gentleman, from all houses, to all towns\nFrom the moons of Pluto, back down to earth\nLadies and gentleman, one more time, give it up for\nThe Old Dirty Doggy, I mean, the Ol' Dirty Bastard\nI love that guy!\n(Ol' Dirty!)\n\n[Verse: Ol' Dirty Bastard]\nYes, how y'all doin' out there?\nI wanted y'all to know that tonight is a special night\nCause I'm happy to be living, you know\nA nigga tried to shoot me down and shit\nYou know and, I don't know man it just feel good to be here man\nYouknowhatI'msayin?\nAnd I wanna let all y'all know I love you man, I love all y'all\nYou know, but *sniff* but I really came here tonight *sniff*\nFor one reason *sniff*, just cause *sniff* I don't mean to cry\nI don't mean to cry, dub you can play that shit man, play it man\nI'm tired of this shit, remember the time I told y'all\nWhen I got burnt, gonorrhea\nWell this bitch, there's a new bitch goddamnit\nOhh, bitch burnt me again with gonorrhea\nSo I didn't get burnt one time I got burnt actually two times\nWhen you really look at it\nYeah, I love the girl but I had to cut the bitch off\nYeah the bitch died, I killed the bitch\nShe suffered a long pain\nBut she had to go, bitch had to go\nI I knew the bitch for ten minutes of her life\nBut the pussy was good! Yes the pussy was good!\nI just want you to know girl!\nThat I dedicated, this song, well this song really was written by Blowfly\nAnd I want all y'all to hear this shit\nIt's just a poem that I writ for you girl *paper crinkles*\n\n*singing*\nThe first time, ever you sucked my dick - Thank you thank you!\nI felt, the earth tremble, under my balls\nSomethin' shot out of me real fast\nFirst time\n\nNah I'm just kidding witch'all\nHow y'all feelin, listen to the album cuz it's BANGIN\n\n[Outro: Sample]\nWe have only thirty-five chambers, there is no thirty-six\nI know that, but, I want to create a new chamber\nOh? And what would that be?", "[Intro: Ol' Dirty Bastard]\nSing the song, sing along with me\nSing the song, sing the song with me\n\n[Verse 1: Ol' Dirty Bastard]\nLelele lady, tell me why, tell me so\nI ask you to go high, you tell me to go low\nSo I go low, [slurp], taste the shit\n[Slurp], taste it again, I like it\n[Rrr] I'm the original G-O-D\nMaking young ladies scream's my specialty\nWhen I go DUN DUN DUN DUH, girls get hype\nFrom the funky fresh music that was stereotyped\nWhen I kill, that ol' mad funky flow\nNot sayin Ason, duck duck disco\nOr disco duck, strictly hip hop\nBaby baby, I can't stop\nWu, gots  like come on through\nSoo, that's the call for the Wu\nI came here to rectify\nBROOKLYN ZOO, terrify\nWhy, niggas wanna get up and rap and rap and rap\nMan, fuck that\nShit, that I make it's the skit\nI wanna see ya hands in the air, can ya dig it\nLet's sing the song\nCome on party people, all in together now, sing along\n\nHave you ever ever ever\nIn your long legged life\nHad a bald headed bitch\nFor your bald headed wife\n\n[Laughter] Gimme dat\n\n[Verse 2: Ol' Dirty Bastard]\nWho's the baddest motherfucka in the Brooklyn town\nAnd also representer of the Wu-Tang sound\nIf you wanna jump up and get fucked up\nLast nigga got up and got shot up\nBut you's a gangsta, on the boards I'll bang ya\nMess with the Wu-Tanger, I'll hang ya\nYou'll get shanked and spanked and alley-ooped\nI admire true niggas like Dre and Snoop\nChamber number 9, verse 32\nOnly speaks about BROOKLYN ZOO\nThat a true nigga shall come through\nNo-one is available to be compatible\n\nThis is chamber number 9, verse 32\nIs what we call The Stomp\n\n[Stomp] Raekwon\nThe stomp is down [Stomp]\nGet down for your crown [Stomp]\nStomp [Stomp]\n\n[Verse 3: Ol' Dirty Bastard]\nBrothas always playin with the microphone\nWhen it blows up in your face, [BOOM] you leave it alone\nYou couldn't touch, this style is too much\nIt's the rhymer, I don't give a crippled crab crutch\n[Grruh] About any nigga or niggerette\nGet burned to the brimecell like a cigarette\nStraight up and down, I get dirty to the ground\nRhymin gets me paid madd bread by the pound\nShout out to my crew, tight as a belt y'all\nGo by the name Big A, from the shelter", "[Intro: Ol' Dirty Bastard, Shorty Shit Stain, and others]\n(the first line originally ended \"Dirty Dancin\" on Jerky Boys sountrack)\nShit that makes me high\n[One two, one two]\nYo, we gonna bring it back, to Harlem World\nMotherfuckin' jocks (British Knights)\nYo I remember when niggas was walking down the street\nOn Farmers, motherfuckers was wearin goose goose\nMotherfuckers walking around with Brogans\n(I was wearing 'em)\nI'm sayin though\n[One two, one two]\nA gold tooth that was never shined\nI'm sayin though\nSee cause tonight, is the night of all nights\nMost people gather around\nTo hear the show, that is comin through your town\n(I was playin' em)\nSee my name [what what?]\nIs somethin, that you won't know\nUnless you're dowwwwwwwwn, with the Brooklyn Zoo\n(I was wearing 'em)\nOther brothers come\nBut never come back\n(Introducing)\n\nSo basically, what the Ol'-motherfuckin-Dirty Bastard is sayin'\nIs that if you fuck around [one two, one two]\nYou're gonna get yo' ass fucked up\nSo don't fuck around just lay down\n\n[Verse 1: Ol' Dirty Bastard]\nI remember (dnnah-dah, dnh, duh, dnh, dnnah-dah)\nNot too long ago (dnnah-dah, dnh, duh, dnh, dnnah-dah)\nI went to a city (dnnah-dah, dnh, duh, dnh, dnnah-dah)\nAnd I saw a Wu-Tang show (dnnah-dah, dnh, duh, dnh, dnnah-dah)\nNow I always wanted (dnnah-dah, dnh, duh, dnh, dnnah-dah)\nTo get, with, the band (dnnah-dah, dnh, duh, dnh, dnnah-dah)\nBut niggas was singin they own songs\nBein in they own worlds\nSo I guess I, I guess I, RARAARRRRAAHHH!!!\nThe terminology, the psychology\nYou still expect me to accept\nDo what I say off the TDK...\nWith the button on record and the other on...\nThus I press pause for a serious cause\nTo respect an intellect with this gratifying\nNow that I'm ready let the music begin\nAs I detect what I wrote with my...\nThrough the time that I spent, money that I lent\nRap records went up just about\nThen became a new way to get paid\nThey said, \"rhymin' on the mic is the number one...\"\nThen a brother get the feeling that he want to play cool\nYou discombumberated diabolical fool\nHog-flesh MC, go play in the mud\nAnother 20th century, modern day\nCannibal, humanoid, underground (Dweller)\nChud broke loose from the god damn (Cellar)\nDope-fiend addict why you walk with\nAcquired Immune Deficiency Syndrome\nWhen the MCs came, to live out their name\nMost rocked rhymes that was all the...\nWhen I elevated, and mastered the time\nYou was stimulated from the high post\nYou got shot cause you knew you were rocked\n\n[Verse 2: Ol' Dirty Bastard]\nYou're not the king of the diss\nYouse a queen of a bitch\nYou're like a homosexual\nYour ass always switch\nNiggas wake up in the morning\nYour ugly-ass guise\nGot slob around your mouth\nGreen cold in your eye\nYou can't smile your teeth too gritty\nCan't even move, drawers too shitty\n(you know what else) You're shaped like a thistle\nThe holes in your drawers when you fart them shits (whistle)\nYOU DUCKIN SUCKIN MOTHERFUCKIN COLD-HEARTED FAGGOT\nSperm germ slimy worm DISINTEGRATED MAGGOT\nRepeat your rhymes all the time like a FUCKIN parrot\nPhony gold chains only rated two carats\nYou tell your friends that your home is like heaven\nLivin in the gutter sewer seven pipe eleven\nYou wear your socks twelve days in a row\nTurn them on the other side so the dirt won't show\nGo to school, take a shit, don't wipe your ass\nBlame it on another sucka nigga in your class\nYOU WANNA BATTLE?\nIs it the pork on your fork, or the swine on your mind\nMake you rap against a brother with a weak-ass rhyme\nSwine on your mind, pork on your fork\nMake you imitate a brother in the state of New York\nChain on your BRAIN, that drove you inSANE\nWhen you tried to CLAIM, for the talent and the FAME\nNothin to GAIN, yet and still you CAME\nSuffer the PAIN, as I demolish your NAME\nNot like Betty Crocker, baking cake in the OV\nSayin this is dedicated to the one I love\nNot a swine or dove, from the heaven's up above\nWhen I rap, people CLAP, so they push and they shove\nWhen I rhyme I get LOOSE, better than Mother Goose\nRock the mic day and NIGHT, so you see I'm the JUICE\nLike the two-six-EIGHT, politicians demonstrate\n\n[Outro]\nNow hold up hold up hold up hold up\nWhat y'all niggas don't seem to hear\nIs y'all can not FUCK with me\nI saiiiiiiiiiid\nALLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLL\nCan't FUCK with me\nI wanna give a shout out to my nigga Dore, Dore, Dore\nBuddah Monk, Buddah Monk, Buddah Monk\nYo, Jack, Jack, Jack, Jack, Jack\nFor the niggas who's here\nAnd the girls who's out there\nThrow your hands in the air\nCause this one is more fly\nFly, fly\nFlyyyyy, flyyyy\nFlyyyyyyyyahhahayhahhhha\nBZZZZT\nWooo!\nGet your ass in the house boy, I told you\nGet your ass in the house! Get, get, in the god damn house boy!\nLast fuckin time I'm gonna talk to you you hard-headed motherfucker\nC'mon daddy?\nI didn't mean nothin by it\nBut when it come to... FUCKIN with you MCs", "[Intro]\nYo, when I say you don't want to fuck with me\nI'm not talking to you girl (and woman)\nYo, 'cause y'all want to fuck... y'all want to fuck me\n\n[Verse]\nI stay away from danger, danger stay away from me\nI counter react on y'all niggas and then I flee\nWhatever you say is a mirage\nAnd on top of that, huh, nigga fuck y'all\nI'm the law of the land, got girls Uncle Nuggah\nI gagagaga got girls on the command\nI got the government lost on Gilligan Island\n(Nigga Please!)\nBy December, CIA gettin' paid taxes back\nFrom the Candy Cane, Santa came, back in the big hurricane\nYou ain't shaggy anymore, DA, I ain't in your ballgame\nI became, ain't your doggy bag ho same\nYou gotta make Ol' Dirty a better man\nIn the world if you wanna live\nFuck y'all, God don't forgive, I don't answer phones\nI'll never reveal the Wu-Tang secret and if you don't believe\nI'll kill your shit\n\n[Chorus]\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\n\n[Verse 2]\nPlease Nigga! You couldn't jump jump jump\nYou couldn't punk, you couldn't funk funk funk the shit up\nMy name is Dirt Dog the 18\nMillimeter, shoot you up, bust you up\n(Fuck fuck, What?) I drop the ambulance on a nigga\nMac truck, runnin' over niggas\nI love bitches, when they front on they pussycat\nYou ain't gettin' over like a fat rat\nHate is the method, killin' all you savages\nYou won't be sendin' me messages\nI put your nigga on pause, I keep that shit on\nDestroy you through your whores\nCause you ain't never had clout\nYou niggas on a rap drought\nI never get tired, I ain't in your drama quote\nSuck my dick! Yeah that horror flick!\n\n[Chorus]\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\n(To the ugly girls, throw your hands in the fuckin' air!)\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\n(To the ugly bitches, wave 'em like you just don't care!)\n\n[Verse 3]\nYo, I'm the cunt, breast, asshole eater\nAnd if you let me physically eat it, it only get (burps)\nYo, don't race, you will lose!\nI'm stronger than booze! Don't eat the food!\nAAAAHH! If you really want to cum\nThe cocaine get your pussy numb\nYO! FUCK Y'ALL! EVERYBODY!\n\n[Chorus]\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\nYou don't want, you don't want fuck with me\n'Cause my name is Ol' Dirty\nYou don't want, you don't want fuck with me\nDon't ever look at my name as bad", "(Ol' Dirty Bastard is doing a Martin Lawrence comedy skit from You So Crazy)\n(this is going on in the background during the Intro and part\nOf the first verse)\n\nYou know God damn well I don't smoke this shit Meth\n*coughing* Know damn well I don't smoke this sheyit\nKnow damn well!\nI remember when we used to go down to the creek\nMember when we used to go down to the creek?\nAnd used to dip your head in the water?\nEverybody thought you had it in you, you know\nYou used to jump out the water\nThe water used to glisten alllllll over your bohhhhhhdy\nWhat? I said the water used to glisten alllllll over your bohhhhhhdy\n\n[Intro: Ol' Dirty Bastard]\nClean out my vocals\nYeah, I said YEAH\nI said zuckazuhzuhzuh, zuckazuhzuh\n*more nonsense noises*\nChkccha ckchcka Brooklyn, zucka Zoo\nC'mon baby baby, baby, baby\nBaby, baby, baby, c'mon!\n\n[Verse 1]\nSuperlogical this, superlogical that\nI detect a nigga dialect by the way he rap\nI elect myself President MC\nMy career so intelligent, unique physique\nThen with mathematics, not democratic\nStatic, topic, Asiatic\nZssshuh, them unique, never leak, brlaharl...\nBring it on back\nSuperlogical this, superlogical that\nI detect your dialect by the way you rappp!\nI elect myself President MC\nMy career so intelligent, unique physique\nDoin mathematics and I'm not democratic\nNo static, topic, I'm Asiatic\nSee, I'm Unique, never... blarhalal...\n\n[Verse 2: Method Man, Ol' Dirty Bastard]\nCrazy, lurkin in the shadows, I'm shady, sheisty\nGet your weight up, don't take me lightly\nBlasted, dirty to the grain I be stained with the madness\nIt's the Meth-Tical with the Bastard\nMZA MZA my name is the Ol Dirty Bas\nMy gammmmme, to kick your ass\nDnnah duh dnnh dnnh duh duh!\nDnnah dnh duh duh duh dahhhhhh!\nFlip and relax, take an Ex-Lax, I'm shittin\nOn the industry that was frontin now they missin\nWhat everybody else is gettin\nCuz they wasn't representin the real...\n...appeal, like me and, old time\nWhen it comes to the microphone who killed the swine?\nBe the original G\nDo the rhymin on time and in the place to be\n\n[Interlude: Ol' Dirty Bastard, Method Man]\nYou are now in my trance\nYou are getting sleeeeeepyyyyyy\nYou are now getting sleeeepyyyyy\nAnd sleeeeppieeerrrrr\nAnd sleepy, and sleepy\n\n[Verse 3: Method Man]\nThis one here's for my people, my people\nEnter the 36 chambers, the sequel\nPart two, for me and the cipher troop\nWith the Teflon lyrics that you can't get through\nWith the twenty-two automatic rap you pack, what?\nYou ain't hittin with that wack shit you kickin\nStraight from the beginning, of the game\nAll the way to the ninth inning, I bring the pain\nDark like the midnight train on the track by the RZA\nDiesel like Arnold Schwarzanegger\n\n[Outro: Ol' Dirty Bastard]\nThe hardware, choose the hardware\nAsk you a question, test the Ason\nExtra extra, read the drama and thennn another one\nWhich you intrigue, do your rap fatigue in the...\nOhhhh....\nHere I go, aauhhh\nYeahhh...\n(shit that makes me high)", "[Intro: DJ Premier (ODB samples)]\nRest in peace, Ol' Dirty\n\"See my name is the ODB\"\n\"The-the-the-the-the Ol' Dirty Bastard\"\n\"Wu-Tang, Wu-Tang, Wu-Tang, Wu-Tang\"\n\"Roc-a-Fella, Roc-a-Fella, Roc-a-Fella, Roc-a-Fella\"\n\"Wu-Tang, Wu-Tang\"\n\n[Hook 2X: Ol' Dirty Bastard w/ samples cut]\nAs I poppppppppppp, shotttttttttttttttttts\nAs I po-a-opppppppp, shotttttttttttttttttts\n\n[Ol' Dirty Bastard]\n'86 was the year that it started\nCrack hit the states, and my hood got to poppin'\nBack then, you had to catch it with narcotics\nWithout a doubt, Brooklyn had the hardest projects\nNowadays, if a nigga say you got it\nYou be sitting in the county, with like 3 or 4 charges\nYoung when started, but I had a talent\nTo get this package up, cuz I took it as a challenge\nThe older niggas game me much as I can handle\nCop the eagle, started jackin' with the green New Balance shit\nI'm feelin' clean, I was only thirteen\nWith the heavy starch, on my Bugle Boy Jeans\nMy name's spelled right on my four finger ring\nIt was Dirt then, cuz McGirt you ain't seen\n\n\"The Ol' Dirty Bastard\"\n\"Rollin....\"\n\n[Hook 2X w/ more samples cut]\n\n[Ol' Dirty Bastard]\nToe to toe, I scrap with the best\nIf I spit ten rhymes, nigga, nine gon' connect\nIf you ain't feelin' 1 or 2, I respect\nCuz I probably just forgot, and wrote it strictly for my set\nWu-Tang, man I love my set\nNiggas comin' up here, this is where the G's at\nLook here, more money, more problems, my ass\nYou'se a naive cat, if you still believe that, for real\nThat's a trick to try to keep you where you at\nAll content, while niggas ridin' Bentley's and Maybach\nThink I'mma lay back, playa, forget it\nFirst hundred G's, I see, nigga, I'm tryin' to flip it\nAnd that's some real shit, not just a lyric\nDrop a couple open cases, not too specific\nNiggas out here tryin' to prove whose the realest\nIt's ok to pop shit, but come a little different\n\n\"Tell 'em who the fuck I be...\"\n\"The ODB\"\n\"Tell 'em who the fuck I be...\"\n\"The-the-the Ol' Dirty Bastard\"\n\n[Hook 2X w/ more samples cut]\n\n\"Wu-Tang, Wu-Tang, Wu-Tang, Wu-Tang\"\n\"Roc-a-Fella, Roc-a-Fella, Roc-a-Fella, Roc-a-Fella\"\n\"Wu-Tang, Wu-Tang\"\n\"See my name is the ODB\"\n\n[Hook to fade w/ more samples cut]", "[Outro: Ol' Dirty Bastard]\nI ain't no nigga\nMy words can't be held against me\nI'm not caught up in your law\n\n[Verse 1: Ol' Dirty Bastard]\nAll music must obey me\nAll pain must obey me\nI cripple my enemies\nGot the gift of vocabulary\nI can talk my way up out of anything\nNobody's words can go against me\nI'm stingy, I want all that energy\nOsirus, the best nigga in the place to be\nI two hundred hot degree\nBurning ya til you faint y'all\nY'all niggas shooting blanks y'all\nI'm fucking my vest, drive an armored tank y'all\nI dead niggas like a dog buries a bone\nYou could never set me up I raise the pain volume\nNominate me, as presidential MC\nMy career so intelligent unique physique\nA nigga please!\n\n[Chorus: Ol' Dirty Bastard & RZA]\nYou could never fuck with the dog\nA nigga please!\nNigga I will bury ya bone\nA nigga please!\nI'm the one who burned ya home\nA nigga please!\nWatch your shit fall like Rome\n\n[Verse 2: Ol' Dirty Bastard]\nWhat, nigga I'm immune to all viruses\nI get the cocaine it cleans out my sinuses\nJust for slinging *nuh* I get a quarter a mil\nI'll have it raining ice drops the size of automobiles\nKill all the government microchips in my body\nI'm the paranoid nigga at your party\nI kill all my enemies at birth!\nShut the fuck up!\nBitch and let me stick my hands up your skirt\nNigga please!\n\n[Chorus]\n\n[Break: Ol' Dirty Bastard (RZA)] (x5)\nNigga please!\nYou could never fuck with the dog\n\n[Outro RZA]\nStraight up! ODB type shit\nY'all watch out for the Abbott and Crazy Monk\nComing soon\nSplashed y'all with the organic hip-hop spazzola type\nNaw mean, Straight up!\nFor born-born and on", "[Hook: Macy Gray]\nIntoxicated and I'm faded by you honey, why\nWe finally made it, got to lovin' money, seeds and shine\nThey wanna hate it, try to break it but it's yours and mine\nNothing can change it, finally made it, so divine\n\n[Verse 1: Raekwon]\nYo, I sat around the illest villains\nCampaignin' while we all G off\nAutomatic mayors, now we ain't playin'\nWolves start scheemin', violate me in the rain\nGet more respect, rob Marvin Gaye on 'em\nGold, black, beige on 'em, heavy gauge\nGettin' blazed, all that money, but he ain't even shaved\nThis a new flavor, bigger vets, bigger begets\nBigger papes, god damn it, nigga got saved\nThree or more, two thousand four Blazers\nLookin' good, it's all hood, just analyze amazed\nPeace, let's mozy and swaze', y'all\nThen count real bank and thank 'em, hit me on the page, what\n\n[Hook: Macy Gray]\nIntoxicated and I'm faded by you honey, why\nWe finally made it, got to lovin' money, seeds and shine\nThey wanna hate it, try to break it but it's yours and mine\nNothing can change it, finally made it, so divine\n\n[Verse 2: Method Man]\nYo, I was born on the same day as Dr. Seuss\nPlenty of friends, henny and gin, who got the juice?\nLet's get drunk, in this motherfucker, let's get pumped\nI need that funk, like I ain't took a bath in a month\nYou can find me where the thugs be at, club be at\nA fact, I love women, cuz they love me back\nThe name's Johnny, they used to call me sucker for love\nBut now I'm grimey, cops searchin' motherfuckers for drugs\nGive me that bud, that come in nickels, dimes and dubs\nAt four twenty, when niggas knew what time it was\nA shot of Remy, in my system, I'm buzzed\nThen baby, I ain't just a little off, I'm unplugged\nHaha, you know I, crack myself up, sometimes with no excuses\nLike every nigga that done time, I didn't do it\nMeth the Magnificent, not Jeff\nI see the game done gone impotent, soft and suspect\n\n[Hook: Macy Gray]\nIntoxicated and I'm faded by you honey, why\nWe finally made it, got to lovin' money, seeds and shine\nThey wanna hate it, try to break it but it's yours and mine\nNothing can change it, finally made it, so divine\n\n[Verse 3: Ol' Dirty Bastard]\nYo, silence on Smith with six shots, lick shots\nLeave ya head like a Shaolin monk with six dots\nHindu kush, twistin' a Sweet Swisher\nIn search for Bobby the Digital, bitch, not Bobby Fisher\nHead full, with a Grey Goose and Redbull\nI came for, a beer, weed, plus a bed full\nOf dimepiece, model type bitches, who mind they own business\nBlow my dick, like birthday cake wishes\nMy warrior's scornful, hard to respond to\nDirt McGirt, be sailin' boat and in Honolulu\nBrooklyn Zu, wild like Shaka Zulu\nBrooklyn Zu, shots will go right through you\nTouch me in Cali, or the streets of Maui\nIn the two thousand six pitch black Audi\nDrivin' by bitches, I'm like howdy\nDoody, to you some beauty bitches crowd me\n\n[Hook: Macy Gray]\nIntoxicated and I'm faded by you honey, why\nWe finally made it, got to lovin' money, seeds and shine\nThey wanna hate it, try to break it but it's yours and mine\nNothing can change it, finally made it, so divine\nIntoxicated and I'm faded by you honey, why\nWe finally made it, got to lovin' money, seeds and shine\nThey wanna hate it, try to break it but it's yours and mine\nNothing can change it, finally made it, so divine", "[Intro]\nYo, Yo Miami\nYo Cali-Fornia\nNorth East West and South motherfucka\nYo Check this out\nThis is Dirt Dog\nI'm here to make you scream\n\n[Chorus] (x4)\nBig Baby Jesus I can't wait\nNigga fuck that! I can't wait!\n\n[Verse 1]\nI ain't no actor my shit's for real\nThighmaster\nIf I don't get paid 2 or 3 million dollars on Monday\nI'm a bring on the ARMAGEDDON!(It's Monday)\nFuck that feeling, this fo reeling\nNigga I want my own island\nMake it rain, hail, storm and earthquake\nUHHHH! That's what I'm saving!\nPlay that music in your trunk\nThe cocaine amplifies my funk\nNigga I'm from the ghetto\nHow many celebrities from the ghetto?\n(Dirty your crazy, I'm crazy about your music\nDirty your crazy, you're a nutcase you're a fucking nutcase)\n\n[Chorus] (x4)\nBig Baby Jesus I can't wait\nNigga fuck that! I can't wait!\n\n[Verse 2]\nAIDS, chickenpox, flu, and night fever\nCancer, herpes, mumps, and seizures\nDiabetes, TB if you're against me\nYou die easier!\nCops don't have a show whatsoever\nAin't no more doctors, ministers\nNurses can't give us searches\nThere won't be electric, won't be churches\nCause your body go against you\nWhether it's a lie or whether it's true\nYou can't use violent mentalities anymore\nIt ain't lambskin\nYou can't use the word napkin\nNigga ya sleeping\n\n[Chorus] (x3)\nBig Baby Jesus I can't wait\nNigga fuck that! I can't wait!\n\n[Break]\nHold on Hold on Hold on\nHAHAHAHAH\n\n[Verse 3]\nI'm diplomatic playing pen and pad\nRatatat you're a scaredy-cat\nCause I have a tat put you up like that\nYou can't stand that, cause you gotta scat\nYou couldn't even move\nDon't know how to groove\nBITCH TAKE OFF YOUR SHOES\nStink up the room\nMotherfucker you knew!\nFucking with the doo\nDirt Dog don't mean to be rude\n\n[Chorus] (x8)\nBig Baby Jesus I can't wait\nNigga fuck that! I can't wait!\n\n[Outro]\nI want to give a shoutout to FunkMaster Flex\nAnd all the DJs across the world\nI want to give a shoutout to my nigga Luke\nI want to give a shoutout to my nigga Suge Knight\nTo my nigga Dr. Dre, Snoop Dogg\nI want to give a shoutout to um,um, what's them niggas, Outkast\nI want to give a shoutout to them crazy niggas\nIn parts of the world that I never been too\nI want to give a shoutout to the Eskimos\nI want to give a shoutout to the submarines\nI want to give a shoutout to the army, air force, navy marines\nKnow what I'm saying? Y'all playing my music\nIn the submarines and the boats\nPlay that shit know what I'm saying?\nIt's called traveling music busting ya ass style\nYo Big Baby Jesus, know what I'm saying it's one love\nI give a shout out to all the women\nI give a shout out to all the babies\nAll the munchkins\nAll across the world playin' hopskotch\nI want to give a shoutout to all the school teachers\nI give a shout out to um, um, myself\n\n[Chorus] (x3)\nBig Baby Jesus I can't wait\nNigga fuck that! I can't wait!\n\n[Outro]\nBig Baby Jesus\nI give a shout out to the Wu-Tang, Tang, Tang, Tang...\nThe Brooklyn Zoo", "[Intro]\nYo, imagine- imagine the shit\nDrunk as hell and shit\nAnd you going into a fuckin bar and shit\nYou stumbling over bitches and everything\nFalling over everywhere, throwing up and shit\nYeah, ayy, yeah-ahh\nC'mon, c'mon\nAhh-hyah!\nI want all y'all people to feel what I feel\nSee, my momma taught me this shit!\nAnd my daddy learned from my momma\nWhich is good! Which is good-ahh!\n\n[Verse]\nSweet sugar pie, oh I wish you were mine\nLookin' so good, like you know you should, yeah\nAnd I- ayy, yeah, love you down, down baby\nOh my girlie, sweet my honey\nYou look so good to me\nLove you down, all night long\nYeah, yeah, ahh!\nYeah, all night long\nYeah, yeah, ahh, all night long, girl\nSugar pie\nSweet oh-my-oh-my there's no lie\nI love you girl, love you, girl\nLove you sweet pie\nYeah, yeah, ahh!\n\n[Hook]\nDo you love me? Do you love me like this?\n(Do you love this, girl?) I know you love me\nI love you too!\nAhh, ha, ha!\n(I'll let you know) I'm serious\nI need to know that\nI needs you to let me really know that\nI said I'm serious, very, very serious\nAight, let's go\n\n[Outro]\nYeah, all night long\nYeah, yeah, ahh!\nAhh, ha, ha, yeah\nIt's other groups that's better than me like the Temptations\nAnd you other, groups\nFrom the Motown, Philadelphia, Atlanta\n(This is dedicated to you)\nAnd you others, better than me\nMrs. Jones, don't feel disgraced baby\nBecause I love your soul your got it together type thing\nDiana Ross\n(See, I don't say these things for myself)\nMichael Jazzy-Jackson!\n(Please understand or something)\nNo! I'm the baddest, hip-hop man, across the world!\nI don't care, what you care, I just give, what you receive!", "[Intro 1: Chris Rock]\nYo, yo, this is Chris Rock\nYou heard my man\nHe ain't on no commercial shit\nThe O.D.B\nIt ain't the Young D.B\nIt's the Ol' D.B\nThat old shit\nThis ain't the Embry O.D.B\nThis is the Ol' mothafuckin D.B\nI'm Chris Rock, I'm chillin with the O.D.B\nSo I'm the wrong place, at the wrong mothafuckin time\nWith the wrong mothafuckin man\nThe O.D.B., baby\n\n[Intro 2: Ol' Dirty Bastard]\nAll y'all niggas talkin bout commercial song\nThis ain't no commercial song\nStraight up, nigga, what?\n\n[Chorus: Ol' Dirty Bastard (The Neptunes)]\nY'all niggas can't fuck with me\nAll y'all niggas lovin me\n(Mister courageous O.D.B\nYou need to recognize he's a P-I-M-P\nYou need to recognize)\n\n[Chorus: Ol' Dirty Bastard (Neptunes)]\nYo, what's my name? (You need to recognize)\nShut the fuck up! (You need to recognize)\nI bring the mothafuckin ruckus\n(You need to recognize) C'mon punk ass niggas\nUh, nah, nah, I'm just fuckin wit'chall, uh-huh)\n\n[Verse 1: Ol' Dirty Bastard (Zu Keeper)]\nWho get drunk at night till the early morn'?\nTap dances at the party like it's goin on\nBitches and niggas all around scopin eachother down\nI'm takin pictures at y'all at the fuckin lounge\nMad niggas was, gettin drunk at the bar\nI'm throwin Moet bottles, HA HA HA HA HA HA\nIt's rowdy outside, I ain't signin shit\nDon't flow bitch, I take your microphone\nYou party bitches fallin in line\nWith your fat ass stinkin behind\nYou don't know who the fuck is here\nI back smack your ass, make pressure appear\nCause cold Lucky knockin at your door\nI dedicate that to your source\nCause this (Nigga please) is dirty and it's stinkin\nFunkier than (Peppi Le Pew, so I was thinkin)\nI drop you mothafuckin niggas on the (weekend)\n(Lettin you know that) bitch nigga don't start\nYou thought that I was weak? Huh, let me speak\nMy rhymes come funkier than your grandfather's feet\nSo listen mister, don't you ever forget\nRhyme dirty, you couldn't even clean it with Comet\nOr even Worex, some tried Ajax\nOnly mix wit, the back get this track\n\n[Chorus: Ol' Dirty Bastard (The Neptunes)]\nY'all niggas can't fuck with me\nAll y'all niggas lovin me\nMister courageous O.D.B\nYou need to recognize he's a P-I-M-P\nYou need to recognize, you need to recognize\nYou need to recognize, niggas need to recognize\nUh-huh, uh-huh\nUh-huh, uh-huh\n\n[Verse 2: Ol' Dirty Bastard (Zu Keeper)]\nSweet girl, sweet girl\nEach and every day-a, each and every way-a\nSee you niggas, most of your strayers\nStray off from a thing, civilization-a\nDon't understand the true nation-a\nIt go back like coal ovens and ice boxes\n(Murder Avenue L trains, Broadway blackouts\nBrooklyn Zu keep history, fam shake the trends\nFive years of workin bodies\nVoice box hits the shotty\nI move in parties, stickin hotties\nAnd all you fake mob Gotti's, I push your skirt up\nMy shit's so bad I wipe my ass with a burner)\nPicking up the pieces!!\n\n[Chorus: Ol' Dirty Bastard (The Neptunes)]\nY'all niggas can't fuck with me\nAll y'all niggas lovin me\n(Mister courageous O.D.B\nYou need to recognize he's a P-I-M-P\nYou need to recognize, you need to recognize\nYou niggas need to recognize, uh-huh, uh-huh)\nY'all niggas can't fuck with me\nAll y'all niggas lovin me\n(Mister courageous O.D.B\nYou need to recognize he's a P-I-M-P\nYou need to recognize, you need to recognize\nBitches and niggas'll recognize\nLook, uh-huh, uh-huh, uh-huh\nUh-huh, uh-huh, uh-huh)", "You can't imitate me on this fuckin tape\nYou ain't ringing the bell I'm ready when you are\n\n[You ain't ringing the bell\nYou ain't busting the grape\nYou ain't imitating me on this fuckin tape] (x10)\n\nI'm tellin you bitch ass niggas\nIf y'all don't fuckin\nIf y'all coloured bitch ass faggot punk ass motherfuckers\nDon't see that these white people are trying to take over your shit\nDon't worry, you betta be happy the Ol' Dirty Bastard is here\nYour betta be happy I'm here\nTo beat the shit out of all you faggot punk ass motherfuckers\nBitch ass niggas!\n\nI shut the fuckin' whole world down\nYou white motherfuckers could never, ever take over\nYou can't ever take over!(x2)\nYou shut the fuck up and you shut the fuck up\nThat's what the fuck you do!\n(Could I get a beer, yo I need some beer)\n\nYou ain't using your phone, you ain't callin the cops\nCause nigga I'm the only king of the block\nI'm the only black god, motherfucker!\nAnd I came to rock the spot\nWhen I throw at football pass at a bitch she miss\nAin't trying to be funny gonna use my fist\nYou can't use the family feud\nYou can't run it on a cuckoooo!!!!\nYou bring shame, I'll keep Ol' Dirty safe\nNot locked up, cause I'll have your fuckin ass locked up!\nI'll stash you, lickin you down, light that blunt!\nYou ain't gettin one, two I do what I want!\nIf I got a problem, a problems got a problem til it's gone\nI'm the only Unique Ason\nYou reap what you sew\nFuckin with the O\nI got the precinct locked down\nYou ain't using the po-po\nFuck you Soso\nI got the keys to your ho\nI'll stop your whole flow, all you bitches roll\nWith me from the ghetto\nYou want me to control\nThis fuckin' show\nGive Ol' Dirty what he want and mo!\nTime stops you'll go\nMafia slow!\nTime'll stop you'll go\nMafia! Pay me all my motherfucking money\nOr I'mma slow down your dough!\n\n(Chorus)\nJesus I'm rollin with you(x4)\n\nYou'll all be in danger\nYou'll have a sex changer\nI'm gettin more anger call me Dr. Stranger\nI master the demon demonic toys\nSting you with the venom kill your joy!\nBitches throw hands in the air like to be sodomized\nThat's what I'm here for!\nThat's what I'm all about!\nI get girls in the mood to wanna get physically fucked from me\nOh BABY!!\nHippa to the hoppa and you just don't stoppa\nI control Michael Jackson's Thriller\nCatch him and ruuhhahaha\nFuck with the guys that'll make you shrug\nI'm the only original\nFuck you chump!\nShut the fuck up!\n\nYo did you understand that?\n\nChorus", "[Intro: ODB]\n1-2, 1-2, 1-2 (guess who's home?)\nYeah mothafucker, you know who it is\nOl' Dirty Bastard a.k.a. Dirt McGirt\nKillin' anything that moves {x2}\nYou know what time it is\nNeptunes mothafucker.. The Neptunes\nYo 1-2, 1-2 (yeah this shit don't stop!)\n\n[Ol' Dirty Bastard]\nPlug it up, cocaine make ya speakers blow\nParty amps gettin' sniffed up now wit it too\nWhen there's somethin' in my camp, a wireless amp\nHigh as a ramp, speak to Wu like stamp\nThe wet got me damp, pussy darker than lamp\nMoses you don't wanna 'ttempt, I see all fans\nI'm too drunk too, now you like \"Move!\"\nCoked out in Peru, in hair/here like shampoo\nSmall like snubs, camera to you scrubs\nKinda like stubs, confidential at the club\nSniff buds like Rule, I fast Ghost like Wu\nGet cream like tube, burn ya fast food\nAppeared in rude, we'll take ya panties off nude\nYes and renewed, big guns and clued\nBitch I'm loose like Lugz, Dirty to the litter bug\nGirls you like hugs? I don't like thugs\n\n[Hook: Pharrell (ODB)]\nPop shit, bitch what's wrong?\nPop shit, nigga what's wrong?\n(Take my drink it's about to get..) OOH!\n(Take my drink it's about to get..) OOH!\n(Me and my niggas about to get...) SUED!\n(Me and my niggas about to stop..) YOU!\n\n[Ol' Dirty Bastard]\nAiyo all this shit is from the ghetto\nSmoke Palmetto, sing like Peno\nCarry the Heathrows, scared of police though\nThey tried to kill O. in prison yo!\nHad me turned out, drunk is all about\nI got this money pourin' out the stout\nI'm a loud mouth, drunk party is out\nPlay this music on every route\nFollow Dirty, I'm the WhiteOut\nCatch bitches like trout, get drunk, won't stop\nI'm gettin' this money, called gettin' honey\nStreets of Brooklyn and ain't a damn thing funny\nHave a day sunny, bitches put me in ya tummy\nI'm the nigga on the cross burnin' about 20\nGo me a bunny lookin' good and funny\nAll you niggas, is straight crash dummies\n\n[Hook]\n\n[Ol' Dirty Bastard]\nI was checkin' out my melody before The Blueprint\nFelony, a nuisance, huggin' me and my two cents\nDon't double the six takes, never did a mixtape\nBut rather a chick take but waste any weather we get cake\nI let rats have it, fuck these rap faggots!\nEverybody want the kid dead like Pat Garrett\nI'm a goon, speak with a mellow tone\nRock yellow stones, gun longer than a broom!\nCuz felon on the ride is long due and soon\nOut again like boom, government comin' soon\nAnything less is uncivilized like a case mack\nI'm a shooter used to stay jack, cooler than a Maybach\nArubu known to collect, twistin' up that haze black\nAnd Backwood on that, good rap, I stay strapped\nP.P., don't carry that weight\nNigga redhead, fuck with chicks if their head straight\n\n[Hook]\n\n[Outro: ODB]\nYeah you know what time it is\nIt's that new shit\nDirt McGirt, Neptunes", "Stink hoes (repeat 6X)\n\nI want pussy for free, I want pussy for free\nYou can not have my money\nI want pussy for free, look, I want pussy for free\nI want pussy for free, I want pussy for free (for freeeeeeeee)\n\nI ain't givin none of y'all girls money shit fuck y'all\nLove ya but fuck ya let bounce this ball\nScrewface you bitches, voodoo on y'all\nHe won’t slip, won’t trip, won’t ever fall\nBitch, you obey me, you better not betray me\nBe calling no cop saying “this is his baby!”\n\nPussy for free, baby, I don't want none of yall havin my money\nI want pussy\n\nYeah my momma can not protect y'all\nYeah my momma can not protect y'all\nYeah my momma can not protect y'all\nRight, Right\nYeah my momma can not protect y'all\nYeah my momma can not protect y'all\nRight Right\nYeah my momma can not protect y'all\nMy momma can not protect y'all\nMy momma can not protect y'all\nMy momma can not protect y'all\nBitch and I ain't gonna protect y'all bitch\nAlright? Yeah", "Intro:\n\nOooh baby I like it raw\nYeah baby I like it rawww\nOooh baby I like it raw\nYeah baby I like it rawww\n\nVerse One:\n\nShimmy shimmy ya shimmy yam shimmy ya\nGimme the mic so I can take it away\nOff on a natural charge bom-voyage\nYeah from the home of the doge brooklyn scwad\nWu-Tang killer bee's on a swarm\nRain on your collage ass disco dorm\nFor you to even touch my skill\nYou gotta put the one killer bee and he ain't gonna kill\nNow chop that downpass it all around\nLyrics get hard quick cement to the ground\nFor any em-cee in any fifty two states\nI get psycho, killer, Norman Bates\nMy producer slam my flow is like bamm\nJump on stage ah then I dip doown\n\n(I like the way you talk)\n\nChorus: repeat 2X\n\nOooh baby I like it raw\nYeah baby I like it rawww\nOooh baby I like it raw\nYeah baby I like it rawww\n\n[Backwards verse incorporating part of Verse Two]\n\nVerse Two: (additional extended verse)\n\nSee, when a nigga say he likes it raw\nHe means dirty, down to the floor\nSee my name is the Ol'DB and I'll beat your ass\n\nFor the ladies who know me tell them who the fuck I be\nFor the niggas who know me tell them who the fuck I be\nMy style comes down on ya'll like rocks\nBy the doc\nUmm by the flock\nBy the creak by the flock\nGot east coast locked down padlocked\nMy sulu be all all down by the flock\n\nChorus: repeat 2X\nVerse One: repeat\n\nYo ya'll know the lyrics come on sing with me\n\nChorus: repeat 2X", "[Ol' Dirty Bastard]\nC'mon, fuck that shit\n{*panting hard seven times*}\nYo bitches out there, a-throw your hands in the air\nTo my niggas out there (out there)\nThrow your guns in the air (one two three)\nLet me hear you go - Dirt, Doooooooog!\nDirt, Doooooooog!\nLet me hear you go - Dirt, Doooooooog!\nDirt, Doooooooog!\n(Ahhhhh) Let me hear you go..\nNO!\n\nNever been branded, no dough shorthanded\nThis is why the Dirt Dog landed\nAnd I expanded - from the help of the RZA\nShit that NUH commanded\nI'm a project ho, LOVE project ho\nNigguh get BUST, at the front door\n(I do) I don't don't don't, I don't don't\nI don't got no love for the pro, the prostitute pro\nThe Brooklyn Zu know, I be like Old Joe\n*pbbbbbbbbbbt* See me at the cocaine sto'\nCoppin a.. eh ehh ehh.. and coppin mo'\nSee I'm a real nigga, give a bitch a car\nBitch want a Jeep, give a bitch a star\nBitch wanna sleep, number one..\n.. umm, number one, I live in my momma house\nNumber one, I live in my momma house\nThis a Ol' Dirty Bastard production, let off SHOTS!\nBe hot like I fart from a bitch's twat\nI'm just a small boy, well known like Elroy\nWell employed\nChest built up like steroids, electra master\nPuppeteer motherfuckers\nYou can't control the black man's God!!!\nBluh bluh bluh bluh bluh, bluh, Bed-Stuy\nDoo-doo-doo-doo-doo-doo-Dirtiest place to be\nYou white Flintstone, bitch\nYou stickin your dick in my gravel pit\nJourney to the center of the Earth\nThe white woman tryin to slide up in\nI'm the Granddaddy Man from the Senegal clan\nGot the bite of a pit, keep your afro simmerin\nNigga GUARD YOUR GROUND!\n(GUARD YOUR GROUND!)\n\nAh-throw your hands in the air\nTo my niggas out there, throw ya guns in the air\nLet me hear you go Dirt, Doooooooog!\nDirt, Doooooooog!\nLet me hear you go Dirt, Doooooooog!\nDirt, Doooooooog!\nLet me hear you go Dirt, Doooooooog!\nDirt, Doooooooog!\nLet me hear you go Dirt, Doooooooog!\nDirt, Doooooooog!\nLet me hear you go Dirt, Dirt Doooooooog!\n(I feel you penetrating through my body)\nDirt, Dirt Doooooooog!\nDirt, Doooooooog!\nDirt, Doooooooog!\nLet me hear you go Dirt, Doooooooog!\nDirt, Doooooooog!\nLet me hear you go..\n\n{*some woman humming la lahhh lahh.. *}\n\n(Oh baby I like it raw..\nYeah baby I like it RAW..)", "[Hook]\nYeah youknowhatI'msayin\nIt's all I'm saying\nKnahmsayin, yo I'mma tell all y'all motherfuckers something\nKnahmsayin, I'm a Dalmation knahmsayin\nMotherfucker I'm white and I'm black what\nYou can't understand it then fuck you, knahmsayin\nI love this, motherfucker I need this\nWe work from hand to hand, from country to town\nFrom city to state, from world to world nigga\nFrom universe to universe\nIt's a white and black thing, all the world leaders\nIt's all, and together, I said peace, and love, from happiness\nYou understand me\n??, turn me up\nAh turn me up (x7)\nWhite girls shake your ass\nBlack girls shake your ass\nEverybody shake your ass\nC'mon shake your ass\n\nTurn me up motherfuckers getting hot in here\nNiggas all getting hot in here\nEverybody getting hot in here\nWhiteys getting hot in here\nBlackies getting hot in here\nSomebody getting hot in here\nEverybody getting hot in here\nRed people getting hot in here\nYellow people getting hot in here\nBlue people getting hot in here\nAliens gettin hot in here\nSomebody gettin hot in here\nWhite people getting hot in here\nBlack people getting hot in here\nEverybody gettin hot in here\n\nThe chamber of this banger, is 36th chamber\nUnderstand Equality Slang, that of Allah's name\nPlayed the rabbit, like you dead\nMork from Ork, first take support see me in The Source\nYo I take the eighty-five percent brain\nCause Black makes what makes rain\nDirty brain is like payday to me\nGOD unique baby\nWho's the Five Percent of the planet Earth\nTell em Poppa Wu, well it sure ain't Poppa Smurf\nGot to check your blood, take you to church\nMinisters down with the nerds\nEver since birth\nWhite man always trying to take the Black man's turf\nBlack man built America\nI named you after Asia, you ain't my Momma\nNow her name is Erika, Bo Derek-ah\nWhat, you like that slave name\nIt wasn't 'posed to sound better\nNew Wu order, New Rule order\nFor all the maniacs in jail read this letter\nBe behind me when I'm making this cheddar\nCause I'mma make it more better for our babies\nCause they play in the same schoolyards everyday\nC'mon, c'mon, c'mon, c'mon, c'mon\n\nYou've, got, that WHITE WHITE WHITE WHITE\nWhite man clock on your wall\nI'm tired of gettin up goin to work\nFor that white, white, white, white man y'all\nI's got a bad boss\nThese thoughts was fucking Diana Ross\nI ain't no ??, making this money\nNuh, show yourself\nWhitey come on, get the money\nMy Father Allah walk with Gods\nJust like the dollar bill walk with God We Trust\nAnd I walk this dog, two-thousand two-hundred miles for you\nWhat, let the ?? know it's done\nHey blackie, yo whitey\nIt's all, all, all in together now\nWe getting paid getting dressed for the weather now\nAll, all, all in together now\nWe getting paid gettin dressed for the weather now\nAll, all in together now\nGetting paid getting dressed for the weather now\nAll in together now\nWe're getting paid getting dressed for the weather now, peace\n\nIt's all in together now\nNew World Order baby, knahmsayin\nY'all recognize it's together\nYou understand me, it's the Dirt Dog speaking\nMy word is bond and my bond is life\nIt's all in together now my niggas and my niggarettes\nMy peoples don't worry about it\nIt's all slang from the same gang\nI'm black out, and I'm black in\nI'm white out, and I'm white in, so what", "[Black Keith]\nYou don't even know me, you can't even see me\nFriendly of the daylight, now I'm back, now I'm back again\nDon't be scared baby, can't you see I'm thirsty?\nFriends of the daylight, let me drink, let me drink, my friend\nDon't be scared baby, don't be afraid\nFriends of the daylight, and I'm back, and I'm back again\n\n[Hook: Black Keith]\nNever going nowhere, you can't run from me\nDay and night baby, can I drink, can I drink again\nYeah, yeah, yeah, yeah, yeah, can we drink, can we drink, my friend?\nDon't be scared, don't be scared, baby\nCan't you see I'm thirsty? And I'm back, and I'm back, again\n\n[Ol' Dirty Bastard]\nWhat, first things first, man, you can't fight the curse\nYou can't call the doctor, you can't call the nurse\nYou got that Louie Loco on the side of your purse\nAnd those tight mint sixties, about to make me burst\nI can't think, let me sink into your jugular\nCome have a joint, with the thirsty love guzzler\nFrom the darkside, baby, don't be afraid\nYou can't fight the thirst, nor escape the Blade\nI've been scoping ya, hoping you be open to\nTake a sip, of the potion cause it's overdue\nIt's not your ordinary, it's a special brew\nIn the heat of the night, I will rescue you\n\n[Hook]\n\n[Interlude: Blade: Trinity sample]\nAllow me a parting gift, to remember this\nSooner, no later, the thirst, always drink\n\n[Outro: Black Keith]\nYeah, yeah, and I'm back, and I'm back again\nLive, live.... back again", "[Ol' Dirty Bastard]\nTwo steps from the border line\nAnything closer will kiss the nine\nThink I'm out the game? You out of your mind\nCuz I stay on track, like transit line\nKeep it nappy or braided up\nDirty in the cockpit, blazin' up\nStop frontin' when you made it up\nTellin' all my hoes, you can't spray it up\nHah, huggin' nuts like tighty whites\nStill trickin' on hoes like Heidi Fleiss\nYou know why niggas don't give you much respect\nCuz they seen you gettin' slapped with the empty gat\nKnow Dirt, like bow know death\nWhen I'm huntin' down, birds of rap\nHate Dog, cuz I ate your cat\nAnd you can eat my ass and have a coke with that\nUse a spoon, unless you want a fork\nPull my dick out, watch the room get dark\nStay high with the zombie walk\nGotta sit my ass down, like Rosa Parks\n\n[Hook 2X: high pitched female (Ol' Dirty Bastard)]\nDirty Dirty, you tell me how you do it\nIt look so easy, like there was nothin' to it\nBut they don't understand, about the Dirty M.C\nIt's the.... (Ohhhhhhhhhh), new track by ODB\n\n[Rhymefest]\nThey say dirt and sunshine make the flowers grow\nI say, fuck a bitch raw and drive your nut on the floor\nCall it what you want, you son of a ho\nI was 5 percent til' white bitches came and dropped it down to four\n3, 2, 1, I can lick the sun with my tongue\nPull it out and smack a nigga, just for thinkin' I'm done\nShut your trap, razor blade cut your wrap\nFat girls seen me comin', started tuckin' their flab\nRhymefest and Dirt Dog, gon' spark this\nThe day he got to heaven, track mud on the carpets\nHot like the hot potato, you niggas ain't macho\nYou hot as gazpacho\nGo to the show, for hot dogs and nacho's\nThis me and Dirt Dog's style, it's not yours\n\n[Chorus 2X}\n\n[Ol' Dirty Bastard]\nWhat can make a ho, look more cuter\nHennessey shots, or smoke more Buddha?\n\n[Rhymefest]\nI don't know Dirt, now she look like Zab Judah\nTest my manhood, go get my dick ruler\n\n[Ol' Dirty Bastard]\nNow you hungry, wanna eat right through her\nBut you better first track for a noter\nLike does she have a best friend, or a daughter\nHas she ever tried fuckin' under water\n\n[Rhymefest]\nDown down with the fishes, deep sea dishes\nI ain't a genie, bitch, I don't respect your wishes\nThis trick ain't fuckin' me though, god damn\nSomething very wrong, I don't understand\n\n[Ol' Dirty Bastard]\nMisinterpetate, let me break it down\nTwo pulls make the your merry go round\nTouch your toes, show me that rose\nButt naked, in a Wu-Tang pose\nWide open, girl, everything goes\nReal freaky, when you powder that nose\n\n[Rhymefest]\nKeep it and move, I sleep in the nude\nI'm keepin' it rude, pull out my dick and pee in the food\nOn the way to the stars, don, where's the map?\nWe fuckin' there, and we gonna fuck back\n\n[Hook 2X]\n\n[Outro: Rhymefest]\nYeah, Dirt Dog, Rhymefest, you want it, man\nRest in peace, I know you heaven right now\nTrackin' mud on the carpet, so, we gon' let ya\nDo what you do it's the ohhhhhhh\nDon't forget the crew, it's the Wuuuuuu\nI thought you knew, it's the Ol' Dirt Dog\nRhymefest, yeah yeah, from now to 3000, man\nWhat's rap with Dirty? What's the world without Dirt?\nJust a bunch of fuckin' water, ohhhhhhhhh\nWe out....", "\"Please calm down, the music & everything, everything\n(?) I went and bought me an outfit today that costed a lot of money, today\nYou know what I mean, because I figured that Wu-Tang was gonna win\nI don't know how y'all see it, but when it comes to the children, Wu-Tang is for the children, we teach the children\nYou know what I mean, Puffy is good but WU-TANG IS THE BEST!\nOkay, I want y'all to know that this is ODB and I LOVE YOU ALL, Peace!\"\n\n-Ol' Dirty Bastard's Classic 1998 Grammy Cameo (R.I.P.)", "[Verse 1: Ol' Dirty Bastard]\nWe used to sleep in the staircase, smoke weed in the staircase\nFriday night got drunk, used to pee in the staircase\nHopin' a cop might slip, I'm never known to drop the clip\nYou copped the Fifth, nigga, I'll pop the fifth\nI show no mercy, dunk like a bar of Hershey\nCall my gun, Lil' Seymour, bitch, or Big Percy\nA Dapper Dan fan, who will clap a man\nFor five grand of small bills, wrapped in a rubberband\nThen lay up in a fat pair of titties, my bitch is so saditty\nThis is Dirt McGirt, ho, not P. Diddy\nAll we got in common is the money, the only thing I want is the money\nYou see my face on the wall of every precinct\nBitches keep your pussy decent, I'm juvenile delinquent\nFor guns that I creep with, they whisper, in secret\nOnly bitch that peepin', is the one that I sleep with, nih-huh!\n\n[Hook: Ol' Dirty Bastard]\nAlotta niggas wanna dust me off\nBad bitches wanna suck me off\nRockafella dropped a million here\nAnd Dirt McGirt back in the air\nAll my gangstas, where ya at?\nThrow your guns up and make them clap\nTell me now, muthafuckas, you strapped?\nAnd bitch betta have my money\n\n[Verse 2: Ghostface Killah]\nAiyo, the bitch better have your money and mine\nCuz if she don't, we both gon' double team that bitch from behind\nAnd for them niggas outside screamin' that\n'Somebody gotta die' shit, same dudes on the cop's dick\nThis is Tone, y'all niggas be frontin'\nAnd most of y'all niggas don't got no guns\nBorrowed your man's shit, how's that for a bum?\nDum-dums emptied out of pun son, so see man, see Ach' run\nSee spots over my Reebok's, cuz he got done\nCheap shots fell out his weak Glock and he got stung\nMy cheap gun is a gangsta's protein\nTreat bitches with the utmost respect, like get 'em wetted\nTellin' to, drink the milk, boo, don't even wet it\nThis is Starky, I got a foot fetish, loot fetish\nWith the dust-head men, we got good credit\n\n[Hook]\n\n[Verse 3: Ol' Dirty Bastard]\nNotorious Glock buster, cap peelin', block hustler\nWho slap hoes, who lack feelings\nBlack building, crack dealing, black villain\nHad a taste for blood spillin', love stealin'\nAny thing that twinkle bright to my eye sight\nMany nights I used to stay up, at the twilight\nAnd wonder to myself, if's there's a Heaven or Hell\nBeen alone in these streets, since eleven or twelve\nOn my own, I run buckwild in the West\nA knucklehead nigga, used to sleep in my vest\nHad no home, my Moms used to show me no lovin'\nBurn the crib down, try'nna dry my shirt with the oven\nNow I'm exiled, destined for penal\nHyperactive off the cocaine, got me senile\nBack on the block, knowledge to build, knowledge to kill\nIntent to put a dent in your grill with the steel\n\n[Hook]", "[Intro]\nY'all no nothing 'bout the pimp game\nI wanna thank Rick James for letting me do this song, thank you very much\n\n[Verse 1]\nWho are you? Girl, who do you belong to?\nMy point of view is: girl, I think you're hot\nIf we talk, what words will I describe?\nThere's no dictionary book to explain how you look\nCause I think you're hot (Sexy, sexy, sexy)\n\n[Hook]\nCold blooded!\nGirl, I think you're hot! (Sexy, sexy, sexy)\nCold blooded!\n\n[Verse 2]\nWho are you? Girl, what's your name and number?\nIs it true? Girl, you think I'm hot\nIf we tried to get to know each other\nYou might find, you couldn't trade me for another\nCause I think you're so (Sexy, sexy, sexy)\n\n[Hook]\nCold blooded!\nGirl, I think you're hot! (Sexy, sexy, sexy)\nCold blooded!\n\n[Verse 3]\nSweetheart baby, touch me, girl, where I wanna be touched\nDon't ever complain, got ya in a cobra clutch\nLove me tender, love me sweet\nI wanna bust this nut in a Super Freak\nOh, you're a Super Freak, fuck me anywhere\nYou ain't scared to ever do a do or dare\nI wanna undress you, hold your loosie tight\nAnd I won't cum all night!\n\n[Hook]\nCold blooded!\nCause I think you're hot! (Sexy, sexy, sexy)\nCold blooded, yeah!\nCause I think you're hot! (Sexy, sexy, sexy)\nCold blooded, baby!\nCause I think you're hot! (Woo!)\nCold blooded!\nCause I think you're hot! (Sexy, sexy, sexy)\n(Sexy, sexy, sexy)\nOoh, baby!\nOoh, aww!\nOoh, baby!\nCold blooded!", "[ODB]\nLadies and gentlemen, huh\nThis a song.. that dedicated..\n(wee kah boo boo doo doo boo dah boh dah bah dah boh doh goh doh doh..)\n.. to me.. (dah boh goh ding.. ah, lalalalalalalah)\nMmmmmmmmmmmmmmmmmmmmmmMMmmmmmmmmmmmm..\nDoo be doo boo boo be doo boo woo boo BEE booweeoooohhh\nWeayeahhhhhhhhhhhgirrrrll\n\n[Lil' Mo]\nWhoahhhh-woaAHH-woahhoahhohhh\n\n[ODB] Ah zooby dooby dooby\n[Lil] Whoahhoooooohwhoahhhooooooh\n[ODB] It's on me girl, to stop fightin and work this out, knahmsayin? F'real\n\n{*from here out, ODB not in (), Lil' Mo in (), both in []'s}\n\n(Good morning heartache) Good morning heartache, good morning\n(You always by my side)\n[Good morning heartache] Good morning heartache\n[Thought we said goodbye last night]\n[I tossed and turned til it seemed] that [you had gone]\n[But here you are.. with the dawn] Ooooohooooohhh\n[Oooh wish I'd forget you] Wish I'd forget you, proper state of mind\nWish I'd forget you bayyyybe, [but you're here to stay]\nStop thinkin about bein so harsh all the time\n[It's seems I met you] Stop bein prejudiced to each other\n[When my love had gone away] Stop bein jealous, of one another\n[Iaahahahahahhhhhhhhh] ahahahahahhhhhhh\n(Start each day out) [just by.. saying to you..] hello\n[Good morning heartache, what's new] newwwwwwwwww\n[Stop holding me now..] nowwwowowowowwwwwwwwwwwwww\n(Can't shake you, no howww) No howwwwwwwwww\n(Why don't you) why don't you, why don't you\n[Leave meeeeee alone] aloneeeeeahhhhhhhhhhIahhhhhh got\n(I got those, Monday blues) Monday bluesss\n(go straight through) straight through (Sunday blues)\nSunday blueeees\n(Oahahaoohhhhhhhhh good morning heartache)\nGood morning heartache\n(Here we go, here we go, here we go again)\nGood morning heartache, oahahhh.. let's go\n[Good morning heartache] Good mornin heartache babe\n[You're the one, who knew me when..]\n(Yes I might as well get used to you)\n(Hangin around) Oahhhhhohhh\n[Good morning heartache] acheeeeeeeee\n[I see you're back in town] towwwwwwwwwn\nOahh *cough cough cough*\n(Good morning heartache..)\n*cough cough, cough*\n[Why don't you just, sit on down]\nHold up\nWHYYYYYYY DON'T YOUUUUUUUUUUUUUUUUUU\n[SIT DOWWWOWWWWOWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWN!]", "\"C'mon baby, c'mon c'mon baby\" repeats\nIn background all throughout the song\n\n\"You bitches can't do nothin\" repeats\nIn background through intro\n\n[Intro: ODB]\nIt's Ol' Dirty Bastard and shit, know'm sayin?\nI wanna give a big shout out to my nigga Lou\nKnowI'msayin? You know, you know, know\nI wanna lock all the bitches down\nI wanna lock all the bitches down from the North\nTo East, to West, to South\nKnowI'msayin?\nI wanna.. help me put these bitches in my trance\nI want y'all to suck my lizard\nYou bitches wanna fuck me when you smell my under-arms\n\n[ODB]\nI'll make yo' dick disappear\nI ain't hearin' anymore weird sounds in the air\nPSSSSSSS... you can't purr no more\nYou wanna kneel and suck dick? I'mma keep your throat sore\nBitch you got herpes in ya ass\nEvery time you fuck a nigga, he dies fast\nAnd you won't last\nThe pussy break down from a rash\nIt's hard for you to walk, cuz you stuck up in your ass\nDon't ask me for no cash\nYou better not be tellin' me to give them no cash\nAsh, bash, crash, sad ass\n\n[Hook: ODB]\nGive me a little of that Cracker Jack\nYou ain't caramel coated Cracker Jack\nWell surprise, bitch you gonna get waxed\nThat's that shit, you can't do nothin' about\n\n[ODB]\nGirls ain't pretty to me anymore\nCuz you ain't bein a real whore\nOoh, you ain't a real whore\n*I'm gettin' hot and touchin' myself!*\nYou can't say, wear nails anymore\nYou ain't givin a, manicure\nSuckin' my dick is gonna be your cure\nIf you don't, your punishment\nYou can't get off until you suck my dick\nPhysically I operate your brain to function\nGive me anything, that I want and\nALL GIRLS WANNA FUCK ME EVERYDAY\nAnd give me that, the money\nDon't even know it happens naturally\nEspecially when I'm playin with the chemistry\nTHE MONEY COMIN TO ME FIRST\nYou gonna keep dyin til you die from thirst\nI WANT A DIFFERENT GIRL EVERYDAY\nIf you wanna die, you gotta drink my sperm\nThe other way to die, is eat a can of worms\n\nChorus 3X\n\n[Outro: ODB]\nGive me a little...\nYo, I love you girls cuz you wanna stick your tongue up in my ass\nOr you can't taste, smell, touch or hear, or see\nI got you in a smash, give me it!\n\n[Instrumental for next 58 seconds]", "[Ol' Dirty Bastard]\nThis is the cleanest bathroom I've ever seen\nI'mma sit my shit down\nUhh, ahhh, ahhh, oh shit *fart* uhh hold on, I'm good\nTake my shit, now, boy\nNigga gotta shit! Nigga gotta shit!\nAin't nothing wrong!\nWhat? What, wash the toilet bowl?\nThat look clean to me\nAhh, shit -- shit, lord\nOh... damn... ahh, ahh, fuck, man\nDrinking too much of that damn wood, everytime\nShit... mmm rush no shit...\nUgh... ahh, damn... wipe my ass\nI don't know why they don't just put one of them\nProtective covers over the seat\nFuck I might catch some shit up in my ass", "[Hook: Ol' Dirty Bastard]\nI wanna stay high in the clouds\nI wanna keep plenty of pussy around\nI'm gonna keep puttin' in bullets in pocket\nJust in case, it's goin' down\nI'm a Brooklyn soldier, yes, I'm is\nIf you lookin' for a problem, here it is\nI'm worser than the cross and bones, and that's danger\nI don't give a fuck, what beef it is\n\n[Ol' Dirty Bastard]\nNow I'mma get serious, pussy don't talk, went the heat come out\nNiggas sleep on Dirty, til the street come out\nI like fame, but lockdown changed the nigga\nNow it's all about the gauge, on the stage for nigga\nCuz haters wanna shoot, everything that shine\nSo I'm prepared, to lock and load my rhymes\nEat, two at a time, while my mind is bent\nAnd dare motherfucker, come with Brook' with that\nI be rollin' on the Boulevard, nothin' better rush\nI'm like Big Ben with my middle finger up\nSidewalk hash, make thugs relax\nGot a team that could devour your habitat\nMore gritty than Diddy, cause my hair's uncombed\nStreets I roam, are too hot to throw on poems\nFeel like every block's home, when the yay is yo\nGotta rob a motherfucker when the day is slow\n\n[Hook]\n\n[Black Rob]\nUh, pussy doctor, four-four cocker\nPlatinum, baby, ya'll niggas is goin' copper\nI'm down in Bad Boy South with the nigga Chopper\nProgrammed to blow shit up, like Dennis Hopper\nHella pointed, hop out the helicopter\nIt's L.A.X. for the weed, it's hella proper\nI rap, but still stick hoes for door knockers\nAnd if she's persistent, block her, block her, block her\nInfered, I call it the show shocker\nIt's M.S.G., with Jay-Z, the show stopper\nAnd this is for them gangsta dudes, know you boppin'\nThat take dough, and don't take shorts for no coppers\nMy team are life stoppers, watch me split ya life up\nLike Mekhi Phifer, in the movie \"Clockers\"\nAnd just for doing the thing, they try to lock us\nWanna find me? I'm way in' the back with the pill poppers\n\n[Hook 2X]", "[Intro: Damon Elliott (Ol' Dirty Bastard)]\nYo, this is Damon Elliott, we got a lotta shit\nDame Dash, put me on game, baby\nPurplelicious style, Macy Gray, Ol' Dirty Bastard\nWho the fuck thought it would hit like this? (what? what?)\nWhere's my J, baby, where's my J? (Ohhhhhhhh, yeah)\n\n[Hook: Macy Gray (Ol' Dirty Bastard)]\nDon't go breaking my heart\n(I won't be breaking your heart) You better not\nThey're gonna tear us apart, now, baby\n(Don't wanna tear us apart) They better not\n\n[Ol' Dirty Bastard]\nI'll die for you, do time for you\nKill for you, that nigga was never good to you\nNow that I'm out, what, you gonna do?\nLet's get Hot Dogs on a Stick, now (Hot Dogs on a Stick)\nThree drinks of lemon, fresh trip\nOver the back of the backlands, king size bed\nFilth all clean, let's do the do\nAll listening to Dionne Warrick singing \"Deja Vu\"\nThis is a dream that I was new\n\n[Hook]\n\n[Ol' Dirty Bastard]\nMacy, and O.D.B., too hot for the chief, F.U.C.K.I.N.G\nThat's what I'm gonna do with you baby (what's that spell?)\nLet's go to the park, after dark\nRide some bitches, stab a bitch nigga\nAnd get on your knees, leave behind you, atomic doggies\nThen go to the movies, I don't care which movie\nI just wanna get some popcorn, make it salty\n\n[Macy Gray]\nDo you want some licorice, do you want some candy?\nI wanna drink something outta you, while you sip some Ginger Ale\nHey, hey\n\n[Hook]\n\n[Interlude: Damon Elliott (Macy Gray)]\nHaha (yo, these for all the lovers out there) shut up\n(Sh-shut up?) Shut the fu....\n\n[Hook: Ol' Dirty Bastard (Macy Gray) {both}]\nOoooh-hooo, nobody knows it, nobody knows\nThat when I was down (I was your clown)\nOoooh-hooo, nobody knows it, nobody knows\nThe life on the side (I gave you my heart)\n{Ohhhhhhh-hooo, I gave you my heartttttttttttt}\n\n[Bridge: Macy Gray (Ol' Dirty Bastard]\nDon't go, go breaking my heart\nDon't go... breaking it...\n(I won't be breaking your heart) Don't go breaking it\nThey're gonna tear us apart, now, baby\n(Don't wanna tear us apart) Don't go breaking it\nDon't go... breaking it... don't go... breaking it...\n(I won't be breaking your heart) Don't go breaking it\nDon't go... breaking it... don't go... breaking it...\n(Don't wanna tear us apart) Don't go breaking it\n\n[Outro: Macy Gray (Ol' Dirty Bastard]\nOooh, oooh (I won't be breaking your heart)\nThere's nobody faster, don't go breaking it\n(Don't wanna tear us apart) Don't go breaking it\nHot Dog on a Stick, ooah-ooah, hahaha\n(I won't be breaking your heart) Don't go breaking it", "Intro: Ol Dirty Bastard\n\nSup? Let's go\n(Yo Snoop Dogg! Yo Dre! Yo Too $hort! E-40, and the motherfucking Click!)\nNuff respect to the West coast\n(Duhhn duhhn duhhn)\nYo, Ol Dirty Bastard coming through\nKnow what I'm saying? I got the East coast locked the FUCK down\nHear my SHIT, nigga! (Dirty dirty dirty, Brooklyn!)\n\nVerse One: 12 O'Clock\n\nShit is crazy real in the field\nI watched niggas blood get spilled over five dollar bills\nAnd major drug deals on the real\nSee a nigga get meals and his bitch get him killed\nIn this American dream to get some cream\nYou're ownin a Beem, and your face in magazines\n12 O'Clock maintains in the game\nBring the Pain, to smokin' meth in Maine\nIt's not all about the fame, silly ass dames\nGet a gold record and you change\nAnd for the niggas sellin cocaine, you're too blame\nBlack people lives ain't the same\nAnd that's the Tale in my Hood\nNiggas is up to no good, you better watch em in them hoods\n\nVerse Two: Ol Dirty Bastard\n\nI always thought livin life was easy\nGo to school, get a job, yo it couldn't be me\nSo instead, I played my bed\nMy momma got fed, and now a nigga livin with a dread\nMy best fuckin friend, knew him since ten\nNigga feed me CREAM, let me whip the Benz\nHouses all over Texas, lightning gold Lexus\nHe had enough respect to dress this\nExpensive Tim suits, girl wearin fly Gucci boots\nPut me on like POOK!\nEvery morning that I awake\nTen G's in my fuckin face, combination to the safe!\nSon run the state, carrying coke by the weight\nNigga put pounds in the weed gate\nAnd it's ran by Ol Dirty\n12 O'Clock, my little brother, he keeps it dirty\nDirty\n\n[Fuck all that motherfucking drug selling shit\nI wanna see some motherfucking lyrics\nI wanna hear some motherfucking lyrics\nWhat up nigga, what?]\n\nHahahahahahahahahahaha\nI got you nigga\n\nVerse Three: 12 O'Clock, Ol Dirty Bastard\n\nI'll rip mics on site you know the type\nNew Jack, this is my City like Wesley Snipes\nGo fly a kite or somethin, make some muffins\nI come up bad in the town like Charles Bronson\nNow set your speaker and I'll do you for that reason\n12 is no joke I bring wreck through the seasons\nSolomon, contend, many more but just when\nThat Joker act you can save for Jack Nicholson\n\nOne two and three, through your rap fatigue\nIn the MC world, is a minor league\nWhat you speak, you swear it's unique\nIt's just a peek, physique, of an old antique\nDon't expect a project, then it's bound to freeze\nYour whole head is stuck and stiff\nNext Siamese, I never liked rhymes\nThat's incomplete, then again obsolete\nI shall repeat, there's an Easy Street\nFor niggas who earned, then learn your sojourn\nThen you return, as an intelligent, positive, messanger\nNot an experiment negative Lucifer\nWith a tittling gloss of crafted skin\nNothing like spring sauce, of the true origin\nWho would score, the wizard of war\nCame in best man was a god damn dinosaur\nNo more jungle-like living, from the Blue Lagoon\nIt's not an Animal House, National loon Lampoon\nIf you understand the what when\nWhy how, are you fellas who exempt\nOr to disallow, a fresh MC, that will knock you down\nI gets dizzy spellbound like a merry-go-round\nWhile I'm freaking, shall I expose\nYou take a subject, and then you decompose...", "[Intro: Ol' Dirty Bastard]\nTurn it up!\n\n[Ol' Dirty Bastard]\nOne nigga, two nigga, three nigga, four\nOne of you niggas is about to get fucked up\nIt's the Ol' Dirt McGirt, live and uncut\nLive and uncut, ready to bust a nut\nLike when I first came home, I boned Simone\nFucked her so hard, pussy started to groan\nSeven in the morn', woked up and yawned\nThe bitch scrambled my eggs, she wrote me a song\n(Sing it!) It's all because of Dirt Dog\nThat the reason I took my skirt off\nYou went away -- now I'm back with (what?)\nAnd this is where the bullshit stop\nPlus these voices in my head, want me to go back\nPick up your guns, don't take your Prozac\nRitalin, Codelin, Zoloft, cocaine\nWu-Tang, nigga, it's the new John Coltrane (hahahaha)\n\n[Hook: girl (Ol' Dirty Bastard)]\nDirt Dog, Dirt Dog, you our man\nIf you can't do it, then no one can\n(Mr. McGirt, gonna get you dirty\nLift up your skirt, I'm gonna get you dirty)\nDirt Dog, Dirt Dog, you our man\nIf you can't do it, then no one man\n(It's the (what) in the house, gonna get you dirty\nThe Wu-Tang Clan gonna get you dirty)\n\n[Missy Elliott]\nI hopped on the scene, spit sixteen bars lean\nCross your face like a smear of Mabeline\nWet jeans, get rised, ecstatic clean\nIs it cuz my sex feel like you on morphine\nThey-they think, I'm so much\nI talk tough, burn your mouth and handcuffs\nMakin' hits, I'm making paper, cake it up\nLookin' haters in the face, like 'nigga what?'\nNow scream, how many of these muthafuckas respect me\nCuz I'm the only chick who freak any beat\nSo pack it up, with that O.D.B\nOh, it's a bad bitch...\nShame on a nigga, who, who tried, to run game\nOn a nigga, like a gold digger\nI pull my trigger, I bet my gun bigger\nNow how ya'll figure, that's how ya die quicker\n\n[Ol' Dirty Bastard]\nA Son, what? what?\n\n[Hook]\n\n[Outro: Ol' Dirty Bastard]\nDie, drin', die, come on\nThis is strictly for the radio\nYo... can't stop...", "[Intro: O.D.B/Violent J/Female]\nYa'll know how I get down..Ya know what I'm sayin'\n(Dirty) Detroit (Dirty) What..Brooklyn..Zoo (Dirty) Yeah..What (Dirty)\nInsane Clown Posse and O.D.B\n(I got O.D.B and I got) platinum baby what\n(I ain't goin' nowhere until I'm Dirty and Stinkin')\n\n[Verse 1: Ol' Dirty Bastard]\nYeah, There's a quarter and it's Dirty and Stinkin'\nFunkier than Peppy Le Pew so I was thinkin'\nAbout (What) droppin' this single on the charts (Yeah)\nLetting you know hey the kid has heart\nI never deny myself, it's when you dope\nBut in my last jam, slept on my notes\nYou thought that I was weak, Huh let me speak\nMy rhymes come funkier than your grandfather's feet\n(Dirty) So listen hear mister don't you ever forget\nThe rhyming Dirty, you couldn't even clean if you commit\nOr even boring, some try ajax, only mess with the best, 48 tracks (Yo)\nI get down with the Ason sound\nLyrics that be flowin' from miles! around\nSo let the music shut yo' ass up\nAnd throw the upper cut that will make you fall onto yo butt\n\n[Hook: Female Singer]\nI wanna get Dirty and I (Dirty) wanna get Stinky\nAnd I (Stinky) ain't goin nowhere till I get\n(Till I) get Dirty and Stinkin'\n(It's Dirty and It's Stinkin')\nI got O.D.B. and I got I.C.P\nAnd I ain't goin' nowhere until I'm Dirty and Stinkin'\n(It's Dirty and It's Stinkin')\n\n[Verse 2: Ol' Dirty Bastard]\n(Dirty) Let me continue, verse number 2\nStyle is wild dirty stinky like doo doo\n(Get Dirty) If you hangin' around\nHen change yo' mind, It is a bad influence, Yo it's my rhyme\nI sit down and I say to myself\nSelf, Yo are you rated top joe\nI drop a single for ya to get a dose of\nAs I lay back like a pillow on the sofa\nYou get paid (Yeah right) Bully, Fly\nAskin B.G. wha wha wha wha you know me\n(Dirty) Sweet as a hunny bee, taste like a 40\nTick you like oohhwee\nWant to drink old english so I speak old english\nYa gotta be dirty and stinkin'\nAnd if it's not, well I guess I'm not\nThe ASON in my butt , It's Dirty and It's Stinkin'\n\n[Hook: Female Singer]\nI wanna get Dirty and I wanna get Stinky\nAnd I ain't goin nowhere till I\n(Nowhere, Nowhere) get Dirty and Stinkin'\n(It's Dirty and It's Stinkin')\nI got O.D.B. and I got I.C.P and I\n(What) ain't goin' nowhere until I'm (Yeah Yeah)\nDirty and Stinkin'\n\n[Violent J]\nO.Deezy. Beezy and I.C.Peezy\nTogether on this track forever\n\n[Verse 3: Shaggy 2 Dope]\nSell me, I know my funk be kickin'\nTurnin' heads like an 8 foot tropical mud chicken\nThey fear these juggalo flows\nI'm (Dirty) dirty like Osama Bin Laden's toes\nI got hatchet love, it decayed in the barn\nChicken chain saw hard\nI'm making neighbors uncomfortable\n(I wanna get Dirty and) and Take me home and it's late\nDon't worry bout the ring in ya tub\nIt's the clown paint\n\n[Verse 4: Violent J]\nI.C.P. and O.Dizzle wildin\nWorkin' like a fat chicks feet at Kings Island\nA whole Source 9 mics, I don't care\nI'm a 10 year vet 5 plaque rat millionaire (Yeah)\n\n[Hook: Female Singer]\nI wanna get Dirty and I wanna get Stinky\nAnd I ain't goin nowhere till I get\n(Till I) get Dirty and Stinkin' (It's Dirty and It's Stinkin')\nI got O.D.B. and I got I.C.P\nAnd I ain't goin' nowhere until I'm Dirty and Stinkin'\n\nOh Oh...Oh..Dirty..Oh...and Stinky....\n(I) (I) (Stinky, Stinky)...(It's Dirty and It's Stinkin')\n\nOh\nDamica (What I)\nI.C.P\nO.D.B\n\n(Dirty) (Dirty) (Dirty) (Dirty)", "[Intro: Too $hort (Ol' Dirty Bastard)]\nBitch you knew I was a dog when you met me\nHow you gonna get mad at me now?\nCause I got bitches.. everywhere\nBitch I'm a player, y'know\n(Y'know, killa, y'know'I'msayin'\nI said shit, I said, that's dat monster dog shit, y'know'I'msayin'\nThis is all dedicated to all you hoes)\nAnd bitches\n\n[Verse 1: Ol' Dirty Bastard]\nShame on a nuh, who tried to step TUH\nThe Ol' Dirty Bas, put my foot up your UHH\nBitch, you walk around with your bra too tight (beitch)\nIt's alright, you still gon' get fucked tonight\nHoeeeeee! (bitch fucky) Stinkin ass ho!\nYou're the type of bitch don't appreciate shit\nNever had shit, so you won't be shit\nThat pussy there, couldn't satisfy a hair\nOn my body, treat me like a lolli and slob me doooooown (beitch)\nAnd Doo Doo Brown! (beitch) Hehahahaha\nTossed salad, oh you in some shit now\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nHere comes Rover, sniffin' at your ass\nPardon me bitch, as I shit on your grass\nThat means ho, you been shit-ted on!\nI'm not the first dog that's shitted on your lawn\n\n[Hook: Ol' Dirty Bastard]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\n\n[Verse 2: Big Syke]\nRight behind my pitbull, full grown\nThat wanna make the cat moan all night long\nPuppy don't take me wrong, but it's on\nBe monkeys up, so call me king kong\nGet gone with the thong, crew comin' through\nBig Syke daddy with the Brooklyn Zu\nYou know what to do, freaky sucky sucky\nWon't you show the crew how you play wit' the monkey\nLet him see you don't fake it, and you can take it\nIt's only the bigger bone, gotta make it\nBaby shake it in the worst way, OK\nUp in you in the parle\nMy forte is a freakyness, look at this\nI don't kiss anythin' that I don't miss, runnin' sense\nTo get licked from the nuts to the crack of my butt\nI'm a dog, so what, but you still give it up, Wu/woof\n\n[Hook]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dog out\nCallin' me a dog, well leave a dogged alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\n\n[Verse 3: Too $hort]\nBeitch, this is what I tell these hoes\nDon't sweat it baby, you'll never be my lady\nTake this bone, straight to the dome\nAnd get on (get on), cause I don't wanna talk\nShut the fuck up if you done wanna walk\nWe on the same page? I thought so\nYou know them big dogs hit you wit' their paw ho\nBig pimp (pimpin') jump the fence\nHoppin' all night it don't make no sense (na na)\nFrom New York to Cali', whylin' (wild)\nI got the bitch in the alley howlin' (beitch)\nAnd she don't wanna go nowhere\nShe got love for a player she don't know no better\nThat's why I tell her (tell her)\nI'd be wid you forever if I could find time to put you\nIn my schedule (beitch)\nBeitch, $hort Dog in the house\n\n[Hook]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\n\n[Verse 4: Ol' Dirty Bastard]\nShe flew in like calm breeze\nTall brown skin, her weave like palm trees\nI went coconuts\nDipped my dunkin' between your Donut\nDon't want it if it ain't no slut, bitch!\nFathership touch ground, like fly on soup\nDon't invite me I tear the fuck down\nWhite boys cut my toupee!\nSeventh day raster, or scream play\nI slump MC slay, it ain't nuttin' to bust ass\nBullet him, get him fast\nBitch I don't break out, blast to the next rash\nThe dog piss on MC's like trees\nGot meals but still grill that old good welfare cheese\n\n[Hook]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out", "[Ol Dirty Bastard]\n\nSee let a nigga come through with that bullshit\nAnytime you pop that shit nigga\nI'ma tell you you can suck a dick, you can suck a pussy\nI know, it'll come to what? Say what?\nNow I'ma let all you motherfuckers know\nSee them knows that this is something you can't fuck\nWhether you from Brooklyn, whether you from Manhattan\nAlways\nYou from Queens nigga, I don't give a fuck, where you be motherfucker!\nWhere you reside... motherfucker! How you live? How you seeeeeeee...\n\nSort the stack outs, this one's the blackout\nThree-fifty-seven to your mouth, blaaow!!\n\n[Buddah Monk - Brooklyn Zu]\n\nDunn can you hear me? Raw is how I'm inflicting this\nIt's that G type slang that makes this real sickening\nIgnite my styles I got my hand pon the trigger\nStarts from the smallest and hits the bigger nigga\n\n[Prodigal Sunn - Sunz of Man]\n\nYo, straight actin live about them hellfires\nA known mental killer, or thriller, assassin of terror\nThe hot bloody fatal mixture of carbonate water\nHomicidal manslaughter, death is the order start the mission\nTravel like the speed of wind\nThrough the valley of sin, I step to ville and murdered many man\nServing justice in my vicinity\n\n[Zu Keeper - Brooklyn Zu]\n\n(This is, Brooklyn, Zu!!)\nZa-za-za, za-za-za\nZuh-za-zah, z-zz-zz-z-z-zz-zz-z-dah-duh-dnn-duh\n\n[Murdoc - Brooklyn Zu]\n\nI get down I get down I crack your fuckin crown\nLay around and watch some real niggas break ground\nI can't shop cuz every bro blowin up the spot\nHit rocks and niggas know\n\n[Killah Priest - Sunz of Man]\n\nYo! Niggas grab the mic like the bites of a scorpion\nNervous, that's why the Zoo brought me in\nNow bring em forth, like the tortures at the courts\nBefore the case begin, first break me in\nHis brain! And make sure he can't maintain the calmness\nYa harmless, watch how I bomb this\nStage like, mail, pre hands that be the move\nNow your Posse is your fuckin Platoon\nStale cells, just flows through the air\nI'm like a ninja, once I send ya down stairs\nThen I get furious, imperious, the lyricist\nWith the cleverest rhyme\nErupt to deduct your fuckin mind\n\n[12 O'Clock - Brooklyn Zu]\n\nFuck shit up on the hurry-up\nKnown for burying ducks through more styles than a monk\nWarning you chump, brain is out for lunch\nGiven the power punch, soon to be paid like Donald Trump\nNever fall victim to no bitch\nJerked my dick, but still got more hoes than a pimp\nAnd score more points than Shawn Kemp\nKeepin powerfully strong like the center on the Knicks\nHut one, hut two, hut three, hut!!\nOl Dirty Bastard live and uncut\n\n(Shame on a nigga who tried to run game on a...)\n\n[Shorty Shit Stain - Brooklyn Zu]\n\nGot more props than the President\nMy hardcore represent, blowin niggas back who never had this\nCause I'm gifted, so you can get wrapped\nThe shit I'm kickin, send it to your MOMS for Christmas\nAnd tell her Shorty Shit Stain sent it\nSoon to have more green than the Jolly Green Giant\nCuz niggas rap styles just down is aspired\nYou shoulda stayed HOME instead of picking up a microphone\nBut if you wanna run on up, like you TOUGH\nI call your bluff, and blow you down with my hardcore\nStuff, I shine like twenty-four carat\n\n[Ol' Dirty Bastard]\n\nRoll and stroll with the party scene\nNigga wanna know me as Mr. Clean\nWza-wza-wza-wza-Wu-Tang, flip the script and\nTest my skill niggas, you're trippin\nDrugged up from sniffin, you're the one who's riffin\nI'm not Opie, save that old shit for Andy Griffith\nStart to flip, slip, cuz you're slippin\nWhile you sleep I be the God on point, with Scottie Pippen\nAs I, jump on stage, flip rip a show\nStrip and rip a hoe, wayyy like Bo\nJackson while I'm still taxin maxin\nRelaxin sittin back sellin good tracks and\nAgain and again when I rock the jam\nWANNA SEE EM UP IN THE AIR! Throw up your hand\nIntroducin, one-man band in town\nIt's wild, with the style couldn't stand nigga\nWhen the jump, stepped, to the center\nOf the rhyme inventor, MC's come at the\nYou get dap slapped, across the MC map\nYour ass that's your ass, on a whore shot\nCome on through I black and blue your whole crew\nThen I get Rudy with the Hong Kong Fooey\nOl Dirty Bastard, MC killer\nMoney maker, Brooklyn, challenger\nThat I lay down like towel\nThen I get higher!!\n\n[60 Second Assassin - Sunz of Man]\n\nHere comes the illlll, type ruffer\nStyle be untouched I'm leavin broken down grammars on the pen\nWho who what? What brings it? Tighter than your anus\nChambers this name is for the deepest trainers\nKeep it stainless, steel, on time it is the windmill\nDeadly venom kills, at the last of the Sam's Mill\n60 Second, nucleus, attack on your set\nHit you with the blast (yo close the door)\nShabazz!!\n*gun blast*", "[Intro: Ol' Dirty Bastard]\nHold on tight and don't let go\nBaby, I'm about to explode...\n\n[Hook: Ol' Dirty Bastard]\nIt's Dirty Run, when you see me coming high\nNine times out of ten, don't wonder how\nIt's Dirty Run, it's Dirty Run, no more vacancies\nI'm a minute from feeling no sympathy\nWhen you see me coming high\nIt's nine times out of ten, you will wonder how\nIt's Dirty Run, it's Dirty Run -- \"Run\" --\nI'm a minute from feeling no sympathy\n\n[Ol' Dirty Bastard]\nBitches be actin' like they so damn fine\nThat's why I fuck 'em at the drop of a dime\nNeedle dick niggas, go fuck a needle\nBefore I squash a John Lennon, like a Beetle\nDirt McGirt, Mr. McGirt to the hoes\nStinkin' rich, cover your mouth and your nose\nMan of my codes, it's old man, dig it?\nSometimes rockin' went, and Dirty might kick it\nDamn, your takers, that's the type to flight\nTo get any more suck, how niggas dick through a flint\nBig pimp, watch the fur drag\nA hundred lick, hundred lick, hundred lick fabulous\nBring it like a bus full of travelers\nTurn it up so the cops will get mad at us\nSwear to God, we're the trouble, you imagine us\nCuz the news only exploit the bad in us\nWhen, turn it down a little\nCuz the ground is startin' to crack a little\n\n[Hook]\n\n[Ol' Dirty Bastard]\nDiamond, baby, name the time and place\nWhen your legs get tired, you can sit on my face\nAnd touch me, tease me, feel me, caress me\nHold on tight and don't let go, baby I'm about to explode..\nTake that bitch for bite, my name Dirt Dog not cake with ice, bitch\nFuck bitin', when there's so much pussy\nIf you ain't into ass, then pimp 'em for the cash\nCome quick, turn the camera on\nSo whose that rippin' off your mama's thong?\nDirty, creep out your back door, nigga\nWith my shoes untied, zippin' up my zipper\n\n[Hook]", "Intro:\n\nOne two, one two -- you taping this?\nAll types of shit yo let that shit ride\nWord to mother, turn up the microphone!\nGet all that good shit, get all that good shit (one two, one two)\nOne two, one two, one two... one two\nNow niggas know\nSsssshhhit, yo yo check this out, check this joint\nThis is strictly for the radio, yo\nI just want all y'all to know\nThe reason why I curse is because my momma and my daddy\nThey grew up cursin\nSo please respect my style, please!\n\nVerse One: Ol Dirty Bastard\nI'll grab the mic and now I damage you, cut your whole stamin-u\nOhh, sssshit, nahh\nI'll grab the mic and now I damage ya, cut your whole stamina\nHere comes the medical examinuh\nOne verse then you out for the count\nBring the ammonia make sure he sniffs... the right amount\nYa yo, I'm sorry, un-gah-e-gas-e-ya\n\nI'll grab and the mic and now I damage you, cut your whole stamiNUH\nHere comes the medical examiNUH\nOne verse then you're out for the count\nBring the ammonia, make sure he sniffs the right amount\nWake you up and then I ask you\nHow do you intend this --\nCompetition to get an asssss kickin sooooo tremendous, RARRH!\nYou shouldn't bother this\nLeave me alone like a son he'll be fatherless!\nI got the asiatic flow mixed with disco\nRoll up on the scene like the Count of Monte Crisco\nAnd MC's start to vanish\nI rolled up on a jet black kid the nigga started speakin spanish\nYo! You wasn't from Panama\nI asked you how you get so fuckin dark, you said \"suntanima\"!\nHe responded so fast, you made me laugh\nHa-ha-ha, HARARRRH scared-his ass!\nKick the hundred strongest rhymes\nThen I brought out the punk in him\nRoll up with the strong five deadly venoms\nTold HIM! Enter the Wu-Tang!\nWitness the Shaolin slang, that crush any shit you bring\nI watch your ass take a big fall, why?!\nMy Main Source, is like a friendly game of stickball\nAnd as you step up to bat man, I play the Riddler\nYou try to do me for my nigga I'll change to Hitler\nI'll go out like Nazi, wish your fuckin ass stayed\nHome and play Yahtzee!\nOr watchin Happy Days sweatin Potsie\nWith Ralph, and Richie Cunningham, Joni and Chachi\n\n(Yo Unique, yo kid\nCheck this shit out! Yo, yo)\n\nVerse Two: Ghostface Killer\nNinety-five niggas is wasted\nKeystone capered, and Wu kept the rap fiends basted\nFoamin out the mouthpiece, heads blown like geese\nMurderous police, I do shows and perform in Grease\nIt's not magic, gaming is the gadget\nWorld classic big national high attracts dear graphics\nLampin in my own zone, my physical show\nInhale bones Tony Stark, for the diamond in Rome\nHe's convincin, labelled one man rap convention\nThe nigga that'll gun down, eighty frenchmen\nLead vocalist, music specialist, rap arsonist\nI deal with sharpness plus spark the hardest individual\nI plant crimes inside vocals\nMy rap's like my passport, my life's my proof\nHit the sun roof, be out like a wanderin dream\nShuttle, and get startled off the verbal hygiene, my nigga\n\n(sample of Stamina)\n(sample of Baby C'mon)\n(sample of Brooklyn Zoo)\n(sample of Drunk Game (Sweet Sugar Pie)\n(sample of The Stomp)\n\nShame on you when you step through to\nOl Dirty Bastard, Brooklyn Zoo!\nShame on you when you step through to\nOl Dirty Bastard, Brooklyn Zoo!\nWhat?!! My nuh\nShame on you when you step through to\nThe Ol Dirty Bastard, Brooklyn Zoo\nShame on you when you step through to\nTHe Ol Dirty Bastard, Brooklyn Zoo\nTo the West coast!\nTo the East coast\nTo the North coast\nTo the South\nWhen you take North, East, West, South\nPut it all together and it spell NEWS!\nThen you got the ol rhythm, bastard blues\nAnd ya don't stop\nSo keep your shit, motherfucker, fucker, fucker!\n\n(live concert)", "[Intro: Ol' Dirty Bastard]\nYou want this Dirty long, you want this shit\nYou want it, you need it\nYou want this Dirty long, you want this shit\nYou want it, you need it......\n\n[Ol' Dirty Bastard]\nDon't need muscle, cuz Barry got a gun\nNighttime, still blaze like sun\nBook the residence, worry bout none\nChillin' with believer, drinkin' zero proof rum\nDarker is better, cuz the dick's well done\nBe a good girl, let you taste what I'm from\nBaby, I'm the man, with the frame: well hung\nCuz a squirrel, is a squirrel til a squirrel get a nut\nGet a butt, like an ashtray, point it out, I eat her\nTil the 6, been callin', sayin, \"nah, I don't wanna meet her\"\nIn the ass, to some Pendergrass, after smokin' grass\nFuck her fast like a rabbit, I'm a sex fiend addict\nI'm a sex fiend addict, I'm a sex fiend addict\n\n[Interlude: Ol' Dirty Bastard (sample) {Black Keith}]\nYou want this good looking muthafucka\nCuz I'm a good looking muthafucka, girl\nYou want this Dirty long, you want this shit\nYou want it, you need it..\n(It's so doggone good, it's so doggone good\nIt's so doggone good, it's so doggone good) 2X {Keep calling me...}\n{Pussy keep calling me}\n\n[Ol' Dirty Bastard]\nIf she's layin' in my sheets, she's the freek of the week\nSeen it all, done it all, lick my balls with her tongue\nGot my toes curled up, like I'm sayin' right on\nIf you wanna ride home, let me call you a cab\nCuz the next bitch coming, might be coming in the cab\nLike licking, you can chill, if you ain't, you can escape\nCuz the friend's coming with her, and she can participate\nAfter Mardi Gras, I meet 'em in titty bars\nTake 'em home, and bend 'em, and fill 'em with Dirty long\nCock strong dick diesel, when I stand like an easel\nCome sit on Mini Me, and put a smile on Dr. Evil\nGot some sunshine, leavin' my girl behind\nThe kind of pussy that start up a conga line\nPussy callin', I be pickin' it up\nPussy robber, I be stickin' it up\nWhen I leave the ringer off, I be missin' a nut\nI be missin' a nut, I be missin' a nut\n\n[Outro: Ol' Dirty Bastard (sample) {Black Keith}]\nYo, you get your friends, and I'mma get my friends\nAnd we gonna smoke some shit, and we gonna do this shit\nYou know what I'm sayin', we gonna go wild like animals and run loose in this\nMuthafucka\n(It's so doggone good, it's so doggone good\nIt's so doggone good, it's so doggone good) 2X {Keep calling me...}\nYeah, you like it when I go deep, baby, it's that Dirty long baby\nFuck you, fuck you, fuck you, come all in that pussy {Pussy keep calling me}\nAiyo, hold on, hold on for a second {pussy keep calling me}\n\n(I wanna keep on, checkin' on you, yeah.... I got to know everything you do\nCuz you're lovely, love that you that, hey hey hey, you so doggone good)", "[Intro: Nicole Ray (Ol' Dirty Bastard)]\nDirt Dog, Nicole Ray\nWelcome home, you Dirty mutha-- Wu!!!\n(2003, Brooklyn)\n\n[Hook: Nicole Ray]\nUh oh, Dirt Dog\nUh oh, Dirt Dog\nUh oh, Dirt Dog (dirt dog)\nUh oh (dirt dog), Dirt Dog\nIt's been so long (been so long)\nSince you've been gone (you've been gone)\nSo bring my body some heat (body some heat)\nTo move slow to this beat (yeah, yeah)\n\n[Verse 1: Ol' Dirty Bastard]\nDirt, the ol' shit, let me put my hands up your skirt\nBeen to you since I flirt, bet your knees get hurt\nSee your titties through your shirt, may I feel like Kurt\nIn bed, I put in work, I got a dick I'll squirt\nI'm totally psyched, that this party all night\nWhen I play the shelf, I'm fuckin' bitches, that ain't my hype\nI got ass in my sight, girl, would you now blowin' the pipe\nJewelry, I wear, bite, I like that pussy tight!\nFind my drugs in the street, stink assholes in seats\nHolla at me, tweet, tweet, that's where the fucked up feet\nBanana livin' bitches, fast it itches\nUnwire Gucci stitches, get grain to riches\n\n[Hook: Nicole Ray]\nUh oh, Dirt Dog\nUh oh, Dirt Dog (Get off the jock!)\nUh oh, Dirt Dog\nUh oh, Dirt Dog\n\n[Verse 2: Ol' Dirty Bastard]\nMet this bitch, pussy switch\nI'm a dog, I itch, monkey, I'm rich\nSettled in Brooklyn, only let crooks in\nGhetto black pussy, yeah, I fit in\nNigga, I'm most in, party's I'm hostin'\nMy note to cokes in, do the front row sting\nPut your hot temperature, your pussy sent ya\nOver here, I pimp ya, white and black I blend ya\nDick up like a roaster, you be like whose the\nMy music will lose ya, you miniature\nI got this microphone, pulled back and cocked\nAnd all sperm cells get off the jock!\n\n[Hook: Nicole Ray]\nUh oh, Dirt Dog\nUh oh, Dirt Dog (Get off the jock!)\nUh oh, Dirt Dog\nUh oh, Dirt Dog (Yeah)\nIt's been so long (been so long)\nSince you've been gone (you've been gone)\nSo bring my body some heat (body some heat)\nTo move slow to this beat yeah, yeah\n\n[Bridge: Nicole Ray]\nBaby can you play my song (got song)\nWe be dancin' all night long (all night long)\nFeelin' sexy and so free\nMusic takin' over me\n\n[Hook & Bridge to the end]\nUh oh, Dirt Dog\nUh oh, Dirt Dog\nUh oh, Dirt Dog\nUh oh, Dirt Dog\nBaby can you play my song\nWe be dancin' all night long\nFeelin' sexy and so free\nMusic takin' over me\nUh oh, Dirt Dog\nUh oh, Dirt Dog\nUh oh, Dirt Dog\nUh oh, Dirt Dog\nBaby can you play my song\nWe be dancin' all night long\nFeelin' sexy and so free\nMusic takin' over me\nUh oh, Dirt Dog\nUh oh, Dirt Dog\n\n[Outro: Ol' Dirty Bastard]\nHot for you, comin' soon\nDirt McGirt..", "[Intro]\nWhat what what what what what\nYou know when the time it is motherfucker\n\n[Hook]\nReunited cause it feels so good\nReunited cause we're understood\nThere's one perfect thing\nAnd children this one is it\nWe both we're so excited cause\nWe're reunited, hey! hey!\n\n[Verse 1]\nI'm known on the microphone as the rap professor\nCas-ual dresser, you may dress fresher\nThe way that I speak this shit is energetic\nMy physique of meat is quite athletic\nRemove all MC's who disapprove\nThat my funky rhyme article always have the groove\nYou're jealous over me nigga, you're not a competitor\nYou're just a donor, I'm the rap editor\nTryin' to rock the mic when you get an appetite\nAll negative on the mic, I dislike\nTry to rock the mic but only will reduce\nTry to get loose, you juice as a youth\nNot knowin' to yourself that you shall be frozen\nI'm the MC warrior, who has been chosen\nTo rock and shock beats, polite when I recite\nSulfur emcees, you are down right, out right\nTryna be talkative, there's no alternative\nHide until I forgive, this motive\nI am unique with the perfected physique\nThe objective of my rhyme is my own technique\n\n[Hook]\nReunited cause it feels so good\nReunited cause we're understood\nThere's one perfect thing\nAnd children this one is it\nWe both we're so excited cause\nWe're reunited, hey! hey!\n\n[Verse 2]\nI maintain the paradise on this Earth\nWith the shut the fuck up style for what this shit is worth\nWatch a nigga catch a purse\nSuper-hero niggas die\nDo my dirt, get away and multiply\nYou bitches, ya nice guys\nAlways want bitch, because ya need my bit\nI pleased on how I get up on the stage and fuck up the show\nCause nobody can't fuck with me!\nEarl!!, from ages, a 100 and down, sacrifice ya baby to the underground\nThe best kept secret, how does it feel to be\nBoxin' in like a skeleton, growin' back ya skin? oaaaaaaaw!\nI can't help it if my style is foggy, monster boogie\nGet ya high on my patio, all come to see me movie\nBicthes, you're walkin' on my dirt\nWe ain't sayin nuthin'\nI'm in ya ear, make ya blink cold Pert\n\n[Hook]\nReunited cause it feels so good\nReunited cause we're understood\nThere's one perfect thing\nAnd children this one is it\nWe both we're so excited cause\nWe're reunited, hey! hey!\n\n[Outro + Hook]\nYo, I wanna tay give a big shout out to the Wu-Tang Clan\nWe holdin' it down. YouknowI'msayin?\nAnd I also wanna show mad love to Puffy cause you holdin' it down\nMaster P, you holdin' it down\nKnowI'msayin? Dr.Dre, you holdin' it down\nGive Snoop my love, E-40\nMC Eiht, West Coast, word is bond\nThis is family, I don't give a fuck!\nStraight up. It's Dirt Dog, nigga!\nY'all niggas know how the fuck I get down!\nKnowI'msayin? I'm here to represent this shit!\nKnowImean? I love y'all niggas!\nMotherfucker, my stomach hurts!\nBitch, I got to go!\nReunited cause it feels so good\nReunited cause we're understood\nThere's one perfect thing\nAnd children this one is it\nWe both we're so excited cause\nWe're reunited, hey! hey!", "[Hook 2X: Swizz Beatz]\nOl' Dirty make the girls say\nCome on, clap, come on, clap, come on, clap\nCome on, everybody, come on, clap\nCome on, yo\n\n[Ol' Dirty Bastard]\nLook up in the sky, it's a bird, it's a plane\nNo it's Dirt McGirt, ain't a damn thing changed\nJust put spinners on a brand new Range\nWhen I walk up in the party everything seem strange\nOooh, must be that Roc-A-Fella chain\nI mixed it up, with that Wu-Tang slang\nThat college girl over there, she give good brain\nWhen I pull out my gun, it goes chitty bang bang\nI love 'em fat bitches cuz they titty hang hang\nWhen I'm trying to get some food stamps, to buy some champagne\nWhen you in the senior cars, gonna make you switch lanes\nBlame it on the muthafucking game\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nNow, come, get some, you little bum\nI'm Dirt McGirt, still living in the slums\nYeah, that's where I'm from\nAnd I got enough liquor, you can all get some\nThe Swizz Beatz drum, bang through your speaker\nI don't want no bud, cuz that ain't no good reefer\nForget from the Dirt, though, I'm the grim reaper\nAnd I might hit it once and pass to my man Peter\nAdios see ya, would hate to be ya\nYour man talk shit, I'mma put him in the sleeper\nSo get down, get down, like James Brown\nRoc-A-Fella money got me feeling lot better now\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nOooh, love it when you shake it to the ground\nYou serve in town, ODB comes around\nBlaow, listen to my drunken style\nGot enough Chambers, I can hit it going wild\nRims on my truck is bigger than a cow\nChpaow! Jewellery cost more than your house\nIf you cooking in your kitchen, get the fuck out\nMake them scream and shout \"McGirt, get in the house\"\nDude gonna air it, I'm barricade, pull it out\nIf I ain't got my gun, I hit you with the Guinness Stoute\nI'm back, buzzed, hit you with a different route\nPeace Mariah, for getting a nigga the fuck out\n\n[Hook 2X]", "Drunk as can be\nI am the drunken master style\nYou see nobody can ever touch me\nNobody can ever feel me\nNobody can ever say that he loves me or she loves me\nShe is a blessing on this earth nigga like the sun. raw\nYou see sometimes when the lyrics gotta come out\nMake the ladies want scream and shout\nThoughts be amazed handcuts is played\nNever wore other ?\nStormbrainiac\nTo the holy ghost taxism dusting ya\nCall me your neighborhood ghostbusta\nObviously you know my name by now\nThrow stupid parties all through your town unique or live or selected\nPanic will erupt you'll be infected I break mc's down into syllables\nHold it back till ya rhymes one syllable ?", "[Intro: Ol' Dirty Bastard]\nYo, I got love for you girls\nAll my Sweet Sugar Pies\nThis is dedicated to you\n\n[Verse 1: Royal Flush]\nHey baby what's your name? Look at your whole frame\nCompliment me on my chain, she bling it so I did the same\nWhere we goin' from here? Lets smoke and drink in Belvedere\nAskin' me about my peers, where I been for all these years\nStarin' at my car yeah, notice money round here\nPlease baby show your speed, nuff talk about me\nWhere you work? What's your hobby?\nMarried, or got kids to some bonnie\nFamous for karate\nWhat's your number, call you probably\nWaited for a week ot two, didn't see what we gon' do\nCame through, new car XL on them 22's\nKnock and marry, straight to her I wanna hit it badly\nThen she startin' barkin', said \"first we gotta get married\"\nI hate this bitch, all I wanna do is hit the nappy\nGassed her head up, tell her anything tha make her happy\nStraight to the hotel, she suck dick and fuck well\nAsked me for my house number, I gave her Ol' Dirty's cell\n\n[Hook]\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?\n\n[Verse 2: Ol' Dirty Bastard]\nIf a girl is a slut, with a hole in her butt\nWho used to be a meaty-bone puppy cow little mutt\nCame to my house smellin' like trout\nI said, \"Doggie doggie get the fuck out!!\"\nLet me tell you about the rash from the neck\nIt's enough to put the ring around the collar in check\nShe's nothin' but a bitch other known as a witch\nWith an irritating itch from trying to switch\nStrung out ass, foggin' up glass\nTellin' all the niggas tell that the bitch first class\nSmoke a bag of hash from all the shit she stashed\nFirst she had to play the collar just to made that cash\nPull down her panties then scratch that rat\nTear up the whiff, that appear [?]\nTryna get slayed, got the Tabernacle Prayer\nThe only thing holy was her shitty underwear\n\n[Hook]\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?\n\n[Verse 3: Royal Flush]\nHead anytime I want it, C-O 600\nWorld my state stuttin', girls come in diamond dozen\nFuck hard, niece and cousins, doin' what your niggas wouldn't\nFattin' like the white guttin', 85 I put my foot in\nBuck Scotties still pimpin', stay puttin' long dick in\nWhite pussy our commission, hit it while you when out fishin'\nDog I be fuckin' bitches, while you be duckin' stitches\nAnd don't think cause I'm a mack I won't buck at bitches\nMad cause my chain is bigger, rims look a little thicker\nLifetstyle's alot richer, you actin' like low hitchin'\nGet a heater on my strippers, maybe y'all gon' hit it\nNo rhymin', dance in a minute\nCause everybody that I popped tonight at least had 3 E's in it..\n3 E's in it\n\n[Hook]\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?\nWhen I'm sippin' on the henny, make me wanna fuck\nWanna fuck, wanna fuck\nWhen I'm thinkin' of them bitches I don't fall in\nLove, fall in love, fall in love\nAll I ever do is get high and fuck, bust some nut, bust some nut\nODB and Royal Flush don't give a fuck, bitches what?", "Intro: Ol Dirty Bastard, Shorty Shit Stain\n\nYo, turn the-- drop the, drop the drums\nYeah, drop the drums\n(I know all the time) Step up to the mic boo\n(It be hard to use a Trojan) Yeah, let me hear you\n(Cause your shit can't breath...)\n\n(Sex is something that everybody needs) I know all the time fellas\nIt's hard to use a Trojan\n(Everybody wants, everybody loves)      Cause your shit can't breathe\nIt's all closed in\n(Sex is something that everybody needs) Put the beat on, put the beat on\n(Everybody wants, everybody loves)\n\nChorus: Shorty Shit Stain\n\nSex is something that everybody needs\nEverybody wants, everybody loves\n\n(repeat 2X) - If you want it baby\nIf you want it babe\nBetter use a Trojan!\n\nVerse One:\n\nI know all the time fellas, be hard to use a Trojan\nCause your shit can't breathe, it feels all closed in\nYou wanna slip itoff, ohh baby I like it raw\nBut why i wanna hurt myself for?\nI was walking down my block, say my block Munroe\nSaid peace to this girl, girl said hello\nWell hell is low, and the lowest you can go\nIs thirty-two degrees, below zero\nSo I started to rain on this young bitch brain\nCausin her a great relief of physical pain\nShe said, \"Tit for tat, step off da bra strap\nNo diamonds, no gold, I can never get a rap.\"\nI said, \"So what?\", as I grabbed herbutt\nBitch smiled for a while but her  mouth kept shut\nBitch eighteen years old, just birthed a child\nYoung in the brain though her thoughts are wild\nOn welfare, but she don't care\nShe says, \"FTF is always there.\"\nFTF means face-to-face\nMain, headquarters of your local place\nWhere, you collect your monthly pay\nTo support bad habits youse abuse everyday\nThere hasnever been a girl in my entire life\nMy girl, my next, ex or my wife\nAnd never been one who tried to disrespect\nI'm speakin bout the member of the opposite sex!\nThere's somethin that I gotta let out\nBut I don't want to be known as Ralph the Blabbermouth\nQuiet as kept, she thought I was soft\nBut all I wanted to do, is knock her boots off\nJust from obtaining the common sense\nYou can tell that the girl seemin rather quite dense\nOther than dense she played slightly bold\nBut from the statement I made she could not uphold herself\nShe broke down, and she started to cry she said\n\"Oh!  I don't believe this guy!\"\nWhat what you gonna do?\nMay I diss her?  Yes you may\nThat girl's a slut, with a hole in her butt\nWho used to be a meaty-bone puppy child little mutt\nCame to my house smellin like trout\nI said, \"Doggie doggie doggie, get out!!\"\nShe did my dick, I mean she bit bad vicious\nDirt Megirt, deep dark and delicious\nShe's a doo-doo BUH\nAlcoholic NUH\nAnd her ass is tighter\nThan a pair of vice GRIPS\nSpeaking of a TUH\nI won't kiss, because they don't give milk\nThem shit, kick, see uh\nLet me tell you about the rash from the neck\nIt's enough to put the ring around the collar in check\nShe's nothin but a BUH\nOtherknown as a WUH\nWith an irritating ITCH\nFrom trying to SWITCH\nStrung out ass, foggin up glass\nTell all the NUH that the pussy first class\nSmoke a bag of hash with the money she stash\nBut she had to play the corner just to make that cash\nPulled down her panties and scratched that rash\nThen rubbed it with that a pimp had slashed\nTryied to get saved at the Tabernacle Prayer\nBut the only thing holy was her shitty underwear\nI will change a style, always I will fix\nBut you can not teach an old bag...\n\nOutro:\n\nYo I ain't got to say no more Son\nYo word to God man\nOnly thing I'm saying man, is use a Trojan\nKnowhatI'Msayin?  Fore real man\nCause it's on man\nYouknowhatI'msayin?  I had to learn that...", "[Ol' Dirty Bastard]\nLadies and gentlemen introducing Cab Calloway\nFeaturing the Dirt Dog\nFirst things first man you're fuckin with the worst\nI'll be stickin pins in your head like a fuckin nurse\nI'll attack any nigga who slack in his mack\nCome fully packed with the fat rugged stack\nThe heat is on, I'm about to blow up the spot\nAll I wanna see is fire cause I'm makin shit hot\nLike the blow between Glocks, mad niggas I shot\nGive a fuck on a cop, conversate with a lock\nDown at the chop-chop, 600th and Rock\nCrazy as a fox tryin to rob Fort Knox\nThe DeNiro-Al Pachino war\nTryin to score mad dough like a million or more\nFor the illegal war that's all I saw\nIt's all about that knot in ya\nI'm alone, I roll with 6 niggas with stones\nEvery hour tap my phone with embezzlement stones\nGet a loan from the stocks because of my pops\nFifty bills in the pocks, Wu-Gambino got props\n\n[Cab Calloway]\nBut Minnie had a heart as big as a whale\nHi-de-hi-de-hi-de-hi (Hi-de-hi-de-hi-de-hi)\nHoooooooooooooooooooooo (Hoooooooooooooooooooooo)\nHe-de-he-de-he-de-he (He-de-he-de-he-de-he)\nHeeeeeeeeeeeeeyyyyyyyyy (Heeeeeeeeeeeeeyyyyyyyyy)\n\n[Ol' Dirty Bastard]\nElevator scheme with the scheme to catch CREAM\nSome diamond rings, jewels all types of priceless things\nJust in case you don't make it to the safe\nDon't talk to Jakes or your whole shit be laced\nGot a bomb bout ready to blow up shit\nThe White House nuh be quiet as a mouse\nMy job is hundred proof, better know the scoop\nGot niggas undergrounds, in your walls, in your roofs\nAbout made zoo, 6-6-6-6-2\nCause I'm goin all out with the supplies of Balu\nI'm unstoppable, my six man team is unstoppable\nStickin my middle fuckin finger at you\nLivin in America's fuckin fucked up\nWhen I was young some say I had no sense\nI rhymed all day until my throat got tense\nAnd bought em by the cage from my lungs to my knees\nIn the winter I cough, all summer I sneeze\nAh-choo! Then I was sore, there was only one cure\nOriginal rhymes wholesome in thought\nDemocratics are debatin wanna be the imitatin\nBut the knowledge that I'm givin positively stimulatin\nI acknowledge any MC in a South Bronx town\nSouth Proof Projects, did they really go down\nShit, I remember when I was 12 years old\nI didn't know about frontin or playin a role\nI thought I was slick, I fell harder than bricks\nWith my best lyrics and my uptown ticks\nPrince start jackin in my baseball cap\nI'm tellin many chit-chats step off my jockstrap\nApproach this party other known as a jam\nLookin for my cousin Bam-Bam Sleepingham\nFrom front to back the jam was packed\nOver there some dance, over there I just macked\nI looked around then I started to walk\nHeard an older woman's voice and a silly slang talk\nThe kid was nice for payin the price\nAnd give weak MCs beneficial advice\nYes, beneficial meaning good for more\nFrontin cause with the mamas would have loved to explore\nStudied MC and changed lyrics around\nBefore I became a member of the lost and sound\nMy words I strung, I bettered my voice\nRollin over people known to be top choice\nCh-ch - BLAOW BLAOW BLAOW\nHoodlum\n\nHi-de-hi-de-hi-de-hi (Hi-de-hi-de-hi-de-hi)\nHo-de-ho-de-ho-de-ho (Ho-de-ho-de-ho-de-ho)\nHe-de-he-de-hee-de-heeee (He-de-he-de-hee-de-heeee)\nHooooohhhoooooooooooooooooooooooo (Hooooohhhoooooooooooooooooooooooo", "[Intro]\nWhy'd you won't let me love you?\nYeah\nHa-ha-ha-ha-ha-ha\nParty people all around the town\nIt's the ODB kid\nOnce again coming through your area\nAnd I'm going to tell you one time\nYou gon' love this\n\n[Verse 1]\nI'm the one-man army, Ason\nI never been tooken out, I keep MCs looking out\nI drop science like girls be dropping babies\nEnough to make a (nuh) go crazy\nIn the G-Building, taking all types of medicines\nCuz you thought you were better than\nAson, I keep planets in orbit\nWhile I be coming with deeper and more sh**\nEnough to make you break and shake your ***\nAs I create rhymes good as a Tastykake makes\nThis style, I'm mastered in\n(nuh) catching headaches, what? What? You need Aspirin?\nThis type of pain, you couldn't even kill with Midol\n(What?) 'round, get sprayed with Lysol\nIn your face like a can of mace, baby\nIs it burning? Well see? now you're learning\nHow I don't even like your  profile\nIt's like BLAOW! CH-CH-CH-CH, MAD STYLES!\nLast seen and heard, no-one knows\nYou forget: (nuh) be quiet as kept\nNow you know nothing\nBefore you knew a whole bloodclot lot\nYou don't wanna get shot\nA lot of MCs came to my showdown\nAnd watched me put you loooooooooooow down\nAs you can go, below zero\nWithout a doubt I never been tooken out\nBy a (nuh), who couldn't figure\nYo by a (nuh), who couldn't figure\nYo by a (nuh), who couldn't figure (Brooklyn Zoo)\nHow to pull a gun trigger\n\"GET OUTTA HERE!\"\n(Nuh) wanna get too close, to the utmost\nBut I got stacks that'll attack any wack host\nIntroducing - yo **** **** *****'* name\nMy Hip Hop drops on your head like rain\nAnd when it rains it pours, cause my rhymes hardcore\nThat's why I give you more of the raw\nTalent that I got will riz-ock the spot\nMCs I'll be burning, burning hot\nWhoa-hoa-hoa! Let me like slow up with the flow\nIf I move too quick, oh, you just won't know\nI'm homicidal when you enter the target\n(Nuh) get up, act like a pig trying to hog sh**\nSo I take yo *** out quick\nThe mics, I've had it my *****, you can suck my ****\nIf you wanna step to my mother******* rep\nCH-CH-BLOAW! BLOAW! BLOAW! Blown to death\nYou got shot cause you knock knock knock\n\"Who's there?\" Another mother******* hardrock\nSlacking on your macking cause raw's what you lack\nYou wanna react? Bring it on back\n\n[Hook]\nShame on you, when you step through to\nThe Ol' Dirty Bas****, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bas****, Brooklyn Zoo! Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bas****, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bas****, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bas****, Brooklyn Zoo!\nWHAT?\nShame on you, shame\nShame on you, when you step through to\nShame on you, when you step through to\nShame on you, when you step through to\nShame on you, when you step through to\nThe Ol' Dirty Bas****, Brooklyn Zoo!\nShame on you, when you step through to\nThe Ol' Dirty Bas****, Brooklyn Zoo!\nWHAT?", "[Intro: Ghostface Killah sample (Ol' Dirty Bastard)]\nNew York City stand up, Staten Island stand up\nNew York City stand up (don't you bother me, don't you bother me)\nNew York City stand up (old school style g.)\n\n[Ol' Dirty Bastard]\nYou nothin' but fallen stars, I see it on ya'll\nAppear bizarre, Ol' Dirty boulevard\nI've known global law, take his head Ceasar\nGot babies like caviar, growin' evening star\nGod bless the dead, 2Pac Shakur\nYou can't divide war, this slim galore\nArabian flow, at nine a gigolo\nWith a bad hot ho, only cocaine up the nose\nIncognito, defeat me, how so?\nRap K'd O, money green playin', go\nLong ago, Protect Ya Neck video\nMade me blow, on rap radio (Wu, Wu)\n\n[Hook 2X: Ghostface Killah sample]\nStaten Island stand up, New York City stand up\nNew York City stand up, New York City stand up\n\n[Hook 2X]\n\"For the ladies who know me, tell me how the fuck I be\" ODB\n\"Dirty...\" - Kelis\n\n[Cappadonna]\nBrooooklyyyyyyyyyyn Zu, came through with the baby blue\nMe and my brother Dirt Dog\nMama made breakfast today, with no hog\nWe hustle in the street, niggas ain't fuckin' with Wu, so roll deep\nBorn God Body with the vest of heat\nWhen the Bee Sting hit, niggas move they feet\nYo, we banned from the club, you best to not sleep\nKeep somethin' on the waves, thug passion with the Alize's\nSmack 85 percenters, right in they face\nOn some black pimpin' shit, like my dun-dun Huey\nGod Squad in the building, big bags of ooey\nPush the phat shit like Dutch Tsasui\nRZA bring all the shit, fuck these clowns\nAson Unique, yeah baby, hold me down\nOriginal tag team, S.I. City\nAin't nothin' sweet kid, ain't nothin' pretty\nWu-Tang Forever, kid, keep it gritty\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nCall me Osirus, lyrical virus\nOl' school fire, straight from lockdown\nWu-Tang veteran, straight from lockdown\nO.D.B., now with Roc now\n\n[Hook 2X]\n\n[Outro: Ol' Dirty Bastard]\nOh baby, dedicated to all the pretty girls\nAll the pretty girls in the world, and the ugly girls too\nCuz to me you pretty anyway, baby", "[Intro: Ol' Dirty Bastard]\nDirt, Dirt, Dirt...\nDirt, Dirt, Dirt...\nThat's what I'm talking about\n\n[Ol' Dirty Bastard]\nSoon as she slurp the mic, here comes the herpes light\nPeople at church be like, friends, at work be like\nShe is the thirsty type, a nigga McGirt be like\nLook, it ain't workin' right, it will convert my life\nNow she's an earthly type, pure, and worthy type\nCatch her in early nights, smile with pearly whites\nSippin' Bacardi's like, she's back in perverted life\nYou know how these birds be like, that's why you can't treat them right\nMy brother he eats it right, cheat, and beat his wife\nIke and Tina fight, this Medina life\nThe crack and nina like, block and fiending like\nCop subpeona like, giants and beams of light\n\n[Hook: RZA (Ol' Dirty Bastard)]\nStomp, stomp, stomp! (Dirt, Dirt, Dirt, that's what I'm talking 'bout)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp!\n\n[Ol' Dirty Bastard]\nThings ain't the same today, this is the game they play\nDirt, the name, they say, throwin' the blame my way\nSo they can change my face, take and claim my space\nBut I remain the ace, always maintain a space\nCoke, the 'caine, the base, Henny without the chase\nThen it come out to lace, pussy all in my face\nYou know where the Dirt be at, where the skirts be at\nMoney and work be at, pull and squirt the mac's\nYou fake aristocats, where your pistol at?\nWeak ballistic caps, I'm firing missiles back\n\n[Hook: RZA (Ol' Dirty Bastard)]\n(That's what I'm talking 'bout)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp! (Dirt, dirt, dirt)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp!\n\n[Ol' Dirty Bastard]\nThree years, I'm out the gate, waiting, my clients deflate\n(What, what) chain plate, bitch, I'm goin' state to state\nBitch, I sniff them eights, muthafucka, make these papes\nWatch that ho get raped, nigga, I'm going ape\nThis is part two, the Stomp, you niggas in the slump\nUzi's all in my trunk, nigga, you hear the thump\nFill you with holes and lumps, rocks all in my fronts\nCock and feel the Monk, pussy everyday of the month\nDo what the fuck I want, bitches, you shake your rump\nNiggas you ain't no comp, let me see you jump\n\n[Hook: RZA (Ol' Dirty Bastard)]\nStomp, stomp, stomp! (Dirt, Dirt, Dirt, that's what I'm talking 'bout)\nLet, me, see/(Dirt, Dirt, Dirt), you, stomp, stomp, stomp!\n(Dirt, Dirt, Dirt, McGirt) get, the, fuck, off, your, ass, nig-ga!\nStomp, stomp, stomp! (That's what I'm talkin' bout!)\nLet, me, see, you, stomp, stomp, stomp!\nGet, the, fuck, off, your, ass, nig-ga!\nStomp, stomp, stomp!", "[Hook: Ol' Dirty Bastard, RZA]\nWhen you get that skrilla, nigga, act familiar\nWhen you get that skrilla, nigga, act familiar\n\n[Ol' Dirty Bastard]\nWhen you get that skrilla, nigga, act familiar\nOwn family will kill ya, damn it be a skrilla\nBox of bullets in flavors, like Mike & Ike\nFriday night, I'm in the bed, with a bitch and a dyke\nOl' Dirty, 7:30, got the thirty-thirty\nCaught a mouscope, ain't aimin' at no birdie\nMy name plate, travel through the interstate\nGlock in the stash box, my drop top ventilate\nPermanent A.C., use to boost at Macy's\nSmoke out Mr. Spacely, and still Dick Tracy\nI blind dunk a base, make ya chest inflate\nI'm at the herb gate, watch my money bake\nDisrespect me, where I lay my head, my hammer spray\nMy cybertech nylon suit, reflect gamma ray\nWhen I speak, ears open to the size of cymbal\nMake you tremble, watch what the fuck my gun do\n\n[Hook]\n\n[Ol' Dirty Bastard]\nA moment to pray, a second to die\nTake your hard ride with the bulletproof high\nNigga, check ya logic, Ol' Dirty's out the closet\nI return you niggas for a five percent deposit\nBeer belly, I chuckle like Kris Kringle\nPut four grams of cocaine, crushed up in the single\nEveryday is Saturday, everyday my gats play\nWhen shit get bad, I'm looking for a badder way\nOl' Dirt McGirt, in concert the bomb burst\nTo set it off, shoot him in the arm, first\nLet him off? Nah, kidnap his mom, first\nTold you, when things get worst, nigga, things get worst\nCats be saddling, when the gats splattering\nOl' Dirt, caught one through the lower abdomen\nStraight through the back, like the javelin\nWord, son, it had to been, still here, battling\n\n[Hook 2X]", "[Intro: Ol' Dirty Bastard]\nWhy ya'll always be talkin' shit (I'm comin')\nYou're always talkin' shit (want me I'm come? We coming)\nWhy ya'll always be talkin' shit (I'm comin')\nYou're always talkin' shit (want me I'm come? We coming)\nShit (we coming, we coming!)\n\n[Ol' Dirty Bastard]\nI'm the nigga walkin' through the Hill, with the gun out\nLookin' for the big mouth, showin' off in front of bitches\nTalk about Dirt, leave you lumped up in stitches\nDig a lotta ditches, for you six feet spitters\nPut the barrel in ya mouth, I'm the shell case shitter\nMasquerade paid, stay on the front page\nPlayin' on streets, like streets was arcade\nMy hand's all sprayed, like Charles blades the gensu\nFeel the lucy, and spark up the neptune\nResurrect them, to dawn on, protect 'em\nOutside set up, guess who inject them\nWalk through zoo, but no Zu, is Brooklyn\nHeavy artillery, thug chains in Brooklyn\nStrapped in the back of the Ac', Dirty rolls like that\nThat's a Crooklyn fact, find Dirty\nAnd you find where the cash is at, fuck y'all\n\n[Hook 2X: Ol' Dirty Bastard]\nWhy ya'll always be talkin' shit (fuck y'all)\nEverytime I hear you talkin' shit (fuck y'all)\nAnd anytime I hear you talkin' shit\nWill be the last thing that you be talkin', shit (fuck y'all)\n\n[Ol' Dirty Bastard]\nSpit fire like a livewire, the messiah\nTake you higher than the last hit, mythological\nIn pussy logic, gynecolagist you can swallow\nCuz it' O.D.B., bitch!\nBring it like the Warriors, on the D Train\nExplosive rap game, like a Meth thing\nSpit acid, the Ol' Dirty Bastard\nPull like coast, to toast it, while I'm acid\nTen stories up, penthouse, only us\nMeanwhile I'mma strain, what I can't crush\nFresh, wild and bold like the Cold Crush\nPurple haze keep a nigga with the robut (fuck y'all)\nOn the major when the bitch slap, giddy up\nI'm an ass man, but I tear the titty up\nTear ya whole city up, bring it if you grittier\nDirty ain't so pretty, even when the legs are levetated\nEscalated, cuz I'm made of Baby Jesus\nWelfare card expired, so I need this\nDirty rolls like that, that's a hood fact\nFind Dirty and you'll find where the cash at\n\n[Hook 5X]", "Dirty?\n\nPhil Collins\nOl' Dirty\nYeah, Su-su-ssudio\nSudioo\n\n[Ol' Dirty Bastard]\nThis recording is dirty and a-stinkin'\nFunkier than Pepé Le Pew\nSo I was thinkin' about droppin' this single on the charts\nLetting you know \"Hey! The kid has heart\"\nI never deny myself as being dope\nBut in my last jam, niggas slept on my notes\nYou thought that I was weak\nUhh, let me speak\nMy rhymes come funkier than your grandpa was weak\nSo listen, mister, don't you ever forget\nThe rhyme are dirty, you couldn't clean it with Comet\nOr even Morax, some try Ajax\nOnly mix with the best, 48 tracks\nYo, I get down with Ason sound\nLyrics that be flowing from miiiiiles around\nSo let the music shut ya ass up\nAnd feel the uppercut that would make you fall to your butt\nWhat!\n\nChorus:\n\n[Female singer]\nIf he calls me, I'll be there\nI'll come running anywhere\nHe's all I need all my life\nFeels so good if I just say the word\nSu-Su-ssudio\nJust say the word, oooh\nSu-Su-ssudio\nUh ohh\n\n[Ol' Dirty Bastard]\nLet me continue verse number two\nStyle is wild, Dirty stinkin' like doo-doo\nIf you're hangin' around, you change your mind\nIf it's a bad influence, but yo it's my rhyme (my rhyme)\nI sit down and I say to myself\nSell, yo, or you on the top, shelf\nI drop this single for you to get a dose of\nAs I lay back like a pillow on a sofa\nGettin paid? Yeah, right, fully\nMy ass can be G one one one\nYou know me\nMy rhyme is sugar\nSweet as a honey bee\nTastes like a 40\nStinkin' like OE, yeah\nWell I drink Old English\nSo I speak Old English\nIf not, I'd be dirty and stinking\nAnd if not, well I guess I'm not\nThe A-S-O-N, my friend\nYou wouldn't understand\n\nChorus:\n\n[Female singer]\nIf he calls me, I'll be there\nI'll come running, anywhere\nHe's all I need, all my life\nFeels so good if I just say the word\nSu-Su-ssudio\nJust say the word, oooh\nSu-Su-ssudio\nUh ohh\n\nIf he calls me, I'll be there\nI'll come running, anywhere\nHe's all I need, all my life\nFeels so good if I just say the word\nSu-Su-ssudio\nJust say the word, oooh\nSu-Su-ssudio\nUh ohh\n\nIf he calls me, I'll be there\nI'll come running, anywhere\nHe's all I need, all my life\nBaby\nSu-Su-su-ssudio", "[Intro: Ol' Dirty Bastard]\nYo East New York in this motherfucker, Blahzay Blah in this motherfucker\nBrooklyn in this motherfucker, Dirt Dog in this motherfucker, it's on point\n\n[Hook: Ol' Dirty Bastard]\nCome on baby let me you jump, let me see you body rhythm pump\nCome on baby let me see you go, let me see you, like go, go, go\n\n[Blah Bloomberg]\nAiyo, my timin' is so precise, gangsta all my life\nI don't get robbed, I control the heist\nCold as ice, still nothing, this whole device\nLife's a gamble, so I roll the dice\nI camed up, still I'm up and coming\nAuto start, put on my sneaks, truck is running\nBad broads, that's beyond Beyonce\nEatin' on my body like a dinner entree\nWhat ya'll critics gonna say, don't even risk it\nForget Pillsbury, eat this Blah Blah biscuit\nYa'll watered down the game, man, like bar liquor\nIt's nothin' for me, I just buy the bar quicker\nOh my God, nigga, I'm in the house, and I'm rowdy\nHe been doin' this since five thousand on an Audi\nRemember \"Danger!\" Yo, ya'll know Blah\nThis is grown under water, ya'll ain't even in my sonar\n\n[Hook: Blah Bloomberg (Ol' Dirty Bastard sample)]\nThe east is in the house like (danger)\nAbout to, turn it out like \"Oh My God\" (danger)\nPut the barrel in your mouth like (danger)\nI see the dipper through a blouse, it's \"Oh My God\" (danger)\nMe and Dirty on the floor like (danger)\nMe and Dirty pimpin' ho's like \"Oh My God\"\n\n[Ol' Dirty Bastard]\nSo then you act like you love my little baby\nAnd you know that I act a little crazy\n\n[Hook]\n\n[Ol' Dirty Bastard]\nI'm on the streets lingo, spendin' the spingo\nEazy-E lingo, doin' the dango, the vet' don't wear Kangol\nI dare pump my shit, at the club, actin' strange, yo\nSmack ya'll niggas in the face, yo\nGot wiggas in the place, yo, block party in this motherfucker\nI'm the only round actin' like sucka, sucka bitch ass pucker\nSo don't play this motherfucker, or watch you bird clucker\nSo don't let yourself break yourself\nWith the sip and tumble, that will take yourself\nI move with that heat that smoke you in your head, man\nThe shit war, time to take, man, take man\n\n[Hook]\n\n[Hook]\n\n[Blah Bloomberg]\nEast/West beef is over, gettin' money all over\nSet up shop in Cali, then one in deli Dover\nMusic, or sellin' crack by the Grove\nI ain't talkin' about dick, but I'mma stock it to hoes\nI'm not gonna grow, I'm the type to explode\nHit this song to walk back in it, then it's gon' be white gold\nEatin' wild timing, ya'll know it's my title\nI burn more bushes than Moses in the Bible\nBut hates gon' Holly, pimpin's gon' Broadway\nSo many pimps, broads don't know who to pay\nBut ya'll better have my dough\nCome on baby, just go go go\nYo, I once was lost, but now I flaunt\n2004 Porsche, all you haters get off\nI will board-to-the-board, the-hang-the-hang\nDown to the ground, to the ground, they bang, they bang\n\n[Hook]\n\n[Hook]", "[Intro: E-Snaps]\nAww, man, yeah, Lenox Ave. Boyz\nAww, man, come on, yea, yeah, yo\n\n[E-Snaps]\nYou doin' what you doin', let's get it\nStarvin' and you robbin', and you catch a nigga slippin', best get 'em\nHit 'em where the good Lord split him\nIntroduce myself, go booth yourself\nIn the far left lane, and I'm, hydro planed\nAnd I'm, slingin' my 'caine, don't care how you feel\nCheckin' out the truck, check the wheels\nWanna get fucked, bitch kneel, let me splash in your grill\nWho but me? Muthafuckin' right, get it right\nPapi of this motherfuckin' thing, truck tight\nRollin' with my niggas, we ain't lookin' for no fights\nNow pop one in your head, that's all she said\nIt's time to get head in my Mercedes-Benz\nChipped up and I ain't even talkin' bout my jams\nClipped up, so any nigga frontin', gettin' banned\nGive 'em all ten in his chin, I'm all in\n\n[Hook 4X: Meeno]\nMove back, move back, you can't fuck with me, huh\nI'm from the clique called N.I.B\n\n[Meeno]\nNext up, I believe that's me\nMeeno, get it right, no descrempancy\nAlways keep a weapon, see, run it ground\nWorth of stones, nothin' less on me, why you stress on me\nNiggas mad cause I stretch my D., ya'll dudes want my recipe?\nHere's what ya'll do, hit the lab, write an album or two\nThen I might let you sign my shoe, that's just how I do\nEverybody sayin', boy too souped up\nNah, I'm just hot, plus Bentley Coup'd up\nWho put, you too busy holdin' the stoupe up\nYa'll fault your broke, and not mine, stupe'a\nI'm like Juve', I need it in my life\nGot fifty birds flyin' in, later on tonight\nRock and I hustle, so I get paid twice\nLife is a gamble boy, roll your dice\n\n[Hook 4X]\n\n[Tony Wink]\nWho you know spit flows, get dough like I\nIn the L.A.B.'s, motherfucker, no lie\nHit the links I've seen, back in late '95\nHad to wait for two nine, rockin' and clickin' on both sides\nOf course we gon' ride, ride over the competition\nThe real has arrived, ya'll bitch niggas is finished\nAll I gotta do is Nextel tag my lieutenant\nYour whole click will get toe tagged tagged in two minutes\nThis to them fools thinkin' they gon' catch the God slippin'\nI'm always on point and I'm always packin' my weapon\nYou see me in the club, believe me, I got the tech in\nI slipped the DJ a guard, you slipped it in with the records\nEither you love it or hate it, but bet you gon' respect it\nRainbow glow, when the lights hit off the necklace\nI'm what you can't be, young, black, rich, and wreckless\nIt's the god free, and L.A.B.'s, one two, check it\n\n[Hook 2X]\n\n[Interlude: Jae Millz]\nRemix! Huh, yeah, it's 101, what?\nYou know what it is when you hear that, Harlem\nFix ya face or smacked in it, Harlem\nHarlem, right here, Harlem\nYou gon' stupid if you don't bounce to this man\nYou gonna only look like a hater, huh-huh\nLenox Ave. Boyz, what up, it's only right\nThey know what it is, man, remix\n\n[Jae Millz]\nMove back, its no touchin' me, I'm from that place called NYC\nH Dub to the death, and I don't give a fuck what party it is\nI'm still in the club wearin' sweats (hah)\nMilk ears with the money colored check\nIll two step, blowin' dubs with the best\nLive life, most hated, with my Lenox Ave. Boyz\nRemix, Move Back, with Grease providing all the noise\nHuh, your home boy game so raw\nAnd I ain't even gotta say my name no more\nHaters wanna give my name to the law\nBut punchin' and kickin', to kick us all, they can blame you for\nMight catch me in the 'Lac with Snaps\nOr lightin' sticky green 'dro, with Wink and Meeno\nYou from the hood and you ain't no coward, well me neither\nAnd before you step on my sneaker, I really think you need to (move back, move\nBack)\n\n[Drag-On]\nThis your boy to the dash\nSame nigga, no talkin', just result to the mass\nI stab niggas, throw the hawk in the trash\nPeroxide my bullets, give the burners a bath\nThree fifty Z, burnin' the Ave\nI'm old school, I still got the fiends burnin' the glass\nI pull the pump off my waist, and dumb in your face\nI'm a little bit too hard for the radios to play\nI still can spit eighty miles an hour in a verse\nAnd my Coupe go eighty miles an hour in reverse\nI let my tool go, ya'll niggas just studio killas\nNigga, I'mma killa in the studio\nI got guns that'll hollow a wall\nPoint it to your jaw, make you swallow it all\nYa'll niggas want hardcore?\nWhat the fuck you think the R, and Full Surface and D-Block is for?\n\n[Cardan]\nThey ask, who's that, that's P-Cardi\nAnd what he in, what he in, he in a Fer-rari\nYou know I'm strapped, you know I'm strapped, I got the heat on me\nAnd what I'm wearin', and what I'm wearin', a long Bigari\nThinkin' I'm Joe Clark, nigga, try to 'lean on me'\nBut if he is, like Biggie said, 'he gon' bleed'\nNiggas ain't hard, niggas heart full of creatine\nBut go against that, green, I go against your, brain\nAnd don't fuck with me and the kid, I've been a daddy all my life\nNo 'dro, we gon' blow that alley all day, say what\nAct stupid, we gon' it crackin' here tonight\nGreasin', Meen' on the front, with Snappy on my right\nIf rap don't work, nigga, we go to the kitchen\nThose ain't hoes, so then you know we ain't pimpin'\nI'm on, my toes, so nigga, no, I ain't slippin'\nToo close, hold somethin', or now I know Cardy didn't\n\n[Terra Blacks]\nAnd if he know, what keep me little\nThink you know, I think it later\nSee me, and my guns come to, just like a waiter\nYou up north, singin' just like Anita Baker\nMake up your mind, then come and ready, feen to meet your maker\nThe man that laugh last, will surely laugh harder\nMe have a gonna shut up and eat bars, and all of the prankster\nWith them and I for black gangster (huh, I'm from the clique called N.I.B.)\n\n[Ol' Dirty Bastard]\nBut drunk, when he hop inside, in the club gettin' tired\nBitches scatter all around me, ready to excite it\nAll these kittens got me flea bitten, eatin' out my mitten\nI'm comin' off top, my moves are unwritten\nNow slitter to the snake, in the spring time wither\nBut strong on my own, Wu-Tang, I'm forever\nWomen desirin', jobs is hiring\nMoney admiring, never keep tiring\nRhymin' ain't nothin', the easiest job ever\nAnd I'm doing mine, holdin' it together\nWhile money quadruple, from playin' the cripple\nDrinkin' from a titty nipple, sippin' on ripple\nBlunt keep on flippin', from keep gettin' dippin'\nThe mic I'm rippin', the record skippin'\nThe pussy drippin', the wet got me slippin'\nThe bitch I'm strippin', I'm platinum shippin'\n\n[Hook 4X]", "[Intro]\nI just want all y'all to know, the reason why I curse\nBecause of my momma and my daddy; they grew up cursin'\nSo please respect my style, please!\n\n[Ol' Dirty Bastard]\nI'll grab the mic and now I damage you, cuts your whole stamina\nHere comes the medical examiner\nOne verse then you're out for the count\nBring the ammonia make sure he sniffs the right amount\nWake you up and then I axe you\nHow did you intend this --\nCompetition to get an ass kickin' so tremendous\nOh!, you shouldn't bother this\nLeave me alone like a son, he'll be fatherless!\nI got the asiatic flow mixed with disco\nRoll up on the scene like the Count of Monte Crisco\nAnd MC's start to vanish\nI rolled up into jet, black kid the nigga started speakin' spanish!\nYo!, he wasn't from Panama\nI axed you how you get so fuckin', dark, you said\n\"suntanama!\"\nHe'll be responded so fast, you made me laugh\nHa-ha-ha, HARARRRH scared his ass\nKick the hundred strongest rhymes\nThen I brought out the punk in him\nCaught him with a strong five deadly venom\nTold him!, enter the Wu-Tang\nWitness the Shaolin slang, that'll crush any shit you brang\nI watch your ass take a big fall, why?!\nMy Main Source, is like a friendly game of stickball\nAnd as you step up to batman, I play you the riddler\nYou try to jew me for a rhyme nigga, I'll change to Hitler\nI go out like a Nazi, wish your fuckin' ass stayed, home and played (Yahtzee!)\nOr watchin' Happy Days sweatin' Poxie\nWith Ralphie and Richie Cunningham, Joni and Chachi\nWu, who? Me gettin wreck talk to him\nHe's like a twelve and a half foot, gettin' in a seven shoe\nNow picture that with a Minolta\nI have your ass doin' some Night Fever shit like John Travolta\nI come strong I make knowledge born, I flip the script\nAnd rock on from P.M. , past the fucking Dawn\nPass the Hammer you're broke down, niggas grab my what what\nYou can't understand it, here's the panorama\nA complete view, of how I defeat you\nShoulda stepped to those god damn kids who tried to beat you\nYeah I bust that ass before\nYou ran to Texas and came back but forgot the chainsaw!\nAnd wanna perform a massacre\nBetter be coming with some motherfucking shit that's spectacular\nI bust y'all..", "[Chorus: Buddha Monk]\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\n\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\n\n\n[Post-Chorus: Ol' Dirty Bastard]\nCome on, baby, let me hear you jump\nCome on, baby, let me see you stomp\nCome on, baby, let your body go\nCome on, baby, let it flow, flow, flow\n\nCome on, baby, let me hear you jump\nCome on, baby, let me see you stomp\nCome on, baby, let your body go\nCome on, baby, let it flow, flow, flow\n\n[Verse 1: Ol' Dirty Bastard]\nThe most amazing, rhyme blazing, smoke that purple haze and\nI'm the Ol' Dirt McGazing\nAfter the club, I'm straight up dazing\nI fuck til my nuts shiver up like raisins\nEverybody just, do my dance\nWhile your girl, she feel my dick through her pants\nI'm the Ol' rotten slang, that Wu-Tang mixture\nLeave your head to bang, boom bang licked up\nWatch the speaker kick up, bitch eat my dick up\nAss stick up, I'mma hit her quicker\nNever find a nigga nasty as Dirty\nStill fuck a bitch if her ass is dirty\nStill sip the Hennessey if the glass is dirty\nYou ain't getting shit if your cash ain't dirty\n\n[Chorus: Buddha Monk]\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\n\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\n\n\n[Post-Chorus: Ol' Dirty Bastard]\nCome on, baby, let me hear you jump\nCome on, baby, let me see you stomp\nCome on, baby, let your body go\nCome on, baby, let it flow, flow, flow\n\nCome on, baby, let me hear you jump\nCome on, baby, let me see you stomp\nCome on, baby, let your body go\nCome on, baby, let it flow, flow, flow\n\n[Verse 2: Young Dirty Bastard]\nHit a ho, make her go crazy\nDoctor, doctor, she having a baby\n(Girl: oh, no, who could it be?)\nOut is the son of the ODB\nMy name is Bar, I'm made like a Maybach car\n(Girl: you crazy) What you say that for?\nBar slick with the gift of gab, I throw jabs\n(Girl: tell the cop, boy, get your black butt in the lab)\nStill got a slab of that welfare cheese\nStill get features from government G's\nStill looking for a big butt to squeeze\nOl' Dirt, are you gonna give Lil' Dirt a G?\n\n[Chorus: Buddha Monk]\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\n\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\nDirts the boogie, Dirts the boogie\n\n\n[Post-Chorus: Ol' Dirty Bastard]\nCome on, baby, let me hear you jump\nCome on, baby, let me see you stomp\nCome on, baby, let your body go\nCome on, baby, let it flow, flow, flow\n\nCome on, baby, let me hear you jump\nCome on, baby, let me see you stomp\nCome on, baby, let your body go\nCome on, baby, let it flow, flow, flow", "[Intro: Ol' Dirty Bastard]\n\"It's the Ol' Dirty Bastard\" - scratched up throughout\nHold on, muthfuckas, ya'll know Dirty?\n\n[Ol' Dirty Bastard]\nIt's the Ol' Dirty Bast'\nCut ya face, with a piece of old dirty glass\nBitch, shake ya dirty ass\nRun up in your stash house, on a dirty mat\nIt's the Dirt McGirt, a/k/a Osirus\nSpread my bullets around like a virus\nNigga, from the Wu-Camp, nigga\nSlap ya face with a wet food stamp, nigga\nI'mma make the world, do my dance\nTry to lock me down, but I'm back in my stance\nWave my gun around, like it's part of my hand\nBout to take this game, like, 'pardon me, man'\nDirt McGirt, I'm a family man\nBut I still hold tools like a handyman\nSay my name three times like Candyman\nIt's the what, what, what...\n\n[Hook: Swizz Beatz (N.O.R.E.) w/ Ol' Dirty Bastard acting wild]\nCuz we can do it like this\n(Yo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt)\nCuz we can do it like this\n(Yo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt)\nCuz we can do it like this\n\n[N.O.R.E.]\nWho get drunker than, N.O.R.E., on a Sunday\nAnd on the way to Sunday school, intoxicated\nSee ah, lord forgive me, I'm a ex-coke flipper\nAnd skipped on that good ol' bitch, she got a strip of these\nNiggas is bitch-made, I got a switchblade\nAnd I pack guns, shootin' niggas since the sixth grade\nMac Milli, Millitainment, it's La Familia, now\nGuess it's niggas all in your rap, ain't gotta kill you now\nNore never slack off, I smoke a pack soft\nAnd I run deep in this bitch, and let that mack off\nBing, Nore got a whole lotta bitches\nOut of character, and eating out a whole lotta dishes\nIn my lifetime, sippin' on white wine, caveza\nNore ran twiz, get a whole lotta head\nChing, simple like uno, dos, tres, ah'\nAnd I leave the crib, and grab the tech, cuz I'm the drastic\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nOh shit! Oh shit!\nYa'll remember when me and Mariah\nI'm back with the kid, spit fire\nDirt McGirt, I break up the earth\nMy ice is white and blue, like Papa Smurf\nStash niggas like crack, throw them under the earth\nThen past the dirt pound, and ask 'em \"do it hurt, now?\"\nYa'll gonna make me back the truck\nTo the Dash, O.D.B., that's what's up\n\n[Hook]\n\n[Outro: Swizz Beatz]\nCuz we can do it like this", "[Ol' Dirty Bastard]\nYo, stepping fresh out the clean, through the fog\nI be that Ol' stinkin' Dirt McGirt dog, with a hurtin' for ya\nThat nigga liftin' ya skirt, learned it in the dark\nHurtin' bitches feelings on purpose, I'm a dog\nBiting, no -- I don't bite, see\nI just like to nibble on ya nipple, a little\nIt's not a riddle, or game, with dope\nI just wanna stroke or poke, you in the right place\nAs if your pussy got a nice face\nYou need to stop fucking with lightweights\nSee my Roc chain is heavy, cock game, is ready\nTo shoot, oh bitch, go get cute\nCuz you can easily get treated like a prostitute\nPlease believe me, I like it raw, because I'm so freaky\nDirty, but a nigga still shining when you see me\nYou know that nigga, A, Son\nNever been tooken out, Dame, good looking out\nHoes holla!\n\n[Hook: Rhymefest (girl) {Ol' Dirty Bastard}]\nI'mma keep it real, don't hurt me\nA nigga like me, love the ill punani, cuz I'm dirty\nPlease don't flirt with the Dirt McGirt\nWhen I'm done, liftin' ya skirt, then this mic get hurt, u know\n(Don't hurt me, Dirty) {Okay}\n(I promise, I won't you, Dirty) {You sure?}\n(Don't hurt me, again) {Okay} (Don't, don't, don't hurt me again)\n\n[Ol' Dirty Bastard]\nAiyo, my album gets crazy, but I'm still on the low\nYour style is flashy, and you don't got no hoes\nDon't front, I spit classics, you know how it go\nOn my leisure, Lisa give me so much throat\nWell I need ya, bitch, betta have my dough\nAnd Indonesia, in the Dutch, already rolled\nDon't let 'em fool ya, tell you, Ol' Dirty's a joke\nSomebody school her, tell her Ol' Dirty's a pro\nFirst it's marriage.... then it's babies....\nYou know, Dirt love the babies.... (aiyo, bounce with me now)\nIt's game time, baby, ball with me now, I'm in your court, now\nIn your grand marquee, on tour with me now\nWith the Benz, laid back, in the hood with me now\nMomma said she wanna go with me, cuz I make her feel good\nWhen she go away with me, Ol' Dirty, nigga!\n\n[Hook]\n\n[Outro: Ol' Dirty Bastard (girl)]\n(Don't hurt me, again, don't, don't, don't hurt me again)\nYeah, I'm back, what you thought?\n(Don't hurt me, again, don't, don't, don't hurt me again)\nShake ya ass to this!", "[Intro: Ol' Dirty Bastard (girl)]\nOh yeah...\nWhat what, got your money\nWhat what, (dirty), what what\nWhat what, (dirty), yeah, yeah\n\n[Ol' Dirty Bastard]\nMy niggas better raise it up, fruit punch in my cup, so what?\nOl' Dirty, I served my time, now I'm out and gonna have a good time\nMy new account is kinda different, cuz I'm 'ready spendin' all my dimes\nWhat what, give me a check for 9, zero, zero, zero, zero\nCount count 'em, muthafucka, this mine\nNow, I just better finish my rhyme\nBefore my muthafuck' appeal come, what the fucking due line\n\n[Hook: Ol' Dirty Bastard]\nNo, sip-ping, alco-hol, at all (no way)\nNo, smo-king, Phil-ly, blunts, or Backwoods (no way)\nNo, lea-ving, the state, of New York (stay home)\nIt's, all good, long as I can, still feel some breasts\n\n[Hook 2X: girl (Ol' Dirty Bastard)]\n(And how ya feeling, Dirty?) I feel good!\n(I'm glad you are) Yeah, me too!\n(I wanna love you, Dirty) I wanna love you back!\n(Can I get a..) baby, just, baby just, wiggle that booty!\n\n[Bridge: girl]\nAhhhhh, a wiggle-wiggle, a wiggle-wiggle\nDirty...\n\n[Ol' Dirty Bastard]\nI never will forget the way\nDame Dash, send a limo for me\n(What what), signed me up for the team\nVH1, caught me doing my thing\nI had bitches in the limo actin' like they fucking rolling with king\nShopping sprees on Fifth Ave., backrubs, bubble baths\nOl' Dirty fucked, come, clean my ass\nNow I'm straight, gotta spit for my chips\nWith nothing in my system that would get me incarcerated\n\n[Hook]\n\n[Bridge 2X]\n\n[Hook 2X]\n\n[Bridge 2X]\n\n[Interlude: Ol' Dirty Bastard]\nSing this song\nDirt, Dirt, Dirt, Dirt McGirt, Girt, Girt, Girt\nStraight from Wu, Wu who?, Wu who? Wu who?, ahh\nDirt, Dirt, Dirt, Dirt McGirt, Girt, Girt, Girt\nStraight from Wu, Wu who?, Wu who? Wu who?, ahh\nDirt, Dirt, Dirt, Dirt McGirt, Girt, Girt, Girt\nStraight from Wu, Wu who?, Wu who? Wu who?, ahh\n\n[Bridge]", "[Intro: Chops]\nYou listening to a Chops production\nAnd MB's the click, ODB, Dirt McGirt, tell 'em\n\n[Ol' Dirty Bastard]\nYeah, roof is on fire, bitch, put it out\nOut of control, flames spinnin' out\nWhen you get real deep, dig it out\nWhen you rollin' up the L, pig it out\nPop the cork, respect, pour it out\nWhite Horse in the house, roll it out\nIf it's goods on the wood, throw 'em out\nI'll be there, pop, you can dig it out\n\n[Hook: Ol' Dirty Bastard]\nDirt Dog, want the red rug, roll it out\nYou saw the grip, and I ain't ashamed to pull it out\nMy fault, cuz you said you gonna bring it out\nAnd you know it ain't comin', til I'm singin' out\nOh, don't stop ma, got my legs shakin' here, don't stop ma\nYou'se a real freak girl, gotta give you props\nCuz I feel the bam bam when my bed rock\n\n[Ol' Dirty Bastard]\nRollin' on your stair, bitch, pick her out\nOut of control, and can't slut her out\nBig girls, you can get it, no doubt\nYou jumpin' off, with the pretty little mouth\nDon't expect to trip down south\nUh-uh, and relay in my baby mama house\nLet's fuck, girl, time's running out\nMama be home at five, on the dot\n\n[Hook]\n\n[Ol' Dirty Bastard]\nFuckin' up my party, bitch, throw 'em out\nOut of control, my name, wide 'em out\nFill the arenas, the Roc, sell 'em out\nGet mad shit on the curb, and pout\nWhen I left the Billboards, what drought\nSerious thought, for those who wanna doubt\nMove with felony niggas, that just came out\nAnd thunders that be spittin' in heavy, like four pounds\n\n[Hook]", "[Intro]\nGive it to ya raw!\nYo, it's that old school shit\nAbout 12 years old\n\n[Verse 1]\nLet's get physical, operate your brain to function\nI remember the Gods at the junction\nConjunction junction what's your function?\nI summed it up as the Ason 'sumption\nKnown on the microphone as Crazy Crucial\nDipping low on an MC like you and doing you\nSomething, so step to the shit right now\nKicking on everything in my god damn town\nDoing expression, a jam it to deadly\nDaredevil doing, 'cause I am the U-N\nI-Q-U-E funky fresh\nFunky do he get hype?\nYou're motherfucking right I do\nAson, break it down sure anytime\nA serious outstanding never end it clever in the rhyme\nBreak down your shit, wherever you come\nThere's no one who can fuck with Ason\nI paralyze you make you realize who\nLost concern with my god damn crew\nQuiet as kept when I start any fuckin riots\nEven before you do in my nigga? Don't try it!\nFor you to get close enough to my style\nYou have to travel miles and miles and miles\nTo find a special rhyme like mines, you gotta look\nAt what you find in the Brooklyn Zoo\nRaw exit, killing the beat with all your might\nYou love a hip hop song baby, I don't wanna be right\nWake up, what, what, losing  your head\nWoke up on the wrong side of the bed\nJuvenile faction of hard, you say you're living large\nYou're the head nigga in charge\n\n[Chorus]\nI give it to ya raw!\nI said I give it to ya raaaawww!!\nI'm Ason baby, I'm the Ason baby\nI'm Ason baby, I'm the Ason\nI'm Ason baby, I'm the Ason\nGivin it to ya raw baby\nThe raw deal, because\n\n[Verse 2]\nThese lovely rhymes made by the one and only\nI'm Ason, there's nothing phony about me\nSteady of course so hard to handle whip it\nLike a specialist I write my own music\nNow I make ya dance, get drunk or act wild\nBaby saying \"Hey hey I love your style\"\nWhether you're sober, known just to holder, Casanova\nGet chopped with the lawn mower\nSo get busy as Ason perform\nOn and on ladies scream my name Ason\nThat means the Ason girls fanatic\nRepeat it so much you get a throat infection\nYo I relieve the ones who believe\nYou're in the need of the God degree\nThat I build on with style and finesse\nKeep MCs in check like a game of chess\nSo to the folks, come to my rehearsals\nI look so good I should be on the commercials\nOn TV that tell original lie\nOf the Ason most high\nWho's your Jesus? Stop me and question\nThey'll never forget they can choke on position\nDon't charge a cent of excellent\nAdd the ingredients of Ason's elements\nFire, water, cold earth wood\nYo do the knowledge because it is good\nEnough to overstuff jumbo pack\nBrother like Ason will never be attacked\nA by a nigga couldn't figure how to pull the gun trigger\nAnd I say yo get the fuck outta here!", "[Intro: Ol' Dirty Bastard]\nThis is dedicated, to allllllll you bitch assssssss\n\n[Hook 2X: Ol' Dirty Bastard]\nWho can make it happen like Dirt?\nBury motherfuckers like Dirt?\nA Dirty for drama, get's worse\nWho can make it happen like Dirt?, tell me\n\n[Ol' Dirty Bastard]\nStandin' over bodies with a shovel\nStandin' over bad, til my beef all settle\nOn another level, cuz I dance with the Devil\nThen I slap a bitch in the eye, with the bezzle\nStarin' at ice, so my nine stare back\nThen I shoot first, so you won't shoot back\nCriminal thoughts, sippin' on Similac\nIf I walk with a limp, then it's pimp tag scrap\nOn sundown, you gonna eat these rounds\nRoll on the bitch ass, with the tops dropped down\nDirty stay focused on the bend, deep nigga\nThen I will offend, who offend me, nigga\n\n[Hook 2X]\n\n[Hook 2X: Ol' Dirty Bastard]\nWho can make it happen like Dirt?\nBury motherfuckers like Dirt?\nWhen the cavalry come, and you face these guns\nWho can make it happen like Dirt?\n\n[Ol' Dirty Bastard]\nIf you sittin' beside me in the church\nOne hand on the bible, on hand on your purse\nFuckin' the deacon's wife, like I'm Judas\nY'all thank God, while me and my stank, do this\nHad her online like desktop computers\nWe ran the train, like rush hour commuters\nPack a pussy, like porn stars, yea, ya'll\nWho can make it happen, Dirt Dog, the rock star\nBury motherfuckers who come, so stay far\nI can send a bullet back to when, ya'll start war\nWho can make it happen like Dirt?\nWho can get it clappin' like Dirt?\nWho can make it happen like Dirt?\n\n[Hook 2X: Ol' Dirty Bastard]\nWho can make it happen like Dirt?\nBury motherfuckers like Dirt?\nWhen the cavalry come, and you face these guns\nWho can make it happen like Dirt?", "[Intro: C-Murder]\nTytanic, let's wake 'em up, ya heard?\nYeah, it's real out here\nJusting chill about it now (chill boy)\nSome of the ODB what?\nNYC CP-3 nigga what?\nLet me ask you a question\nWhat do you think about the game now? (What you think about it now?)\nHow you feel like my name now (How you feel 'bout me now?)\nHow you feel like C now?\nWhat do you think about the ODB now? (What?)\nWhat do you think about the game now? (What you think about it now?)\nHow you feel like my name now (How you feel about me now?)\nHow you feel like my name now (I told you I wanted somethin')\n\n[Verse 1: Ol' Dirty Bastard]\nYeah, bite that point, the habit of breathin'\nNo hope to find, that you're misbehavin'\nLink your cupid and fuck your brewin'\nFlash the burgers on your crewin'\nCause I must different from the other MC's\nI got the amazing ability\nI get on the mic so you can have a ball\nI could fly through the air and stick to the wall\nI could take a punch or get hit by a car\nCould go to the nearest or farthest star\nAs a matter of fact it's what I won't talk about\nHoppin' and goin' out of his trace just to be in the house\n\n[Hook: E-40]\nI'm so pimped out about my big spendish\nI got a 20, 6 Clock extra dickless (extra dickless)\nFor Anybody of them wanna pop off at the lip\nAnybody that wanna give me banana split\nIt's only E-40, Murder in this biatch\nAll the money motivated me to biatch\nThree soldiers from the East, South and West\nStreet soldiers holdin' it down for they septs (for they septs)\n\n[Verse 2: C-Murder]\nI'm C-Murder, murder mass ten, I'm wit' the Dirty Bastard\nAnd my flows comin' faster than a jet to Alaska\nI ask ya how you feelin' my collabo'\nThe CP3, the ODB from NYC the ghetto B\nLight it up, let it cook, look in the mirror, as we crush\nDon't worry about how it looks, put some money on my books\nOnly God can judge me now\nThat's when I heard the click clown\nI was Christened ,I ain't with them, am I RZA\nLet them whistles out them pistols\nLet loose on them troops and then shake 'em like Cherok smoke\nI slam dunk 'em like Shaq\nI wanna be free, I'm not guilty, do you feel me?\n\n[Hook: E-40]\nI'm so pimped out about my big spendish\nI got a 20, 6 Clock extra dickless (extra dickless)\nFor Anybody of them wanna pop off at the lip\nAnybody that wanna give me banana split\nIt's only E-40, Murder in this biatch\nAll the money motivated me to biatch\nThree soldiers from the East, South and West\nStreet soldiers holdin' it down for they septs (for they septs)\n\n[Verse 3: E-40]\nHey sluggin', wanna hit this rock down (rock down)\nI only got one world, mane, I feel like take this to the thick of him\nUnder there, got the smell, you do the ho you hear\nFuck it there, let me get a swig of that Thunder Bird\nOK, it's cute, it's squashed\nNow, no though mane, lets have a back wash\nYeah you trippin', \"no I ain't\", yeah you is\nThat boy spittin', what's his name? 40, quarter, biatch\n\n[Verse 4: Ol' Dirty Bastard]\nI stays in place, place stays in me\nI'm a vision of truth, just a true MC\nLove hiphop so much, mic won't untouched\nThugs grow unbust, bitch won't get fucked\nEvery 40 ounce cracked, every napsack packed\nOl' Dirty kickin' your ass, the record gets scratched\nOh, the record gets scratched, the record gets scratched\n\n[Hook]\nI'm so pimped out about my big spendish\nI got a 20, 6 Clock extra dickless (extra dickless)\nFor Anybody of them wanna pop off at the lip\nAnybody that wanna give me banana split\nIt's only E-40, Murder in this biatch\nAll the money motivated me to biatch\nThree soldiers from the East, South and West\nStreet soldiers holdin' it down for they septs (for they septs)\n\n[Outro: E-40]\nAnd there you have it\nE-40 the Fonzarelli\nThe  from the Soyo block soil\nTurf hall, been through it all\nBall 'til we have it all (ball 'til we have it all)\nOh boy ooo me (not me)\nOo we better than ooo me\nI'm so damned stalk on my self on crack by self\nAy look where c-murder at?\nMe and Ol' Dirty Bastard got the same birthday\nIf you don't stay your ass out of trouble\nMe and Ol' Dirty Bastard got the same birthday\nAy we got the nigga Tytanic on the beat\nWhat's up boy? ODB\nWe got the same motherfuckin' birthday\n11 -15 Scorpio, November Scorpio we tight motherfuckers\nWe look at the motherfucking memes when we get on the good one I can't please foul while y'all on the good one\nI'm on thought, I'm not throw em a paw but I only give lood\nWhat the fuck you drinkin'? Fortay\nShit I'm off this motherfucking .......", "* original version w/o The Clipse, additional two ODB verses\n\n[Chorous: Ol' Dirty Bastard (Pharrell Williams)]\nOperator (operator)\nGet the police (she's so fine)\nOperator (operator)\nGet the police (she's so finen)\nLook at that girl (she's so fine)\nLook at that girl (say it again)\nLook at that girl (must be a crime)\nOperator\n\n[Ol' Dirty Bastard]\nMet this bitch, by the name of Suzy\nShe was a bad bitch, she had a big ol' booty\nShe got me set up, when I went to the projects\nBad ass bitch, she was the one to holla at\nHad another bitch by the name of Precilla\nYou know that bad bitch, she taste like vanilla\nIn my car, looking good like that\nGetting money, making rushes, down with rats\nSaying to myself, no one can defeat me\nI got my dick out, come on bitch, feed me\nLet shit out, go down the throat\nNigga like me, never miss a note\nIf rain, I got coke, so I can't soaked\nMake a nigga go, I takes that dough\nGet hot like Superfly\nI'm the best at this shit and I don't know why\n\n[Chorus]\n\n[Ol' Dirty Bastard]\nGirls with money, drippin' from your ass\nI don't give a fuck, I'm smoking grass\nYou known me from down the block, I'm that good\nSold to your people in your neighborhood\nBaby how you want, the period is yummy\nThe diamonds in my mouth, I'm eatin' gummy\nThe feet bitch, I'm not lookin' at the corn\nThe way you farted, smell like them horns\nYou got enough body, enough to start a fight\nYour deep throat, me solo, say all night\nI'm movin' on you, screwin' on you\nDon't know what I'm doing on you\nAin't your man, but I know I'm chewing on you\nYou'll be best, when me and you leave the set\nGot rubies, how did you get them neck?\nHow do you feel about that bitch, if the bitch is a fatty\nHit that bitch, now take it from me\n\n[Chorus]\n\n[Hook 4X: Ol' Dirty Bastard (girl)]\nIf you ain't sweating, there's something wrong, girl\n(I am....) Say it louder\n\n[Ol' Dirty Bastard]\nNow bitch tell me right now, why you trying to kill me\nAs if that I like bitches like Eazy-E\nYou float like a butterfly, sting like a bee\nKnock that ho out like Muhammad Ali\nSpin in my mouth, throw your knees to the floor\nSqueel like a pig, I squeel like a whore\nSqueel like a motherfucker, do on tour\n69 girl, get on all fours\nWinter, Spring, Summertime, Fall\nWhen I walk down the street, do a man whore\nBlack blueberry bitch, stink, girls itch\nForget two G, I'm filthy man rich\nTuesday, Wednesday, I take off\nGet it bitch, get it, my dick needs floor\nI'm gonna get this CREAM, teen girl, hurt you, fuck laws\nMovin' on your broads, fly skit tours\n\n[Chorus 2X]", "[Intro: Ol' Dirty Bastard]\nDirty, ya'll niggas get the fuck up\nI'm out of jail, nigga, I'm out of jail\nWhat more, nigga, Dirty\nGo and get the fuck out, I'mma pull\nOne of your muthafucka's eye, ahh, something\nDirt McGirt, muthafucka\n\n[Ol' Dirty Bastard]\nYa'll know who I am, what?\nDirt McGirt, baby, whose the man?\nWhat part you fools don't understand\nBeen away now, I'm back by popular demand\nAin't a damn thing changed, nigga, back up\nFirst nigga to act up, get smacked up\nOrange suits on hand, Dirty this, Dirty that\nYo, where Dirty at? But now Dirty back\nMy girl is nasty, her booty is stank\nI fucked her all night, until a nigga shoot blanks\nDoggystyle, will never spill my drink\nThen smoke a blunt, and watch the shit on tape\nYou can sit on my face, I like the taste\nIf my P.O. call, tell that bitch to wait\nI break ya face, invade your space\nDon't make the mistake, tell me who is in the place what?\n\n[Hook: Ol' Dirty Bastard]\nYeah, let me see you work something\nSlow down, don't hurt nothing\nYou nasty, ain't ya? You freaky, ain't ya?\nGet ya ass over here, shake it like ya just don't care\nNow bounce-bounce, move it over here, now\nWork, work, move it over here\n\n[Young Chris]\nHistory, I do her, then we split up\nLyon call, whenever, we ready to get up\nI ain't never been hit up, with a line that's strong\nHave a nigga fuck the shit up, with his love, that's wrong\nGot a hell of a body, yeah, I love that tone\nAnd god damn, I love that moan\nThere's just something about you, make a nigga stay all night long\nMy undercover freak the shit\nIt's cool, cuz her peeps was rich\nSo whatever I want covered, and she got my peeps' pitch right\nSo when I'm on the road, or a girl play the show\nShe can respect homebase, she play the codes\nNasty as she wanna be, shaking that ass right in front of me\nCan't seem to keep her from up under me\nAnd how I am, try'nna see if chirp gash\nShake it for the Gunnerz and Dirt, shh..\n\n[Hook]\n\n[Ol' Dirty Bastard]\nI'm dirty, just like the dirty south\nI talk dirty, wash out my dirty mouth\nI'm dirty, just like the dirty south\nTalk dirty, wash out my dirty mouth\nWhat, nigga? Why you wanna get me started?\nGot me in the club with Tha Alkaholiks\nOn the down low, like I'm ducking the warrant\nGetting head in the back by the bathroom toilet\nThere's beauty all around, let me see the performance\nShe down for whatever, you know I'mm all for it\nGotta spark hard, hoppin' sports bar\nAfter this, it's the Marriot courtyard\nGold card, I'mma max it out\nJust keep your titties shaking and the apples out\nYou can, stick around, honey, that's no doubt\nBust a nut, then I'm passing out\n\n[Hook 2X]", "Shoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nOh, when you walk by every night\nTalking sweet and looking fine\nI get kinda hectic inside\nMmm baby, I'm so into you\nDarling, if you only knew\nAll the things that flow through my mind\nBut it's just a sweet, sweet fantasy, baby\nWhen I close my eyes\nYou come and you take me\nOn and on and on\nSo deep in my daydreams\nBut it's just a sweet, sweet fantasy, baby\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nImages of rapture\nCreep into me slowly\nAs you're going to my head\nAnd my heart beats faster\nWhen you take me over\nTime and time and time again\nBut it's just a sweet, sweet fantasy, baby\nWhen I close my eyes\nYou come and you take me\nOn and on and on\nSo deep in my daydreams\nBut it's just a sweet, sweet fantasy, baby\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nShoe do do do do do do do\nShoe do do do do do do yeah\nIt's just a sweet, sweet fantasy, baby\nWhen I close my eyes\nYou come and you take me\nOn and on and on\nSo deep in my daydreams\nBut it's just a sweet, sweet fantasy, baby\nI'm in heaven\nWith my boyfriend\nMy laughing boyfriend\nThere's no beginning\nAnd there is no end\nFeels like I'm dreaming\nBut I'm not sleeping\nIt's just a sweet, sweet fantasy, baby\nWhen I close my eyes\nYou come and you take me\nOn and on and on\nSo deep in my daydreams\nBut it's just a sweet, sweet fantasy, baby\nSweet, sweet fantasy, baby\nWhen I close my eyes\nYou come and you take me\nOn and on and on\nSo deep in my daydreams\nBut it's just a sweet, sweet fantasy, baby\nSweet, sweet fantasy, baby\nSweet, sweet fantasy, baby\nShoe do do do do do do do", "[Intro: Ol' Dirty Bastard (Baby Sham)]\nYo, this Dirt McGirt representin' Brooklyn\nWe gettin' ready to wreck shit up, downtown, uptown\n(Boroughs, ya'll niggas better know it's something) Wu-Tang, bitch\n(Get ya fuckin' head punched ya fuckin' shoulders, duke\nThis is how we do, everyday, blast through your motherfuckin' speaker, nigga)\nBastards!\n\n[Hook: Baby Sham]\nUh, we be so caked up, ya'll best wake up\nIt's just us and we livin' this up\nWe sip that cognac, then lean far back\nIt's just us, and we flippin' the truck\nDon't be so gassed up, be foul, assed up\nWhen them coroners, pickin' you up\nFirst you was in a black tux, now you all axed up\nYou smashed what, like you givin' it up\n\n[Ol' Dirty Bastard]\nI'm good with them free throws, like I play ball\nWhen the war is on, it's McGirt that you call\nThe last man standing, heavy with the cannon\nCome through on a bike, with a bulletproof, prancin'\nLeave you in your pearl, put you on the porch, dancin'\nAnd leave your brains on the back of a white shirt\nWhile they playin' some old school shit by Al and Bert\n(To all my bitches that smell like perfume, Dirt McGirt be here for you baby)\nI'm not gonna stop til I'm under the dirt\n\n[Hook]\n\n[Baby Sham]\nYou can never be as half as me\nCuz one thing'll lead to another, cock sucker, melt ya knees\nAnd make sure that your casket's deep\nCuz my trigger finger's itchin' like Athlete's feet\nSo stand wise, when you meet the chief\nAnd watch your movements in the circle of the ultra-beast\nI'm that nigga that'll culture speak\nWhose gon' ride, whose gon' die, divorce your peeps\nIt get's worse on the down reaking\nSo please, dog, do you a favor, move from around me\nCuz I set my boundaries, you wanna know where I'm from\nAsk Bust' where he found me, true B\nPaper chasin', Franklin' raping\nAnd for sure, I'm gonna make my statement\nAnd believe that the shit is taken\nCuz the gun, playin' long, like vacations\n\n[Hook]\n\n[Outro: Ol' Dirty Bastard]\nWe lay the law down, motherfucker\nBig Moses in the motherfucker house\nAny way that nigga go out, that's how the nigga go out\nGrand capo", "One, two and three through your raps fatigued in this mc word is a minor league/ see when brothas speak they swear it's unique, just a peak physique of an old antique / don't except a project, that's bond to freeze, your hardheaded stiff neck siamese / see i never liked rhymes, that's incomplete then again obsolete, shall i repeat, it's an easy street/ brothas who earn, learn your sojourn then you return, as an intelligent, positive, messenger not an experiment, negative, lucifer, with the tinited gloss of grafted﻿ skin, not the light spring source of the true origin / who was thor, wizard of war, cave man best friend was a damn dinosaur / no more jungle life living from the blue lagoon / its not an animal house, national lampoon / if you know the what, when, why and how / have you feel into a zen or to disallow / a fresh mc that will knock you down, i get you dizzy spell-bound, like a merry go round quan to u live and raw\n\n\n\nI didn't catch everything if you can fix it thanks!!", "[Hook: girl (Ol' Dirty Bastard)]\nLounge, homeboy, you in the danger zone\nLounge, homeboy, you in the danger zone\nLounge, homeboy, you in the danger zone\nIn the danger zone, in the danger zone\n(Say what?\nLounge, homeboy, you in the danger zone\nLounge, homeboy, you in the danger zone\nLounge, homeboy, you in the danger zone\nIn the danger zone, in the danger zone)\n\n[Ol' Dirty Bastard]\nFrom coke to PCP, from Marie to Penelope\nI'mma smoke this cocaine, like white boys smoke trees\nCan I get that G, autograph me\nI feel like a refugee how people run up on me\nPussy is powerful, it feels wonderful\nIt got me worshipful, money is plentiful\nNiggas is full, and plus your bored\nAny girl I pull is too wall for war\nPower plug on, pussy turned on\nI rocked it on, rap colored thong\nWeight, I put on, strong like protons\nI polly, then I'm gone, my style carries on\nIt's my party, holdin' too much hotty\nGo and dance, and it's a robbery, actin' all snobbery\nReal name: Moses, I pantyhose it\nTo all my hoes, industry, I sow's this\n\n[Hook]\n\n[Joe Budden]\nWhere the aluminum bats'll give welts\nAnd niggas wear ratchets in they belts\nNah, niggas wear ratchets like belts\nNah, it ain't good, but if you say the wrong thing\nIn my hood, might as well, say the casket just fell\nCollapse from that smell, he dodgin' po-po\nNiggas wanna act like they mafioso\nAll they see is me, when I spark the four-four\nWith a red dot, bigger than the Target logo\nDudes be superhuman, on some X-Men shit\nWith fast ways, you the only dead man to live\nSo act tough, til he see his best man give\nNow he pro-black, on some X-Clan shit\nFor realer, I ain't a killer, but don't push me\nRevenge ain't sweet, when a muthafucka pussy\nSo get loud, get piped, get drunk, get live\nGet tough, get hype, go ahead, get smacked, nigga\n\n[Hook 1.5X]", "[Intro: Ol Dirty Bastard]\n\"When the east is in the house\" Jeru the Damaja (sample) Oh my god! (2X)\nYo East New York in this muthafucka, Blahzay Blah in this muthafucka\nBrooklyn in this muthafucka, Dirt Dog in this muthafucka, it's on point\nCome on baby let me jump, let me see you body rhythm pump\nCome on baby let me see you go, let me see you, like go, go, go\n\n[Outloud]\nAiyo, my timin' is so precise, gangsta all my life\nI don't get get robbed, I control the heist\nCold as ice, still mountin' this whole device\nLife's a gamble, so I roll the dice\nI tamed up, still I'm up and coming\nAuto start, put on my sneaks, truck is running\nBad broads, that's beyond Beyonce\nEatin' on my body like a dinner at entree\nWhat ya'll critics gonna say, don't even risk it\nForget Pillsbury, eat this Blah Blah biscuit\nYa'll watered down the game, man, like bar liquor\nIt's nothin' for me, I just buy the bar quicker\nOh my God, nigga, I'm in the house, and I'm rowdy\nHe been doin' this since five thousand on an Audi\nRemember \"Danger!\" Yo, ya'll know Blah\nThis is grown under water, ya'll ain't even in my sonar\n\n[Hook: Outloud (Ol' Dirty Bastard sample)]\nThe east is in the house like (danger)\nAbout to, turn it out like \"Oh My God\" (danger)\nPut the barrel in your mouth like (danger)\nI see the dipper through a blouse, it's \"Oh My God\" (danger)\nMe and Dirty on the floor like (danger)\nMe and Dirty pimpin' ho's like \"Oh My God\"\n\n[Ol' Dirty Bastard]\nSo then you act like you love my little baby\nAnd you know that I act a little crazy\nCome on baby let me jump, let me see your body rhythm pump\nCome on baby let me see you go, let me see you, like go, go, go\nI'm on the streets lingo, spendin' the spingo\nEazy-E lingo, doin' the dango, the vet' don't wear Kangol\nI dare pump my shit, at the club, actin' strange, yo\nSmack ya'll niggas in the face, yo\nGot wiggas in the place, yo, block party in this muthafucka\nI'm the only round actin' like sucka, sucka bitch ass puffer\nSo don't play this muthafucka, or watch you bird clucker\nSo don't let yourself break yourself\nWith the sip and tumble, that will take yourself\nI move with that heat that smoke you in your head, man\nThe shit war, time to take, man, take man\n\n[Hook 2/3]\n\n[Outro: Ol Dirty Bastard]\nCome on baby let me jump, let me see your body rhythm pump\nCome on baby let me see you go, let me see you, like go, go, go", "[Intro]\nYeah, yeah!\nMotherfucker right up do, tape things\nYo, are you taping baby?\nBaby are you taping?\nOhh yeahhahhahheeyahhhyahhhhohhhyahhhh\nWhat the fuck anybody wanna do?\nRight motherfucking now!\nAhhahhahhhah\n\n[Ol' Dirty Bastard]\nI'm the God who's ahead of the Lords\nDirty Bastard from the Wu-Tang squad\nCan I get raw, yes I get Dirty to the floor\nRhymes, hittin' on your mind, you could never ignore\nHip-hop to me is like a place to be\nMy specialTY from me to you is emCEE\nSay what you wanna sayyyahhh, baby sayahh\nI flip the microphone-ah, any dayahh\nI'm mad swift because I got that gift of gab\nNiggas get mad, your ass stink never had\nThis talent that I got will resound the spot\nMC's, you got paid a lot\nYou ever notice a black man damn mostly slams\nWhen it come to the money yo it ain't funny\nIt's what you gotta do what you got to do\nC'mon, can I get a Wu-Tang\nWu, Tang, Wu, Tang, Wu, Tang, Wu, Tang\nWu, Tang, Wu, Tang, Wu, Tang, it's on your brain\nI get riggy diggy raw when it's time to get\nOn the dancefloor shotgun kill the shit\nBLAOW, then you won't step to me\nThinking is he really raw as he said he'd be\nIf I wasn't really raw, standing here on the floor\nYou'd be like \"Boooo He ain't no Hardcore\"\nNiggas play like they live but won't survive\nJumpin' up and down ticklin' that jive when you ticklin' gab\nI'm an average man, G-O-D fan\nLet it be known who's the champ, Wu-Tang Clan!\nIt's coming through and WU, boy it's bad too!\nThrow your hands in the air, if you don't care\nWho!, the Ol Dirty Bastard be\nOh me on my, you be hoppin' on my shit just like a fly\nBZZZZZT, all around\nThe dirtiest stinkin' sound down to the ground\nWhat what, what you wanna do?\nWhat you wanna do when I'm coming for you?\nI'm gonna give it to ya, bayyybah, bayybah, bayyyybah", "[Intro: Zoo Keeper (Popa Chief) {Ol' Dirty Bastard}]\n*Popa Chief singing \"Do or die, do or die, do or die\nDo or die\" throughout intro*\n(What's your move bitch nigga?)\nSuttin' ain't goin' down like that\nI ain't lettin' niggas know they ain't know\n(what's goin' on in yo life\nHow you gonna get what you ain't got?\nYou know what I'm sayin'?) You ain't gonna get it\n(Yeah) That's the way it's goin' down\n(Yeah, yeah, yeah, yeah) Fuckers are around\n{Yo I mastered the art of Shadowboxin'!}\n\n[Hook : Popa Chief]\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\n\n[Verse 1: 12 O'Clock]\nNiggas waitin' for hook up, get shook up\nNever get your weight off and do a push up\nYou smokin' all my purple kush up\nDon't make me push and rook up\nGet you touched up, I lift my wrist up, yup, yup\nNow niggas know Lil' Diggs, only twice wore a suit\nHad sex in a group with a couple of bitches dance for loot\nSee I'mma tell them niggas about spendin' all they loot\nPartyin' and trickin' on bitches and don't recoup\nI got my own version of roots\nCracker ass nigga pickin' cotton and polishin' my Brooklyn Zoo boots\nThe new news is Brooklyn Zoo\nSunz and Two On Da Road, Blue, Crazy Cuffie Fam too\n\n[Verse 2: Prodigal Sunn]\nYo, I ain't tryin' to be on no forever broke shit\nSo I made myself eatin' these streets where blood leak\nMe and my whole fleet smoke trees, blow heat, roll unique\nDo or die tactics, and keep us sharp on our feet, meak\nAnd all we do is make classics, CCF, the Unit\nDirt Dog, the Zoo, Ghetto Government, get your ratchet\n95% of them niggas is faggots, and I've had it up to here\nSee our face this year, appear\nOn your TV screen, we stay green\nMoney makes the world go around, know what I mean-ean?\nNew team, fresh and clean clean on your scene\nNow sing along, sing along, y'all know the theme-heme\n\n[Popa Chief {*singing*}]\nNow do or die, do or die, do or die, do or die (aarrgh, wooh)\nNow do or die, do or die, do or die, do or die (oohhh)\n\n[Verse 3: Hell Razah]\nYeah, bitches wanna bone a nigga when your records is sellin'\nLabels don't play a nigga when they nuttin' but felons\nYoung Razah got that hot shit that's under the Heavens\nGG'z poppin' grey goose feathers\nProstitute cheddar, crashin' in whips with new leathers\nBad models be on the dick that shy and strip\nThinkin' we some gangsters, thugs, Bloods or Crips\nWatch who you sleep, shake hands and hustle with\nWhy dream to be rich when I'm already rich?\nTwo bars I spit got the hottest nigga pissed\nChicks kiss the diamonds that twist on our wrist\nBrooklyn Zoo, S.O.M., Dirty Bast' shit, nigga\n\n[Hook]\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\n\n[Verse 4: Ol' Dirty Bastard (Buddha Monk)]\nI whip a nigga ass on hand and hand, you get flashed\nWhatever you do, I stop your ass\nMy name is Isis, I kill you with a hiss\nI kill you with my motherfuckin' piss\nA matter of fact you kill yourself, nigga I crash ya stealth\n(See let a nigga come through with that bullshit)\n(Yeah we ain't sayin nuttin')\nI never was familiar with bein' pussy\nI loved that shit 'til it's bloody\n\n[Verse 5: Buddha Monk]\nHey yo hold up, you told me you liked that shit muddy and swampy\nAnd you gonna hit it from where (from the back door)\nThis Fam right here, is the Fam right here\nAnd if you fuck with the Zoo you gon' get clapped right there\nFor this cream nigga, I'll walk through Muddy Waters\nIf he be call out, and rob your son and daughter\nLintballz in my pocket and yours is real lumpy\nNah, Lay Down, gimme what you got G\nSplit the pie three ways, live off it for three days\nAnd when it's done, who's the next victim today\nI'm trife nigga, and I don't live by Bible life\nI yap the nigga ripe then stash a nigga right\nYeah I did wanna do it and the Devil didn't make me\nLinballz in my pocket that made me stick them keys\nCheckmate, pray to the Lord, your soul He take\nThen I hip into the rob for my Fam I just got 'im, nigga\n\n[Hook]\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\n\n[Outro: Brooklyn Zoo {Popa Chief}]\nYeah yeah, huh huh (motherfucker)\nThat's right, that's right, OK (alright)\nYeah so {now you be knowin'}\n{Annihilate}\n{Get some papes like Bill Gates}", "[Intro: Ol' Dirty Bastard {Buddha Monk}]\nI was drivin' an Accord, nominated at awards\nBack in the days drivin' an Accord\nRun-uhhn-uuhhn-uhhn, nominated at awards\nBack in the days drivin' an Accord\nEverybody rise (Wu-Tang)\n(This slang) You know (this rhyme) you came to America\n(that's our thang)\n(I hang) And took over the black woman (and her reply)\n(Is slang) The black woman wanted the Judge\n(They runnin' from the cops)\nThey run, runnin', run, runnin', runnin', runnin'\nHere Comes the Judge, here Comes the Judge\nHere Comes the Judge, here Comes the Judge\nHere Comes the Judge, here Comes the Judge\nHere Comes the Judge, here Comes the Judge\nHere Comes the Judge, here Comes the Judge\nHere Comes the Judge, here Comes the Judge\n{Give it to me now}\n\n[Verse 1: Ol' Dirty Bastard (girl)]\nHere comes my Mac\nI don't need this shit owned by stack\nI don't need you to monitor my perimeter (I wanna [?])\nGot me Accord, take me to judge\n{*sniff*} Sittin' broke\nNominated at awards\nBack in the days drivin' Accords\nI didn't have nothing to give\nI didn't have no life to live\nBastard C'Mon\nAaahhhhhhhhaahhhhhhh\n\n[Break: Buddha Monk (Ol' Dirty Bastard)]\nHey hey excuse me Mr. Russell Jones\nWill you please calm down and tell the story?\nJust the story (aheh aheh)\nWe want nothing else, just the story\n(No disrespect Judge)\n(Police-police-police)\n(Police-police-police)\n(Dirty ass, Dirty ass, Dirty ass)\n\"I come camouflaged\" --] Zoo Keeper\n(Dirty scorpian)\n\"Uh uh Judge your honor Pig Meat, sir don't you\nRemember me\"\n\"No who are you boy?\"\n\"Well I'm the fella that introduced you to your wife\"\n\"To my wife? Life you son of a (gun you)\"\n\n[Verse 2: Buddha Monk]\nYo, start the attack with dirt up cats that's wack\nWants to be a gun blazer but jacks the flavor tracks\nI numb out frames, don't blame it on the cocaine\nWhat is sure to be the blame is the bullets of which you obtained\nZoo or Zi Tribe and will live to be trifle\nNews stands everywhere shows Zoo homicidal\nExtra extra read all about it\nDirt Dog's Dirty cousin kills off Franklin and Madison\nThis Dirty hiphop, tryna stop the raw lights\nZu shoot down on the block, I need beamie of Scotch\nBlock is mad hot, bad boys want their fuckin hollar\nAsked for Information, got it from a bitch named Tmara\nClick click, a bloaw bloaw bloaw\nWish y'all woulda crawled with her\nWould have killed that bitch off, and fucked her ugly daughter\nHahaahhhahaaa\n\n[Outro: Judge]\nMr. Russell Jones and Mr. Ellery Chambers\nWould you please stand\nThe court finds you guilty as charged\nI am the honorable Judge Pig Meat\nNo longer will you make a mockery of the justice system\nThe honorable Judge Pig Meat has spoken\nI sentence you to life\nHahahahaha\nI am the Judge, I am the Judge, I am the Judge, I am the Judge\nI am the Judge, I am the Judge, I am the Judge, I am the Judge\nI am the Judge!", "[Intro: Ol' Dirty Bastard]\nFuck you, fuck you, fuck you, fuck you (We about to hurt somethin' up in here)\n\n[Hook 2X: Ol' Dirty Bastard]\nThem down south niggas been loved Dirt\nTake a shot to the head, if you been through the worse\nShow respect to your niggas, who been doin' it first\nAnd be comin' with that shit, I'm just doin' the work\n\n[Ol' Dirty Bastard]\nYou don't wanna ride with Dirt, you still stuck in coach\nYou don't wanna fly in first, yo, I can spit one verse\nAnd leave in a New Benz burst\nTake a trip down south and put some hoes to work, you hear me\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nDirt McGirt, you niggas gon' respect it\nI'm drunk and crunk so don't come in my direction\nI'm ready to thump, and get the whole crew arrested\nBail 'em out, and laugh about it in Texas, yo\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nAnd get with Rome, down in Caki-Lac\nAnd hit the spot, in the hood where the houses at\nWhere the shootin' and the fightings and the stabbings at\nWhere the Lincolns and the Chevys and the Cadi's at, shit\n\n[Hook to fade]", "[Ol' Dirty Bastard]\nTwo steps from the border line\nAnything closer will kiss the nine\nThink I'm out the game? You out of your mind\nCuz I stay on track, like transit line (FIRE!)\nKeep it nappy or braided up\nDirty in the cockpit, blazin' up (FIRE!)\nStop frontin' when you made it up\nTellin' all my hoes, you can't spray it up (FIRE!)\nHah, huggin' nuts like tighty whites\nStill trickin' on hoes like Heidi Fleiss (FIRE!)\nYou know why niggas don't give you much respect\nCuz they seen you gettin' slapped with the empty gat (FIRE!)\nKnow Dirt, like bow know death\nWhen I'm huntin' down, birds in rap (FIRE!)\nHate Dog, cuz I ate your cat\nAnd you can eat my ass and have a coke with that (FIRE!)\nUse a spoon, unless you want a fork\nPull my dick out, watch the room get dark (FIRE!)\nStay high with the zombie walk\nGotta sit my ass down, like Rosa Parks\n\n[Hook: sample (Ol' Dirty Bastard)]\nFIRE, FIRE-FIRE, FIRE (Let me hear it)\nFIRE, FIRE-FIRE, FIRE (Ohhhhhhhhh)\nFIRE, FIRE-FIRE, FIRE (Let me hear it, ohhhhhhhhhhh)\n\n[Ol' Dirty Bastard]\nWhat can make a ho, look more cuter\nBut, Hennessey shots, and smoke more Buddha (FIRE!)\nNow you hungry, wanna eat right through her\nBut you better first track for a noter (FIRE!)\nLike does she have a best friend, or a daughter\nHas she ever tried fuckin' under water (FIRE!)\nMisinterpetate, let me break it down\nTwo pulls make the your merry go round (FIRE!)\nTouch your toes, show me that rose\nButt naked, in a Wu-Tang pose (FIRE!)\nWide open, girl, everything goes\nReal freaky, when you powder that nose\n\n[Hook]", "[Intro: Ol' Dirty Bastard]\nRoyal Flush, Dirt McGirt\nAnd we don't give a fuck whose in here tonight\nSomebody's gon' get shot, bastards!\n\n[Hook 2X: Ol' Dirty Bastard (Royal Flush)]\nIf ya'll want war (ya'll want war?)\nLet's get it on (let's get it on)\nCuz we don't care (ya'll know we don't care)\nWhere ya'll from (wherever ya'll from)\n\n[Ol' Dirty Bastard]\nYo, you go one shot, two shot, three shot, four\nThat's how I'm soundin' when I'm shootin' down your door\nFive shot, six shot, seven shot, eight\nThat's for all them niggas, that I catch at the wait\nNine shot, ten shot, eleven shot, twelve\nThem four shots, gonna keep me outta jail\nI be, damned if I fail, BK know me well\nAnd take your precint to war, before I take a fall\n\n[Hook 2X: Royal Flush]\nY'all don't really wanna fuck with us\nCuz you know we gon' shoot shit up\nDon't waste bullets on your house and truck\nWait til' we see you, then we hit you up\n\n[Hook 2X]\n\n[Royal Flush]\nAnd I ain't got no time, to talk to none of ya'll niggas\nYou tough, then you get shot, you turn to snitchers\nAnd them niggas that you runnin' with, become your witness\nMan, I'm good with my aim, dog, I hit you from a distance\nNo, look, this is the difference, like special ed., you on a mission\nToo eager to glisten, when your mom talked you should of listened\nTake out the trash, do the dishes, now she gotta bury a son\nGot hit with a gun, just convicted homicide\n\n[Hook]\n\n[Hook to fade]", "[Hook]\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\n\n[Verse 1: Ol' Dirty Bastard]\nOl' Dirty kickin' your ass\nThe things that you learned in class is trash\nYou can't do nothin' wit' it, I put you in the past\nYou broken motherfuckers, shut the fuck up\nI do it 'til you bad luck and head get bucked\nThe only thing on your brain is to give me this cash\nStay out of my business cause I'm takin' your tash\nThis rumble on the ming, none of y'all free\nI got y'all in.. slavering\n\n[Hook]\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\n\n[Verse 2: Mack 10]\nI gives a fuck about a bitch or a crooked ass cop\nI'm a burst that, it's dealin', the hustle don't stop\nI got stones and [?], ecstasy and weed\nMetham-phetamine, sherm, sticks and speed\nPay it high wid, dope is all I got to give\nI'm a ghetto nigga dog so I get it how I live\nGot money, lock 'em off, fuckers still I got drama\nGot two strike dog and like five baby mamas\nWith new strain I maintain, I'm ready and willin'\nTo keep change on niggas brains to keep the blood spillin'\nI hate it but it ain't complicated, it's real simple\nFuck with me and know you get a hole in your temple\nI ain't gonna play you niggas, I'mma slay you niggas\nDon't take but a few figures and a few new triggers\nMack 10 livin' legend, every West coast rhymin'\nStraight hoo bangin' gangsta and hard rhymin' sodom was that\n\n[Hook]\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\n\n[Verse 3: Royal Flush]\nShut up, let me talk for a minute, alot of bull shit on my mind\nDealin' with crime, alot of y'all dealin' wid rhymes\nStuck on the grind, crackheads cookin' my pies\nStartin' off on the 1-2-5, the block's mine\nBucket just spine, DH tryna tap my line\nStop my productions, wanna know my money discussions\nWho I roll wid, \"buy so many cars is he legitin' of my dick\"\nIt didn't matter when I ain't have shit\nThey'd watch me in helicopters, parklin' in my crib\nAll I wanna feed is my kids, no time to do a bid\nFeel me, I forced the whole guns a while for my ones\nDidn't sell drugs, where the money come from?\nNo school, no job, no bitch, no food, fuck that\nDo what I do to make my shit true\nAnd I make it hard on them boys who blew they cats charges\nIf I go to jail you know I'm blowin' on the Sergeants\n\n[Hook]\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\n\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\n\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\n\nSome people get caught up\nAnd some charge is brawl out\nMakes some people, some people, some people\nSome people, some people, some people\nSome people, some people, some..\n\nSome people get caught up\nAnd some charge is brawl out", "[Oh, fuck, you can't even sing.]\n\nOoh, baby, I like it rawww...\nYeah baby, I like it RAWWW!!!\nOoh, baby, I like it raww...\nYeah baby, I like it RAWWW!!!\nSh...\n\nVerse:\nShimmy shimmy ya, shimmy yam, shimmy yay\nGimme the mic so I can take it away\nOff on a natural charge, bon voyage\nYeah, from the home of the Dodgers, Brooklyn squad\nWu-Tang Killerrr Bees on a swarm!\nRain on ya college ass, disco dorm!\nWhen you didn't even touch my skill\nYou gotta have the one Killer Bee and he ain't gonna kill. Now\nChop that down, pass it all around!\nLyrics get hard, quick cement to the ground!\nFor any MC in any 52 states\nI gets psycho killerrrr Norman Bates!\nMy producer slam, my flow is like bam!\nJump on stage, and then I dun-daaaah!\n\n[I like the way you come]\n\nOoh, baby, I like it rawww...\nYeah baby, I like it RAWWW!!!\nOoh, baby, I like it raww...\nYeah baby, I like it RAWWW!!!\n\nReverse Verse:\nFirst Verse repeats\n\nThe odb won't neva quit\nMy name is odb nigg* and i'll beat your sh*t", "[Raekwon the Chef]\n\nSo yo yo all I want to do is just tell them cats\n\nOn the real, keep your game high man, keep it up\n\nWord up, never stop your goals man, yaknowhatI'msayin?\n\n(For real baby)\n\nAnd, yo son, on the real I'ma get a sneaker just like y'all\n\n[Ol Dirty Bastard]\n\nI need help Because the black man is God\n\nThe government is after me And the worst is, black man is the Devil\n\nI need help So this is to bring everything in the\n\nSomeone help me please universe within the light\n\nSomeone help me! Understanding\n\nThey already did 2Pac My children, all six billion humans\n\nBiggie Smalls on the planet Earth\n\nSomeone help me! Regardless of who or what, I love you\n\nSomeone help me please! Word is bond, I love you\n\nAhh! I'ma groupie for life, about nine wife\n\nAll the babies are mine, save a child life\n\nNo more doctors deliverin my babies\n\nStick in pins killing me slowly\n\nTo the President you say I'm a welfare fraud\n\nYou motherfucking right! Let's burn this dark house white!\n\nInsecure about my ding-dong, married to Babylon\n\nMy queen lookin at me like a pawn!\n\n[Raekwon the Chef]\n\nSplash the worst rehearse a verse Flashdance on the universe\n\nTelevise the work Network Shop til your neck hurt\n\nWhattup Dirt, nine diagram phoenix on your sweatshirt\n\nThirty-thousand went bezerk, it's like clockwork\n\nRockport Mr. Raw God, hold the fort\n\nCollect thoughts, elect sports, sideswipe, by the white horse\n\nFrench cut, gleamin in the Benz truck, whattup\n\nTellin my mens what? Ten times platinum and we ends up\n\nDraped out, jumpin out a cake, now throw your tape out\n\nFurniture style, holdin the mic we got it laid out\n\nMind iodine Einstein remind mine\n\nPeople swam nine didn't know they own kind wrong time\n\nDenim rap, competition quick, handle that\n\nSuckin the jim hat, pervertin on my raps'll get you slidapped\n\nMix drink Cuban Link lizink, flip a to zinc\n\nPlus, expensive like a roman mink, now think\n\n[Ol Dirty Bastard]\n\nAn ugly thirty-six chamber degree, what, you want to rhyme?\n\nDeep bring 600 ABC through the love white hate line\n\nI'm telling you tornado, 42 billion thought travel\n\nThe year 90's parallel, controls to the wakes\n\nI dig woman's stomach swell, my borough is dark\n\nMany lights UFO kites, Benjamin Franklin got it right\n\nAbraham I stuck your cherry tree\n\nYour white head came out my black pussy\n\nI ran Rip Van Winkle on all fours\n\nMountains twinkle twinkle star, Tarzan in a jar\n\nAnd then came out Jane Flintstone in my gravel pit\n\n[Method Man]\n\nKill the chatterin, niggas bust shots, keep em scatterin\n\nBlood splatterin, on point like a javelin\n\nFuck battlin, you cats is only good for babblin\n\nImaginin yourself, as the God space travellin\n\nRound the seven rings of Saturn\n\nGot my sword plus the Abbot in the chamber, nine in the clip\n\nAt the gatherin, we left you staggerin, yo it had to been\n\nHot Nickel, who broke bread, at the Vatican\n\nStick a pin, in a citizen, mental food, got us diggin in\n\nMy compliments to the chef\n\nM-E-TH like amphatimens, yes stick it to the veteran\n\nBlaow blaow! Blown to death, take your medicines\n\nI put the sick in your mu-sick with Osirus\n\nBound to blow like a bad sinus\n\n[Ol Dirty Bastard]\n\nStay up at night don't sleep on your morn\n\nRest in the day because it's sunlight\n\nReverse thought psychology\n\n[Prince Rakeem]\n\nChild wild adventures walk trillions of square inches\n\nTen percentage try to drain me of my mental strengthage\n\nHeavy wattage knowledge cleans blood clottage, and retardage\n\nI refine the garbage logic exterminate your cottage\n\n[U-God]\n\nThirty-six anger, dirty language is the stranger\n\nThe mangler, the honor roll singer righteous finger\n\nWhen we shine-a, we always find a never minor major\n\nHard to spot we dangerous with our behavior\n\n[Prince Rakeem]\n\nAustralian Venezuelaen illegal aliens\n\nChameleons all catch the feelings we revealing\n\nKiller bee keep your mind at ease, lay back like Adam fuckin Eve\n\nFour thousand years in the garden, puffin trees\n\n[U-God]\n\nI aim slang I maintain, through the main vein\n\nThe answer came clever, when we do greatness through trial and error\n\nMile of terror motormouth, let the odor out\n\nFumin greater, the temper in my spine huminator\n\nThe super grass childish blast sleepy eye stash\n\nThe hashish masterpiece, Osirus is the virus\n\nThis split second splash, severe drop is near pop\n\nThere's fallin teardrops, now is it worth your career?", "[Ol' Dirty Bastard]\nThis recordin is Dirty and it's Stinkin\nFunkier than Peppi Le Pew so I was thinkin, about\nDroppin this single on the charts, lettin ya know\nHey, the kid has heart, I never deny myself as being\nDope, but in my last jam, niggas slept on my notes\nYou thought that I was weak? Huh? Let me speak\nMy rhymes come funkier than ya grandfathers feet\nSo listen mister, don't you ever forget\nThe rhyme is dirty, you couldn't even clean it\nWith Comet, for even Wolrex, some tried Ajax\nOnly mix with the best, forty-eight tracks\nYo, I get down with the Ason sounds\nLyrics that be flowin from miles around\nSo let the music shut ya ass up, then feel the uppercut\nNow I make ya fall to ya butt\n\n[Master Fool]\nHo-ho-hold up, Master Fool\nTakin' it on down, jugga-jugga-ju\nFall on ya butt, ya ass gon' hurt\nThey call us WINGWORM cuz we mastered this dirt\nI act like a drunk but I'm out for the dough\nI mastered the funk, Dirt mastered the ho's\nOnly Master play the Fool, I worked hard and paid my dues\nTony Snatcher played the fool\nAnd man meater eater played the bone\nI come in the club with no ID\nThey gon' have to close the club up messin wit me\nUp.. Dirty and Stinkin stuff\nIt's that Dirty dick NUH with the Stinkin nuts\nLast Call now drink it up\nMe and Dirt want a pound for some Stinkin stuff\n\n[Hook x2: Master Fool]\nLast Call for alcohol, everybody out the bar\nGet ya back up off the wall\nPeople.. ohh.. ohh.. people.. ohh.. ohh\n\n[Ol' Dirty Bastard]\nYo, let me continue, verse number two\nStyle is wild, dirty and stinkin like doo-doo\nIf ya hangin around, ya changed ya mind\nIt is a bad influence, but yo it's my rhyme\nI sit down and I say to myself, \"Self\nYo, are you rated top the shelf?\"\nI drop the single for you to get a dose of\nAs I lay back like a pillow on a sofa\nGettin paid? Yeah right, Willy\nWhy askin me, G? What? What? What? What? You know me\nMy mouth is sugar, sweet as a honey bee\nTaste like a forty, Stinkin like Old-E\n\n[Master Fool]\nFool in this bitch, where the fuck is the drinks?\nNo open bar!?! Where the fuck is the drinks?\nThat bitch over there with her man tuckin his link\nAll strip club bitches straight clutchin his mink\nNiggas official, big guns, wavin the pistol\nMy dogs lookin for the brew now we bitin the gristle\n(Stop fuckin with them guns son you playin too much)\nCatch a charge drinkin bro', I ain't playin too rough\nFucks! Lay in the cuts and hug the butts\nGrab a big five whether you a scrub or not\nRobbery, robbery, pop, pop, poppin like a Glock\nRobbery, robbery, drop, drop, drop it like it's hot\n\n[Hook x4]\n\n[Outro: Ol' Dirty Bastard]\nDoo-doo, doo-doo, doo-doo, doo-doo\nHeard Master singin that shit?\nStinkin blue Palmaid..\nDoo-doo, doo-doo, doo-doo..", "Featuring Ghostface, RZA, Ol' Dirty Bastard\n[rza]\nYo Yo Yo doodododododo Yo pssh yo\nYo park the jeep on the street of the Sunset Marquis\nAutograph sign and pass wit a gold tip sharpee\nPermanent ink blots undrunk from velly poo scotts\nAll you faggots try to judge my shit like Ed Koch\nUnderground left and right pair surround sound can't be scared\nPlea the ams radio tapes that he jammed\nGolden chrome, desert eagle never left at home\nFlip the track of the beat watch Bobby flip the metronome\nHigh voltage, keep my seat in winsbro cultured\nKill enemies by mailin them the poison glue postage\nI open and fold ya thought he fucked a ogre\nI leave the cats the book of food stamps ????\nThe box of evil a fifty sack of that lethal\nAdjust these boots and bloody cube steaks from keebu\n\n[odb] 4x\nWhat party can you go to\nAnd I ain't there you bitches actin like they don't care\n\n[rza]\nYou bitches actin like you don't care\nYou bitches actin like you YO\nRazor blade toenails cut holes inside tube socks\nGolden platinum things unstainable\nI chew rocks\nSlipe wit type digital soup deflect bullets\nBlack hooded surrounded by forty acres of wooded\nLand, like my cousin dusty dirty as dan\nFucked the daughter of the leader of the Ku Klux Klan\nTapes we dub pound you wit the ace of club\nClimb your tree to a shub\nTongue kiss a lion and kidnap her cub\nPassin it portrait\nMy bitch spread eagle wild orchid\nPussy so wet you could fuck it wit a soft tipped dick\nTickle the tonsil you could hear her coughin\nI don't know if Dirt fucked Mariah, but I'm out to fuck Tyra\nStarks might fuck Mya\n\n[odb]\nI'm the pussy vampire\n\n[Chorus] 4X\n[Ghostface]\nYo I'm bent out three days two nights yo I'm spent out\nOne hell of a cruise New York got they hand out\nLike I owe somethin, check they stance they frontin\nI'm two seconds fromt wistin ya'll shit over nuttin\nAll a sudden ice grills kid you did a baby bid\nIn a minute almost hung yourself slit ya wrists\nTo the maximum hand me the forty I'll thrash and\nSplit out guests wit gash lemon goes throw his laz gone\nTrama the block pro bar sledge slang ho\nRunnin from to and sharles some rap and I might blow\nWorld cup, some been blessed wit the Stanley\nYvonne lendl ordered lamb racket wit the cam key\nSideline maneuver, polish wax MC remover\nNiggas wit long nails cuttin me leavin bruises\nCandle lows tied a thousand an ya'll froze\nCame home an dust that doo tryin to play me close\nWe've been peaked for years now Liz wants to choppin the kid\nI might do magic make him disappear\nRearose that nigga Isotoner Coca-Cola holder snap the granola\nSprinkle ginko polish\nVenom from a cobra lace in the come he brought older\nSoaked through a strainer here's a doser\nThe King James version is paid just like Samsung\nWit effects that'll kill rogers double O seven\nHanna Barbera hops the opposite abandoned the deer\nFuck wit mics like Sonny and Cher\nOr maybe captain entenail, connect and then blow the seal\nNice like mister whittendale your girl Chippendale\nShallah bridge all up in ya dog dial trench\nWhen I snatched that shit was broke shoulda sent ya ass back\nAnd where's the key to the hatchback pop that\nGet in throw a bag full of mice and then respect that\n\n[Girl] 4X\nWhat party can you go to, and Wu ain't there\nThese niggas actin like they don't care\nWhat party can you go to, and Wu ain't there\nThese hoes actin like they don't care", "[Intro: Thirstin Howl III]\nYeah, this what happens when you dirty and thirsty at the same time\n\n[Ol' Dirty Bastard]\nYo, It goes one shot, two shot, three shot, four\nThat's how I'm soundin' when I'm shootin' down your door\nFive shot, six shot, seven shot, eight\nThat's for all them niggas, that I catch at the wait\nNine shot, ten shot, eleven shot, twelve\nThem four shots, gonna keep me outta jail\nI be, damned if I fail, BK know me well\nAnd take your precint to war, before I take a fall\nI'm good with them free throws, like I play ball\nWhen the war is on, it's McGirt that you call\nThe last man standing, heavy with the cannon\nCome through on a bike, with a bulletproof, prancin'\nLeave you in your pearl, put you on the porch, dancin'\nAnd leave your brains on the back of a white shirt\nWhile they playin' some old school shit by Al and Bert\nI'm not gonna stop til I'm under the dirt\n\n[Hook 2X: Ol' Dirty Bastard]\nIf ya'll want war\nLet's get it on\nCuz we don't care\nWhere ya'll from\n\n[Thirstin Howl III]\nOne shot, two shot, three shot, four\nI wear that gold chain that used to be yours\nFive shot, six shot, seven shot, eight\nShotgun shells give your face a new shape\nNine shot, ten shot eleven shot, twelve\nThat last fucking bullet I'ma save it for myself\nSpeed luger, weed smoking, walking with the pistola\nSomebody gotta die for this shit to be over\nBrownsville, pull your gold card membership\nRikers Island styling, just courted sentences\nYou been a bitch since your thing started showing\nGlocks down in Moscow, did the jooks out in Poland\nLeather trench, villain shit, gutter crime citizen\nShow the something hand held with shells to kill you with\nMy heart's the realest thing to ever fill a clip\n\n[Hook 2X]\n\n[Interlude: Thirstin Howl III]\nYeah yeah, Ol' Dirty Bastard, Roc-A-Fella\nThirstin Howl III, Skillionare Enterprises\nMelbeatz, Optic Records\nThis universal right here, all around the world\nYa know what I mean? This is breaking language barriers righ here\nWhen you dirty and thirsty at the same time, somebody's gon get hurt\n\n[Hook 2X w/ Thirstin Howl III ad libs]", "[Intro: Ol' Dirty Bastard (Goldy Hawn)]\nEvery horror movie they can attack ya ass\nIf you fuckin' wit the Ol' Dirt Dog\nBitch what's his name... in Wu-Tang\nBitch, if you didn't hear it muthafuckin'\nYou heard it now, on radio 98.7\n\"Time to go to sleep\"\n(Aight, it's time for ya bitch ass muthafuckas to go to sleep, then\nBig Bad Wolves, niggas\nYo son, aiyo Dirt you ready, ready?) I'm ready, I'm ready\nAll you bitches ready to go steady\n(Yo, hit them niggas wit that shit, son)\nTo the girls over there (to the bitches)\nTo the niggas over there (to my niggas)\nFrom the front, to the back, packed everywhere\nWanna get smacked out the atmosphere (you wanna get smacked?)\nMy name is Dirt Dog, bitch, I don't know where and how\nMy name is Dirt Dog, and in pilgrim, you smile\nBitch you get murdered from the first start\n(Aiyo, God, you gotta fuck the shit up iller than\nThe that shit son, right there, man, for real man?)\nTurn it up, turn it up, turn the headphones up\n(Word?) One-two, one-two (one-two ya'll)\nIt don't stop ya'll (it don't, ya'll)\nWon't stop ya'll\n\n[Hook 6X: Ol' Dirty Bastard (Goldy Hawn]\nChildren sik 'em (children sik 'em)\n\n[Ol' Dirty Bastard]\nMurder was the first artwork obtained\nA nigga didn't know the seven half ounces of brain\nYou try to maintain, you didn't know the slang\nMy name is from the Wu-Tang, nigga, I kill a buttfucka up to slain\nNigga, Wu-Tang, you could never ever hang\nI said it again and again and again\nNigga you fooled cuz you didn't know this\nCuz I'm the specialist\n\n[Hook 2X: Ol' Dirty Bastard (sampled kids)]\nChildren sik 'em (when they're gonna get you)\nChildren sik' 'em (when they're gonna get you)\nChildren sik 'em (I'm not asleep)\nChildren sik 'em (it's time to go to sleep)\n\n[Ol' Dirty Bastard]\nYou didn't have no power to predict in them\nThe Dirt Dog came wit the natural handsome and slim\nStyle that came wit the buckwild\nNigga, I taught 'em, nigga I treat 'em\nNigga, don't know how to reach them\nMy name is Dirt Dog I keep those speeches in\nFrom down down Martin Luther King to Malcolm X\nI make the niggas come up and give recess\nBlaow! She don't know my Elijah Muhammed style\nFuck a nigga up wild, I am up on the couch\nThe Dirt Dog nigga, never foul\nFuck a nigga up, a spirit attack ya wild\nHow? Cuz hip hop don't stop the groove, ya'll\nI make a nigga caution at the smooth yard\nStyles that make you wanna roll up in the streets\nAnd go up in ya house, because ya streets and ya house is talkin' to you\nYou want to get a haunted house Amittyville\nWhat you, what you say, and do\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nI grew up, in the L.P. crew\nMuthafucka, me, Ro' and Johnny Q\nNigga Johnny, attackin' on ya analog ass niggas\nCuz you was on the dick and you wasn't fuckin' lookin' at me\nMaster Born, and on top of them niggas, you was rollin' wit me\nShit, RZA came through and Popa Wu\nMuthafucka, we ran ya whole muthafuckin' crew\nDon't act like we didn't know what the fuck to do\nMuthafucka, we taught ya bitch ass kung fu, too\nWhat, what, you wanna talk about?\nYou won't know know no kung fu if I'm not in ya house\nDirt Dog, yo' Busta Rhymes I ain't got nothin' against you\nBut ya fucked my boo, it's all good, nigga, true\nDirt Dog, do it for you, hip hop don't fuck wit me, who\nHow, when, what, where, gonna get you\n\n[Hook 2X]\n\n[Outro: Ol' Dirty Bastard]\nAnd if you ever go against the nigga, you die\nEnough dyin', enough unmultiplyin'\nWhite boys, white girls, when you hear this noise\nGo crazy, attack a nigga like a muthafuckin'\nMuthafuckin', animal, savage, beast\nComin' through ya muthafuckin' house\nBitch, you couldn't reach\nThis style that's fuckin' you up", "Yo yo, Miami, yo California\nNorth, east, west and south motherfucka\nYo check this out this is dirt dog\nI'm here to make you scream\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nI ain't no actor my shits for real Thigh master\nIf I don't get paid two or three million dollars on Monday\nI'm a bring on the Armageddon it's Monday\nFuck that feeling, this for reeling\nNigga I want my noalin'\nMake it rain, hail, storm and earthquake\nUh! That's what I'm saving\nPlay that music in your trunk\nThe cocaine got my stuck\nNigga I'm from the ghetto\nHow many celebrities from the ghetto?\nDirty your crazy, I'm crazy about your music\nDirty your crazy, you're a nut case you're a fucking nut case\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nA to the pox doing night fever\nCancer, herpes, mumps, seizures\nDiabetes, TV if your against me\nYou die easier\nCops don't have a show whatsoever\nAin't no more doctors, ministers\nNurses can't give us searches\nThere won't be electric, won't be churches\n'Cause your body go against you\nWhether it's a lie or whether it's true\nYou can't use violent mentalities anymore\nIt ain't lambskin you can't use the word napkin\nNigga you're sleeping\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nI can't wait hold on hold on hold on\nI'm diplomatic playing pen and pad\nRatatat you're a scared cat\n'Cause I have a tat put you up like that\nYou can't stand that, 'cause you gotta scat\nYou couldn't even move, don't know how to groove\nBitch take off your shoes, take up the brew\nMotherfucker you knew, fucking with the doo\nDirt dog don't make any room\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nI want to give a shutout to funk master flex\nAnd all the DJs across the world\nI want to give a shutout to my nigga Lupe\nI want to give a shutout to my nigga Suge knight\nTo my nigga Dr. Dire, snoop dog\nI want to give a shutout to um, um, what's them niggas, outcast?\nI want to give a shutout to um, them crazy niggas\nIn parts of the world that I never been too\nI want to give a shutout to the eskimos\nI want to give a shutout to the submarines\nI want to give a shutout to the army, navy, air force, marines\nKnow what I'm saying? Y'all playing my music\nIn the submarines and the boats\nPlay that shit know what I'm saying?\nIt's called traveling music busting ya ass style\nYo big baby Jesus it's one love\nI give a shout out to all the women\nI give a shout out to all the babies\nAll the munch kins all across the world play a, God\nI want to give a shutout to all the school teachers\nI give a shout out to um, um, myself\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait, nigga fuck that I can't wait\nBig baby Jesus I can't wait\nI give a shout out to the woo tang, tang, tang\nThe Brooklyn zoo", "[ODB]\nYeah, youknowhatI'msayin, to you?\nI was in Riker's Island, youknowhatI'msayin?\nHigh impact, youknowhatI'msayin?\nThey they had me pickin cigarettes (SLAM!)\nA thousand cigarettes up off the floor\nDoin push-ups, all that bullshhhh\nYo I'm tryin to (SLAM!)\nI just wanna give a shout, to all the jails everywhere\nCause you know, I know it's a game (Just SLAM!)\nYaknowhatI'msayin?  The government got a game\nGet all the brothers locked down\n(This one, is a hit, it's called SLAM!)\nBut it ain't like that baby!\nKnahmsayin?  I'm not havin it no more\n(Doin it at the park)\nMe personally, knowhatI'msayin?\n(Doin it LAH-Lah-LAHHH!)\nYo, check this out\n(Ohhh yeah, rock the park)\nThis is the jam called SLAMMMMM\n(Ohhh yeah, rock the park)\n\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)\n\nYo, yo bust thissssssss! Yo white boy don't you got a shadow?\nBlack boy don't you got teeth, what the fuck is the beef?\nSome tame buck nigga in the movie, said a little poetry\nHad some problems with the cops, cause his man gun was hot\nAnd of course, fuck that red tape\n(*gavel pounds three times* \"Guilty!!\")\n\n[Coolio]\nI gotta spit at y'all, they runnin some shit on y'all\nOr should I say yes, cause I'm still on the bus\nSo y'all is really me it's just, y'all is already you\nI hereby do declare, all of us is we\nQuit your silly-ass games and, petty-ass dirts see and put\nGreed to the side for good\nFor your heart it's like a court minus time divide\n\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)\n(A-dubba-dubba-dah!)\n\n[Coolio]\nWe live in a society created by an empire\nThat's based on terror, welcome to the One World Era\nA complete interruption to your lil' paultry ass life\nThat you thought you was livin, and what you been given\nNo more Benzes to roll in, fat-ass stacks of money\nCause ain't no such thing as money\nI bet y'all niggas think it's funny\nPut your money where your mouth or where your mouth used to be\nCause ain't shit on this planet, or in this life for free\nWe gonna do it like Osirus and The Warriors in the dark\nGet your niggas and my niggas and some mo' niggas\nAnd have a meeting in the park!\n\n[ODB]\nLost in the sauce, cause you think you got force\nGet this across, there is only ONE boss\nA NUH got it locked down, while NUH be dumbfound\nAnd got alllll on the surrounnnnnd!!\nWho you think own the ships planes and trains?\nNow you got a white man's name!\n\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)\n\n[C]\tYo whassup son?\n[O]\tYo whaSSUP lOC?\n[C]\tYou ready to heat it up at make this system smoke?\n[O]\tBLAOW, BLAOW, BLAOW\n\n[Coolio]\nWe want knowledge, we want wisdom\nY'all want bars, Cristal and bitches\n\n[ODB]\nWe want off shore bank accounts, property\nWe wanna show you how to do it, properly\n\n[Coolio]\nFuck your friends, stack your ends\nThe next time somebody tryin to run game, then pretend\nThat they runnin game then, run game back and\n\n[O]\tYo let him let him roll off in his Cadillac\n[C]\tCause real players play the back\n[O]\tOld schooL FLAVA!!!!\n\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)\n(Doin it at the park)\n(Doin it LAH-Lah-LAHHH!)\n(Ohhh yeah, rock the park)\n(Ohhh yeah, rock the park)", "[Ol' Dirty Bastard]\nTwo steps from the border line\nAnything closer will kiss the nine\nThink I'm out the game? You out of your mind\nCuz I stay on track, like transit line (FIRE!)\nKeep it nappy or braided up\nDirty in the cockpit, blazin' up (FIRE!)\nStop frontin' when you made it up\nTellin' all my hoes, you can't spray it up (FIRE!)\nHah, huggin' nuts like tighty whites\nStill trickin' on hoes like Heidi Fleiss (FIRE!)\nYou know why niggas don't give you much respect\nCuz they seen you gettin' slapped with the empty gat (FIRE!)\nKnow Dirt, like bow know death\nWhen I'm huntin' down, birds in rap (FIRE!)\nHate Dog, cuz I ate your cat\nAnd you can eat my ass and have a coke with that (FIRE!)\nUse a spoon, unless you want a fork\nPull my dick out, watch the room get dark (FIRE!)\nStay high with the zombie walk\nGotta sit my ass down, like Rosa Parks\n\n[Chorus: sample (Ol' Dirty Bastard)]\nFIRE, FIRE-FIRE, FIRE (Let me hear it)\nFIRE, FIRE-FIRE, FIRE (Ohhhhhhhhh)\nFIRE, FIRE-FIRE, FIRE (Let me hear it, ohhhhhhhhhhh)\n[Ol' Dirty Bastard]\nWhat can make a hoe, look more cuter\nBut, Hennessey shots, and smoke more Buddha (FIRE!)\nNow you hungry, wanna eat right through her\nBut you better first track for a noter (FIRE!)\nLike does she have a best friend, or a daughter\nHas she ever tried fuckin' under water (FIRE!)\nMisinterpetate, let me break it down\nTwo pulls make the your merry go round (FIRE!)\nTouch your toes, show me that rose\nButt naked, in a Wu-Tang pose (FIRE!)\nWide open, girl, everything goes\nReal freaky, when you powder that nose\n\n[Chorus]", "[Ol' Dirty Bastard]\nAll I wanna be is free with mad fucking money, man\nBe free with mad money\nYou never be free fucking with these white boys", "(Ol Dirty Bastard is doing a Martin Lawrence comedy skit from Raw)\n(this is going on in the background during the Intro and part\nOf the first verse)\n\nYou know God damn well I don't smoke this shit Meth\n[coughing] Know damn well I don't smoke this sheyit\nKnow damn well!\nI remember when we used to go down to the creek\nMember when we used to go down to the creek?\nAnd used to dip your head in the water?\nEverybody thought you had it in you, you know\nYou used to jump out the water\nThe water used to glisten alllllll over your bohhhhhhdy\nWhat? I said the water used to glisten alllllll over your bohhhhhhdy\n\n[Intro: Ol Dirty Bastard]\n\nClean out my vocals\nYeah, I said YEAH\nI said zuckazuhzuhzuh, zuckazuhzuh\n[more nonsense noises]\nChkccha ckchcka Brooklyn, zucka Zoo\nC'mon baby baby, baby, baby\nBaby, baby, baby, c'mon!\n\n[Verse One:]\n\nSuperlogical this, superlogical that\nI detect a nigga dialect by the way he rap\nI elect myself President MC\nMy career so intelligent, unique physique\nThen with mathematics, not democratic\nStatic, topic, Asiatic\nZssshuh, them unique, never leak, brlaharl...\nBring it on back\n\nSuperlogical this, superlogical that\nI detect your dialect by the way you rappp!\nI elect myself President MC\nMy career so intelligent, unique physique\nDoin mathematics and I'm not democratci\nNo static, topic, I'm Asiatic\nSee, I'm Unique, never... blarhalal...\n\n[Verse Two: Method Man, Ol Dirty Bastard]\n\nCrazy, lurkin in the shadows, I'm shady, sheisty\nGet your weight up, don't take me lightly\nBlasted, dirty to the grain I be stained with the madness\nIt's the Meth-Tical with the Bastard\n\nMZA MZA my name is the Ol Dirty Bas\nMy gammmmme, to kick your ass\nDnnah duh dnnh dnnh duh duh!\nDnnah dnh duh duh duh dahhhhhh!\n\nFlip and relax, take an Ex-Lax, I'm shittin\nOn the industry that was frontin now they missin\nWhat everybody else is gettin\nCuz they wasn't representin the real...\n\n...appeal, like me and, old time\nWhen it comes to the microphone who killed the swine?\nBe the original G\nDo the rhymin on time and in the place to be\n\n[Interlude: Old Dirty Bastard, Method Man]\n\nYou are now in my trance\nYou are getting sleeeeeepyyyyyy\nYou are now getting sleeeepyyyyy\nAnd sleeeeppieeerrrrr\nAnd sleepy, and sleepy\n\n[Verse Three: Method Man]\n\nThis one here's for my people, my people\nEnter the 36 chambers, the sequel\nPart two, for me and the cipher troop\nWith the Teflon lyrics that you can't get through\nWith the twenty-two automatic rap you pack, what?\nYou ain't hittin with that wack shit you kickin\nStraight from the beginning, of the game\nAll the way to the ninth inning, I bring the pain\nDark like the midnight train on the track by the RZA\nDiesel like Arnold Schwarzanegger\n\n[Outro: Ol Dirty Bastard]\n\nThe hardware, choose the hardware\nAsk you a question, test the Ason\nExtra extra, read the drama and thennn another one\nWhich you intrigue, do your rap fatigue in the...\nOhhhh....\nHere I go, aauhhh\nYeahhh...\n(shit that makes me high)", "[Ol' Dirty Bastard]\nAlright, my man, that's cool?\n\n[Man]\nYup! Sorry I didn't recognize you when you first came in, man\n\n[Ol' Dirty Bastard]\nMan, that's alright, man, shit, man, aight\nAight, thanks alot man, you know\nYou got the young white folks, man\nThey be all cute and shit\nLittle cute white folks, huh?\nLittle cute devils", "[Female]\nYeah, let's coming over here, as the Queen Latifah get\n\n[Ol' Dirty Bastard]\nHuh?\n\n[Female]\nYa'll wanna come over here still after the Queen Latifah episode?\n\n[Ol' Dirty Bastard]\nWhat happened?\n\n[Female]\nYou didn't hear about what happened to Queen Latifah right, on the corner?\n\n[Ol' Dirty Bastard]\nNah, what happened?\n\n[Female]\nShe got highjacked\n\n[Ol' Dirty Bastard]\nHighjacked? What you mean somebody *car driving away noise*\n\n[Female]\nShe told me they took her -- they took her BMW\nCarjacked, brother\n\n[Ol' Dirty Bastard]\nShit word? I need some action in my life\nRight now\nI ain't got nothing but nobody to highjack\nWhat you gonna take, my beeper?", "[Ol' Dirty Bastard]\nJust be all -- I be hungry, man\nI just can't take this man\nOh my God, I need some food!\nChill baby -- I wish this muthafucking black nigga\nWould shut the hell up\nI love you too, darling", "[Intro]\nShit. Word. I bust that nigga ass right now\nAin’t no–none of them niggas can’t fuck with me\nWhat? Nigga you could never fuck with me, my nigga\nI’ll fuck you up right now! What?! What?! What?!\nBust your motherfucking ass boy!\nI ain't no motherfucking joke, you know who you talking to?\n(Word up, bust that nigga ass, word up)\nOl' Dirty Bastard, you know what I’m sayin'?\nI fuck you up right now\nYeah! What?! What?! What?!\n\n[Verse]\nI'm the one-man army, Ason\nI never been tooken out, I keep MC's looking out\nI drop science like girls be dropping babies\nEnough to make a nigga go crazy\nIn the G-Building, taking all types of medicines\nYour ass thought you were better than\nA-son, I keep planets in orbit\nWhile I be coming with deeper and more shit\nEnough to make you break and shake your ass\nAs I create rhymes good as a Tastykake makes\nThis style, I'm mastered in\nNiggas catching headaches, what? What? You need Aspirin?\nThis type of pain, you couldn't even kill with Midol\nFuck around, get sprayed with Lysol\nIn your face like a can of mace, baby\nIs it burning? Well, fuck it, now you're learning\nHow I don't even like your motherfucking profile\nGive me my fucking shit: CH-CH-BLAOW!\nLast seen and heard, no-one knows\nYou forget: niggas be quiet as kept\nNow you know nothing\nBefore you knew a whole fucking lot\nYour ass don't wanna get shot\nA lot of MC's came to my showdown\nAnd watched me put your fucking ass low down\nAs you can go, below zero\nWithout a doubt I never been tooken out\nBy a nigga, who couldn't figure\nYo by a nigga, who couldn't figure\nYo by a nigga, who couldn't figure (Brooklyn Zoo)\nHow to pull a fucking gun trigger\nI said \"Get the fuck outta here!\"\nNigga wanna get too close, to the utmost\nBut I got stacks that'll attack any wack host\nIntroducing - yo fuck that nigga's name\nMy Hip Hop drops on your head like rain\nAnd when it rains it pours, cause my rhymes hardcore\nThat's why I give you more of the raw\nTalent that I got will r-iz-ock the spot\nMCs I'll be burning, burning hot\nWhoa-hoa-hoa! Let me like slow up with the flow\nIf I move too quick, oh, you just won't know\nI'm homicidal when you enter the target\nNigga get up, act like a pig trying to hog shit\nSo I take yo ass out quick\nThe mics, I've had it my nigga, you can suck my dick\nIf you wanna step to my motherfucking rep\nCH-CH-BLOAW! BLOAW! BLOAW! Blown to death\nYou got shot 'cause you knock knock knock\n\"Who's there?\" Another motherfucking hardrock\nSlacking on your macking 'cause raw's what you lack\nYou wanna react? Bring it on back\nI rock the microphone, kill the M.I.C\nGet happy as I wanna be\n\n[Outro]\nNigga!\nDon't ever fuck with the Ol' Dirty Bastard\nI fuck a nigga up any time, any day, any motherfucking way\nGive it to ya, nigga\nTake ya fucking ass home where you belong\nFuck around, get physical on your shit right motherfucking now\nKnow what I'm saying?", "[Intro: Mickey]\nOh, .... you can't even sing\n\n\n\nShimmy Shimmy Ya Shimmy yam shimmy yay\n\n\n\n\n\n\nOoh baby i like it rawww\nYeah baby i like it rawww\nOooh baby i like it rawww\nYeah baby i like it rawww\n\n\n\n\n\n\nOoh baby i like it rawww\nYeah baby i like it rawww\nOoh baby i like it rawww\nYeah baby i like it rawww", "[ODB]\n\nThe terminology and psychology\nYou still expect me to accept?\nDo what I say of the (TDK?)\nWith the button on record and the other on play\nThus I press pause for a serious cause\nTo respect an intellect with the gradifying\nNow that already let the music begin\nAs I detake what I wrote with my bulletpoint\nTo the time that I spent, the money that I lend\nRap records when I'm just about 8 cents\nThen it came a new way to getting paid\nThey said rhyming on the mic is the number one trait\nWhen the brother get the feeling that he wanna play cool\nThe discouberrated, diabolical fool, all flesh MC\nGo play in the mud, you know ... 20, if you ... (a)nother century\n... modern day is a chad\nIs a cannibal, human or an underground dweller\nChad broke loose from the goddamn cellar\nDope fiend addict why you walk, why you roam?\nWith the aquired, immune, deficiency sydrome\nWhen the MC's came to live out their name\nMost rock the rhymes that was all the same\nBut when I elevated the mass of the time\nYou stimulated from the high force rhyme\nYou got shocked because you knew you were (?)\nLike the sucker MC, from of my block\nTalking to you, you MC crew\nWhen I speak about wonder, speaking bout two\nSpeaking bout the, who swear they can rhyme\nYou wanna battle the god? you lose everytime\nRetake the port inside my box, just b... of my doorcells\nAnd it did not rock!\nWell it's not my style or your profile\nIts just the (?) the time that rocks more while\nSee, I be the motivating, dominating supreme force\nThe cultivating, activating cream and sauce\nThe wise educated and I'm gonna be, you and I, to the (Q.U.E?)\n\nYo Peace, Dirt Bas out kid", "[Intro: Masta Killa]\nMasta and the Killa is the name\n\n\n[record scratching] Suuuuuuu!\n[Chorus: Ol' Dirty Bastard (Mickey Mouse)]\nShimmy Shimmy Ya Shimmy yam shimmy yay\nShimmy Shimmy Ya Shimmy yam shimmy yay\nShi-shi-shimmy shimmy ya shimmy yam shimmy yay\n\nShimmy Shimmy Ya Shimmy yam shimmy yay\nShimmy Shimmy Ya Shimmy yam shimmy yay\nShi-shi-shimmy shimmy ya shimmy yam shimmy yay\n\nShimmy Shimmy Ya Shimmy yam shimmy yay\nShimmy Shimmy Ya Shimmy yam shimmy yay\nShi-shi-shimmy shimmy ya shimmy yam shimmy yay\n\n\n[Wu-Tang Clan]\nWu-Tang, Wu-Tang, Wu-Tang, Wu-Tang, Wu-Tang!! (X4)", "Ooh baby i like it rawww\nYeah baby i like it raw\n\n\nShimmy Shimmy Ya Shimmy yam shimmy yay", "Shi  shimmy shimmy ya\nShi-shi-shimmy shimmy ya"]}