{"Quavo": ["[Intro]\nWhat's happenin', Uncle G?\nHow you doin' this mornin'?\nGood mornin', brother\nWhat's happenin'?\nGood mornin', Uncle George\nWhat is y'all so happy about?\nI mean, you're walkin' through here grinnin'\nYou're just grinnin', grinnin'\nLike you a new man or somethin'\nNah, Rashad's a New-New man\nHe got some cuddy last night\nShut up, mm-mm\nYou got some booty in this house last night?\nMm-mm\nI told you I don't want no company in my house\nMmm\nI told you that I don't want none of them lil fast girls in my house\nMm-hmm\nNo females in my house, that's the rule\nThere's a one-bull rule in effect\nI ain't gon' lie, I got some cuddy last night\nStop lyin'\nYou ain't got no cuddy\nCandy blinds, yeah\nMurda on the beat so it's not nice\n\n[Verse]\nRaise the prices, raise it two times (Two)\nNo cap, these girls be the new vibe (New)\nWe don't like suicide so the doors fly (Doors)\nShe said I hurt her feelings 52 times (Two)\nCall up queen (Nicki)\nThe queen can't flex on a young bull (Flex)\nMade her scream (Scream)\nChanel, I bought her two of 'em\nYou can check IG (Hey, IG)\n'Cause when she post, it go up (Go)\nIs she for keeps? (For keeps)\nOnly if she come with two of 'em (Two)\nYeah, I be snipin' (Snipe, snipe)\nI can't be wifin' (Nah, no wife)\nI know she feisty (Feisty, feisty)\nI'm Huncho Bison (Huncho Bison)\nShe treat me righteous (Righteous, righteous)\nNigga don't mean to brag (No)\nI be tryin' to keep it cool, but I sniped yo' ass (Swear)\nNo \"FEFE,\" I skeet-skeet (\"FEFE\") on yo' face ass (Face ass, brrt-brrt)\nCalled up Huncho to come tap that ass (Swear)\nPull up on you, autotune when I grip that ass (Skeet, skeet)\nPullin' on yo' weave, 'cross the room when I pipe that ass (Pipe it)\nI see a queen on a tree-tree (What you see?)\nShe like the ride new boy tree-tree (Yeah, new boy)\nI see a queen on the tree-tree (What you see?)\nShe like the ride that boy tree-tree (Yeah, new boy)\nNicki (Nicki), do you love me? (Please)\nWhy you crying? (Why?)\nShe don't wanna be a queen unless she got me (Queen)\nShe don't wanna be on scene unless we married (On scene)\nNo cap (No cap, yeah), for real (Hey)\nTea in my double cup, it can't spill (Tea)\nLeft the fire on the dresser at the hotel (Fye, yeah)\nDrunk as hell, made her cook some RO-TEL (Whip it, whip it)\nIf the truth hurt, then I won't tell (Truth)\n\n[Chorus]\nBounce that ass, Nicki (Bounce that ass)\nBounce that ass, Nicki (Bounce that ass)\nShake it like Iggy (Iggy)\nShake it like Iggy (She bad)\nIf I hurt your feelings (Feelings)\nI am truly sorry (Sorry, woo)\nI'm straight out the jungle (Hey), no safari (No)\nBounce that ass, Nicki (Bounce that ass)\nBounce that ass, Nicki (Bounce that ass)\nShake it like Iggy (Iggy)\nShake it like Iggy (She bad)\nWoo, if I hurt your feelings, I am truly sorry (Sorry, woo)\nStraight out the jungle, no safari\n\n[Outro]\nOoh, yeah\n(Woo, woo, woo, woo\nWoo, woo, woo, woo)\nDon't try to play me\n(Woo, woo, woo, woo)\nCannot play that Huncho (Skrrt)\n(Woo, woo, ha-ha-ha-ha, ad-libs)\nJust don't play that Huncho, Huncho\n(Smash, drip)\nHuncho, that Huncho (Ad-libs)\nThat Huncho, that Huncho (Smash, drip)\nHuncho, that Huncho (Drip, drip)\nHuncho, that Huncho (Woo, woo, woo, yeah)\nThis all fun and games, right?\n(Huncho, that Huncho)\nSince I just dropped this\nI'm gon' go get you a iced out chain, baby\n(Huncho, that Huncho)\nIced out Chun Li, you know how we do it\n(Huncho, that cha-cha-cha, hey)\nHey Elliott (Bling, bling, bling)\n(Huncho, that cha-cha-cha, hey)\nGet her that iced out chung-chung  (Bling, bling, blaow)\n(Chancho that chancho)\n(Ching-chong, blaow)\n(Huncho, that chancho)\nPut the tab on Huncho\n(Huncho, this that Huncho)\nWoo", "[Intro]\nTsunami warning\n\n[Chorus: Quavo]\nYou the one that's tryna keep your business low-key, huh? (huh?)\nYou the one that's having your main nigga, can't get no sleep, huh? (Sleep, hey)\nYou the one who walk around on fleek, huh? (Fleek)\nYou the one that started from the bottom but you've reached your peak, huh? (Peak, peak)\nYou taught her how to swallow with no teeth, huh?\nMake them dollars out the street, huh? (Cash)\nBaddest bitch you ever seen, huh? (Bad)\nYou the one who split the guap with your team, huh? (Split it)\nYou the one who drink a lotta codeine, huh? (Drank)\nAyy, ayy I like this shit, this shit take me back to the '99, 2000\n\n[Verse 1: Drake]\nAyy, ayy, I got shorties out tryna find me, that look\nSlipping through the cracks 'cause I'm slimy, I slipped\nChain wetter than a river you could cry me\nQuick to Timberlake a bitch, now she despise me, I swear\nI just let the money energize me\nNigga, you was in your 20s in the '90s, yeah\nI just order Phantoms off the website\nThey ask how I want the shit, I say, \"Surprise me\"\nAyy, yeah, look\nShe wanna hang when the album drop, that's timely\nAyy, got a present for my oppers, word to Smiley\nI know her man, gotta move her from beside me I swear\n\n[Verse 2: Quavo]\nShe got ice in all her veins (All the ice)\nShe gon' change worrying about the wrong things (Wrong thing)\nIf the paparazzi catch her, she'll be famous (Flash)\nGot to move low-key with the gangsters\nDo what you do girl, flex with your gang (Flex)\nLet's call the boys up (BM) Lambos gon' swing (Skrrt)\nWho that making noise? (Who?) Gang-Gang (Who?)\nGot a new crib, with a shooting range, get a professional aim (pow)\nYou was up, now you fell off (Hey)\nThen you pull up, all cap better knock it off (Cap)\nI might get caught with my side bitch (Gang)\n'Cause I put my main bitch in the cockpit\n\n[Bridge: Quavo]\nBad bitches and they lit (Woo)\nI just told 'em, \"Flip the switch\" (Flip it)\nGang 'round, with the shits (Switch it)\nI just told 'em, \"Flip the switch\" (Hey)\n(Flip it, flip it, flip it, flip it)\nSwitch it\n(Flip it, flip it, flip it, flip it)\nFlip that ho switch\n(Flip it!)\n\n[Chorus: Quavo]\nYou the one that's tryna keep your business low-key, huh? (Huh?)\nYou the one that's having your main nigga, can't get no sleep, huh? (Sleep, hey)\nYou the one who walk around on fleek, huh? (Fleek)\nYou the one that started from the bottom but you reached your peak, huh? (Peak, peak)\nYou taught her how to swallow with no teeth, huh?\nMake them dollars out the street, huh? (Cash)\nBaddest bitch you ever seen, huh? (Bad)\nYou the one who split the guap with your team, huh? (Split it)\nYou the one who drink a lotta codeine, huh? (Drank)", "[Intro]\nM-M-M-Murda\nWork, work\n\n[Chorus]\nWorkin' me (Work), she workin' me (Work, work)\nUrgin' me (Urge), it be urgin' me (Yeah, yeah)\nJust let up the top and close the curtain, please (Skrrt, skrrt)\nI decided to go up like Major League (Goin' up)\nShe just popped the Perky just like pork and beans (Perky)\nShe just popped the Perky, say I hurt her knees (Perky)\nShe hurtin' me, wrist strong, Hercules (Hurtin' me)\n\n[Verse 1]\nTwo cups, Martell pour it neat (Two)\nServe a fiend, fuck a bitch, then go to sleep (Serve, serve)\nI need to get me a mil' before we leave (Get me)\nNo key pull up, remember me (Skrrt, skrrt)\n'Member me, oh, 'member me (Hey)\nTake 'em way back, Lil Jon energy (Lil Jon)\nPockets real fat, Cashville ten a key (Young Buck)\nFire the blunt (Woo), it done died off, yeah\nRide off (Ride), bitches ride off, yeah (Skrrt)\nYour boss, he done died off, yeah (Skrrt)\nI just cut the dirty stove and powered off, yeah (Hey)\n\n[Chorus]\nWorkin' me (Work), she workin' me (Work)\nUrgin' me (Urge), it be urgin' me (Work)\nJust let up the top and close the curtain, please (Skrrt, skrrt)\nI decided to go up like Major League (Goin' up)\nShe just popped the Perky just like pork and beans (Perky)\nShe just popped the Perky, say I hurt her knees (Perky)\nShe hurtin' me, wrist strong, Hercules (Hurtin' me)\nShe hurtin' me, wrist strong, Hercules (Hercules)\n\n[Verse 2]\nI decided to go up, Major League (Goin' up)\nCall the plug, tell him bring a key (Bring the key)\nThen retire, with the Bucks, JT (JT)\nBought a coupe and told a rapper, \"Race me\" (Skrrt, skrrt)\nRemember when they used to curve me (Swoop)\nNow they wanna represent my earnings (Represent it)\nIf you want smoke, smoke alarm me (Smoke, smoke)\nBy yourself, no, bring your army (Come and get it)\nI'm havin' shit that gon' extinct your whole family (Extinct)\nI put 'em out, I feel like he done broke the leaves (Ayy, ayy)\nI put the work inside the wall behind the scene (Work, work)\nShe attractin' all the dogs, but work for me (Hrr, work)\n\n[Chorus]\nWorkin' me (Work), she workin' me (Work, work)\nUrgin' me (Urge), it be urgin' me (Yeah, yeah)\nJust let up the top and close the curtain, please (Skrrt, skrrt)\nI decided to go up like Major League (Goin' up)\nShe just popped the Perky just like pork and beans (Perky)\nShe just popped the Perky, say I hurt her knees (Perky)\nShe hurtin' me, wrist strong, Hercules (Hurtin' me)\nShe hurtin' me, wrist strong, Hercules (Whoop)", "[Intro: Travis Scott & Quavo]\nThis nigga, man\nYah, yahhh\nOh, uh-oh, yeah, yeah\nWoah, woah, woah, woah, woah, woah\nYah, yuh-yuh\nAyy\n\n[Chorus: Travis Scott & Quavo]\nShe like it (Like), I'm swipin' (Swipe)\nIce bitin' (Bite), she dykin' (Dyke), yeah\nI had to come right back like double back and rerun\nI had to come right back like double back and rerun\nShe like it (She like), I'm swipin' (Swipe)\nIce bitin' (Blaow), she dykin' (Dyke), yeah, yeah\nI had to come right back like double back and rerun (Yeah, uh)\nI had to come right back like double back and rerun (Yeah, uh)\n\n[Verse: Travis Scott & Quavo]\nYeah, go ahead spend it, I'm live in it (Yeah)\nYeah, my whip came with curtains, I don't need it tinted (Ooh)\nYeah, when it come to I, she turn so independent (Ooh-ooh)\nYeah, when it comes to this D, she turn so damn dependent (Straight up, ooh-ooh)\nNight times, summertime cold\nYou really wanna say yes, but you sayin' no (No)\nI'm on top my game like a Kangol (Yeah)\nI let her drive the Range, then she wreck the Rolls (Rolls)\nYeah, ice-ice biting Cartier Bangles (Bitin')\nYeah, she let me smash her friends long as the chain froze (Alright)\nYeah, ain't been here 15 minutes, why she changed clothes? (It's lit)\nShe ride with me through the city while we swang doors (Straight up)\nSlide through the hood, pop up on the nawf (Yeah, yeah)\nYou know everything good when you with the 'Cho (Yeah, yeah)\nChosen, outspoken (Yah), arrogant, that's on both ends (Alright)\nGood vibes, givin' off good vibes (Good vibes)\nOne time, can you kick it one time? (One time)\n\n[Chorus: Travis Scott & Quavo]\nShe like it (Yeah, like), I'm swipin' (Yeah, swipe, yeah)\nIce bitin' (Bite), she dykin' (Dyke), yeah\nI had to come right back like double back and rerun\nI had to come right back like double back and rerun\nShe like it (She like), I'm swipin' (Swipe)\nIce bitin' (Blaow), she dykin' (Dyke), yeah, yeah\nI had to come right back like double back and rerun (Yeah, uh)\nI had to come right back like double back and rerun (Yeah, uh)\n\n[Interlude: Travis Scott]\nI think one of us is inclined to\nYou, you didn't come the second night, I was here\nNo, I got too fucked up the first night\nFor real\n\n[Break: Travis Scott]\nLink up, come witness\nCome link up, we can bring your bitches\nBring your drink up, we can do some business\nWhen the min up, we can run a mission\nYeah, link up, come witness\nCome link up, you can bring your bitches\nWe can drink; we can drink up\nYeah, link up, yeah, link up\nHit my beeper, I'ma hit the creep up\nJust to see us, I'ma need a few dubs\nIn the penthouse, you gon' get the reaper\nOh my, I swear, on the v-nuh\nOn a v-nuh, I can do no e-nuh\nCalled up Nina, rollin' on my d-nuh\nIke and Tina, way I beat the, beat the, beat the, beat the\n\n[Chorus: Travis Scott & Quavo]\nShe like it (Like), I'm swipin' (Swipe)\nIce bitin' (Bite), she dykin' (Dyke), yeah\nI had to come right back like double back and rerun\nI had to come right back like double back and rerun\nShe like it (She like), I'm swipin' (Swipe)\nIce bitin' (Blaow), she dykin' (Dyke), yeah, yeah\nI had to come right back like double back and rerun (Yeah, uh)\nI had to come right back like double back and rerun (Yeah, uh)", "[Chorus: Quavo]\nYeah, she lookin' like a movie, yeah (Woo, bad, yeah)\nI think that I'ma choose her, yeah (Choose her, hoo, yeah)\nBack that ass up, no Juvie, yeah (Juvie, hoo, yeah)\nThrow them racks, go stupid, yeah (Racks, stupid, yeah)\nSqueeze my shot like Uzis, yeah (Shoot, Uzi, yeah)\nWhen I slide on her, yeah (Skrrt, slide, yeah)\nHeard she wet, Jacuzzi, yeah (Splash, wet, yeah)\nMake me go, make me go, make me go lose it (Go, lose it)\n\n[Verse 1: Quavo]\nBought her Chanel, surprise on her, yeah (Chanel, yeah)\nShe so bad, got girls and guys on her (Yeah)\nMake me wanna pull out the phone and go live on her, yeah (Yeah)\nBut I snap back and close my eyes on her (Damn, yeah)\nBad bitch, she bring a team of girls (Damn, yeah)\nThey all came back after the club (Woo, yeah)\nEvery city I go, they show me love (Show, yeah)\nThat's because we (What?) real thugs (Yeah)\nBet that ice make her drown in the tub (Ice)\nSay she got that bag, told her put down on the drugs (Bag)\nThat the type of shit that make your nigga call in (Brr, woo)\nThat the type of shit that make your nigga fall in love (Woo)\n\n[Verse 2: Lil Baby]\nPull up, I'm the life of the party\n4x4 truck sittin' on Forgis\n488 with a 8, that's Yachty\nLime Lamborghini sittin' pretty, that's Cardi\nBlue Lamborghini Diablo, gon' Offset's\nHavin' talks in the Wraith, 'bout to take off\nMe and Pee in the Dawn havin' boss talks\nGot the game from, bruh, that's where I walk\nWhat am I gonna do when all these girls\nIn the city goin' crazy over me?\nTake the tints off the car so they can see me\nSlick, intimidatin', niggas wanna be me\nPJ when we creepin', they won't ever see me\nAin't too into cameras, but they got to see me\nDiamonds on my fingers, I'm a superstar\nAll in there like sneakin' with a superstar\nHit me if you want, I'm not gonna make a call\nMarlo's still trappin' in them trap house\nCartier, solitaire, golf ball\nReal big dog, I won't fuck with y'all\nMade it to the charts, they know who I am\nShout out to my fans, really fuck with y'all\nInternet beef, I won't get involved\nIf it's real problems, then it's gettin' solved\nYeah, yeah\n\n[Chorus: Quavo]\nYeah, she lookin' like a movie, yeah (Woo, bad, yeah)\nI think that I'ma choose her, yeah (Choose her, hoo, yeah)\nBack that ass up, no Juvie, yeah (Juvie, hoo, yeah)\nThrow them racks, go stupid, yeah (Racks, stupid, yeah)\nSqueeze my shot like Uzis, yeah (Shoot, Uzi, yeah)\nWhen I slide on her, yeah (Skrrt, slide, yeah)\nHeard she wet, Jacuzzi, yeah (Splash, wet, yeah)\nMake me go, make me go, make me go lose it\n\n[Verse 3: Quavo]\nWhen I say (Lose it)\nShe gonna make a nigga lose it\nI'm talkin' big money\nBig money, thumb throughin' it (Hey)\nNot through with it (Nah, nah)\nNot through with it (Nah)\nShe all on the phone with her last nigga\nSay that pussy is mine, he losin' it (Brrt, yeah)\nShe poppin' it, I'm ownin' it (Yeah)\nShe droppin' it, it's stoppin' it (Stop), lose it (Yeah)\nOut of control, she movin' it (Ooh, yeah)\nIt's movin' (Woo)\nIt's a movie (Woo)\nShe walkin' around in Nike leggings (Ooh, yeah)\nJust doin' it (Go!)\nDon't get involved with her besties, they messy\nSpent a fifty ball on her neckpiece, she flexing\nI don't give no calls, I just hit her with the texting\nEmoji all drippin', leakin' waterfalls, yeah", "[Intro]\nDun Deal on the track\n\n[Verse 1]\nIs you with me or against me? (With me or against me?)\nI'm a OG now, so you need me (OG, I'm a OG)\nThink you poppin' Xanax bars, but it's Fentanyl\n(No-no bars, it's Fentanyl)\nThink you're living life like rockstars but you're dead now (Yeah)\nLet me put you under my wing, I can teach you one thing (Let me put you under my wing)\nLet me put you under my wing, I can show you it ain't all about a chain (Ayy, ayy)\n\n[Chorus]\nI'ma be your big bro (Big bro), I'ma be your big bro (Big bro)\nI'ma be your big bro (Big bro), I'ma be your big bro (Big bro)\nI'ma be your big bro (Big bro), say we all need a big bro (All need a big bro)\nAll need a big bro (All need a big bro), I'ma be your big bro (Yeah)\n\n[Verse 2]\nShow you how to get a ring on that championship team\nWhen you get a ring, it's a championship\nTeach 'em how to get them Ps on the back of RVs\nWhen you get 'cross seas, it's a championship\nClappin' on things like I'm in New Orleans\nWhen I hit 'em hard I be striking them\nCalling all gangs 'cause I'm right with them\nYou too young to be hanging out all night with them\n\n[Refrain]\nBrrrrrrr (Ahh)\nTsh, it's a young nigga calling my phone (Ahh)\nWhat's happening?\nHey big bro, them niggas just got me for my chain (Ahh)\nWhat?\nThem niggas just set me up big brother\nThey just got me for my chain (Ahh)\nAw man (Ahh)\nDamn (Ahh)\nAy, ay, calm down, calm down, we gon' get it back (Ahh)\nJust pull up on me, tell me what happened (Ahh)\n\n[Verse 3]\nBig bro ridin' with the tool tight (Big bro)\nBig bro straight, he live the cool life (Big bro)\nBeen through the struggle played the rules right (Big bro)\nAin't got nothing to prove, big bro got nine stripes (Big bro)\nYou out here tryna live your broke life (You, you, ayy)\nYou out here tryna live that GOAT life (You, you, ayy)\nYou gonna fuck around, take your life (You, you)\nInstagram and guns just don't go right (No, no, ayy)\n\n[Chorus]\nI'ma be your big bro (Big bro), I'ma be your big bro (Big bro)\nI'ma be your big bro (Big bro), I'ma be your big bro (Big bro)\nI'ma be your big bro (Big bro), say we all need a big bro (All need a big bro)\nAll need a big bro (All need a big bro), I'ma be your big bro (Yeah)", "[Intro: Lil Yachty]\n30, you a motherfucking fool, nigga\n\n[Verse 1]\nI was twenty-two when I first dropped (Deuce, deuce)\nMost influential dude when I first dropped (Uh, true story)\nThe bando named the new spot (Bando)\nWhere them boys from? They ain't from the Hot (Nawf)\nHotlanta (Hot), dirty mango Fanta (Mud, hot)\nSwept the game like I'm Huncho MC Hammer (Uh, hammer time)\nWrite my name 'cross the hall of fame banner (Write it, write it)\nHit the lights, diamonds flash like a camera (Flip the switch)\nFirst met her in some open-toed sandals (Yeah, hey)\nNow-now her attitude like a candle (She lit, lit)\nThat bag make you wanna up your standards (Get rich, rich)\nWay too fat but she ain't got no manners\nLil' bitch (Uh), hop on the stick, uh (Stick)\nGrant your wish, uh (Woo), came for licks, uh (Licks)\nWe came to hit, uh (Hit), who that bitch? uh (Who?)\nPoppin' shit, uh (Who?), let it rip, uh (Who? Raow)\n\n[Chorus]\nI said this the biggest alley oop (Yeah, alley oop)\nI'm gon' air it out if I shoot (Baow)\nIt's only one mic in the booth (One mic)\nGuess it's my night to tell the truth (Woo, truth, ah)\nWho got the biggest bag in the room? (Bag, bag, ah)\nWho got the biggest bag in the room? (Bag, bag, ah)\nWho got the biggest bag in the room? (Racks, cash, ah)\nWho got the biggest bag in the room? (Yeah, hey, woo, hey)\n\n[Verse 2]\nI lead the way (Yes, leader), follow the wave (Follow the wave, ah, ah)\nI'm not Beyoncé (No, ah, ah), it's bigger than Jay (Hov')\nAll in the studio cookin' up beats (Woo), but I'm not Ye (Yeezy, ah, ah)\nBlessin' the whole industry but they not tryna pay (Pay, ah, ah)\nI wanted like ten mill' (Ayy), that was like last year (Ayy, ah)\nThey lookin' like, \"Oh, for real?\" (Ayy), wait 'til this year (Ayy, ah)\nMake the bank clear (Racks), grandma ain't here (Grandma)\nFuck your fake tears (Fake, ah) Huncho made his (M's)\nAnd I'm humble still (Yeah, yeah, ah)\nNiggas been handlin' business and dough before the deal\n(Rah, handlin' business, ah, ah)\nYou livin' a lie, I only provide the real (Go, go)\nNiggas been drownin' they kidneys before they got rid of the seal (Drownin' my kidneys)\nThinkin' 'bout gettin' a big Bentley and callin' it Shaquille O'Neal (Yeah, Shaquille)\nThinkin' about wrappin' a Benz yellow, Kill Bill (Kill Bill)\nThinkin' that you poppin' but it's Advil (Advil)\nThink your stage hoppin'? It's a standstill (Standstill)\n\n[Outro]\nYeah, I go by the name of Huncho\nQuavo Huncho (30, you a motherfuckin' fool, nigga)\nThe hitman, woah\nHuncho, let's go\nSkrrt, skrrt-skrrt", "[Intro]\nYo\nMigo\n\n[Hook]\nMy bitch is badder than yours\nMy bitch is badder than yours (bad)\nMy bitch is badder than yours (woah)\nMy bitch is badder than yours\nAnd my pockets fatter than yours (fat)\nMy pockets fatter than yours (money!)\nMy pockets fatter than yours (Yeah)\nMy pockets fatter than yours\nMy bitch is badder than yours (bad)\nMy bitch is badder than yours (she beautiful)\nMy bitch is badder than yours\nMy bitch is badder than yours (Woo)\nAnd my pockets fatter than yours (cash)\nMy pockets fatter than yours (enormous)\nMy pockets fatter than yours (Woo)\nMy pockets fatter than yours\n\n[Verse]\nHer pussy wet like ocean (water)\nSuper (splash) soakin'\nMy pockets swollen (money!)\nBust down, Rollie (Rollie)\nPay me 'cause you owe me (Owe me)\nAll your dab is stolen (stolen)\nDon't act like you know me (Huh)\nStay strapped cause I lost my homie\nBig bank, you know it\nMy life, important\nYour life, can't afford it\nHundred bags in the storage (Bags)\nMy bitch bad, she gorgeous (Bad)\nPull up, pull up, Forgis\nPull up, pull up, Forgis (Skrrt)\nI am the plug, cordless\n\n[Hook]\nMy bitch is badder than yours\nMy bitch is badder than yours (Bad)\nMy bitch is badder than yours (Woah)\nMy bitch is badder than yours\nAnd my pockets fatter than yours (fat)\nMy pockets fatter than yours (money!)\nMy pockets fatter than yours (yeah)\nMy pockets fatter than yours\nMy bitch is badder than yours (bad)\nMy bitch is badder than yours (she beautiful)\nMy bitch is badder than yours\nMy bitch is badder than yours (woo)\nAnd my pockets fatter than yours (cash)\nMy pockets fatter than yours (enormous)\nMy pockets fatter than yours (woo)\nMy pockets fatter than yours", "[Intro: Quavo]\n22 million dollars in cash left on the street\nThe boy who picked up the cash? Went on a mission\n(Buddah Bless this beat)\nIt's the most money I've ever felt or touched\nBuddah, Huncho, go!\nWoo, woo, woo, woo (Yeah)\n\n[Chorus: Quavo]\nI brought my niggas to the bank, then we cashed out\nI brought my bitch to the bank, then she passed out (Bitch)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo (That's hard), yes sir\nI do not talk about niggas out my damn mouth (No)\nI pull up on you, pull the trigger, then I air it out (Uh)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo, woo, woo, yes sir\n\n[Post-Chorus: Quavo]\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr (Huncho)\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr\n\n[Verse 1: Quavo]\nYeah, whip it like I can't stand it (Skrrt, skrrt)\nPull up, park and do damage (Skrrt)\nTrap house to a mansion (Trap)\nI put that on my granny (Grandma)\nGrandma, yeah\nGrandma\nLet me see that lighter (Hey)\nFire a nigga ass up, yerr (Yeah)\nMissed his head so I caught him in the ear (Grrrah)\nI should face tattoo a hundred tears (Huh?)\nAll these rappers wanna make disappear (Woo)\nIn the spotlight lookin' like deers (Deer)\n'Specially when we pull up pressin' (Press 'em)\n'Specially when we pull up flexin' (Flexin')\n'Specially when we pull up checkin' (Check 'em)\n150 cash on a necklace (Ice)\nYoung nigga scrapin' them extras (Skrrt)\nMovin' 'em blocks, no Tetris (Blocks)\nWrap 'em a lot like Texas\n\n[Chorus: Quavo]\nI brought my niggas to the bank, then we cashed out\nI brought my bitch to the bank, then she passed out (Bitch)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo (That's hard), yes sir\nI do not talk about niggas out my damn mouth (No)\nI pull up on you, pull the trigger, then I air it out (Uh)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo, woo, woo, yes sir\n\n[Verse 2: 21 Savage]\nLil' mama fine as hell, but she actin' saditty (Stuck up)\nI'm not Will Smith, but I'm tryna get jiggy (Fuck her)\nI can show you how to make a band like Diddy\nGet up out yo' feelings 'fore this choppa make you dance like Shiggy (21)\n6 God just like Drizzy (Skrait up)\nShoot you in the back like Ricky (Skraight up)\nSeats peanut butter like Jiffy (Skraight up)\nY'all niggas rats like Mickey (Skraight up)\nThick women only, I'm picky (On God)\nYellow diamonds on me, they pissy (On God)\nElliot the one did all my ice, but I'm not talkin' bout Missy (On God)\nPick your side (Yeah)\nOne man army, don't need no side (Yeah)\nRolls-Royce truck (Skraight up)\nYour bitch gettin' down on her knees inside (On God)\nY'all gotta put shit together, 'cause your money short, nigga, like Yeezy slides (Broke ass)\nThe Bentley truck came with them, I ain't even have to put no TVs inside\n\n[Chorus: Quavo]\nI brought my niggas to the bank, then we cashed out\nI brought my bitch to the bank, then she passed out (Bitch)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo (That's hard), yes sir\nI do not talk about niggas out my damn mouth (No)\nI pull up on you, pull the trigger, then I air it out (Uh)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo, woo, woo, yes sir\n\n[Post-Chorus: Quavo]\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr\n\n[Verse 3: Quavo]\nYeah, hey! Only God I fear (God)\nIt's ten bricks in the Lear (Bricks)\nDraco came with a mirror (Boom-boom-boom-boom)\nTo watch my back (Uh, uh)\nHeard he got whacked (Huh, huh)\nThe bando back (Uh)\nCookin' from scratch (Uh, whip)\nHeard you the man now\nYou do the dirt with your hands, huh? (Dirt)\nGet it for a lil' bit of change, feel like you pickin' up cans now (Uh)\nSatellites on the plane, think the prezi flyin' (Dope)\nBeep, beep! Fuck it, dead line (Fuck it)\nTook your bitch to the bank, now her head's mine (Toppy)\nIf I ever have kids, inherit my bread line (Oh!)", "[Hook]\nFill up the bank account, overload\nI just touched down on the truckload\nYou an impostor like gusto\nYou an impostor like gusto\nI keep the tool like Rambo\nI'm rich and still trap out the bando\nI'm rich and still trap out the bando\nI'm rich and still trap out the bando\n\n[Bridge]\nPlay with the key like piano\nPlay with the key like a banjo\nPlay with the key like a guitar\nI turned myself to a trapstar\nI turned myself to a trapstar\nI turned myself to a trapstar (aye, trap)\nTrapstar, trapstar, trapstar\n\n[Verse]\nIf you get dope on your hands\nDon't put your hands on your face\nRun it and stack up some bands\nThrow that shit right in your safe\nReal trapper gon' make him a cap everyday\n(real trapper, real trapper, real trapper)\nHit you a jugg or ice out your Rollie, go skate\nI put a cam in my license plate\nWe fuck her you know we don't go out on dates\n(You know we ain't spendin' money on ho's)\nI'd rather go strike on the dice\nI bet it all in one play on the 6 and the 8\nMe and my nigga pull up where your momma lay\nBetter bring the money back to me ándale\nI sprinkle the pot with the baking soda like a funnel cake\n(fuck wit' da' fuck wit' da pope)\nAnd she never seen a boss\nI told her I be's the boss\nAnd she rather wait in the car\nWhen I pull up and serve at your house\nI met the little bitch at the bar\nI told her that I was a trap star\nI'ma be in the hall of fame of trappin'\nI beat up the pot with a crow bar\n\n[Hook]\nFill up the bank account, overload\nI just touched down on the truckload\nYou an impostor like gusto\nYou an impostor like gusto\nI keep the tool like Rambo\nI'm rich and still trap out the bando\nI'm rich and still trap out the bando\nI'm rich and still trap out the bando\n\n[Bridge]\nPlay with the key like piano\nPlay with the key like a banjo\nPlay with the key like a guitar\nI turned myself to a trapstar\nI turned myself to a trapstar\nI turned myself to a trapstar\nTrapstar, trapstar, trapstar", "[Intro]\nAyy\nBuddah Bless this beat\n\n[Chorus]\nLamb talk, uh, yeah, Lamb talk, Lamborghini (Woo)\nLamb talk, uh, yeah, Lamb talk, Lambo (Skrrt)\nLamb talk (Yuh), Lamb talk (Yeah)\nLamb talk, nigga, Lamb talk (Skrrt, Huncho)\n\n[Verse 1]\nBad mouth, agh, rag talk (Rag)\nBring that cash out (Bag), these bitches ass out (Woah)\nWho gon' back down? (Who?) We can't back down (Who?)\nBodybag now (Who?), toe tag now (Who? Rrrah)\nRun through the city, you think that you gettin' it\nYou gon' have to pay your percentage (Hey)\nFuck nigga, we'll come get it (Come get it)\nWe'll come get it with interest (Go)\nNiggas be dissin' on Twitter and still believin' they gon' get a mention (Who?)\nFuck nigga, we'll come get it (Come get it)\nYou know we gon' handle the business\nBow talk (Yeah) this that bow talk (Yeah)\nNiggas tried to hit me but they fouled out (Yeah)\nBirds sing like Whitney and Bobby Brown house (Brrt, yeah)\nQC the new Cash Money Records now (Yeah, go)\nWhip it up, turn it up, 'fraid they don't turn it up\nPipe it up, live it up, give it up, give it up\nType it up, write it up, hit 'em up (Woo), nigga can't fight at us\nHit 'em up, really gon' split 'em up\nDiamond gon', diamond gon', diamond gon' bite\nAdd it up, add it up, nigga, this a million bucks\nBaby girl, eat it up, eat it up, ain't nobody here rich as us, rich as us, uh\n\n[Chorus]\nLamb talk, uh, yeah, Lamb talk, Lamborghini (Woo)\nLamb talk, uh, yeah, Lamb talk, Lambo (Skrrt)\nLamb talk (Lamb, yuh), Lamb talk (Lamb, yeah)\nLamb talk, nigga, Lamb talk (Skrrt, skrrt)\n\n[Verse 2]\nBad bitch, your highness (Your highness)\nTruck, green, sinus (Snotty)\nWelcome to Huncho World, the Migo Gang Dynasty (Dynasty)\nYeah, get your lil' money for my niggas, minus it (Go get it, go get it)\nI promise you lil' niggas don't want the violence (No smoke, no smoke)\nBought me a strap, issue silence (Pshew, pshew, pshew)\nIt's a shame, these young niggas drinkin' Wocky (Wock', Wock')\nAnd Quali (Damn!) Me and Wop were drinkin' Act'\nBack when Follie's (Drank! Guwop!) didn't let me in with that gat\nNow it's (Yeah) jets (Phew), designer clothes, flex (Flex)\nMet Gala carpet (Hoo), Walk it like I talk it (Walk it)\nAll these hoes stalkin' (Stalkin'), shake these haters off me (Shake it)\nYou got a big mouth (Big mouth), like a gator talkin' (Gator)\nThen I take the pot, (Woo) skrrt, skrrt, fork it, skrrt, skrrt, skrrt\nGumbo, like I'm from New Orleans (Skrrt, skrrt)\nLil' bitch said she hate me, fuck it, go and divorce me (Fuck it)\nI iced out her neck in A.P., but she won't report it (Swear she didn't)\n\n[Chorus]\nLamb talk, uh, yeah, Lamb talk, Lamborghini (Woo)\nLamb talk, uh, yeah, Lamb talk, Lambo (Skrrt)\nLamb talk (Lamb, yuh), Lamb talk (Lamb, yeah)\nLamb talk, nigga, Lamb talk (Skrrt, skrrt)", "[Intro: Malcolm X]\nWe are denied not only civil rights, but even human rights. So the only way we're going to get some of this exploitation away from us, or aside from us... Who taught you to hate the race that you belong to? So much so that you don't want to be around each other. Who taught you to hate the texture of your hair? Who taught you to hate the color of your skin?\n\n[Verse 1: Quavo]\nFabrics, fabrics (Whoo)\nExpensive, linen (Linen)\nPut that bitch in the kitchen, in the kitchen whippin' (Yaa)\nBack in the days, I was doin' lord willin' (Hey)\nMama gonna kill me, double cup spillin' (Spillin')\nEvery time I get the hundo, Will I'm trippin' (Trippin')\nEvery time your bitch phone rings she workin' (brr-brr)\nGet no playin' time, Kendrick Perkins (Ayy)\nRockin' Timbs like I'm in New Jersey (Jersey)\nDubs versus Hawks, took off KD jersey (KD)\nAnd he scored a 30\nUp real early (Early), servin', servin', servin'\nFuck that bitch, she a virgin (Smash)\nSaid she had to go to work, she was nursin' (Nursin')\nI can turn the pot to the armed service (Armed)\nI declare war on your whole 30 (30)\nChoppa hold a hunnid\nIf I wasn't real, I would be a hunnid (Hunnid)\nSo that mean everything authentic ('Thentic)\nEvery car I get, windows presidented (Presidented)\n\n[Chorus: Quavo & Offset]\nFuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12 (Yeah, hey!)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12  (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo, Offset)\n\n[Verse 2: Offset]\nKnocking at the door, bail (12, 12)\nCookin' up the dope, Ro-tel (Dope, dope, cookin')\nYou can get a whole wholesale (Wholesale)\nFuck 12, 12 on my coattails (Fuck 12)\nThey hatin', contemplatin' on the money (Hey), I'm makin'\nFirst niggas trappin' out the bando (Bando), you fakin'\nKarate chop the brick, cut it up, Ninja Gaiden (Waa)\nGo and get the re-up, out the buck, not later (Go)\nKickin' my feet up, the J wanna eat up (Kick)\nYour bitch addicted to this drip like a needle (Addict)\nDetective on my back, just took my money, I'm illegal (12)\nShootin' at the pigs, they been killin' all our people (Pig)\nYoung, rich, black, got my mama on my back (Mama)\nDaddy disappeared when my mama took him back (Grandma)\nYou shot him 'cause you thought he had a gun or he black (Woo)\nYou better watch out for the boys when you're black (Woo-whoo)\n\n[Verse 3: Quavo]\nI'm doin' just what I wanna (For real)\nDon't believe me, bet a hundred (Bet it)\nBet a nigga won't go under (Bet it)\nHuncho realest out the jungle (Huncho)\nI got the bricks from Wakanda (Bricks)\nThem boys did the block over yonder (Skrr)\n12 tried to pull a young nigga over (Brrt)\nOne call to my mama\n'Cause I'm black (Mama), I don't know how to act (Nah)\nFuck the front seat, I go sit in the back\n'Cause I'm black (Black), I don't know how to act\nDouble my cup and pour yak (Martell)\n'Cause I'm black, I don't give a fuck about that\nYou judging me off the face tats (Whoa)\nAnd I'm black (Black)\nWhips on my back (Whip), got me the whips out back (Whoo)\n\n[Chorus: Quavo]\nFuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\n\n[Outro: Quavo, Malcolm X & others]\nHands up, don't shoot\nHands up, don't shoot\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot\n(Fuck 'em, fuck 'em, fuck 'em, fuck 'em)\nWe are being killed every day\nThis gon' be your life every day\nYou gon' get tired of this shit before we do\nYou can ask yourself who taught you to hate being what God made you\nFuck 'em\nFuck 'em", "[Chorus: Madonna & Quavo]\nDrink me up Champagne Rosé (Oh, Huncho did it?)\nIt's my game (M-M-M-Murda)\nPlease fill my cup Champagne Rosé (Yeah)\nIt’s my name\nPlease drink me up Champagne Rosé (Drink)\nIt's my game\nPlease fill my cup Champagne Rosé (Woo)\nIt's my name (Drink, drink, drink, drink, drink)\nPlease drink me up Champagne Rosé\n(Drink, drink, drink, drink, drink)\nIt’s my game\nPlease fill my cup Champagne Rosé (Drink, drink, drink)\n(One bottle, two bottles, three bottles, four bottles, five bottles)\nIt's my name\nPlease drink me up Champagne Rosé\n(Six bottles, seven bottles, eight bottles, nine bottles, ten bottles)\nIt's my game\n(Ten bottles, ten bottles, ten bottles, ten bottles)\nPlease fill my cup Champagne Rosé (Woo, woo)\nTwo bottles (Two), three bottles (Three)\nFour bottles (Four), five bottles (Five)\nDrink me up Champagne Rosé (Woo, drink)\nTen bottles (Ten), ten models, no drinkin' out the bottle (Splash)\nFill my cup Champagne Rosé (Woo, woo, woah)\nYeah, yeah\n\n[Verse 1: Cardi B]\nCardi, look\nThey say my time is tickin'\nThese hoes is optimistic\nSomebody told you not to fuck with me\nI would listen (Nope)\nNow this big mama (Big)\nBig watch, big charm\nI get pissed off (Bow)\nYou get pissed on (Grrr)\nLook, court-side at the Garden\nJust to see LeBron\nI don't do number two\nThat's the type of shit I'm on (Woo)\n\n[Verse 2: Quavo & Madonna]\nIt’s my game (Game, game, game)\nDrippin’ like she dance in the rain (Drippin', yeah)\nI had to give her a new nickname (Nickname)\nDesigner call us Met Gala Gang (Met Gala Gang)\nShe make me wanna private sale chain (Ice)\nRose gold mixed with Champagne (Rose gold, yeah)\nEnd of the night, she David Blaine (Disappear)\nOnly thing I knew was her name (What it is?)\nChampagne\n\n[Chorus: Madonna & Quavo]\nIt’s my name (Champagne)\nPlease drink me up Champagne Rosé (Champagne)\n(Drink, drink, drink, drink, drink, drink)\nIt's my game (Champagne, champagne)\nPlease fill my cup Champagne Rosé (Yeah)\nIt's my name\n(One bottle, two bottles, three bottles, four bottles, five bottles)\nPlease drink me up Champagne Rosé (Champagne)\n(Six bottles, seven bottles, eight bottles, nine bottles, ten bottles)\nIt's my game (Ten bottles, ten bottles, ten bottles, ten bottles)\nPlease fill my cup Champagne Rosé (Woo, woo)\nTwo bottles (Two), three bottles (Three)\nFour bottles (Four), five bottles (Five)\nDrink me up Champagne Rosé (Woo, drink)\nTen bottles (Ten), ten models, no drinkin’ out the bottle (Splash)\nFill my cup Champagne Rosé (Woo, woo, woah)\nYeah, yeah\n\n[Verse 3: Quavo]\nHuncho\nWe out in public (Hey)\nAnd we thuggin' (Hey)\nKnow they love me (Hey)\nYeah, poppin' bottles (Hey)\nWe on that fuck shit (Hey)\nJust keep 'em comin' (Hey, hey, hey)\nShawty bad mouth\nKeep that bag though\nAnd that ass soft (Yeah, hey)\nI told her please don't play games\n\n[Verse 4: Madonna]\nIt's my game\nPlease let me entertain you ('Tain you)\nGet inside your vein, too\nIntoxicate your brain, ooh\nCrazy, what I'll make you\nI'll take you for a ride\nTurn you up inside\nThere's nothing you can hide\nCrazy, what I'll make you\nCrazy, what I'll make you\nIt's my game\n\n[Chorus: Madonna & Quavo]\nPlease drink me up Champagne Rosé\nIt's my game\nPlease fill my cup Champagne Rosé (Yeah)\nIt's my name (Drink, drink, drink, drink, drink, drink)\nPlease drink me up Champagne Rosé\nIt's my game (Drink, drink, drink, drink, drink, drink)\nPlease fill my cup Champagne Rosé (Yeah)\n(One bottle, two bottles, three bottles, four bottles, five bottles)\nIt's my name\nPlease drink my up Champagne Rosé (Drink)\n(Six bottles, seven bottles, eight bottles, nine bottles, ten bottles)\nIt's my game (Ten bottles, ten bottles, ten bottles, ten bottles)\nPlease fill my cup Champagne Rosé (Woo, woo)\nDrink me up Champagne Rosé\nFill my cup Champagne Rosé", "[Chorus: Quavo]\nHope I don't get lost (Ooh-ooh, ooh)\nHope I don’t get lost (Get lost, lost)\nLost, in a world (Lost)\nIn this world, they divide us all (In this world, world)\nIn this world, they divide us all (In this world, divide)\nOh yeah (Divide, oh yeah, woo)\nI hope the money don't diminish y'all (Yeah)\nI hope the money (Woo, the money)\nDon’t diminish y'all (Hey, ooh)\nYeah (Yeah, woo-hoo)\nHey\n\n[Verse 1: Quavo]\nMy team came from the bottom on the rise, yeah (Yeah)\nGod, please don't get me lost in this ride, yeah (Skrr, hoo)\nWent to sleep, I had a dream of that fishscale (Fishy)\nWoke up, then put it right on the street at retail (Retail)\nLifestyle, it get crazy, it get brazy yeah (Brazy)\nMy bitch mad at me, the days get rainy, yeah (Oh)\nShe always try to leave, she say I'm too player (Oh)\nOh, you lost in the sauce? I hope you get well (Get well)\nAccomplish all my goals, congratulate me, yeah (Yeah)\nGot the five-end guard with me, that's for safety, yeah (Yeah)\nMake me wanna take all the Percocet pills (Percy)\nTold Danny hit my phone when the check clears (Brr)\n\n[Verse 2: Kid Cudi]\nI'm inside my soul, feel the weight on me (My soul)\nBuilt to carry the load, feel this weight on me (Yeah)\nSlide out, hit the road for my sanity (Mmm)\nThis how it fuckin' goes in my galaxy\nAfter midnight (Midnight)\nAnd my mind runs (And my mind runs)\nWith the demons on my back (Yeah)\n'Til the day comes (’Til the day comes)\nBeen through it all my life (Yeah)\nAnd I feel numb (Feel so numb)\nGot the demons on my back\n’Til  the day comes ('TIl the day comes)\nSee, in my mind, I’m trapped in my mind\nBut I know I'll find a way (Find a way)\nSee, in my mind, I'm trapped in my mind\nBut I know I'll find a way\nSurvivin’ now (Ooh)\nAnd find a way (Hmm)\n\n[Verse 3: Quavo]\nHotbox in the coupe, don't nothin' move I say (Skrr, skrr)\nYou gon' get lost if you try to make a move my way (Move)\nBad bitch gonna hit you with a move if you won't play (Get 'em)\nYou let the money get to your head, made me go the other way (That way, go)\nGo to the top this season (Woo)\nLet 'im get a rack, he need it (Rack)\nEating on the drug, she teathin' (Eat it up)\nIt's Migo Gang, believe me (Migo)\nThe gang over everything, that's what I pledge allegiance (Gang)\nTake care my family, I know my mama need me (Mama)\nTold my niggas in the pen I'm on, they didn't believe it (Brr)\nThen they call back, they see me on TV (TV)\nHope I don't get lost (No)\nIn this million dollar vault (Yeah)\nI don't want to take a loss (No)\nYou don't wanna get involved (Yeah)\n\n[Chorus: Quavo]\nHope I don't get lost (Ooh-ooh, ooh)\nHope I don't get lost (Get lost, lost)\nLost, in a world (Lost)\nIn this world, they divide us all (In this world, world)\nIn this world, they divide us all (In this world, divide)\nOh yeah (Divide, oh yeah, woo)\nI hope the money don't diminish y'all (Yeah)\nI hope the money (Woo, the money)\nDon't diminish y'all (Hey, ooh)\nYeah (Yeah, woo-hoo)\nHey\n\n[Outro]\nDon't get lost in the way, don't\nDon't get lost in the way, don't\nDon't get lost in the way, don't\nDon't get lost in the way", "[Intro: Quavo]\nYeah, ayy, yeah, yeah\nAyy, yeah, yeah\n\n[Chorus: Quavo]\nI got more Keys than Alicia (keys)\nThese niggas be talkin', policin' (12)\nI took your ho, then released her (ho)\nI used to trap out a Regal (uh)\nTwo hundred thousand on my wrist (hundred)\nI thought it all was a fantasy (ayy)\nTwo hundred thousand on my wrist\nLord I hope it don't vanish (god)\nTwo hundred thousand on my wrist\nI told my mama don't panic (mama)\nTwo hundred thousand on my wrist (two hundred)\nI bought her heat with a dragon\nTwo hundred thousand on my wrist (two hundred)\nWho thought I would be livin' life like this?\nTwo hundred thousand on my wrist\nYou probably thought I couldn't buy this shit\n\n[Verse 1: Quavo]\nWrist drownin' in the water\nTrappin' early Tom Joyner\nBeat the pot, George Foreman (beat it up)\nJ's go nuts, acornin'\nLook at me now, I'm soarin'\nLook at the lean I'm pourin'\nCome get your ho, she annoyin'\nWe toss her up like a coin\n24 hours, geekin' on a tower\nShootin' at you cowards\n'Cause my wrist two hundred thousand\nIf a nigga try to take it\nI swear to god he ain't gon' make it\nBack to the bando, the basics\nSeein' green numbers, The Matrix\nLook at that boy with the ice on\nCatching plays Jerry Rice on me\nI know niggas that'll get you nigga\nIf a nigga put the right price on it\nRemember the days on the northside\nHit for a rack on the dice homie\nNow I take the mic and stand on the stage\nI p-p-p-pipe on it\nAnd if you lookin' at me wrong\nI got some niggas that's right on 'em\nAll these flawless stones\nI bet your hoe gon' bite on 'em\nSmokin' this gas get rid of the pain\nYou might think I got Glaucoma\nNiggas might think I'm servin' the J's\n'Cause I'm walkin' with these rocks on me\n\n[Chorus: Quavo]\nI got more Keys than Alicia (keys)\nThese niggas be talkin', policin' (12)\nI took your ho, then released her (ho)\nI used to trap out a Regal (uh)\nTwo hundred thousand on my wrist (hundred)\nI thought it all was a fantasy (ayy)\nTwo hundred thousand on my wrist\nLord I hope it don't vanish (god)\nTwo hundred thousand on my wrist\nI told my mama don't panic (mama)\nTwo hundred thousand on my wrist\nI bought her heat with a dragon\nTwo hundred thousand on my wrist\nWho thought I would be livin' life like this?\nTwo hundred thousand on my wrist\nYou probably thought I couldn't buy this shit\n\n[Verse 2: Lil Uzi Vert]\nWhite diamonds on my neck\nWhite diamonds on my fist\nI just got a white bitch\nAnd she whippin' up the brick\nIn the trap my car, yeah it got that motor\nI do not want that lil bitch\nIf that bitch is really not on mind, deep throat\nAyy, told that bitch eat out my oldest\nShe stick that dick en la boc'\nI just be pitchin' her Raf like I'm floatin (yaaaaaah)\nMixin' the lean with cream soda (yeah)\nYoung nigga but my money gettin' older, ayy\nLook at these bitches, they tellin' on me\nBut my lil' bitch, she like \"So what?\"\nLook at my money, that's L-O-V-E\nSmokin' that gas like a stoner\nNowadays fuckin' my bitches in threes\nAyy, ‘Member I'm watchin' TV\nAyy, nowadays I'm on TV\nAyy, Migo and Thugger baby yeah\nYeah, I just be countin' these G's\nYeah, I feel like I am Swizz Beatz\nI got them Alicia Keys\nI got them Alicia Keys\nI got them Alicia Keys\nI got them Alicia Keys\n\n[Chorus: Quavo]\nI got more Keys than Alicia (keys)\nThese niggas be talkin', policin' (12)\nI took your ho, then released her (ho)\nI used to trap out a Regal (uh)\nTwo hundred thousand on my wrist (hundred)\nI thought it all was a fantasy (ayy)\nTwo hundred thousand on my wrist\nLord I hope it don't vanish (god)\nTwo hundred thousand on my wrist\nI told my mama don't panic (mama)\nTwo hundred thousand on my wrist\nI bought her heat with a dragon\nTwo hundred thousand on my wrist\nWho thought I would be livin' life like this?\nTwo hundred thousand on my wrist\nYou probably thought I couldn't buy this shit\n\n[Verse 3: Shad Da God]\nHundred thousand on my wrist\nBustin' at you, lil bitch\nI just poured a lil Drizzy Drake\nI just poured a lil six (that mud)\nI be lettin' a bag go for Blake\n32 and that 6 (Blake Griffin)\nThey be feelin' like Rico\nWhy you ain't called me on that?\nI serve you out the backdoor\nNigga I serve you out the window\n(I serve you out the window)\nI serve you out the front door\nNigga I serve you out the car door\nLaid back like OGG\n200,000 on auto\nCarbon 15 with the button on\nMake me put it on auto (spray it)\nFree the GOAT, that's Roscoe\nWe gon' still be at the top though\n'Member we was on the block though\nHundred rounds and a Glock though\nCame a long way from the zips of the mid, it was perfect\nStayed down all my motherfuckin' life, it was worth it", "[Intro]\nBuddah Bless this beat\n\n[Chorus]\nFuck with me and get rich (Rich)\nPopped one off, then she fly through the six (Six)\nKeep a real nigga and she fuck with the bitch (Bitch)\nSix in the mornin' and we still talkin' shit (Shit)\nDrink a molly, go some weed (Weed)\nPop bubblegum while she thumb through her weave (Weave)\nPop bubblegum while she thumb through her weave\nPop, pop bubblegum while she thumb through her weave (Weave)\n\n[Verse 1]\nHey, you got it, drop, Ferrari ('Rari)\nHey, you got it, hoes, menagin'\nHey, you got it, woah, your wallet (Woah)\nTwo Falcon 50s back to back on autopilot (Woah)\nJumped on her phone and put them bands on her\nEverywhere we go, we see some fans for her\nThe plug pulled up on me, wanna convo with us\nHad to triumph, finesse or gon' buy 'em\nHey, you got it, trust the process (Process)\nHey, you got it, whip it, hibachi (Hibachi)\nHey, you got it, probably goin' through college (College)\nTryna figure out the best way to feed your wallet (Yeah, yeah)\n\n[Chorus]\nFuck with me and get rich (Rich)\nPopped one off then she fly through the six (Six)\nKeep a real nigga and she fuck with the bitch (Bitch)\nSix in the mornin' and we still talkin' shit (Shit)\nDrink a molly, go some weed (Weed)\nPop bubblegum while she thumb through her weave (Weave)\nPop bubblegum while she thumb through her weave (Weave)\nPop bubblegum while she thumb through her weave (Yeah, yeah)\n\n[Verse 2]\nHey, you got it, still got it poppin' (Poppin')\nHey, you got it, freeze on the diamonds (Freeze)\nHey, you got it, probably got somebody (Body)\nThat won't sacrifice it (No)\nThat don't satisfy you, yeah, yeah\nI let her park the Benz, yeah (Skrrt skrrt)\nDrop one off, then go shop with friends, yeah (Shop)\nThis the type of life we live, yeah (Can't stop)\nMillion dollar type of M's, yeah, yeah\nPut her in the light and watch her eyes glow up (Glow)\nLocked in tight, she like the vibe on us (Oh)\nWhen she check the 'Gram watch her likes go up (Woah)\nWatch her likes go up (Woah)\n\n[Chorus]\nFuck with me and get rich (Rich)\nPopped one off then she fly through the six (Six)\nKeep a real nigga and she fuck with the bitch (Bitch)\nSix in the mornin' and we still talkin' shit (Shit)\nDrink a molly, go some weed (Weed)\nPop bubblegum while she thumb through her weave (Weave)\nPop bubblegum while she thumb through her weave (Weave)\nPop bubblegum while she thumb through her weave (Yeah, yeah)", "[Intro: Quavo]\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\n\n[Chorus: Quavo]\nI put a mil' in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI put a mil' in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI'm on Designer drugs, on Designer drugs, on Designer drugs\n\n[Verse 1: Quavo]\nI put a four in a liter\nI used to trap out a Regal\nMy mom used to trap off a beeper\nI look at the molly and eat them\nI am all out of narcotics\nAll of my bitches exotic\nYou niggas drinking on Watson\nI keep the chopper for plotting\nI keep the white like cotton\nLook at your pot, it's rotten\nWe're never going in a drought\nJunkies coming in and out\nI used to run in your house\nWrapping up you and your spouse\nI used to be sleep on the couch\nAnd now I cash out, no amount\nI pop a Perc and then I'm out\nI spent two million on a house\nRun the money up like a route\nSober niggas out of style\nCobra niggas get the power\nFifty thousand for the style\nI'm in the Coupe with no miles\nBalling like Darius Miles\nIf you own the drug I'm on, you need to pull up right now\nI pop it off, feel like a ghost\nMy niggas doing the most\nI'm never gon' set up my folks\nI got more sand than the coast\n\n[Chorus: Quavo]\nI put a mil' in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI put a mil' in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI'm on Designer drugs, on Designer drugs, on Designer drugs\n\n[Verse 2: Hoodrich Pablo Juan]\nSlipping, cripping, drinking blood\nShort bus shawty on the school bus\nI think I'm on everything but the dust\nItching like a junkie when I'm on Tuss\nI pop a Perc and the Vicodin\nGrab me a Fanta, I'm spiking it\nDab in Designer, they biting it\nI hit the mall and the pharmacist\nThese broke niggas drinking on Qualitest\nI take off on drinking on Actavis\nHope they free my nigga 'Set in the set\nFly like a plane with a Louis baggage\nCurling Backwoods, step into the maximum\nPlug on Designer drugs and I'm taxing them\nStep on a brick in Givenchy\nMoving slow, drinking breast cancer\nI pop a test, jump in a tesla\nPut down a brick, served a pedestrian\nSo many bricks, they think I'm a Mexican\nPut on my reading glasses with finesse\nHold on the white, she gave me Becky\nPop the pussy like a Smith and Wesson\nFucked that little bitch at the Westin\nI'm on a 'shroom, extraterrestrial\n\n[Chorus: Quavo]\nI put a mil' in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI put a mil' in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs\nI'm on Designer drugs, on Designer drugs, on Designer drugs", "[Intro]\nI understand, but this is my proposition for y'all. When you came out that mothafuckin' studio, that was one time I almost got killed. (Yup) Yup, I know that. So it's 5 other times that I almost got killed and listen here, my blood brother...\n...And I know who got the 3 piece, Fat Trel, he got that 3 piece chain (We know, we know who got that too, we know all that) So do [?] got that or no?\n\n[Chorus]\nLil' boy don't play with me, lil' boy, lil' boy don't play with me\nLittle boy, never been a gangsta, lil' boy don't play with me\nSmall, lil' boy don't play with me, wipe that lil' baby\nLil' boy don't play with me, small ball, fuck nigga\nDo you know who I am? Lil' boy don't play with me\nHead honcho, you think you can come up off me\nDon't you dare play with me\nPeon, you thinkin' that you can come up off of me\nLittle boy, don't you play with me\nDon't play with me, lil' boy don't play with me\nDon't play with me, don't you dare, lil' boy don't play with me\n\n[Verse]\nLil' boy, can't handle the pressure\nCause the world know you got the QC pendant\nLook at him scared in the interview\nGot him shakin' out his britches\nI'ma tell 'em how it went down\nNigga jumped off the stage, started walkin' through the crowd\nI'm the last one walkin' through the door\nSo they took the opportunity to hit the lick now\nOne nigga tried to go snatch it\nHit him with the Hennessy, broke the glasses\n'Nother nigga grabbed my chain, then he ran to the left\nWhat type of real street nigga leave his partner by himself?\nMy chain gone, it's all good though\nYou just made me re-up on pot of gold\nBut don't think this shit is all good though\nYou might as well hide in a spider hole\nPotato on the snub nose\nCall my niggas Migo Idaho\nYou fuckin' with the wrong rappers, mane\nWe know your address and we got your name\nAll this for a QC chain?\nLike your mama say, boy you in hot water\nPut him on the menu, put him on the plate\nCause Quavo wanna make an order\n\n[Chorus]\nLil' boy don't play with me, lil' boy, lil' boy don't play with me\nLittle boy, never been a gangsta, lil' boy don't play with me\nSmall, lil' boy don't play with me, wipe that lil' baby\nLil' boy don't play with me, small ball, fuck nigga\nDo you know who I am? Lil' boy don't play with me\nHead honcho, you think you can come up off me\nDon't you dare play with me\nPeon, you thinkin' that you can come up off of me\nLittle boy, don't you play with me\nDon't play with me, lil' boy don't play with me\nDon't play with me, don't you dare, lil' boy don't play with me", "[Intro]\nZaytoven\n\n[Hook]\nRidin' round itchin' (skrt)\nYea, my palms itchin' (cash)\nReal grown, ain't fucking with no children (grown man)\nI'm not arguing with no bitches, I ain't in it, nah (bitch)\nWhen I pull up (huh)\nBet I hurt they feelings (see, skrt)\nNiggas talking shit, now they missing (kuh, wush)\nRunning all these packs through the city (runnin' wush)\nI can't tell my business cause you snitchin' (nooo)\nWhen I wake up, stars in my ceilings (hrrr)\n\n[Verse 1]\nPuttin rich niggas' outta business (talk to 'em)\nTold that fuck nigga' mind their business (hold on, yea)\n50K, Momma at the dentist (Momma)\nCriminal pack my niggas got that sentence (hey)\nThink I'm from New York, I got pigeons  (brrrrr)\nWalkin' with that torch, I got decisions (flash)\nKeys like Scott Storch, but I like to dish 'em (here)\nRunnin' the point like I'm Fisher, shoot with the missile (Fishers)\nDon't come to the trap unannounced, pull up with the whistle (wuh, brrr)\nI'm fucking that bitch by the mouth, no you shouldn't kiss her (hrrr)\nThey pullin' up right at yo' house, you shouldn't diss 'em (brrt)\nIt's sad to say these niggas controlled by the system (haha)\n\n[Bridge]\nI'm from a place where my wings gon' fly\nI got the bags, which one you wanna buy? (buy)\nI put 'em in yo' trunk yea (yea-aa)\nI put you on the road yea (yea)\nWhen you get them pies, just please drive slow (yea)\nWhen you got them pies, you can't let nobody know (nop)\nWhen you get them pies off, you ball like cantaloupe (pies)\nWhen you get them pies, you can't go out like no hoe (hey)\n\n[Verse 2]\nThis that dope (yea-aah)\nBuying all the dranks' at the store (drink)\nBeatin up the pot sajamo (beat it)\nI got more water than a boat (splash)\nI'm so geeked up, I can't feel my four (the four)\nShe only want the drugs for her nose (the drugs)\nI am... (You what?)\nI am the huncho boss\nI will... (Do what?)\nTake one, take one off\n\n[Hook]\nRidin' round itchin' (skrt)\nYea, my palms itchin' (cash)\nReal grown, ain't fucking with no children (grown man)\nI'm not arguing with no bitches, I ain't in it, nah (bitch)\nWhen I pull up (huh)\nBet I hurt they feelings (see, skrt)\nNiggas talking shit, now they miss it (kuh, wush)\nRunning all these packs through the city (runnin' wush)\nI can't tell my business cause you snitchin' (nooo)\nWhen I wake up, stars in my ceilings (hrrr)", "[Intro: Quavo]\nI got 9, stupid 9 on me, got that 9 on me, Romo\n\n[Hook: Quavo]\n9 on me (9!)\n9 on me (Woo!)\n9 on me (Pow!)\nGot that 9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go Go!)\n9 on me (Woo Woo!)\n9 on me (Ba Ba Ba Bow!)\nThat 9 on me (Flex!)\n9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go!)\n\n[Verse 1: Quavo]\nIma' cowboy, cause i got that 9 on me\nTony Romo, grah grah get away from me\nAll my goons like linemen, you can't get no sack from me\nI took your bitch, I smashed your bitch, left her at the Double Tree\nThey call me Tony Romo, 9 on me, its solo\nGot goons with me that'll hit your ass up, nigga I ain't talking bout no homo\nCall up mercy for the mojo,yall niggas ain't getting no dough\nCall up the up the plug just for a 3 5, nigga but that whole thing in a relo\n\n[Hook: Quavo]\n9 on me (9!)\n9 on me (Woo!)\n9 on me (Pow!)\nGot that 9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go Go!)\n9 on me (Woo Woo!)\n9 on me (Ba Ba Ba Bow!)\nThat 9 on me (Flex!)\n9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go!)\n\n[Verse 2: Ballout]\nI got that 9 on me, run up you die homie\nI just hit a lick, so I got it for the dirt cheap\nI'm in the trap juugin'﻿ all day, sellin' them things\nThey going for 9 homie, i got my 9 on me\nMigos hit me up and said they need 9 homie\nIm like thats crazy cause im in the bando now homie\nIn the kitchen cooking chickens, wrapping up pies homie\nAnd I got my 9 on me, I got my 9 on me\n\n[Hook: Quavo]\n9 on me (9!)\n9 on me (Woo!)\n9 on me (Pow!)\nGot that 9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go Go!)\n9 on me (Woo Woo!)\n9 on me (Ba Ba Ba Bow!)\nThat 9 on me (Flex!)\n9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go!)\n\n[Verse 3: Chief Keef]\n(Sosa Baby)\nPosted on o'block, i ain't worried bout shit i got my 9\nAnd this bitch hold 30 shots, sucker you can i hope i miss\nGlory gang we v.i.p, my homeboys can't wait in lines\nSquad tote .223 i tote ning ding\nAnd these fuck boys they ain't on non\n'Member when I use to trap, now I ain't gotta trap nomore\nI ain't even gotta rap, bitch I can die in this trappin game\nGBE bitch we the squad, i know you wanna get signed with me\nI just got like 9 a tape, now I'm 'bout to get high right now\n\n[Hook: Quavo]\n9 on me (9!)\n9 on me (Woo!)\n9 on me (Pow!)\nGot that 9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go Go!)\n9 on me (Woo Woo!)\n9 on me (Ba Ba Ba Bow!)\nThat 9 on me (Flex!)\n9 on me (Go!)\nRomo, Tony Romo (Toooonny!)\nRomo, Tony Romo (Go Go!)", "[Chorus: Quavo]\nKeep that shit (Keep that shit), keep that shit over there (Oh)\nAye, keep that shit (Keep that shit), keep that shit over there, aye\nAye, keep that shit (No, no, no), keep that shit over there (Woo!)\nKeep that shit (Keep that shit), keep that shit over there (Woo!)\nAye, keep that shit (Hey), keep that shit over there (Keep it)\nAye, keep that shit (No, no, no), keep that shit over there, aye\nAye, keep that shit (Keep that shit), keep that shit over there (Woo!)\nKeep that shit (Keep it), keep that shit over there (Hey)\nAye, keep that\n\n[Verse 1: Quavo]\nRacks on my fist (Racks), you broke as a bitch (Woo!)\nThree-way assist (Three-way), Migo Gang rich!\nShe hopped on the dick (Keep it), guap, fuck this shit (Yeah)\nPop for this shit, don't stop for this shit (Yeah, hey!)\nI get the bag, fuck a diss (Fuck it)\nDon't get me wrong, you get chopped for this shit (Chopped)\n.30 clip shit (.30!), hit your residence (Hit 'em, nah!)\nLook, we don't pretend (Nah) and we don't do new friends\nWe can beef it up (Up!), nigga peace it up (Up!)\nNiggas seen it's us (Us!), now they walkin' up (Up!)\nTry to work a move (Up!), but I'm on it too (Yup)\nOn the first of June (June) them Niggas hunted you (Woo!)\n\n[Bridge: Quavo & Takeoff]\nPockets, double cheese, she please me with ease (Please!)\nWhen I put this ice on, everything freeze (Freeze! Ice, Ice, ice, ice)\nEverything freeze (Ice, Ice, ice, ice, freeze!)\nIf she goin' hard, she gotta get a job (Go, go!)\nTold her don't stop, now she on (Don't stop)\nSomebody got dropped, now he gone (Bow!)\nBut the world don't stop, it keep goin' (Takeoff!)\n\n[Verse 2: Takeoff]\nKama glitched (What the fuck?)\nDiamonds see-through clip (Uh)\nKeep that shit (Keep that shit), keep that shit over there (Uh)\nLook at my ice (Ice!), hit 'em with a right, then left (Bop!)\nAnd the gang-gang nice (Gang-gang), big drip better watch you step (Whoa!)\nCheck your tone (Watch it), I made my guap to feed my own (Mines)\nRemember the nights, I'm tellin' my nigga that, \"We gon' be on\"? (Remember them nights?)\nWhippin' the chicken, I'm whippin' the brick and my eyes is closed (Whippin' the white)\nIn love with the money, I got on my knee and I had to propose\n\n[Chorus: Quavo]\nKeep that shit (Keep that shit), keep that shit over there (Oh)\nAye, keep that shit (Keep that shit), keep that shit over there, aye\nAye, keep that shit over there (No, no, no), keep that shit over there (Woo!)\nKeep that shit (Keep that shit), keep that shit over there (Woo!)", "[Intro]\nHeh-heh-heh-heh-heh-heh\nIt's Budda Beats\n\n[Verse 1: Quavo]\nI'm like Odell with the contracts (Odell)\nScratch that\nI'm up fifteen mil, that's a fun fact (Fifteen mil)\nBad bih, where you from? Give me some (Yeah)\nCome back, send me drum, banana, ugh\nCatch a contact, Met Gala, Kanye, one\nCome back, run that, run that, ugh\nFuck her first, then you pay the rent (Smash)\nShit don't make no sense (No)\nFourth down, I need every inch\nNow we first and goal, bitch (Biatch)\nNow it's time to get outta control\nHell nah, I will never snitch (No)\nMiddle finger to the government (Twelve)\nRidin' 'round town, windows president (Skrrt, skrrt)\nShe like it face down, and her ass bent (Yeah)\nShe throw that shit around, you gon' have a fit (Hey, yes sir)\nBust a move, bitch (Move, skrrt, skrrt)\nMake the news, bitch (News)\n\n[Chorus: Quavo & Saweetie]\nWhen she geekin', she be eatin' (Eat it up, eat it up)\nBreak a solid nigga, into pieces (Yeah, yeah)\nMight turn him into a baby (Turn him in baby, hey)\nI told her, \"Give it to him, baby\" (Yeah, woo)\nI be geekin' (Geekin', geekin')\nI be eatin' (Eat it up, eat it up)\nBreak a solid nigga (Break 'em)\nInto pieces (Yeah, yeah, yeah)\nMight turn him into a baby (Turn him in baby)\nI told her, \"Give it to 'em, baby\" (Woo)\n\n[Verse 2: Quavo]\nI had to turn the savage on (Savage, savage)\nI had to turn the manners off (Woo)\nFirst class, yeah, you sittin' with him, baby (Woo)\nFirst class, you sittin' next to the boss (Huncho)\nBig dope inside the loft (Big dope)\nShe said she too bad to knock it off (Woo)\nAt least that's what you thought (What you thought)\nIt's gettin' real sad, the nigga ball (Nigga ball)\nIt's like when 'Melo came to the Hawks ('Melo, 'Melo)\nHe still got a jersey though (Jersey)\nWay she work a nigga call him Deuce Bigalow\nPull up, bald head, lime green, Lamb' Piccolo (Skrrt, skrrt)\n\n[Chorus: Quavo & Saweetie]\nI be geekin' (Geekin', geekin')\nI be eatin' (Eat it up, eat it up)\nBreak a solid nigga (Break 'em)\nInto pieces (Yeah, yeah, yeah)\nMight turn him into a baby (Turn him in baby)\nI told her, \"Give it to 'em, baby\" (Woo)\nWhen she geekin', she be eatin' (Eat it up, eat it up)\nBreak a solid nigga, into pieces (Yeah, yeah)\nMight turn him into a baby (Turn him in baby, hey)\nI told her, \"Give it to him, baby\" (Yeah, woo)", "[Intro]\nRomano\nOG Parker\n\n[Pre-Chorus : Quavo]\nWe keep it goin' let’s go (Go)\nDon't need no keys to go (No keys)\nFuckin' with me, get go (Me)\nNobody seen li’l bro (Ain't seen him)\nLivin' life fast, you go (Fast)\nKeepin' it goin', you go (Keep goin')\nKeepin' it goin' li’l ho (You know)\nKeepin’ it goin' li’l ho (Ho)\n\n[Chorus: Quavo]\nHow 'bout the whole gang get geeked? (Yeah, yeah)\nHow 'bout that?\nHow 'bout the whole gang get freaks? (Yeah, yeah)\nHow ’bout that?\nHow 'bout we run the whole scene? (Yeah, yeah)\nHow 'bout that?\nWhole scene (Yeah, yeah)\nHow 'bout that?\n\n[Verse 1: Quavo]\nAye, move the scene (Move)\nMove the block (Block, ugh)\nI'm with the team (Team)\nWe All-stars (Stars, aye)\nThis all I got (Got)\nI can't stop (Stop)\nCame from kickin' in doors, hop out Benz\nShootin' at Ops (Ugh, ah)\nShe gave me mouth, the dental floss (Aye, floss)\nI bought a boat, I feel like a boss (Ugh)\nPull up on the dock (Skrrt)\nPark the drop (Skrrt, aye)\nJust give me my ends\nGive me my knots (Knots)\nWoah, how 'bout strong?\nHow 'bout strong? (Strong)\nDrippin' and dabbin' (Dab)\nDidn't take me long (Drippin')\nYou gotta practice (Woo), to beat me at home (Oh)\nJust keep askin', put me on\n\n[Chorus: Quavo]\nHow 'bout the whole gang get geeked? (Yeah, yeah)\nHow 'bout that?\nHow 'bout the whole gang get freaks? (Yeah, yeah)\nHow 'bout that?\nHow 'bout we run the whole scene? (Yeah, yeah)\nHow 'bout that?\nWhole scene (Yeah, yeah)\nHow 'bout that?\n\n[Verse 2: Quavo & Takeoff]\nFloss it, (Hey) fuck with my posse (Hey, hey)\nFuck with my posse (Hey, hey)\nWanna go that way (That way, hey)\nRidin' in the crowd wave (Skrrt)\nRidin' in the big Wraith (Big Wraith)\nGive a lil' bitch a taste\nWe goin', up, up, up\nYeah, up, I just, up, went, up, up, up, yeah, up\nWe just, up, pipe it, up, up, up\nYeah, up, we just, up, level up, up, up, yo\n\n[Pre-Chorus: Quavo]\nWe keep it goin' let's go (Go)\nDon't need no keys to go (No keys)\nFuckin' with me, get go (Me)\nNobody seen li'l bro (Ain't seen him)\nLivin' life fast, you go (Fast)\nKeepin' it goin', you go (Keep goin')\nKeepin' it goin' li'l ho (You know)\nKeepin' it goin' li'l ho (Ho)\n\n[Chorus: Quavo]\nHow 'bout the whole gang get geeked? (Yeah, yeah)\nHow 'bout that?\nHow 'bout the whole gang get freaks? (Yeah, yeah)\nHow 'bout that?\nHow 'bout we run the whole scene? (Yeah, yeah)\nHow 'bout that?\nWhole scene (Yeah, yeah)\nHow 'bout that?", "[Verse 1: Quavo]\nWe get allowed to swing\nOh that's a hot spot (Hot spot)\nHit her on the elevator, why not (Why not)\nMake the whole block hot (Block hot)\nMake the whole block hot (Block hot)\n(Skrrt, skrrt) In the hot box (Skrrt, skrrt)\nRight next to the chopper (Skrrt, skrrt)\nAnd the thing go ratta (Buck, buck)\nAnd the thing go ratta (Buck, buck)\nCame from the jungle, we hot but we humble\nYou want to reach out tell her, just put down your number (brrrr)\nIf she's not a bad gyal, then I do not want her (Bo)\nI like to try new things, but not with one woman (No)\nGot to be three or four of 'em (Three)\nYeah, we drippin' designer, but grind on the floor (Floor)\nAnd I do not care what I drink, just keep pourin' (Pour)\nAlready know what she think, girl just go in (Go, go, go)\nShe 'bout to go to the dance hall (Hall)\nTwo bad bitches got a dance-off (Off)\nBy the end of the night, I tried 'em all (All)\n\n[Chorus: Quavo]\nWe get allowed to swing\n(Swingin' ay, swingin' ay)\nWe get allowed to swing\n(Swingin' ay, swingin' ay)\nWe get allowed to swing\n(Swingin' ay, swingin' ay)\nWe get allowed to swing\n(Swingin' ay, swingin' ay)\nWe get allowed to swing\n\n[Post-Chorus: Quavo]\nShe wanna try the new tings\n(She wants to try 'em)\nShe like to try the new tings\n(She like to try 'em)\n\n[Verse 2: Normani & Quavo]\nOh, I got you seeing double, careful not to start no trouble\nOh, I try to keep it subtle, I don't mean to burst your bubble\nOh, I've been workin' hard, I rehearsed that\nQuavo loose, that's 'cause my body heard that\nAnd I think I deserve, a lil' different tonight\nSlow it down and have a drink for a second (Ay)\nCome on get on my page for a second, yeah\nWe're the ones have a thrill, make it messy, yeah (Ay)\nI just wanna show you something a lil' different, yeah\nSlow it down and have a drink for a second (Ay)\nCome on get on my page for a second, yeah\nWe're the ones have a thrill, make it messy, yeah (Ay)\nI just wanna show you something a lil' different, yeah\n(We allowed to swing) I know you love to swing\n\n[Chorus: Quavo & Normani]\nWe get allowed to swing\n(Swingin' ay, swingin' ay)\nI just wanna show you something a lil' different (Yeah)\nWe get allowed to swing\n(Swingin' ay, swingin' ay)\nWe get allowed to swing\n(Swingin' ay, swingin' ay)\nI just wanna show you something a lil' different (Yeah)\nWe get allowed to swing\n\n[Post-Chorus: Quavo]\nShe wanna try the new tings\n(She want to try 'em)\nShe like to try the new tings\n(She like to try 'em)\n\n[Verse 3: Davido]\nThe darker the berry, the sweeter the juice (Black juice)\nWhenever you're ready, I'm ready to move (Ready to move)\nShe said don't keep me waiting\nNow she's in the mood (She's in the mood)\nWhenever you're ready, I'm ready to move gyal\nI'll take you to Africa (Ay)\nYou won't see my type of car (Scoot, scoot)\nThe same one that Cardi got (Vroom, vroom)\nCome live like a fuckin' star (Ay)\nI go turn you to foreigner, yeah\nFor my place, you no need Visa (No need Visa)\n\n[Chorus: Quavo]\nWe get allowed to swing\n(Swingin', swingin')\nWe get allowed to swing\n(Ah, swingin', swingin')\nWe get allowed to swing\n(Ah, swingin', swingin')\nWe get allowed to swing\n(Ah, swingin', swingin')\nWe get allowed to swing\n\n[Post-Chorus: Quavo]\nShe want to try the new tings\n(She want to try 'em)\nShe like to try the new tings\n(She like to try 'em, we get allowed to swing)\nShe want to try the new tings\n(She want to try 'em)\nShe like to try the new tings\n(She like to try 'em)\n\n[Outro: Quavo]\nWe get allowed to swing\n(We get allowed)\nShe wanna try new tings\n(Come and tell me!)\nWe get allowed to swing\n(Ay, you comin' down now)\nShe wanna try new things\n(Let 'em go, let 'em know)\nLet the beat run out, ohh, oh\nLet the beat run out\nYeah, we get allowed to swing", "[Intro: Lil Juice]\nTay Keith, fuck these niggas up\n\n[Pre-Chorus]\nTwo more drinks, bet she go in, for sure (Two)\nLow key dates, uh, nobody knows (No, nobody)\nGet your rake 'cause there's money on the floor (Money)\nGet your gang 'cause they hating on the low (Gang)\n\n[Chorus]\nWe can make diamonds shine (Ice) on the darkest nights (Uh!)\nShe can make diamonds shine (Shine) on the darkest nights\n\n[Verse 1]\nQuavo, Huncho\nBig guap (Big guap), streets on lock (Lock it up)\nThey gone flock (They gone what?), nonstop (Nonstop)\nI told her pop (I told her who?), soda pop (Twerk)\nForget the cops (Fuck the cops), that's how we rock (How we goin')\nThis a Glock (That it, that it), you silly opps (Silly)\nI Got the drop (Got that drop) on your pops (On your daddy)\nDrip drop (Drip), get a mop (Get it)\nFlood the clock (Flood it), ice box (Ice, ice)\nIt still leaks like Nene (Leakin')\nLet it take some time to heal, achilles (Marinate)\nI put the bitch inside the tee-pee (Hibernate)\nShe say her hair was indie, you get me?\n\n[Chorus]\nWe can make diamonds shine (Ice) on the darkest nights (Uh!)\nShe can make diamonds shine (Shine) on the darkest nights\n\n[Verse 2]\nWatch her shine shine then like a VVS (Shine)\nShe go all kind of ways just to get that check (Go)\nShe gone do you down bad, hit you with finesse (Finesse)\nWhy you do that then, why she do the boy like that? (Haha)\nJust remember everything she do high-end (high-end)\nShe can pull lotta strings like a violin (Violin)\nGet the front end, break off the back end (breakup)\nThere she go again, think I seen her twin (Twin)\nDiamond, let her shine yeah (Shine)\nLet her drive the Lambo that is mine yeah (It mine)\nLet's stop at Rodeo I design yeah (Cash)\nMake her whip over the stove, no lasagna\nIt's a vi-i-i-ibe it's a vibe (It's a vibe)\nYou may think they hoes not in my eyes (No way)\nThis money on the floor fell from the sky (Racks)\nI don't have a reason to go tell lies (No cap, no)\n\n[Pre-Chorus]\nTwo more drinks, bet she go in, for sure (Two)\nLow key dates, uh, nobody knows (No, nobody)\nGet your rake 'cause there's money on the floor (Money)\nGet your gang 'cause they hating on the low (Gang)\n\n[Chorus]\nWe can make diamonds shine (Ice) on the darkest nights (Uh!)\nShe can make diamonds shine (Shine) on the darkest nights\nQuavo, Huncho", "[Intro]\nHuncho (Lights out)\n\n[Pre Chorus]\nGo dumb go stupid (Lights out)\nBreak it down like a blueprint (Lights out)\nPipe it up, it's a movie (Lights out)\nLights out and it’s boomin' (Lights out)\nHey, she hit the baddest (Lights out)\nFour-door on my coupe need a ladder (Lights out)\nGot the music blastin' (Lights out)\nShe a dance floor savage\n(No cap)\n\n[Chorus]\nDrop my top, cut the ceilin’ off (No cap)\nSecond bop, uh, knock it out (No cap)\nLookin' like money now (No cap)\nStill go when the sun down (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don’t even know what you talkin’ 'bout (No cap)\nI don’t even know what you talkin' 'bout\n\n[Verse]\nVibe on my line she callin' (Brrr)\nMy vibe on my line, keep callin’ (Brrr)\nBeat it up, like bow (Beat it up)\nIf you a bad bitch say: \"Ow\" (ow)\nWhat's up now? Pop out (out)\nIf you a bad bitch say: \"Ow\" (ow)\nWhat's up now? Pop out (woo)\nPretty thing lookin' like I know her (Pretty)\nPretty thing lookin' like I know her (Bad)\nPlus I know she enjoy (Enjoy)\nAll the bad guys that come for her\n(No cap)\n\n[Chorus]\nDrop my top, cut the ceilin' off (No cap)\nSecond bop, uh, knock it out (No cap)\nLookin' like money now (No cap)\nStill go when the sun down (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No! No cap)\n\n[Refrain]\nShe wanna go all the way to the top (Top, no cap)\nShe wanna go all the way to the top (To the top, no cap)\nShe wanna go all the way to the top (Top, no cap)\nShe wanna go all the way to the top\n(No! No cap)\n\n[Bridge]\nBeat it up like bow\nIf you a bad bitch, say: \"Ow\" (ow)\nBeat it up like bow (Bow)\nIf you a bad bitch, say: \"Ow\" (ow)\nWhat's up now? Pop out\nIf you a bad bitch, say: \"Ow\" (ow)\nWhat's up now? Pop out\nIf you a bad bitch, say: \"Ow\" (ow)\n(No cap)\n\n[Chorus]\nDrop my top, cut the ceilin' off (No cap)\nSecond bop, uh, knock it out (No cap)\nLookin' like money now (No cap)\nStill go when the sun down (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (Lights out)\n\n[Post Chorus]\nGo dumb, go stupid (Lights out, stupid)\nBreak it down like blueprint (Lights out, blueprint)\nPipe it up, it's a movie (Lights out, pipe it up)\nLights out and its boomin' (Lights out, hey)\nShe is the baddest (Lights out, bad)\nFour-door on the coupe need a ladder (Lights out)\nGot the music blastin' (Lights out)\nShe a dance floor savage\n(No cap)\n\n[Chorus]\n(No cap) Drop my top, cut the ceilin' off (No cap)\nSecond bop, uh, knock it out (No cap)\nLookin' like money now (No cap)\nStill go when the sun down (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No cap)\nI don't even know what you talkin' 'bout (No! No cap)\n\n[Refrain]\nShe wanna go all the way to the top (Top, no cap)\nShe wanna go all the way to the top (To the top, no cap)\nShe wanna go all the way to the top (Top, no cap)\nShe wanna go all the way to the top", "[Intro]\nCardo got wings\n\n[Chorus: Quavo]\nIce cold, 'frigerator froze\nBankrolls, cheese nachos\nSuperbowl, Quavo scooped and scored\nOnce you get a slice, you gotta get a loaf\nOnce I get that cake, I just can't let it go\nShe put it in my face, I'm just gon' let it flow\nShe say she want that flake, yeah, I give her snow\nShe gets so hot, she get too high, UFO\n\n[Refrain: Travis Scott]\nOh, I guess, oh, oh, I guess\nRide around and flex, disrespect\nYeah, link with me, light my neck and link with me\nYeah, lean and weed, can't control the lean and weed\nSo low-key with it, so high-key with it\nLike in a stingray, know a nigga be with it, yeah\n\n[Bridge: Quavo]\nQuavo, they callin' me Saint Nick\nWe at the top like the North Pole\nIce cold, 'frigerator froze\nIce cold, 'frigerator froze\n\n[Chorus: Quavo]\nIce cold, 'frigerator froze\nBankrolls, cheese nachos\nSuperbowl, Quavo scooped and scored\nOnce you get a slice, you gotta get a loaf\nOnce I get that cake, I just can't let it go\nShe put it in my face, I'm just gon' let it flow\nShe say she want that flake, yeah, I give her snow\nShe gets so hot, she get too high, UFO\n\n[Instrumental Break]\n\n[Chorus: Quavo]\nIce cold, 'frigerator froze\nBankrolls, cheese nachos\nSuperbowl, Quavo scooped and scored\nOnce you get a slice, you gotta get a loaf\nOnce I get that cake, I just can't let it go\nShe put it in my face, I'm just gon' let it flow\nShe say she want that flake, yeah, I give her snow\nShe gets so hot, she get too high, UFO\n\n[Refrain: Travis Scott]\nOh, I guess, oh, oh, I guess\nRide around and flex, disrespect\nYeah, link with me, light my neck and link with me\nYeah, lean and weed, can't control the lean and weed\nSo low-key with it, so high-key with it\nLike in a stingray, know a nigga be with it, yeah", "[Intro: Young Thug]\nGator bump, they ain't swag, though\nBackburner full of fine hoes\nSwag journies to the condo\nCouple milli' off a ride, woah\nThat boy Cassius\nN-N-Nonstop\n\n[Chorus: Quavo]\nRe-up on the bag (re-up), then I walk on the red carpet (hey)\nAnything I see, I'm snatchin' (woo)\nI'm geeked, I see iCarly (geeked)\nUpscale fashion (yeah), on the carpet more than Aladdin (yeah)\nPark it at Magic (yeah)\nWhippin' up, whippin' up magic (skrrt, skrrt)\n\n[Verse 1: Quavo]\nTwo hoes, classy (two)\nBut they gon' still get nasty (two)\nWrap it in plastic (hoo)\nJayhawks landing in Kansas (brr, brr)\nThis that Wraith talk (Wraith)\nMil talk, all in the safe talk (safe)\nAin't worried 'bout them nigga, introduce 'em to K talk (K)\nGo get the bag on a day off (racks)\nGo get the rings out the playoffs (rings)\nPots in the beat, it's a bake-off (packs)\nFuck on her, then she get laid off (smash)\nBig boy tools, Maaco (big boy)\nMake a bitch dance with a Draco (dance)\nWalkin' with the cheese, that queso (cheese)\nThat's Huncho, fuck the Rodeo (Huncho)\nPrivate jet, we don't do layover (whew)\nOne call, I'm havin' your bae over (brrt)\nWalk out the spot with the makeover (woo)\nGot her addicted to payola (addicted, hey)\n\n[Chorus: Quavo]\nRe-up on the bag (re-up), then I walk on the red carpet (hey)\nAnything I see, I'm snatchin' (woo)\nI'm geeked, I see iCarly (geeked)\nUpscale fashion (yeah), on the carpet more than Aladdin (yeah)\nPark it at Magic (yeah)\nWhippin' up, whippin' up magic (skrrt, skrrt)\n\n[Verse 2: Young Thug]\nYeah, Patek Philippe (yeah)\nDifferent size diamonds and it's neat (yeah, yeah)\nWipe a nigga nose (yeah)\n50 bitches with me like Floyd (yeah, yeah)\nIf you come to my spot, you gon' need a motor scooter to tour (yeah)\nI'ma put my dick in every hoe (yeah), I'm just a freaky lil' boy (yeah)\nI'm takin' real X, nigga (yeah)\nI'm takin' real X, nigga (yeah)\nI was hittin' it from the back and guess what? (what?)\nI was grippin' my Tec, nigga (yeah)\n9th grade I was lit, nigga (yeah)\nHad a closet full of minks, nigga (yeah)\nUniversal, hittin' licks, nigga (yeah)\nF&Ns when you rich, nigga\nYeah, I took all my old jewelry back and upgraded to baguettes\nYeah, I used to be broke, but I'm rich now, I know you heard that\nYeah (yeah), I used to watch my big homie, now I know the bird dance (brr)\nYeah, now that all my niggas free, tell me where the smoke at\n\n[Instrumental Break]\n\n[Verse 3: Future]\nMore smoke than puff\nBitch thick like buff\nAn' I'm straight out the slum with the yayo (strong)\nSnap on this shit like I'm Fabo (skrrt)\nWe got squares and bales in Clayco\nAll my money and cars biracial\nI can't count up the stars, they head-top\nSoon I sit in that foreign, my leg cop\nI bought a straight [?] with the crack rock (ya)\nHit a lick then I wanna cop the Maybach (ya)\nAll shawty wanted was a dope-boy (dope-boy)\nNever save a hoe like a lifeguard\nAn' I got the Molly by the Eightball (yeah)\nI get the bag on a day-day\nI fucked the bitch on the Adderall (Adderall)\nI put her up in my catalog\nSoon as I came on the car lot, started fishtailing (skrrt)\nYeah, shawty gon' squirt it then spit it out back, Israeli\nYeah, shawty gon' bus' on the head first, no paramedics\nYeah, all I wanted, all I wanted was a hunnid mil\nAn' I'm there already\n\n[Verse 4: Young Thug]\nGo get the bag on a day off (day off)\nMake her suck dick ’til her face sore\nI feel this aspirin like Rentanol\nI got this shit out the bando (yeah)\nI'm in the coupe with like nine hoes (nine hoes)\nYou better believe that they fine hoes (fine hoes)\nI'm drippin' sauce with my eyes closed\nTurned to a horse, I was riding hoes\nGator bump, they ain't swag, though\nBackburner full of fine hoes\nSwag journies to the condo\nCouple milli' off a ride, woah", "[Produced by OG Parker]\n\n[Hook]\nI'm gettin' new paper over here\nGettin' brand new paper over here\nI'm gettin' new paper over here\nGettin' brand new paper over here\nI'm gettin' new paper over here\nGettin' brand new paper over here\nI'm gettin' new paper over here\nGettin' brand new paper over here\n\n[Verse]\nAll this money comin' in my way\nFuck what a hater even got to say (Fuck 'em)\nMe, myself, and I cruise down the highway\nPull up to the bank I walk right out with a 100K (Cash, uh)\nNew money, blue hundreds, no I ain't runnin' from it (New money)\nGot foreign currency from doin' shows across the country (foreign)\n'Case an emergency I got some more money stashed\nWish my niggas seen how far we came it make me sad (R.I.P. Damn)\nMoney make a nigga happy but some niggas mad at me (Mad at me)\nHoes callin' me the dab daddy, trend set the fashion (Dab daddy)\nNew money comin' in every day, that's a satisfaction (Uh)\nThis is the answer to what you keep askin' (Huh)\n\n[Hook]\nI'm gettin' new paper over here\nGettin' brand new paper over here\nI'm gettin' new paper over here\nGettin' brand new paper over here\nI'm gettin' new paper over here\nGettin' brand new paper over here\nI'm gettin' new paper over here\nGettin' brand new paper over here", "[Produced by OG Parker]\n\n[Verse 1]\nI'm having a problem\nThey copy the flow and they really think they out-rapping me\nThis shit is a tragedy\nSo many rappers I used to look up to take after me\nThen they get back to me, It keep coming back to me that we created a dynasty\nThen they get back to me, It keep coming back to me that we created a dynasty\n\n[Chorus]\nSee what I'm saying? (See what I'm saying)\nSee what I'm saying? (what, huh?)\nSee what I'm saying? (See what I'm saying)\n\n[Verse 2]\nEverything change when the money flowing in ya hands\nGot to stick to your plans\nMomma taught me how to turn a boy into a man\nJust me and my brothers started from the bottom\nMan I'd never know what I'd do without them\n\n[Chorus]\nSee what I'm saying? (See what I'm saying)\nSee what I'm saying? (what, huh?)\nSee what I'm saying? (See what I'm saying)\n\n[Verse 3]\nGot a dirty rifle sitting by the holy Bible 'cause the game is dirty like a dirty tower\nWhat a feeling, I'm having all of the power\nSurrounded by killers and none of you cowards\nI'm eating up rappers like Golden Corral\n\n[Chorus]\nSee what I'm saying? (see what I'm saying)\nSee what I'm saying? (huh?)\nSee what I'm saying? (see what I'm saying)\nSee what I'm saying?\nSee what I'm saying?\nSee what I'm saying? (see what I'm saying)\nSee what I'm saying?\nSee what I'm saying?\n\n[Verse 4]\nFeel like I play for the Dodgers, making sacks, Troy Polamalu\nI been getting guala, young Quavo a shotter, you niggas imposters\nWalk in the kitchen you think I cook pasta (cook it up, cook it up)\nNigga who shot ya? Fuck with the squad and won't know who got ya\nThe plug front a hunnid I made it right back 'cause I told him I got  him\nKing of the jungle\nThey calling me Quavo Mufasa\nWhen I came in with Versace they calling me Quavo Big Poppa ('sace)\nWhen I came in told 'em bando and taught 'em how to whip up a toddler\nWhen we drop Hannah Montana you whipped out your camera to see what I'm saying\n\n[Chorus]\nSee what I'm saying? (see what I'm saying)\nSee what I'm saying? (huh?)\nSee what I'm saying? (see what I'm saying)\nSee what I'm saying? (huh?)\nSee what I'm saying?\nSee what I'm saying? (huh?)\nSee what I'm saying?\nSee what I'm saying?", "[Hook: PARTYNEXTDOOR]\nYeah, yeah, yeah\nIf I lose this bitch, I'm gonna get another\nMoney, money, money, that's my brother\nI need more, I need more, I need more, more\nI need more, I need more, I need more, more\nYeah, yeah\nOh yeah, oh yeah, oh yeah\n\n[Verse: Quavo]\nAyy, they lookin' at me like a water fountain\nThe way I'm flowin', flowin', flowin', flowin'\nThey lookin' at me like a water fountain\nThe way I'm goin', goin', goin', goin'\nI need more, I need more, I need more, more\nI'm so up, yeah I feel like I'm on the top floor\nLife so dangerous, the Bible in the top drawer\nOne question, gotta tell me what you'd die for\nAyy, go Forrest, to that money, run Forrest (yeah)\nHot boys, yeah we really hot boys (yeah)\nYour girl, yeah she really not yours (ayy, ayy)\nGot the key to the streets\nBeen pushin' so long, don't need a key\nGot the key to the streets, yeah, yeah\nIf I lose a bitch then I'ma get another one\nTreat her just the same, just like the other one\n\n[Hook: PARTYNEXTDOOR]\nYeah, yeah, yeah\nIf I lose this bitch, I'm gonna get another\nMoney, money, money, that's my brother\nI need more, I need more, I need more, more\nI need more, I need more, I need more, more\nYeah, yeah\nOh yeah, oh yeah, oh yeah", "[Chorus: Quavo]\nI pour an eight in a liter (ayy)\nWe trendin' the web like PETA (we trendin')\nI'm an OG like Adidas (OG!)\nTwo seater, two seater, two seater (skrrt)\nI got an iPhone and beeper (brrt)\nLook at your ho, she a cheater (look at her)\nAnd you still want to keep her (ew)\nI just Michael Jackson, beat her (beat it)\n\n[Verse 1: Quavo]\nDon't talk about swag, I'm dabbin' (I'm dabbin')\nI read up on all new assassins (pow)\nI'm movin' in orderly fashion\nWe gotta move like Obama, Obama, Obama\nMy niggas playing with plastic (plastic)\nMy life a real scare tactic (scary)\nYou niggas drinkin' molasses\nWhat is you drinkin'?\nWhy did you buy that and drink it?\nWhen I first got my pound, I broke it down (ayy)\nDancin' with the work like I'm James Brown (ow)\nYoung nigga havin' fame 'round town\nThen we got rich off of verbs and nouns\nNever been a sucker, never been a clown\nCash out a four four check, then watch it bounce\nTrap out the bando, trap out the ounce\nFinesse the plug 'cause he keeps changin' amounts (go)\nThirty in my hand, pump on the couch\n'Cause a nigga paranoid now (paranoid)\nIf you come up, don't abandon your hood (naw)\nThey'll be the first to punch you right out\nMy life is lookin' amazin' (ooh)\nIf I send you rice, it come with the gravy\nThink a nigga talkin' crazy (huh?)\nTry it 'fore you buy it, I make you pay me (go!)\n\n[Chorus: Quavo]\nI pour an eight in a liter (ayy)\nWe trendin' the web like PETA (we trendin')\nI'm an OG like Adidas (OG!)\nTwo seater, two seater, two seater (skrrt)\nI got an iPhone and beeper (brrt)\nLook at your ho, she a cheater (look at her)\nAnd you still want to keep her (ew)\nI just Michael Jackson, beat her (beat it)\n\n[Verse 2: Fetty Wap]\nI hurt suckers' feelings, I don't need you\nZoovie Zoo love Rem' by the liter\nIt’s gettin' cold and I love juugin' season\nTwenty thou' get you murked for no reason\nAye, Zoo Gang corner bending\nThis two seater sound different\nI drop the top, no ceilings\nI'm skirtin' on 'em when I serve 'em\nCollect mine, hit the birds, then\n'Fore I ran for the workin'\nI trap hard, that’s my worry\nI put that on my Irving\nEight-hundred-thousand on my brand new Benz\nAsk Zoo Gang, we don't leave loose ends\nEighty Zoo City at the corner, and I [?]\nAnd Quavo and ZooWap make your bitch jump in\n\n[Chorus: Quavo]\nI pour an eight in a liter (ayy)\nWe trendin' the web like PETA (we trendin')\nI'm an OG like Adidas (OG!)\nTwo seater, two seater, two seater (skrrt)\nI got an iPhone and beeper (brrt)\nLook at your ho, she a cheater (look at her)\nAnd you still want to keep her (ew)\nI just Michael Jackson, beat her (beat it)", "[Intro: Young Thug + Quavo]\nGot bands in the Tonka truck\nI mention he's fuckin' up\nGot bands in the Tonka truck\nBitch, go!\n\n[Hook: Young Thug (Quavo)]\nGot bands in the Tonka truck (Tonka truck)\nMy bitch want me to keep it up (Keep it up)\nI'm fallin' in love with her (I'm in love)\nQuavo wanna fuck on her (Migos!)\nHe tell me to give her up (No!)\nI tell him that's up to her\nShe tell me she don't wanna deal with him no more\nCause he used a spatula (No she ain't mine)\nShe a trapper girl!\nThe pots and the pans are her manager\nShe act like she don't like to cook it up\nBut I know how to handle her\nBut I know how to handle her\nHer wrist got too much stamina\nShe act like she don't like to cook it up\nBut I know how to handle her\n\n[Verse 1: Quavo]\nShe act like she don't like to cook it up (bitch, cook it up)\nShe bringin' in nothin' but extras, I'm in love\nHer wrist like a 2-in-1, she whip like a machine\nMe and Thug hit the plug, she workin' for the plug\nNow she workin' for me and PeeWee\nHow many times I told you, bitch I want them M's, nigga\nGet out my face, go, go in the kitchen\nCause Quavo don't wanna deal with you\nWhen you're whippin' don't take them heels, don't take nothin'\nAnd if you take my dope you gon' get killed\nBut forreal, bitch, swear to God I'll kill\n\n[Hook: Young Thug (Quavo)]\nGot bands in the Tonka truck (Tonka truck)\nMy bitch want me to keep it up (Keep it up)\nI'm fallin' in love with her (I'm in love)\nQuavo wanna fuck on her (Migos!)\nHe tell me to give her up (No!)\nI tell him that's up to her\nShe tell me she don't wanna deal with him no more\nCause he used a spatula (No she ain't mine)\nShe a trapper girl!\nThe pots and the pans are her manager\nShe act like she don't like to cook it up\nBut I know how to handle her\nBut I know how to handle her\nHer wrist got too much stamina\nShe act like she don't like to cook it up\nBut I know how to handle her\n\n[Verse 2: PeeWee Longway]\nSpeed it up, break it down, speed it up\nShe breakin' her wrist with a spatula\nI'm in love with her, she got the formula\nAnd it's up to her to give it up\nThem birdies comin' in on dump trucks\nShe karate chop just like nunchucks\nThugger and Quavo won't fuck with her\nBut they go to her to give it up\nMy palms itchy like I'm sippin' on Tuss\nActavis, my penmanship is too cut\nColossal livin', man I'm sneakin' and geeking\nAnd I manage my bitches, they know what's up\nBands, we rubber band double up\nGiuseppe steppin', what the fuck is up?\nDraped up in gold like my name's Shabba Ranks\nA young nigga might pull up Bentley truck\n\n[Hook: Young Thug (Quavo)]\nGot bands in the Tonka truck (Tonka truck)\nMy bitch want me to keep it up (Keep it up)\nI'm fallin' in love with her (I'm in love)\nQuavo wanna fuck on her (Migos!)\nHe tell me to give her up (No!)\nI tell him that's up to her\nShe tell me she don't wanna deal with him no more\nCause he used a spatula (No she ain't mine)\nShe a trapper girl!\nThe pots and the pans are her manager\nShe act like she don't like to cook it up\nBut I know how to handle her\nBut I know how to handle her\nHer wrist got too much stamina\nShe act like she don't like to cook it up\nBut I know how to handle her\n\n[Verse 3: Young Thug]\nI pull up in Bentley, the windows tinted\nRolled 'em down and she noticed it\nHow many times have I told you\nTo roll up the weed and don't smoke the shit?\nHow many times have I told you\nTo stay down and someone gon' notice it\nHow many times have I told you\nDon't knock the police but I told you to\nHow many times have I told you\nLil mama you super bad\nShe sufferin' succotash\nPut Looney and Tooney on pots and pans\nI am a street loadin' man\nI wrap 'em up in saran\nI think I'm the coolest man\nEver since I got in QC, fam\n\n[Hook: Young Thug (Quavo)]\nGot bands in the Tonka truck (Tonka truck)\nMy bitch want me to keep it up (Keep it up)\nI'm fallin' in love with her (I'm in love)\nQuavo wanna fuck on her (Migos!)\nHe tell me to give her up (No!)\nI tell him that's up to her\nShe tell me she don't wanna deal with him no more\nCause he used a spatula (No she ain't mine)\nShe a trapper girl!\nThe pots and the pans are her manager\nShe act like she don't like to cook it up\nBut I know how to handle her\nBut I know how to handle her\nHer wrist got too much stamina\nShe act like she don't like to cook it up\nBut I know how to handle her", "[Intro: Quavo]\nMigo!\nOTF\n\n[Hook: Quavo]\nShe said she ain't never seen a hunnid bands this skinny\nAss so fat, but her waist real skinny\nI make her serve up pies in a Bentley)\nForgiatto tires skinny\nNiggas ain't eatin you skinny\nMamacita real skinny\nMama said she ain't never seen no hunnid bands and I just look at the bitch, skinny\nNiggas ain't eatin you skinny\nYou niggas ain't eatin why you so skinny\nYou niggas ain't eating you skinny\n\n[Verse 1: Quavo]\nHuh dope, Quavo!\nOTF linked up with Migos gang\nYou niggas look sick I will spare you change\nDrop my top in a fuckin' range (Drop top)\nEatin' on big plate ridin down 85, gettin head all on the interstate\nBlack diamond white diamond it dont even matter, roll Gold White Gold jewelry integrate\nI thought that I told you fucking with gangsters you fuckin with mobsters (Told you)\nHe didn't believe me so I had to turn around and hit him second bopperbopper\nYou niggas is thug imposters, pockets is sloppy like whoppers\nMillion of dollars of gold my collar look like you put on some copper\nShittin' on you like the board game\nI'm sorry\nWhat would you do for a shopping spree neiman marcus\nI remember the days in a bando grippin' on the cartridge\nYoung niggas survived the jungle safari\n\n[Hook: Quavo &  Lil Durk]\nShe said she ain't never seen a hunnid bands this skinny\nLets get it\nAss so fat, but her waist real skinny\nI make her serve up pies in a Bentley\nSquad, squad\nForgiatto tires skinny\nNiggas ain't eatin you skinny\nMamacita real skinny\nLets get it, L's\nMama said she ain't never seen no hunnid bands and I just\nLook at the bitch, skinny Gang!\nNiggas ain't eatin you skinny\nYou niggas ain't eatin why you so skinny\nYou niggas ain't eating you skinny\nSquad, squad\n\n[Verse 2: Lil Durk]\nNiggas be mad when they see 10k\nAsk bout Durk when you see me we straight\nNo fool, zoo you a fool\nAnd you'll lose with A\nFour B's in a club they better\nThinkin bout robbin me boy thats an error\nSee on tape\nI want a fuck her (On twitter)\nI might add her\nSee Z put the 40 on me\nNo artist shooting keep da 40 on me\nCash out with Ca$h Out\nThe nigga bring jags out\nPull up kill the scene\nRun up on him gimme that nigga\nNigga skinny but no jenny craig nigga\nCan't hit my weed you a piggyback nigga\nSell my body then get it back nigga\nGot a 30 on 30 on 30 on me\nTwo gun cases can't go overseas\nGonna call from numba nine said the police on me (Lets get it, L)\nLink up in the streets and I ain't gonna leave\nGang\n\n[Hook: Quavo]\nShe said she ain't never seen a hunnid bands this skinny (Hunnid bands)\nAss so fat, but her waist real skinny (Fat)\nI make her serve up pies in a Bentley (Pies, whip)\nForgiatto tires skinny (Racks)\nNiggas ain't eatin you skinny (Eww)\nMamacita real skinny (Mamacita)\nMama said she ain't never seen no hunnid bands and I just look at the bitch, skinny (Mama! hunnud)\nNiggas ain't eatin you skinny (Ugh)\nYou niggas ain't eatin why you so skinny (What, huh)\nYou niggas ain't eating you skinny\n\n[Verse 3: Ca$h Out]\nCa$h Out, Migos, OTF, Boss up\nI'm in the bowl, yeah I'm in the bowl\nI'm cooking' a [?] (I'm cookin' the bitches right now)\nI'm [?] cooking' a [?], making my bitch do the dishes (My bitch do the dishes)\nShe got on her knees like genie, paint on her face for her wishes (makin' her wishes)\nShe said that shit is nutritious, she says young nigga distant\nHunnid band, hunnid band, Longway know that bitch skinny (You know that bitch skinny)\nI love them blue hunnid, I love them blue hunnid, she know that we winnin' (She know that we winnin')\nI'm mixin' designer, that Louie, the Gucci, and I drip in Givenchy\n(I'm mixin' it up and I'm mixin' it up, and I drip in Givenchy)\nI'm up in the kitchen, I'm workin' my wrist and I cook in a Bentley\n(I\"m workin' that bitch)\nI always been stunted, never felt the bitches (Never felt the [?])\nAlready ran it up, got it out the trenches (I'm always good)\nRunnin' up the long way [?]\nBut its normal stuff [?]\n\n[Hook: Quavo]\nShe said she ain't never seen a hunnid bands this skinny\nAss so fat, but her waist real skinny\nI make her serve up pies in a Bentley)\nForgiatto tires skinny\nNiggas ain't eatin you skinny\nMamacita real skinny\nMama said she ain't never seen no hunnid bands and I just look at the bitch, skinny\nNiggas ain't eatin you skinny\nYou niggas ain't eatin why you so skinny\nYou niggas ain't eating you skinny", "[Intro: PARTYNEXTDOOR]\nFerina\nThey don't know, now they know\nI've been too busy getting money\nI've been too busy playing these games that they play\nThat they want to play with me\nM-m-m-Murda\n\n[Chorus: Quavo & PARTYNEXTDOOR]\nShe tell that I ball from the whole shmoney (ayy)\nYou can't win a ring when you only pay ya rent (ayy)\nWhen you win a ring, I'ma keep you on the team (ring)\nWhen you win a ring, I'ma keep you on the team\n(I'ma keep you on the team, I'ma keep you on the team, baby)\nOn the team, baby, I'ma keep you on the team\n(I'ma keep you on the team, I'ma keep you on the team, baby)\nOn the team\n\n[Verse 1: PARTYNEXTDOOR & Quavo]\nRange Rover, Range Rover (yeah)\nSeventeen in a Ranger Rover (yeah, yeah)\nSeventeen and she came over\nThat's why I'm that– right now (ayy)\nPull up in that, pshhh, in that, pshhh, right now (ayy, ayy)\nCome away in that [?] right now\nPARTY is a wave when the tides die down (ayy, ayy)\nYou don't know (know)\nHow many can you tell that you slipped?\nYou've been here and you been there, done that (whoa, whoa)\nIG models, been there, been done that\nI mean my [?]  (ayy)\nShe up in the Trey house, come to Drake house (ohh)\nAnd to Chris house, [?] (ayy)\n\n[Verse 2: Quavo]\nSpend the next night (ayy) over PARTY house (woah)\nThen she turn around and wanna lay in my house (yeah)\nNo, she wanna ring, 'lil mama just wanna be champion\nShe want a ring, don't give me your heart\nI promise, I promise, I'll damage it\nDon't give me your heart\nI was growed up and raised by savages (savages, savages)\nAnd I was trained, just to go chase the cabbages (ayy)\nDamn, my hand got calluses (damn)\nYou too old, when you fuck her, need Cialis (smash)\nI got five hoes in my palace\nDrinking on fake lean, now you got dialysis (damn)\nPut this bitch on more mileage\nGot her late for her class in college\nEven though the pussy, yeah, it got mileage\nWhen I get it, yeah I'm dabbing and styling\n\n[Outro: PARTYNEXTDOOR & Quavo]\nShawty thought she want a baller\nNow she like, \"No, no, no\" (want a baller)\nShawty thought that a nigga wouldn't call her\nNow I'm like \"Whoa, whoa, whoa\" (whoa, whoa)\nIf I want that, I'ma get that (brr, brr)\nGet that, get that, uhh (brr, brr)\nIf I want that, I'ma get that (ayy)\nIf I want that, I'ma get that, oh yeah\nIf I want that, I'ma get that, oh yeah\nI'm 'gone make her put it all on me, baby\nI'm 'gone make her put it all on me, baby\nI'm 'gone make her put it all on me, baby\nI'm 'gone make her put it all on me, baby", "[Intro]\nMigo!\nCinco!\nQC!\n\n[Chorus]\nMigo and Cinco need 'bout 50 PT\nThe way she eat that molly she think it linguine\nAll these cameras on we in the spotlight\nMost of these niggas they'll do anything for the spotlight\nMost of these niggas they'll do anything for the spotlight\nThese niggas would take yo' life for the spotlight\nGotta keep me a pocket rocket with the red light\nMy momma told me they will turn on you for the spotlight\n\n[Verse]\nMy momma told me they will turn on me\nIf I didn't listen it was all on me\nSome of the niggas I didn't, some of the niggas I did\nIf you niggas didn't wanna see you win they ain't yo' friend\nNot at all\nGrowing up had to fight these niggas like Steven Seagal\nYou play with me now and I'mma shoot yo' head off\nCinco gotta make the call\nJust for the spotlight I know niggas would knock you off\nQuit lookin' at my life, get yo' mind right\nVersace my eyesight, I'm living the limelight\nNot you\nIs a nigga mad 'cause the spotlight not on you?\nI'm killin' the game 'cause momma she told me to\n\n[Hook]\nMigo and Cinco need 'bout 50 PT\nThe way she eat that molly she think it linguine\nAll these cameras on we in the spotlight\nMost of these niggas they'll do anything for the spotlight\nMost of these niggas they'll do anything for the spotlight\nThese niggas would take yo' life for the spotlight\nGotta keep me a pocket rocket with the red light\nMy momma told me they will turn on you for the spotlight", "(Hook):\nDem blue strip hunnids, I can't get enough (Dem blue strip hunnids)\nAll these women, I can't get enough (Go, ohh)\nTaking trips across the country, I can't get enough (Ugh, ugh)\nThis migo life I wanted, I can't get enough (Migo!)\nBut yo bitch I know she want me, she gon' give it up (Gon' give it up, ohh)\nNo, I can't get enough (Oh, no no)\nNo, I can't get enough (can't get enough)\nNo, I can't get enough (Ohh, no no no)\n\n(Verse):\nCan't get enough of me winnin' , can't get enough of these women\nCan't get enough of this money, so I stash it in the ceilin' (Stash, Stash)\nNo no, I can't get enough (Can't get enough!)\nIf a nigga wanna hate on me, I just might pull out the pump (Ohh, bow!)\nSmokin' sour in the tower (Sour!), I got the power (Power!)\nWhat plug you know pull up on us by the hour (Plug!)\nI can't get enough of the work, you know a nigga need it first (First!)\nI told my mama she won't ever see me riding in a hearse (Mama, go!)\nShe can't get enough of designer, everyday i buy a purse ('signer)\nWhen I told her I'ma make it rappin' , she believed in me first (Mansion!)\nI'ma bring home the M&M's mama, I give you my word (Ugh, m&m's!)\nEvery time I take you out the people 'round me go berserk (Go berserk, crazy!)\nCan't get enough of my life, no Yo Gotti, \"I am\" (I am)\nCan't get enough of the price, I'ma tax you, Uncle Sam (Sam!)\nShe can't get enough of the cameras, since I put her on the red carpet (Flash!)\nCan't get enough of the hood, can't leave the nawf side out starvin'\n\n(Hook):\nDem blue strip hunnids, I can't get enough (Dem blue strip hunnids)\nAll these women, I can't get enough (Go, ohh)\nTaking trips across the country, I can't get enough (Ugh, ugh)\nThis migo life I wanted, I can't get enough (Migo!)\nBut yo bitch I bet she want me, she gon' give it up (Gon' give it up, ohh)\nNo, I can't get enough (Oh, no no)\nNo, I can't get enough (can't get enough)\nNo, I can't get enough (Ohh, no no no)", "[Hook: Quavo]\nIt's nothing but getting money niggas with me\nNothing but getting money niggas with me\nSipping on Texas, Dirk Nowitzki\nSipping on Texas, Dirk Nowitzki\nIt's nothing but getting money niggas with me\nNothing but getting money niggas with me\nSipping on Texas, Dirk Nowitzki\nSipping on Texas, Dirk Nowitzki\n(Actavis!)\n\n[Verse 1: Quavo]\n41 shots, Dirk Nowitzki\nWhole bunch of chickens in the ceiling\nAll my rich hood niggas feel me\nPull out banana, get to peeling\n15 Vince Carter on the wing\n17 five for a wing\nEvery time my fucking phone ring\nAsians in China speak Chinese\nBad bitches in the VIP please\nHundred racks on my chain sneeze\nI'm sick, 40 thousand rich\nQuavo took your bitch\nSliding in that six\n\n[Hook: Quavo]\nIt's nothing but getting money niggas with me\nNothing but getting money niggas with me\nSipping on Texas, Dirk Nowitzki\nSipping on Texas, Dirk Nowitzki\nIt's nothing but getting money niggas with me\nNothing but getting money niggas with me\nSipping on Texas, Dirk Nowitzki\nSipping on Texas, Dirk Nowitzki\n\n[Verse 2: Young Dolph]\nTrapping out a mansion, choppers in the bando\nSmoking strong, doing donuts in that Lambo\n11th grade in the lunch line with a bankroll\nI fucked your bitch from the back without my chains on\nAnd my shades on\nThen I sent her home\nCartier frames match the presidential Rollie\nI drink promethazine because it taste good with what I'm smoking\nI told your bitch take off her shoes 'fore she jumps in my car\nGetting head, counting money that's my favorite part\nA million dollars worth of cars in the front yard\nI keep real niggas with me everywhere I go\n20 foreigns back to back in a row\n\n[Hook: Quavo]\nIt's nothing but getting money niggas with me\nNothing but getting money niggas with me\nSipping on Texas, Dirk Nowitzki\nSipping on Texas, Dirk Nowitzki\nIt's nothing but getting money niggas with me\nNothing but getting money niggas with me\nSipping on Texas, Dirk Nowitzki\nSipping on Texas, Dirk Nowitzki", "[Intro: Quavo]\nAll this time\nAll them niggas we done tried them\nWe done tried to warn 'em\nAll these other labels we done tried to warn 'em\nAll these fuck niggas we done tried to warn 'em\n\n[Bridge: Quavo]\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna let a nigga in\nThey ain’t wanna let a nigga in\nThey ain’t wanna let a nigga in\n\n[Hook: Quavo]\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nBetter let us in or we gon' kick the door down\n\n[Verse 1: Quavo]\nBetter let us in or we gon' kick this door down\nGot heavy artillery, Glock 9’s, SK’s (What else? Hundred rounds!)\nI’m lookin' around, I’m lining 'em up, yo artist is takin' the sound\nThe industry won't let us in, fuck it, kick the door down\nI told 'em that day would come, now we on top\nLook at them, watch how they run try to get they spot\nThey wanna be kin, they wanna be friends, they tryna get in\nYou think that day I don’t remember you? You don’t let us in\n\n[Hook: Quavo]\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nBetter let us in or we gon' kick the door down\n\n[Verse 2: Losie]\nThey ain’t wanna see a nigga in\nWe independent and we countin' Benjamins\nThe rap game got no friends\nNigga fight, nigga pretend\nNigga act like yo man\nNigga won’t even give you a hand\nNigga talk behind yo back\nWon’t happen if you ain’t got a sack\nThis a true story real facts\nMake the whole world roger that\nAnd QC fuck ?\nHunned bands, watch them fat\nWe done ran up a check\nIn the rap game I sit back\n\n[Verse 3: Jose Guapo]\nAll the hoes wasn't fuckin' with me back then\nBut all the bitches wanna fuck Young Guapo now\nTen promoters at my fuckin back end\nGot a pint of lean whenever Guapo fly in town\nMotherfuck the rap game and industry\nThe streets they taught me never show no sympathy\nI swear I never thought I’d be on MTV\nThem M&Ms the only thing that interest me\nI know why they envy me\n\n[Hook: Quavo]\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nBetter let us in or we gon' kick the door down\n\n[Verse 4: MPA Duke]\nBack then they wasn't fuckin' with me\nNow they can’t get enough of me\nNow the cameras out and they flashin'\nPaparazzi takin' pictures\nYoung independent niggas ballin like the major league\nI think they done caught a disease\nI’m allergic to brokanese\nYoung nigga came from the bottom\nTo the top I had to grind\nI was on the block fore the sunrise\nSo a young nigga like me had to shine\nCame a long way from bustin' bands and servin' Ziploc\nSolid foundation, QC the label\nWe hangin' above the label\n\n[Hook: Quavo]\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna let a nigga in\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nSo we had to kick the door down\nThey ain’t wanna see a nigga win\nBetter let us in or we gon' kick the door down", "[Intro: Quavo]\nZaytoven\nHuh (DJ Durel)\nMigo, woo, chyeah (Give 'em hell)\n\n[Chorus: Quavo]\nI fell asleep in the bando then I woke up in the mansion\nStill trapping out the house, I'm selling Marilyn Manson\nStill wrapping the plastics, money stretching elastic\nMama told me when I grow up boy don't be like your Daddy\n\n[Verse 1: Quavo]\nFinessing the plug with magic (Magic)\nI took the strippers in magic (Magic)\nSeeing Grandma in the casket (Grandma)\nIt turned me out to a savage (Savage)\nI'ma continue the dabbin' (Woo)\nI'ma continue the trappin' (Trap)\nMy chopper continue to blast them (Rra)\nYou gon' continue the actin' (Act)\nRemember the days finessing the plug and runnin' the plays like Madden (Remember)\nNow I'm overseas Milan and China meet with the plug named dragon (Woo)\nI pipe it, I pour up a deuce (Deuce)\nI keep a strap in the booth (Yeah)\nTwo niggas they looking kahoots (Who?)\nI'm not afraid to shoot (Bah)\n\n[Chorus: Quavo & Hoodrich Pablo Juan]\nI fell asleep in the bando then I woke up in the mansion\nFrom a nic to a brick, I made a million dollars trappin'\nI fell asleep in the bando then I woke up in the mansion\nWe trap dab and sell Givenchy bricks in designer fashion\nI fell asleep in the bando then I woke up in the mansion\nI used to have to go and catch the skrrrt now I'm the one who pass it\nI fell asleep in the bando then I woke up in the mansion\nI'm a rockstar sellin' Justin Beiber, Marilyn Manson (Ooh, Pablo Juan)\n\n[Verse 2: Hoodrich Pablo Juan]\nNic to a brick in the field with the chopstick\nPull up in zone 6, droptop M6\nStraight out the bando, cookin' up big bricks\nBust it down in the trap sellin' fish sticks\nTruck load come, I'ma fuck up my wrist (Woo, woo)\nTrap out the mansion, trap out apartment (Trap out the part)\nJump in the water swim where the sharks at (Swim)\nToo many bricks, plug our contact\nStash house I put the work in the carpet (Stash house)\nStash spot got a secret compartment\nSK hunnid round in my cartridge\nPlug in Canada, got a cookie garden\nMy lawyer Michael Jordan he beat the charges (Mike)\nYou are our decoys in the charger (Huh)\nSell you a Brett Farve or a Tony Parker\nSellin' Lieutenant Dan I'm the Sargent\n\n[Chorus: Quavo & Hoodrich Pablo Juan]\nI fell asleep in the bando then I woke up in the mansion\nFrom a nic to a brick I made a million dollars trappin'\nI fell asleep in the bando then I woke up in the mansion\nWe trap dab and sell Givenchy bricks in designer fashion\nI fell asleep in the Bando then I woke up in the Mansion\nI used to have to go and catch the skrrt now I'm the one who pass it\nI fell asleep in the bando then I woke up in the mansion\nI'm a rockstar sellin' Justin Beiber, Marilyn Manson", "[Hook]\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nYour favorite rapper, ain't rich as your average trapper\nYour favorite rapper, ain't rich as your average trapper\nYour favorite rapper, ain't rich as your average trapper\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\n\n[Verse 1]\nYour average trapper might be as rich as your favorite rapper\nFlexing in front of the camera\nBalling like he got the stamina\nReally he don't even amount to nothin'\nWhat is your worth?\nBoy you a turd\nReal trappers on the curb\nReal trappers like to serve\nYou want that life that he deserve\nDope boys buy a car and they owning\nRap niggas get the car and they renting\nI know some trappers that worth about fifty\nI know some trappers that's living like Diddy\nI know some trappers that took more shots than 50\nShout out to my nigga 50\nAnd I know some rappers that's still penny penching, still trynna' get a digit\nI'm a real rapper nigga, check my bank account, I bet you see a milli\nI'm a real rapper nigga, shout out to the trappers trapping in the city\nTrappers slash rapper nigga, might catch a nigga trapping out a Bentley\nYou a trapper slash actor nigga, you would take a Oscar or an Emmy\nFree my nigga Offset, all my niggas thugging ain't no pretending\nWhen I was out trapping, you working at Wendy's\nI got a pint of some drink and on Denny's\nWhen I trap a brick, you might think I'm at Benny's\nI keep a rack on me like I play tennis\nPlay with the weight like I'm at LA Fitness\nTrapper slash rapper I handle my business\nPull out the chopper boy go mind your business\nI pop a perc and then come to my senses\nAdd the shit out and I don't leave a witness\nShout out to trappers that trapping at Whitney\nMigo the gang brung the north to the city\nMet with some trappers that's running the city\nMade an empire, QC we submitting\nStarted from nothing, and now we worth millions\nIf you a real trapper, I know that you feel this\nAt the table with the plug like the Indians and Pilgrims\nMy niggas don't give no fuck 'bout your feelings\nI know some trappers, got M's in the ceiling\n\n[Hook: Quavo]\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers\nYour favorite rapper, ain't rich as your average trapper\nYour favorite rapper, ain't rich as your average trapper\nYour favorite rapper, ain't rich as your average trapper\nI know some trappers that's richer than rappers\nI know some trappers that's richer than rappers", "[Hook]\nI done seen a lot of digits (one, two, three)\nI done seen a lot of pigeons\nYoung nigga, young nigga, I’m tired of it\nYoung nigga, young nigga, I’m tired of it\nI done seen a lot of pigeons\nYou know I want a lot of millions\nYoung nigga, young nigga, I’m tired of it\nI swear to god, I’m tired of it\n\n[Verse 1 – Quavo]\nI done seen a lot of DJs kicking doors\nI swear to god my mama know I got hundos\nShe paying bills by herself, I know she tired of it\nI got niggas on the northside that will ride for her\nYoung Quavo the head hancho, I point fingers and they go\nI got niggas that pull kiddos and point choppas at your nose\nI talked to the lord and told him that the rap game can’t take my  soul\nMy niggas a fool with the tool, my niggas a fool with the bowl\nYou niggas are fools, take your bitch and she hop in my Rolls\nShe working the pole, she don’t want to be a freak no more\nBut young Quavo got hundos\n\n[Hook]\n\n[Verse 2 – Foolie]\nShe say I’m a fool, pull up with no roof\nAston Martin sitting on Forgi’s on them 20 ooh\nYou know I’m a goon, ask about me girl\nI’m on that northside with young Quavo chilling in that bando\nThey making me spaz, I’m on your ass if you don’t got my cash\nM&M, M&M, all about the  blue benjamins\nThese niggas they really pretending shit\nMy niggas they really be kicking shit\nUp in your house, tie up your spouse\n700 Migo gang, L.A. to the to the south\nThese niggas they switching to sides\nLike they switching the bitches, all of my niggas gon get it\nI pull up, that pistol extended\nI’m kinda like I got some children\nPimping, I’m flipping these pigeons\nLet’s go!\n\n[Hook]", "I just took a flick with your girlfriend\nI be kicking shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend\n\nI want her, I want she, I want all of them\nI might hit your main hoe then never call her\nI might hit your main bitch in the Wraith too\nI'ma screenshot the text and get 'em sharing room\nI wanna fuck on her friend\nI only fuck with them 10's\nI fucked that hoe with a tan\nYeah y'all been together 10 years\nI wanna see what it tastes like\nShe hit the Perc' then take flight\nI met your hoe at the red light\nI hit that hoe on the same night\nRidin' with a baddie with that Kylie Jenner lipstick\nI was playin' Madden, so I hit her with that Hit Stick\nTook a flick with her then I cropped her out with PicStitch\nAll this sauce on me, I feel like I come from Dipset\n\nI just took a flick con tu novia\nI just gave some dick to your esposa\nI think she in love with the coca\nYou know why I'm here, open your boca\n\nI just took a flick with your girlfriend\nI be kicking shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend\n\nDolla hit the mall with your bae\nDolla get the mall with your bae\nDolla got some top from your bae\nJackie Chan, Dolla chop your bae\nShe say darlin' buy me new Celine\nCan we go to Rodeo?\nDolla buy me Gucci\nTake me to the club with you\nI been riding through the city\nWith a bitch with big titties\nOoh she fine, ooh she fine\nAll of Dolla bitches pretty\nFlexin' we be flexin'\nWe be running up a budget\nAsk no question, ask no question, what it cost like, fuck it\n\nI ain't even know that was your girlfriend\nI just hit it raw like that's my girlfriend\nTook a private flight with your bae\nDolla one night your bae\n\nI just took a flick with your girlfriend\nI be kicking shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend\n\nYou just spent ten racks on your girlfriend\nShe was walkin' out the mall 'til I said 'Get in!'\nAs we pullin' off, I'm askin' that's yo man tho!\nSkip the condo 'cause we go straight to the bando\nHeard it's wet like water yeah Fiji (water)\nHeard that you a savage, yeah Riri\nShe like me 'cause her boyfriend wanna be me\nHe keep rewinding me back on the TV\nHop in the 'Rari no mileage\nShe got amazing body\nI met your girl at Follies\nThen I put her on a private\nThen we land on a island\nYour girlfriend, got a girlfriend\nThat dig all in your wallet\nBaby girl so smart, she in college\nShe don't like to hang with no thot bitch\nShe can't wait to bang with your side bitch\nThen she pullin' up the lot with her best friend\n\nI just took a flick with your girlfriend\nI be kicking shit with your girlfriend\nI just smoked a blunt with your girlfriend\nI think that I'm done with your girlfriend\nAll up in my business, she been lurkin'\nI've been tryna tell her bye, it ain't workin'\nI think that I'm done with your girlfriend\nI just smoked a blunt with your girlfriend", "[Intro]\n(Yeah)\nThank God that a n*gga still alive (God)\nBought the beamer with the frog eyes (beamer)\nGot yo bitch cut, her eyes (yo bitch)\n(Yeah, uh)\n\n[Verse]\nI took yo bitch to the doctor (yeah)\nI told yo bitch to get well (well)\n'Cause she too sick off a playa (playa, yeah)\nI wanna buy me a bale (ayy)\nI wanna buy me a bale (bale)\nI wanna buy me a bale (yeah, big bale)\nTold the plug get that bag right\nI'm finna pull up on 'em\nYeah, you know my cash right (cash)\nThese lil n*ggas want my limelight\nChopper eight miles long, Mekhi Phifer (schwoo, rrrah)\n(Ayy, ayy)\nAnd I want all my n*ggas just to come and eat good with me (yeah, yeah, yeah)\nI'ma go straight to Hollywood, but I gotta take the hood with me (hood)\nI gotta move in silence\nCounting my money in private (cash)\nDon't think a n*gga acknowledge (no)\nDon't think a n*gga acknowledge (knowledge)\nAll my cars zero mileage\nWanna verse, forget about it (nah)\nYou think I'm signed to Little Caesars (woo)\nPocket dough, fettuccini (ayy)\nI told the bitch I'm havin' sand time (sand time)\nShe pulled up in bikini ('kini)\nBall cap, no beanie (cap)\nTrap signals, no beamer (trap)\nWrists dancin' like Fergie (wrists)\nThought I was a Black Eyed Peas-y (ooo)\nNone of my n*ggas is cheesy (no)\nTrap life real easy (ayy)\n\n[Outro]\n(Then I had to tell my ma)\nTell my mama no (mama)\nNow I can't stop thuggin' (yeah)\nTold my mama nah (mama)\nNo, I can't stop thuggin'", "[Verse: Quavo & Saweetie]\nUh, generation after generation (Woo)\nHandle business without hesitating (Hey)\nSay the world gon’ change, but I’m still waiting\nI done ran out, but I’m still patient (Uh)\nWho is the man, yeah, with the bands, yeah?\nWith the plans, yeah? (Who?)\nWho they gon’ call when they come in the bam, yeah? (Brrr, shaft)\n\n[Chorus: Quavo, Saweetie & Both]\nToo much shaft, coming through there (Hey)\nToo much shaft, run through there (Shaft)\nWho you gon’ call? It’s a shootout (Blaow)\nBlack man looking for a way out (Shaft)\nOoh, blessing all his black suits\nAnd all the fancy shoes (Hey, yeah, woo, shaft)\nWho is the man?\nToo much shaft\nWho is the man?\nToo much shaft\nWho is the man?\nToo much shaft\nWho is the man? (Shaft)\nToo much shaft, coming through there (Hey)\nToo much shaft, run through there (Shaft)\nWho you gon’ call? It’s a shootout (Blaow)\nBlack man looking for a way out (Man)\nOoh, blessing all his black suits and all his fancy shoes (Shaft)\n\n[Verse: Quavo & Saweetie]\nUh, generation after generation (Woo)\nHandle business without hesitating (Hey)\nSay the world gon’ change, but I’m still waiting\nI done ran out, but I’m still patient (Uh)\nWho is the man, yeah, with the bands, yeah?\nWith the plans, yeah? (Who?)\nWho they gon’ call when they come in the bam, yeah? (Brrr, shaft)\n\n[Outro: Saweetie]\nUh, uh, who you think you talkin' to?\nHaha, boy, you better shut your mouth", "[Intro: Quavo & Young Thug]\nOk\nMigo!\n[?]\nBout time, bout time, bout time, bout time, bout time\nI swear to God\nGod damn time, ayy\nThugger\nUr girl say she wanna fuck wit me\nWe brothers\nGotta tell you something\nWe came a long way\nAnd that's why I say\n\n[Hook: Young Thug]\nBout time, bout time, bout time, bout time, bout time\nBout time, bout time, bout time, bout time, bout time\nBout damn time, I swear to God\nGod damn time, ayy\n\n[Hook: Quavo]\nPlease stop wasting me time (Time, woah)\nLil mama she want em to love her\nI had to tell my brother Thugger\nHe told me she wasting me time (Time)\nShe callin' my phone all the time\nShe say that she wanna spend time\nI think the she lyin'\nShe wasting me time\n\n[Bridge: Quavo]\n(Quavo!)\nLemmie ask you sumthin' Thug\nShe tellin' me that she in love (She say that she love me)\nI don't know what to do God damn Thugger Thugger come and talk to me bro (Talk to me!)\nDamn!\n\n[Verse 1: Quavo & Young Thug]\nWhat\nThese bitches know I wanna fuck 'em all\nYoung Money shit\nI know that she workin' (Workin')\nI thinks he deserve it (Know she deserve it, huh)\nI ain't even dropped a sack yet but an nigga bought a new Birkin (Lil bitty bag)\nThese bitches know they come round me with no drawers\n(Cause what?) I'm on that horny shit, whoo\nI know that I'm slippin' but lemma get back on my pimpin' (slip on my pimpin')\nWhen I bought the mansion she told me she wanna live in it (Live in the mansion!)\nWhen I bought the Bently she told me she wanna whip in it (The Bently, skurrt)\nI think I'm bein' to friendly you the one that witnessed it\n(Help me)\n(Can you explain it to me)\n(What the hell am I doin')\n(Cuz I don't know, no)\nHell is a nigga doin' (Hell am I doin' huh)\nShe running away wit my heart\n(Shot her down on the bulevard)\n\n[Hook: Quavo]\nPlease stop wasting me time (Time, woah)\nLil mama she want em to love her\nI had to tell my brother Thugger\nHe told me she wasting me time (Time)\nShe callin' my phone all the time\nShe say that she wanna spend time\nI think the she lyin'\nShe wasting me time\n\n[Hook: Young Thug]\nBout time, bout time, bout time, bout time, bout time\nBout time, bout time, bout time, bout time, bout time\nBout damn time, I swear to God\nGod damn time, ayy\n\n[Verse 2: Young Thug]\nI done ran that money up, bout time\nI used to stack a five, now I'm stacking dimes\nI don't care if none of y'all ain't my kind\nYour watch cost 5000, you wasted your time\nAnd I'm finished, why you still at the line?\nIf you ain't Damu nigga, you must be blind\nAnd I ain't turning down, turn down for what?\nI'ma turn up every time, every time, every time, every time\nThis that horny shit, I don't care, I got hunnids bitch\nAcapella now, I'ma beat your fucking clit, ugh\nI might nail this shit, I won't never tell the bitch\nAll my bitches thin and brown, this that pretzel shit\nMiss Chelle, Miss Chelle\nShe got bumps and rumps all over BB\nI buy her CC, then I turn that shit to BB\nI'm like feed me, feed me, feed me\nI don't wanna eat ye\n\n[Hook: Quavo]\nPlease stop wasting me time (Time, woah)\nLil mama she want em to love her\nI had to tell my brother Thugger\nHe told me she wasting me time (Time)\nShe callin' my phone all the time\nShe say that she wanna spend time\nI think the she lyin'\nShe wasting me time\n\n[Bridge: Quavo]\n(Quavo!)\nLemmie ask you sumthin' Thug\nShe tellin' me that she in love (She say that she love me)\nI don't know what to do God damn Thugger Thugger come and talk to me bro (Talk to me!)\nDamn!\n\n[Outro: Young Thug]\nIt's bout time bitch\nHe ain't have nothing to say nigga\nAin't going back, nigga\nI drank pints a day, bitch\nLoaded, ay", "[Intro]\n(Murda on the beat so it's not nice)\nHuncho\n\n[Chorus: Quavo & Young Thug]\nLike the nineteen ninety-one (Huncho)\nLike the nineteen ninety-one\nLike the nineteen ninety-one (Hey)\nLike the nineteen ninety-one (Hey)\nBack in the nineteen ninety-one (Woo)\nHuncho on these hoes, call the fuckin' 911\nBackflip, palindromic numbers, it's the 1991\nOn tank battle, crash it, Norfolk '91\nBack in the nineteen ninety-one\nBad bitch on me and she knows that I'm the one (Woo)\nLike the nineteen ninety-one (Hey)\nLike the nineteen ninety-one (Woo)\nLike the nineteen ninety-one (Hey)\nLike the nineteen ninety-one (Woo)\nBack in the nineteen ninety-one, yeah\n\n[Verse 1: Quavo]\nAin't no time, bought a 'Rari, now too fast (Now too fast!)\nOff-White my shoes, canvas-black, Spooky Pack, yeah\nVVS on my neck, call me Flash\n'91 with Deion on cornerback\n12 on me, cut the phone, don't call me back, yeah\nHide it in my Gucci bag, hit the gas (Hit the gas!)\nSkrrt-skrrt\n...", "Intro:\nKing of L.A. (Uh)\nKing of L.A. (King)\nKing of L.A. (Woo)\nKing of L.A. (Uh)\nKing of L.A. (Woo)\nKing of L.A. (Uh)\nKing of L.A. (Uh woo)\n\nVerse: (Quavo)\nKing of L.A. (Lebron)\nI guess it’s safe to say, the OG’s paved the way\nNow it’s time for LBJ (James)\nFinger roll finish filayyyy (Finger roll)\nFinger roll is a filay (Filayyy)\nOh do not get in the way, here come the king drivin the lane (King)\nFace of the NBA (woo), somebody change the logo (sorry Jerry)\nI believe we can take em solo (uh-uh sike)\nBut I love the team, shoutout to Lonzo (Lonzo whassup)\nKuzo (Ku), Lance-o, and Rondo (Rondo woo)\nWe knocking at the championship’s front door (Knock-knock)\nUh, knocking at the championship’s front door (Knock-knock)\nEh, MVP, MVP times four (MVP)\nYear 16 never know how long he go (Know)\nInspired the youth, that’s what he built the school for (Kids)\nYeah, that’s the definition of a real GOAT (GOAT)\nTook his arms and wrapped it all around the whole globe (here)\nJump shot all cash like a bank roll (Splash)\nJump shot all cash like a bank roll (Don’t touch it)\nNew NBA season here, now we goin' beast mode\n\nChorus:\nKing of L.A. (Uh)\nKing of L.A. (King)\nKing of L.A. (Woo)\n\nKing of L.A. (Uh)\nKing of L.A. (King)\nKing of L.A. (Woo)", "[Intro]\nYeah\nYeah\n\n[Verse 1]\nI got a Glock (Pew pew)\nIt came with a pot (Skrrt skrrt)\nI need a box (Woo woo)\nTo send to the spot (Send it, where)\nYour trappin' is froze (Froze)\nAnd I’m gettin' hot (Hot hot)\nI'm havin’ all the O's lookin' like in and out (In and out)\nGimme the [?], get it and ship it out (Ship it out)\nToo many bricks and bowls, I need a bigger house (Bigger house)\nIt's still one thing they tryna figure out (Figure it out)\nWhen the fuck I'm gon' ship it (Woo)\n\n[Hook]\nShip it (Ay), ship it (Woo), ship it, ship it (Uh)\nShip it (Yeah), ship it, ship it, ship it (Ship it)\nShip it (Ay), ship it (Woo), ship it, ship it (Ooh)\nShippin' it in and out (Where)\nShippin' it in and out (Where)\nShip it (Ship it), ship it, ship it, ship it (Woo)\nShip it (Yee), ship it, ship it, ship it (Ship it)\nShip it, ship it, ship it, ship it (Uh)\nShippin’ it in and out (Woo)\nShippin’ it in and out (Ship it)\n\n[Verse 2]\nTwo bad bitches and I gotta swap 'em out (Swap it)\nI can’t keep 'em both together I gotta ship 'em out (Ship it)\nYeah word of mouth (Word)\nI got the trap house (Trap)\nI got the trap house boomin' all the way, tho\nI treat the work like the turntables, break down (Uh)\nI treat your bitch to a hot plate at Waffle House (Hot)\nEverybody say a prayer when we send ’em out (God)\nWhen we get 'em, goddamn cause we sinnin' now (Goddamn)\nYeah, told the lord forgive me, bless me (Forgive me)\nGonna test me (Test me)\nThey'll be gone in sixty seconds (Sixty)\nAnd I'll be restin' (Restin')\nIf you got pressure (Huh?)\nIf you got pressure go and impress me (Press)\nWhen you see that rental swerve [?] (Skrrt)\nOrganizing all these blocks like I'm playin' Tetris (Woo, uh)\n[?] (Ay)\nTook some losses but I thank the lord for my blessings (God)\nI ain't got time for confessions (Nah)\nNow ship it (Woo)\n\n[Hook]\nShip it (Woo), ship it, ship it (Uh), ship it (Yeah)\nShip it, ship it, ship it, ship it (Ship it)\nShip it (Ay), ship it (Woo), ship it, ship it (Ooh)\nShippin' it in and out (Where)\nShippin' it in and out (Where)\nShip it (Ship it), ship it, ship it, ship it (Woo)\nShip it (Yee), ship it, ship it, ship it (Ship it)\nShip it, ship it, ship it, ship it (Uh)\nShippin' it in and out (Woo)\nShippin' it in and out (Ship it, gone)", "[Intro: Jose Guapo]\nI ain't time for this shit\nSay I ain't time for this shit now\nI ain't time for no bitch now\nI ain't time for this shit now\n(Picture me rolling)\nI think I had too much to drink\nI think I had too much to drink\nI think I had too much to drink\nShe think she had too much to drink\n\n[Chorus: Jose Guapo]\nI think I had too much to drink\nI think she had too much to drink\nI think I had too much to drink\nI think she had too much to drink\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\nPicture me rolling\nSay picture me rolling rolling rolling\nPicture me smoking\nJust Picture me smoking smoking smoking\nPicture me rolling\nPicture me rolling rolling rolling\nSay picture me smoking\nImma keep on leaning\nImma keep on smoking\n\n[Verse 1: Jose Guapo]\nI got your bitch drunk off a fill\nI'm pouring her zip after zip\nStripper bitches dancing all on me\nWe throwing money  in the vip\nYou can get hit in your lip (your mouth)\nThen pull off in the spaceship\nTell her gon buss it open for a real nigga\nTell her gon buss it open for a rich nigga\nI ain't going back to forth with no bitch nigga\nThey don't know what we did for this shit\nThat's why I get high and smoke zips\nThat's why I keep pouring zips\nThat's why I'm trying to see why they want to judge me\nWhen they ain't really did nothing for me\nI'm just gone pop me another seal\nTell a bad bitch gone pop another molly\nI'm a high-class street nigga shit model\nImma get in that pussy go full trottle\nXanax make me feel everything\nSo I don't even know if I'm gonna know tomorrow\nI told her, gon take another shot\nAfter that you could follow me to the spot\nBetter yet you could follow me to a suite\nIts yung Guapo and baby you so unique\nI could put that Chanel all on your feet\nYSl you could smell that all over me\n30,000 yeah I got that all on me\nEveryone know yea I keep it all on me\n\n[Chorus: Jose Guapo]\nI think I had too much to drink\nI think she had too much to drink\nI think I had too much to drink\nI think she had too much to drink\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\nPicture me rolling\nSay picture me rolling rolling rolling\nPicture me smoking\nJust Picture me smoking smoking smoking\nPicture me rolling\nPicture me rolling rolling rolling\nPicture me smoking\nImma keep on leaning\nImma keep on smoking\nAye\n\n[Verse 2: Quavo]\nI think I had too much driz-ank\nDrinkin on lean out the Piz-ain't\nI think she had too much to driz-ank\nFalling for love and she fiz-ain\nStanding on all them purple riz-ain\nI'm sorry I forgot your Niz-ame\nShe fell in love with my chiz-ain\nYou fuck with her I blow your briz-ain\nYou niggas fell off cuz you lil Zane\nI'm grinding on your hoe like Lil Wayne\nI'm keeping two pistols like Max Payne\nI think I'm confusing her brain\nI want to make lil mamma main (mine)\nOn her birthday got her a range\nI introduce her to the game\nThen lil mamma bought her a plane\nI'm moving in circles\nI had too much to drink\nI'm moving in slow mo\nI don't want to drink no more\nShe said the same thing\nCuz she had too much driz-ank\nShe said the same thing\nCuz she had too much driz-ank\n\n[Chorus: Jose Guapo]\nI think I had too much to drink\nI think she had too much to drink\nI think I had too much to drink\nI think she had too much to drink\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\n(I ain't got time)\nI ain't got time for that\nPicture me rolling\nSay picture me rolling rolling rolling\nPicture me smoking\nJust Picture me smoking smoking smoking\nSay picture me rolling\nSay picture me rolling rolling rolling\nPicture me smoking\nImma keep on leaning\nImma keep on smoking\nAye", "[Intro: Quavo]\nYeah, yeah\n(Deko)\nWoah, hold on\n(OG Parker)\nUh\n\n[Chorus: Quavo]\nWalk it like I talk it (walk it)\nWalk it like I talk it\nWalk it, walk it like I talk it (woo)\nWalk it like I talk it (yeah)\nWalk it like I talk it (walk it)\nWalk it like I talk it\nWalk it, walk it like I talk it (woo)\nWalk it like I talk it (hey)\nWalk it like I talk it (walk it)\nWalk it like I talk it (walk it)\nWalk it like I talk it\nWalk it, walk it like I talk it (woo)\nWalk it like I talk it (talk it)\nWalk it like I talk it (ayy)\nWalk it like I talk it (woo)\nWalk it, walk it like I talk it (yeah)\n\n[Verse 1: Quavo]\nTake my shoes and walk a mile\nSomethin' that you can't do (woo, hey)\nBig talks of the town, big boy gang moves (gang moves)\nI like to walk around wit' my chain loose (chain, chain)\nShe just bought a new ass but got the same boobs (same boobs)\nWhippin' up dope, scientist\n(Whip it up, whip it up, cook it up, cook it up, skrr, skrr)\nThat's my sauce, where you find it?\n(That's my sauce, look it up, look it up, find it)\nAddin' up checks, no minus\n(Add it up, add it up, add it up, add it up, yeah)\nGet your respect in diamonds (ice, ice, ice, ice, ice, ice)\nI bought a Plain Jane Rollie\nThese niggas bought they fame (woo)\nI think my back got scoliosis 'cause I swerve the lane (skrr)\nHeard you signed your life for that brand new chain (I heard)\nThink it came with stripes\nBut you ain't straight with the gang (gang, gang)\n\n[Chorus: Quavo]\nWalk it like I talk it (walk it), walk it like I talk it (yeah)\nWalk it, walk it like I talk it (talk it), walk it like I talk it (woo)\nWalk it like I talk it (walk it), walk it like I talk it\nWalk it, walk it like I talk it (talk it), walk it like I talk it (let's go)\nWalk it like I talk it (walk it), walk it like I talk it (woo)\nWalk it like I talk it, walk it, walk it like I talk it (hey)\nWalk it like I talk it (walk it), walk it like I talk it (yeah)\nWalk it like I talk it, walk it, walk it like I talk it\n\n[Verse 2: Drake]\nAyy, I gotta stay in my zone\nSay that we've been beefin' dog, but you on your own\nFirst night, she gon' let me fuck 'cause we grown\nI hit her, gave her back to the city, she home (She at home now!)\nThat was that, so I can't be beefin' with no wack nigga, got no backbone\nHeard you livin' in a mansion in all your raps, though\nBut your shit look like the trap on this Google Maps, though\nMigo trapphone, runnin' water on my Rollie in the sink, in the sink\nHit the spa, a nigga workin' out the kinks, out the kinks\nOut the kinks, sent my girl to the salon\nOnly one to go from six to twenty three is me and Bron\nKnow I\n\n[Chorus: Quavo]\nWalk it like I talk it (walk it), walk it like I talk it (yeah)\nWalk it, walk it like I talk it (talk it), walk it like I talk it (woo)\nWalk it like I talk it (walk it), walk it like I talk it\nWalk it, walk it like I talk it (talk it), walk it like I talk it (let's go)\nWalk it like I talk it (walk it), walk it like I talk it (woo)\nWalk it like I talk it, walk it, walk it like I talk it (hey)\nWalk it like I talk it (walk it), walk it like I talk it (yeah)\nWalk it like I talk it, walk it, walk it like I talk it", "[Intro]\nMurda on da beat so it's not nice\n\n[Chorus: Quavo]\nDreams go far like fireworks\nDreams go far like fireworks\nWe can be stars in the universe\nWe can be stars in the universe, yeah\nLet's practice our future just like when we were herts, yeah\nAnd I don't wanna lose you, don't think my heart can't hurt, yeah\nGot that spark in your eyes like fireworks\nIf you ever walk out my life, I gotta search\n\n[Post-Chorus: Quavo]\nStraight out the rain, we gon' ride out the storm (Yeah)\nGo through the pain, we gon' ride out the storm (Yeah)\nStraight out the rain, we gon' ride out the storm (Yeah)\nGo through the pain, we gon' ride out the storm (Yeah)\n\n[Refrain: Quavo]\nRide out the storm\nRide out the storm (Yeah)\nRide out the storm\nRide out the storm\n\n[Chorus: Quavo]\nDreams go far like fireworks\nDreams go far like fireworks\nWe can be stars in the universe\nWe can be stars in the universe, yeah\nLet's practice our future just like when we were herts, yeah\nAnd I don't wanna lose you, don't think my heart can't hurt, yeah\nGot that spark in your eyes like fireworks\nIf you ever walk out my life, I gotta search\n\n[Refrain: Quavo]\nRide out the storm\nRide out the storm (Yeah)\nRide out the storm\nRide out the storm", "[Lyrics from Snippet]\n\n[Intro]\nYeah yeah yeah yeah\nYeah yeah yeah yeah\nYeah yeah yeah yeah\nMigo!\nOoooh\n\n[Hook: Quavo]\nHot topic (yeah) told her pop it\nMoney in my pocket (cash)\nWe hot boxin' (hot box)\nOn the tropics, yeah we on a island (Yeah)\nYeah yeah yeah yeah\nHot topic yeah we poppin'\nHot topic yeah we poppin'\nBad bitch Mona Lisa\n1000 miles just to meet ya\nNow I want one to keep her\nIt's cheaper to leave her", "Lyrics from Snippets\n\n[Intro: Quavo]\n(Durel made the beat, I'ma rock with it)\nLet's go\n\n[Verse 1: Quavo]\nChopper, play the keys (Chopper)\nI'm not Alicia Keys (No, no)\nBut I can move them B's (Movie)\nMore water than seas (Splash, who?)\nWho got the weed? (Who? Who?)\nWe serve the fiends (Who? Who?)\nWho got the Xannys? (Who? Who?)\nWho got the Percocet, please? (Uh)\nYeah, can't sleep, I count it up (No sleep, yeah, yeah)\nI'm mad at you (Cash, yeah, yeah)\nWe talented (Talented, yeah)\nTrappin' and rappin', we balance it (Trap, yeah, yeah)\nFuck these hoes (Yeah, yeah)\nSet my goals (Goals, yeah, yeah)\nJump out the Rolls (Skkrt, yeah, yeah)\nCome back to the stove (Yeah, yeah)\nNorthside hot (Yeah, yeah)\nAt the top of the pole (Top, yeah)\nTrade out cash for gold (Trappin' out, yeah, yeah, yeah, yeah)\n\n[Chorus: Don Toliver]\nYeah, get out and ride, with who? (Who? Who?)\nI'm [?]\nI kept that dope in the freezer (Yeah)\nYou talk like I need ya (Talk, like I)\nHit that note like Anita ('Nita)\nI seen you in the back on Bieber (Yeah)\nLegs to the head, it's Fiji (Woo)\nWoke up out the bed, I need ya (Ahh)\n\n[Bridge: Quavo]\nDrop the bass (Yeah)\nShe saw the play, then she drives to stage (Yeah)\nWe trapping hard, ain't no time to lay (No time)\nAll day, pressin' microwave, uh, yeah\n\n[Verse 2: Mango Foo]\nHater back in there, we showin' up\nWe hold it down for the gang and we going up (Yeah, yeah)\nBrand new ice got me shinin', it be glowin' up\nAll white in the trap like it's snowing\nI'm countin' money from the night to the morning\nMy niggas VVs, put ice on my arm\nHe catching Zs, and we moving Ps\nNo shooters, it's demons, [?] wheezing\nShe want the team, I know she a fiend (Fiend)\nI can't go to sleep, I'm living the dream\nI'm only addicted to cash and cream (Cash)\nRun to the bag like an athlete\nI'm making plays, Odell ('Dell)\nWe juug the package for sale (For sale)\nHeard 12 on the block, I bail (Gone)\nWe ducking the pot, oh [?]\nI cannot lay up (Nah)\nMy wrist on ice and it's lit (Lit, ice, ice, ice)\nYou better pay up (Pay up)\nPut him on a plate, he get ate up (Raw)\nI kick her out when she wake up (Wake up)\nI know they mad, they hating\nShoot with a magazine, no fatal\nI cannot say what I seen (I seen)\nMy niggas they ball, Kareem (Kareem)\nThese rats stand tall, they mean\n\n[Chorus: Don Toliver]\nYeah, get out and ride, with who? (Who? Who?)\nI'm [?]\nI kept that dope in the freezer (Yeah)\nYou talk like I need ya (Talk, like I)\nHit that note like Anita ('Nita)\nI seen you in the back on Bieber (Yeah)\nLegs to the head, it's Fiji (Woo)\nWoke up out the bed, I need ya (Ahh)", "[Intro: Desiigner]\nGrrraaah\n\n[Chorus: Quavo & Desiigner]\nWrist like, Klondike, two cups, my type (Gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight)\nWrist like, Klondike, two cups, my type (Grrah, gah, gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight, grrah)\n\n[Verse 1: Quavo & Desiigner]\nI want a night with your ho, she want a night in the Rolls\nDo nothing but pipe up your ho (Gah)\nNot gonna' wife up your ho (Grrah)\nMy diamonds do fightin' the most\nWhen I'm in the trap or the coach\nPut lil' bitch on the boat, hit me when you caught the coast\nIt gon' cost you, just to stand near me\nTook some losses, now we in Japan with it (Gah)\nI put my life on it (Gah), I put my ride on it (Grrah)\nI put five on 'em, Jerry Rice, homie (Gyeah)\nYeah, you know we gon' catch 'em\nI'm in a lab mode, I'm Dexter (Gah)\nYou put your ho on a pedestal (Gah)\nYou keep on givin' her lectures (Gah)\nShe like water-cream fillin', I'ma call her Hostess (Gyeah, gyeah)\nGotta stay 'way from my enemies, can't keep 'em closer\n\n[Chorus: Quavo & Desiigner]\nWrist like, Klondike, two cups, my type (Gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight)\nWrist like, Klondike, two cups, my type (Grrah, gah, gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight, grrah)\n\n[Instrumental Break]\n\n[Chorus: Quavo & Desiigner]\nWrist like, Klondike, two cups, my type (Gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight)\nWrist like, Klondike, two cups, my type (Grrah, gah, gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight, grrah)\n\n[Verse 2: Desiigner]\nGoodnight, one night, two guns, one fight\nYou could get knifed, you could get right, get right, get right\nYoung nigga gettin' lived, he get could run up, he could get right\nTwo step, two leffing and two niggas in a goon fight, too much tonight\nOne time, huh, move right, yeah, get drunk, huh, trap life, yeah\nMoonwalk, that's that back life, confusion, could get hit\nYou could get flipped, that's that math life\nMe and Quavo, Travis, sit back of the back of the trap life\nTwo guns, MACs up, MAC right\nCoco, get rich, fuck yo, get bitch\nChopper on, get rich, steer on, steer shit\nFuck you, get rich\nFuck gettin' sleep, live nights get rich\nGoodnight, good swipe\n\n[Chorus: Quavo & Desiigner]\nWrist like, Klondike, two cups, my type (Gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight)\nWrist like, Klondike, two cups, my type (Grrah, gah, gah)\nFist fight, on ice, knockout, goodnight (Grrah)\nGoodnight, goodnight (Goodnight)\nGoodnight, goodnight (Goodnight, grrah)", "[Intro: 2 Chainz]\nUh-uh, yeah\nI do it\n2 Chainz, okay\n\n[Verse 1: 2 Chainz]\nI met a girl named Destiny, I ride big like a SUV (big)\nI refuse to be a refugee (nah), I use revenge as my recipe (uh)\nAss-whooping so separately (alright), know what I'm talkin' bout (yeah)\nYellow tape, then we chalk 'em out (chalk 'em out)\nWas gon' do a driveby, but we walkin' now (bow, bow, bow)\nEnd of the day, family's the only thing I got (I got)\nYou got a sweet tooth? Them doughnuts in the parkin' lot (skrrt)\nNighttime, we see sparks a lot (bap, bap)\nYeah, I swim with the sharks a lot\nYeah, I'm lit like a arson, arsenal out the box\nAn' I still shoot 'em orthodox, bang, bang\n\n[Chorus: Breyan Isaac & 2 Chainz]\nOne more ride, one more race (yeah)\nWe go all out 'cause ain't no breaks (yeah)\nHere we go, all the way (yeah)\nWe don't slow down 'cause ain't no breaks\nI roll on, I'ma ride or die (true)\nIt don't matter what we face (true)\nSee me goin' out, ride or die (woo, woo, woo)\nI'm the master of my fate (woo, woo, woo)\nOne more, one more night\nAnd this time, we gon' ride forever\n\n[Verse 2: Quavo]\nTakin' off and I'm ridin' on the road now (oh)\nHit the gas, no brakes, gotta go now (no)\nPut my life on the line, yeah, it's on me (on me)\nBlood rushin' through my veins, no IV (no)\nRide, switchin' lanes, you can't stop me (skrrt, skrrt)\nYou can smell the propane when you pass me (propane)\nRide for the gang because I'm the chief (gang, gang)\nHelicopter hoverin', it's high speed\nChase, drive, straight (ride)\nI'ma, race, to the cake (ride)\nFlame, on it, no chain, on me (on me)\nAll of, us, became, homies (yeah)\n\n[Chorus: Quavo]\nOne more ride (ride), one more race (race)\nWe go all out (all out), we don't play (no)\nOne more night (night), one more day (day)\nWe go all out (woo), we don't play (woo)\nI'ma go off (yeah), I'ma ride tonight (yeah)\nIt don't matter what we face (yeah)\nI'ma go of (go off), I'ma ride tonight\nI'm the master of my fate (woo)\nI'ma go off (yeah), I'ma go off (go off), I'ma go off (yeah)\nI'ma go off (yeah), I gotta go now\n\n[Outro: Quavo]\nYeah, yeah\nYeah-yeah, yeah\nYeah, yeah\nYeah-yeah, yeah", "Lyrics from Snippet 1\n\n[Verse: Post Malone & Quavo]\nI got on a ship\nBallin', ballin (yeah)\n\n[Chorus: Quavo]\nGood mornin', good mornin', good mornin' (hey)\nGood mornin', good mornin', good mornin' (good)\n\nLyrics from Snippet 2\n\n[Verse: Post Malone]\n...(Say)\nFlexin' on that bitch, she ratchet (Yeah)\n\n[Verse: Quavo]\n...(Yeah)\nI'm fly, like duck (Oh)\nYeah (Yeah, yeah)\nFly like a pretty lil' birdie", "[Chorus: Quavo]\nMoney shower, money shower, money shower (Money shower)\nI wonder \"Do she smell like flowers?\" (She smell like)\nMoney shower, money shower, money shower (Money shower)\nWhen the clouds get grey, means you 'bout to get paid, hey\n\n[Post-Chorus: Quavo]\nNow it's time to flex (Time to flex)\nBig jewels on your neck (Jewels)\nGet you a new Rolex (Rolex)\nShoot like Steph in the West\nMoney shower, money shower, money shower (Money shower)\nWhen the clouds get grey, means you 'bout to get paid, hey\n\n[Bridge: Quavo]\nYeah, shinin' off (Shinin')\nShinin', shinin' off (Shinin')\nHe's a boss (He's a-)\nEven she's a boss (She's a-)\nWe came up (We came)\nFrom takin' all the loss (All the loss)\nWe pray up (We pray up)\nAnd ice out all the crosses (All the cross)\nShinin' off (Shinin')\nShinin', shinin' off (Shinin')\nHe's a boss (He's a-)\nEven she's a boss (She's a-)\nShinin' off (Shinin')\nShinin', shinin' off (Shinin')\nHe's a boss (He's a-)\nEven she's a boss (She's a-)\n\n[Chorus: Quavo]\nMoney shower, money shower, money shower (Money shower)\nI wonder \"Do she smell like flowers?\" (She smell like)\nMoney shower, money shower, money shower (Money shower)\nWhen the clouds get grey, means you 'bout to get paid, hey\n\n[Post-Chorus: Quavo]\nNow it's time to flex (Time to flex)\nBig jewels on your neck (Jewels)\nGet you a new Rolex (Rolex)\nShoot like Steph in the West\nMoney shower, money shower, money shower (Money shower)\nWhen the clouds get grey, means you 'bout to get paid, hey\n\n[Verse 1: Chance the Rapper]\nI'll be you manager\nGive me your calendar\nWho need a [?]?\n(Give me your-) Give your camera\nI'm a big fan of you\nWe need to get you a song\nGet you some shit you could own\nFinish off that student loan\nMy baby don't want no bracelets, no facelift, no fuckin' fake tits\nNo shit off Craigslist, no shoes from Payless\nShe know I'm A list\nAnd these other rappers basic, she never plays it\nWhen she hit the playlist, she just skippin' Mr. B-list\nShe want the house with the pool\nI like her hair when it's pulled back\nI like her hair when it's cut, aye\nI like that shit when it grows back\nBaby I feel like a new dad\nPoppin' he got 'em a new bag\nI'ma show you how to do tax\nMake sure you [?] my new math\n\n[Pre-Chorus: Quavo]\nYeah, shinin' off (Shinin')\nShinin', shinin' off (Shinin')\nHe's a boss (He's a-)\nEven she's a boss (She's a-)\nWe came up (We came)\nFrom takin' all the loss (All the loss)\nWe pray up (We pray up)\nAnd ice out all the crosses (All the cross)\n\n[Chorus: Quavo]\nMoney shower, money shower, money shower (Money shower)\nI wonder \"Do she smell like flowers?\" (She smell like)\nMoney shower, money shower, money shower (Money shower)\nWhen the clouds get grey, means you 'bout to get paid, hey\n\n[Verse 2: Lil Yachty]\nThey used to laugh at my skin, oh (Oh-oh)\nHey, now I'm bossed up, throwin' twenties and ten (Twenties and ten), ayy\nI just cashed out on a Benz (Ooh, skrr, skrr)\nGettin' facials with my bitch, gotta keep my skin clean, ayy\nWash all my sins with the holy water (Okay)\nI'm a hot boy like I'm doin' [?] (Yeah)\nNiggas still [?] like they iPhone charges (What?)\nI'm gettin' these W's, like I'm [?] (Gang)\nGot a crib at the top, dawg (Yeah)\nGot a bitch poppin' narcos (Gang, gang)\nNiggas dropped at the rap game (Gang)\nNow they stuck doin' talk shows (Haha, fuckin' bitch)\nOh-oh-oh\nWhy you hatin' on me?\nI've been feelin' good, got this ice on my sleeve (Oh)\nI'm a young, rich nigga, why you hatin' on me?\n\n[Pre-Chorus: Quavo]\nYeah, shinin' off (Shinin')\nShinin', shinin' off (Shinin')\nHe's a boss (He's a-)\nEven she's a boss (She's a-)\nWe came up (We came)\nFrom takin' all the loss (All the loss)\nWe pray up (We pray up)\nAnd ice out all the crosses (All the cross)\n\n[Chorus: Quavo]\nMoney shower, money shower, money shower (Money shower)\nI wonder \"Do she smell like flowers?\" (She smell like)\nMoney shower, money shower, money shower (Money shower)\nWhen the clouds get grey, means you 'bout to get paid, hey\n\n[Outro: Quavo]\nGet paid, hey\nThe clouds get grey, means you 'bout to get paid, hey\nGet paid, hey\nThe clouds get grey, means you 'bout to get paid, hey", "[Intro]\nI woke up this morning man\nSanta done dropped off\nMoney in the tree\nThis real money y'all\n\n[Collision]\nAw yeah, my boy Santa, man\nPut money in the tree man\nY'all boys don't got no money in the tree man\nAnd I ain't have this before I went to sleep, ya feel me?\n\n[Hook]\nSanta come drop the sack off, yeah\nSanta come drop the sack off, huh\nSanta come drop the sack off, huh\nSanta come drop the sack off, huh\nReal hundreds and we ball, huh\nSanta come drop the sack off, yeah\nReal hundreds and we ball, huh\nSanta come drop the sack off, yeah\n\nThe rich way, pop a bitch uh\nHundred bands in the tree\nBitches wanna fuck with me\n\n[Hook]\nSanta come drop the sack off, yeah\nSanta come drop the sack off, huh\nSanta come drop the sack off, huh\nSanta come drop the sack off, huh\nReal hundreds and we ball, huh\nSanta come drop the sack off yeah\nReal hundreds and we ball, huh\nSanta come drop the sack off, yeah", "[Intro]\nYeah, yeah, yeah\nHalf-time (yeah, yeah, yeah)\nHalf-time (whoa, whoa, whoa, whoa)\nDun Deal on the track\nHalf-time\n\n[Chorus]\nDouble-park the Benz in the parkin' lot (skrrt, skrrt)\nYeah, she got good brain, is she smart or not? (good brain)\nTold the plug I need a whole thing (whole thing)\nBut instead he brought a half-time (half-time)\nPut them bitches on that cocaine (cocaine)\nShe gon' ride the dick the whole time (whole time)\nWe turned a halfway to whole knots (halfway)\nTurned her out, now she a whole thot (whole thot)\n\n[Verse]\nDrop my top, yeah, you know that's me (ohh-ohh)\nDon't stop at lights, we think they all green (ohh-ohh)\nWe that dream-team (team), we rock clean-clean (clean)\nRollin' eggrolls (rolls), servin' chicken wings (brr, brr)\nI heard them niggas gettin' extorted, that's what I reported (yeah)\nThat's your bitch, that's your ho? She somewhere escorting (damn)\nShe 'bout to pull up shortly (pull up), she 'bout to pull up on me (skrrt)\nYou are outta [?] Rollies (Rollies), you know you cannot control her (ayy)\nShe know you cannot control her (cannot control her, yeah)\nDraco don't fit in the holster (no, no, no)\nFuck-nigga pretendin' it's over (no, ohh, ohh)\nPut a lil' bitch on the coca, then sip pack of cola (yeah, coca)\n\n[Chorus]\nDouble-park the Benz in the parkin' lot (skrrt, skrrt)\nYeah, she got good brain, is she smart or not? (good brain)\nTold the plug I need a whole thing (whole thing)\nBut instead he brought a half-time (half-time)\nPut them bitches on that cocaine (cocaine)\nShe gon' ride the dick the whole time (whole time)\nWe turned a halfway to whole knots (halfway)\nTurned her out, now she a whole thot (whole thot)", "[Intro: Quavo]\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\nDrugs, drugs\n\n[Chorus: Quavo]\nI put a mill in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax (Molly)\nI feel like I land on the planet (Planet)\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Desginer)\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Designer)\nI put a mill in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax (Molly)\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Designer)\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Designer)\n\n[Verse 1: Quavo]\nI put a four in a liter (I did)\nI used to trap out a Regal (I did)\nMy mom used to trap off a beeper (My mom)\nI look at the molly and eat them (My molly)\nI am all out of narcotics (Narcotics)\nAll of my bitches exotic (Exotic)\nYou niggas drinking on Watson (On Watson)\nI keep the chopper for plotting (Rah)\nI keep the white like cotton (White)\nLook at your pot, it's rotten (Rotten)\nWe're never going in a drought (No)\nJunkies coming in and out (Yo)\nI used to run in your house (Yo)\nWrapping up you and your spouse (Your spouse)\nI used to be sleep on the couch (The couch)\nAnd now I cash out, no amount (Ay)\nI pop a Perc and then I'm out (Perc)\nI spent two million on a house (two mill)\nRun the money up like a route (Run it up)\nSober niggas out of style (Sober)\nCobra niggas get the power (Cobra)\nFifty thousand for the style (fifty thousand)\nI'm in the Coupe with no miles\nBalling like Darius Miles\nIf you own the drug I’m on, you need to pull up right now (Skrt, skrt, skrrrt, woop)\nI pop it off, feel like a ghost (I pop it off)\nMy niggas doing the most (My niggas doing)\nI'm never gon' set up my folks (Im never gon')\nI got more sand than the coast\n\n[Chorus: Quavo]\nI put a mill in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax (Molly)\nI feel like I land on the planet (Planet)\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Desginer)\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Designer)\nI put a mill in the attic\nI fell in love with the drugs, I think I'm a addict\nPercocet, molly, and Xanax (Molly)\nI feel like I land on the planet\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Designer)\nI'm on Designer drugs, on Designer drugs, on Designer drugs (Designer)", "Lyrics from Snippets\n\n[Verse: Quavo]\nThe Patek all exotic (Patek)\nI put my chains on twice (Yeah, yeah)\nI put my drank on ice (Drank)\nGo up like the doors, and we all got wings (Brrr)\nPrices on the dope went up, we all fiends (Dope)\n12 came, we ran [?] felonies (12)\nLoading up the PJ, we overseas (Gone)\n\n[Chorus: Quavo & Future]\nBitch, I brought the curve, bitch, we straight out the dirt (Dirt, dirt)\nGang come first, make it work-work-work (Work, work, work)\nEmpty out the clip, make 'em jump out the shirt (Shooter shirt)\nDrop top, I'm goin' then I jump out the vert\n(Wheezy outta here)", "[Intro]\nThat boy Cass\nMigo got the blue (got the blue)\nTrap house jumpin', yeah, the trap house jumpin'\nGot the trap jumpin' like kangaroo (trap house jumpin')\n\n[Chorus]\nKangaroo\nTrap house jumpin', yeah, the trap house jumpin' (trap)\nKangaroo\nTrap house jumpin', yeah, the trap house jumpin'\nOoh, kangaroo\nTrap house jumpin', yeah, the trap house jumpin' (trap)\nOoh, kangaroo\nJumpin', jumpin', jumpin'\nTrap house jumpin' (go, kangaroo!)\n\n[Verse]\nTrap so hot, when you pull up\nGotta tie your shoes in a double knot (tie your shoes, tie 'em)\nTrap so hot, gotta go an' stash your dope\n'Cause you don't know if they're gonna come or not (dope, dope)\nWhen I say kangaroo\nGot big-boy hundos stashed in a Louie pot (hundo)\nNo longer got dope in my sock\nI got the dope in my crotch (ugh)\nI pity the fool if you try me\n'Cause I'm walkin' 'round lookin' like I'm Mr. T\n'Cause I'm lookin' like an athlete\nIs it 'cause the bando jumpin' like a trampoline? (bando)\nI was broke-anese on my knees (damn)\nMy ma said, \"Go get that payola, please\" (momma)\nI looked in my momma eyes an' I realised (realised)\nI had to chase millions\n\n[Chorus]\nKangaroo (kangaroo)\nTrap house jumpin', yeah, the trap house jumpin' (trap)\nKangaroo (kangaroo)\nTrap house jumpin', yeah, the trap house jumpin'\nOoh, kangaroo (kangaroo)\nTrap house jumpin', yeah, the trap house jumpin' (trap)\nOoh, kangaroo (kangaroo)\nJumpin', jumpin', jumpin'\nTrap house jumpin' (go, kangaroo!)", "[Chorus]\nOne more ride (ride), one more race (yeah)\nWe go all out, we don't play (woo)\nOne more fight, one more take (ayy)\nWe won't slow down, ain't no breaks (zoom, zoom)\nI'ma go off, out my way (go off)\nIt don't matter what we face (no)\nI'ma go off, out my way (go off)\nI'm the master of my fate (yeah)\nI'ma go off (yeah), I'ma go off (yeah-yeah)\nHere we go now\n\n[Verse]\nTakin' off and I'm landin' on the down move (zoom)\nTo the group, hell nah, I ain't got no rooms (zoom)\nWhen I ride, ride 'round, yeah, I gotta swerve (skrrt)\nRace me to the finish line, is you nervous?\nPurpose, work for, earn it, yeah\nI earned it, designer shoes on the pedal when I curve it (yeah)\nFly by like a birdie, fly by like [?] (skrrt)\nThank you for your service (ayy), I hope what I did was worth it\n\n[Chorus]\nOne more ride (ride), one more race (yeah)\nWe go all out, we don't play (woo)\nOne more fight, one more take (ayy)\nWe won't slow down, ain't no breaks (zoom, zoom)\nI'ma go off, out my way (go off)\nIt don't matter what we face (no)\nI'ma go off, out my way (go off)\nI'm the master of my fate (yeah)\nI'ma go off (yeah), I'ma go off (yeah-yeah)\nHere we go now\n\n[Instrumental Break]\n\n[Chorus]\nOne more ride (ride), one more race (yeah)\nWe go all out, we don't play (woo)\nOne more fight, one more take (ayy)\nWe won't slow down, ain't no breaks (zoom, zoom)\nI'ma go off, out my way (go off)\nIt don't matter what we face (no)\nI'ma go off, out my way (go off)\nI'm the master of my fate (yeah)\nI'ma go off (yeah), I'ma go off (yeah-yeah)\nHere we go now", "[Intro]\nWe got London on the track\n\n[Chorus]\nDrug dealer (Ayy), my nigga, my nigga (Yup)\nDrug dealer (Woah), my nigga, my nigga (Yup)\nDrug dealer (Ayy), my nigga, my nigga (Drug)\nDrug dealer (Yup), my nigga, my nigga (Woah)\nDrug dealer (Ayy), my nigga, my nigga (Drug)\nDrug dealer (Ayy), my nigga, my nigga (Yup)\nDrug dealer (Woah), my nigga, my nigga (Ayy)\nDrug dealer (Yup), my nigga, my nigga (Drug)\n\n[Verse]\nWalk in the trap with the door wide open\nWhen I walk through, bet I got a shooter on the door\nBut you better know what you came here for\nWhen it's hot outside, man, it inside snow\nPot so big, gotta roll with a boat\nThis the life I live, shoulda played with the [?]\nStack it up one time, give it back to my folks\nYou a real drug dealer, then you been here before\nWay your right hand move, what your left hand do?\nCan you really, really tell if they a friend or a foe?\nDon't [?] like he playin' with his nose\nMy homies fall out, man, you know how it goes\nDrug dealer (Ayy), my nigga, my nigga (Yup)\nDrug dealer (Woah), my nigga, my nigga (Yup)\nDrug dealer go pack a pistol (Pow, pow)\nDrug dealer pull up in Fiestas (Skrrt)\nYou gotta keep a key like the ignition\nYou gotta handle your business\nGet you a plug on a mission (Pablo)\nGet you a ho that's gon' listen (Ho)\nDon't let 'em know how you gettin' it (No)\nRule number one, no snitchin' (Ayy)\n\n[Chorus]\nDrug dealer (Ayy), my nigga, my nigga (Yup)\nDrug dealer (Woah), my nigga, my nigga (Yup)\nDrug dealer (Ayy), my nigga, my nigga (Drug)\nDrug dealer (Yup), my nigga, my nigga (Woah)\nDrug dealer (Ayy), my nigga, my nigga (Drug)\nDrug dealer (Ayy), my nigga, my nigga (Yup)\nDrug dealer (Woah), my nigga, my nigga (Ayy)\nDrug dealer (Yup), my nigga, my nigga (Drug)\n\n[Open Verse]\n\n[Chorus]\nDrug dealer (Ayy), my nigga, my nigga (Yup)\nDrug dealer (Woah), my nigga, my nigga (Yup)\nDrug dealer (Ayy), my nigga, my nigga (Drug)\nDrug dealer (Yup), my nigga, my nigga (Woah)\nDrug dealer (Ayy), my nigga, my nigga (Drug)\nDrug dealer (Ayy), my nigga, my nigga (Yup)\nDrug dealer (Woah), my nigga, my nigga (Ayy)\nDrug dealer (Yup), my nigga, my nigga (Drug)", "[Intro: Jeremih]\nUh\nMally Mall\nAww-ww\nYeah-ahh, ooh\n\n[Verse 1: Quavo & Jeremih]\nPull up on me, pull up on me (skrrt, on me)\nDrop my top (skrrt, skrrt), pull up on Es (skrrt, skrrt)\nYou prolly can't tell my heart on E (yeah, my heart on E)\nYou prolly won’t tell me (tell me) that you really need me (really need me)\nHold my drank (drank), hold my liter (uhh, liter)\nI'ma beat it, I'ma beat it like speakers (uhh, beat it)\nNo fist fights on late nights\nSpotlights, what you told me last night?\n\n[Chorus: Quavo & Jeremih]\nLast night (uhh), last night (yeahh)\nLast night (uhh), last night (yeahh, last night)\nLast night, last night, last night (yeahh)\nLast night, ohh, last night, last night, last night (yeahh)\nLast night, ohh\nLast night, last night, last night, last night\nLast night, last night, that what you told me\nThis what you told me, yeah, yeah\n\n[Verse 2: Jeremih]\nThis show, ain’t even tryna-tryna miss your show\n[?], know where you stay\nWhen the curtains low, you still safe\nWe won't low on the late night\nI ain't tryna move where there's plenty people\n'Cause you know we moved it last night\nTonight, you know I'm tryna make the sequel, yeah\nWe gon' [?] is you in it\nWe gon' [?] round a minute\nNo one front me, though, I’m a menace, yeah\nGo for this, open your legs, yeah, I’m your dentist\nWe gon' [?] the minutes\nNo, no, you remember, no, last night, uhh\nWake up in the mornin’, good mornin' America\nI don't know, no-no, no-no 'bout no area\nPlayin’ games with you, I tell the truth, just deal with ya\nI don't [?]\n\n[Chorus: Quavo & Jeremih]\nLast night (uhh, yeah), last night (last night)\nLast night (uhh), last night (last night, last night)\nLast night, last night, last night\nLast night, ohh, last night, last night, last night\nLast night, ohh\nLast night, last night, last night, last night\nLast night, last night, that what you told me\nThis what you told me, yeah, yeah\nLast night, last night, last night, last night\nLast night, last night, that what you told me\nThis what you told me, yeah, yeah\n\n[Instrumental Break]\n\n[Outro: Quavo]\nThis what you told me, yeah, yeah\nLast night, last night, last night, last night\nLast night, last night, that what you told me\nThis what you told me, yeah, yeah", "[Intro: Quavo]\nMoney comin' in\nMoney comin' in\nMoney comin' in\nOhh\n\n[Chorus: Quavo & Berner]\nRidin' round with the burner\nI'm with Berner (aye)\nRidin' round with the bags on me\n'Bout to serve 'em (serve)\nGot all these blue Benjamins\nYeah, I earn 'em (cash)\nYeah, I earn 'em (cash, racks)\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\n(Serve, cash, racks)\n(Serve, cash, racks)\n(Money comin' in)\n(Serve, serve, cash, racks)\n(Money comin' in)\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\n\n[Verse: Quavo]\nMoney keep comin' in (cash)\nPut it in mattress (the matress)\nNutted and piped up (pipe up)\nFuckin' on actress' (some actress)\nI'm the new bachelor (woah)\nYeah, that's how we actin' now (we actin')\nShe want some Cookie, Lean and Molly\nNow that bitch passin' out (she passin')\nI got that flame with me (flame)\nLike I stay in the dragon house (whoosh)\n'Member the bando (bando)\nTrappin' that gas out the boarded house (gas)\nI might supply them ounces (supply)\nBeat the pot, Ronda Rousey (beat it)\nFeel like I'm on the mountain\nI'm a rich nigga\nNo, they can't doubt me\nNo, no, no\n\n[Chorus: Quavo & Berner]\nRidin' round with the burner\nI'm with Berner (aye)\nRidin' round with the bags on me\n'Bout to serve 'em (serve)\nGot all these blue Benjamins\nYeah, I earn 'em (cash)\nYeah, I earn 'em (cash, racks)\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\n(Serve, cash, racks)\n(Serve, cash, racks)\n(Money comin' in)\n(Serve, serve, cash, racks)\n(Money comin' in)\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\nThat money keep on comin' in and comin' in and comin'\n(Money comin' in)\n\n[Outro: Quavo]\nYeah, yeah\nOhhh, ohhh\nOooh\nMoney' comin' in\nOooh\nMoney comin' in", "[Intro O.T Genasis]\nGo get the money, go get the money\nThis the remix and I'm lit\nHold the line 'cause my hits\nDamn my plug Dwight Howard 'cause I'm waiting for the bricks\n[Verse 1 Remy Ma]\nI'm on the west with O.T\nI just flew in from the east\nOn that Bobby Shmurda shit, just caught a body last week\nSince they wouldn't let me drink\nWhen I get a post release\nI'mma buy so many bottles they gon' think I'm Big Meech\nWhen I catch that bird bitch I'mma put it to her beak\nNo I'mma put it to her brows, now they really on fleek\nSee I grew up in the 'jects\nHad to fight for my respect\nElevator wasn't workin' so we took the pissy steps\nI went years without no sex\nSo you know that pussy wet\nAnd you ain't a real hustler if you can't bust a check, bitch\n[Chorus O.T Genasis & Remy Ma]\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\n[Verse 2 Quavo]\nGotta push it to the limit\nPush it like the Salt N Pepa\nPut the bitch on the perky\nThe coco make her feel better\nShe got her groove back stellar\nYou ask about I'mma sell her\nI got the white like vanilla\nCall that Thrilla in Manila\nPush it, push it, push it\nAsk 'bout the back we took it\nGet it from the fuckin' rookie\nAnd I'm sellin' whole cookie\nGot your fuckin' main bitch cookin', cookin', cookin', cookin'\nYou know, yea we sellin' coca\nAnd we got all the yola\n[Chorus O.T Genasis]\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nPush it, push it\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money\nGo get the money, go get the money", "[Transcription in progress. Please do not edit.]\n\n[Intro: Quavo, 21 Savage]\n21, 21\nMan, no killing\nWoo\nElevation, wild life\nElevation, wild life\n21, let's go\n\n[Chorus: Quavo]\nGot too much dope in my hand\nI bet I don't know what to do with it (do with it)\nThen I talk to my dawgs\nI'm in the jungle like I'm Dr. Doolittle\nWhatchu gon' do in the trap (do)\nWhatchu gon' do in the trap (do)\nWhatchu gon' do (huh)\nHop out the bed and I go hit up the block (go)\nI got way too much dope, I got dope on my shoe\n\n[Verse: 21 Savage]\nAll I ever wanted was some motherfucking paper\nTen burger bar, trap house through the cages\nChoppers everywhere, we don't watch no cable\nSince I got rubber bands, started shitting on my haters (shit)\n21 Savage, I do count money (21, 21)\nWalk up on a nigga, drain him with the tommy\nPulled up on the light, like a motherfucking zombie\nYoung nigga thirteen, and he already catching bodies\nTwelve years old when I first hit the trap\nAunt, put me on fifty slap on my lap\nWhatchu gon' do, turn yourself into crack\nWhatchu gon' do, turn this zip into a stack\nNiggas tried to run, hit his ass with the mack\nWhole bunch of killas and they screaming out, \"Blah\" (21)\nThe bitch stole crystals, I just stole a nigga's stack\n21 Gang, we'll show you how to trap\n\n[Chorus: Quavo]\nGot too much dope in my hand\nI bet I don't know what to do with it (do with it)\nThen I talk to my dawgs\nI'm in the jungle like I'm Dr. Doolittle\nWhatchu gon' do in the trap (do)\nWhatchu gon' do in the trap (do)\nWhatchu gon' do (huh)\nHop out the bed and I go hit up the block (go)\nI got way too much dope, I got dope on my shoe", "[Verse 1: OG Maco & Quavo]\n[?] and shit the same colour\nAnd I ride ride 'round with my brothers\nMigo gang, OG [?] came with the [?]\nYou don't know I got a broken wrist\nWrist hush hush hush hush hush\n[?]\nO. G. G", "[Hook: OG Maco]\nSomebody in this motherfucker gotta feel me\nSomebody in this motherfucker gotta feel me\nSomebody in this motherfucker gotta feel me\nSomebody in this motherfucker gotta feel me\n\n[Verse 1: OG Maco]\nYou're looking at the man of the hour\nWhile I got this cable\nI rather wear Balmain while I don't have no [?]\nI talking real strong bitch you may need chase off\nGo chase your dreams cause I almost got slept on\nMurdering everything they like man got this death on\nSave lord while I'm sinning I'm hell hold\nSeventy is forever, live life till I'm dead bones\nOriginality days, greatness got that fake shit in the lake [?]\nYeah!\n\n[Hook: OG Maco & Quavo]\nSomebody in this motherfucker gotta feel me\nSomebody in this motherfucker gotta feel me\nMigo! Maco!\nSomebody in this motherfucker gotta feel me\nSomebody in this motherfucker gotta feel me\n\n[Verse 2: Quavo]\nQuavo!\nWhen I was broke they was feeling me\nI'm rich now I'm having enemies\nI own money never innocence\nIf you get money you feel me\nHaving nightmares about prison, then I woke up in the bentley\nHaving nightmares about business, then I woke up indepedent\nQuavo and OG Maco tag team Capone and Rambo\nWe came from hancos from the popo now we handcuff ferragamo\nFirst time in Russia I got 19 shows Bitch you guessin thats the assin hole\nWe came in the game and blow up of our clothes\nWhen I ever started rapping I'm kicking doors\nMigos and Maco in this motherfucker\n\n[Hook: OG Maco]\nSomebody in this motherfucker gotta feel me\nSomebody in this motherfucker gotta feel me", "Oou, like a strap, let that thang pop\n[?] Like the drip, like the raindrop\nChains on the streets, yeah we [?]\nWatch me wipe the floor like a, mop\nBlood clot, on the scope, it's a Longshot\nBlood clot, it's a fire on the rooftop\nBlood clots, mugshots, we don't name drop\nBlood clots, dreadlocks, it's a culture shock", "[Intro: Quavo]\nLivin' my life like Osama\nBitches they suckin' and fuckin' for Hondas\nLivin my life like Osama\nBitches they suckin' and fuckin' for Hondas\nLivin' my life like Osama\nBitches they suckin' and fuckin' for Hondas\nMet another plug flew straight to Hong Kong then drop the work off in Tijuana (Hong Kong)\n\n[Chorus: Quavo]\nFeelin' like Al Capone with my Tommy Gun (Al Capone)\nI’m feelin' like I’m Osama Bin Laden on the run (Osama Bin Laden)\nI’m feelin' like I might meet my plug out in Hong Kong (out in Hong Kong)\n(Brr brr brrrrr, fuck) Feds done tapped my phone (Fuck 12)\nFeelin' like Al Capone with my Tommy Gun (Woo)\nI’m feelin' like I’m Osama Bin Laden on the run (Osama Bin Laden)\nI’m feelin' like I might meet my plug out in Hong Kong\n(Brr brr brrrrr, fuck) Feds done tapped my phone\n\n[Verse 1: Quavo]\nLivin' my life like Osama\nBitches they suckin' and fuckin' for Hondas\nMet another plug flew straight to Hong Kong then drop the work off in Tijuana (Hong Kong)\nThis is my life and I do what I wanna I’m trappin' and cappin' on corners\nFuck nigga you settin' up shop in the wrong side of town\nI’mma give you a warning\nAK-47 karat lingo\nShoot a fuck nigga like a free throw\nFinessin' the plug for kilos\n(Who that bangin' on the door?)\nI don’t even know cause the nigga put his finger on the peephole\nI ain't even answer the door\nBoom, boom, boom keep bangin' on the door\nBow, bow, bow, gloww, get away from the door (get away)\n\n[Chorus: Quavo]\nFeelin' like Al Capone with my Tommy Gun (Al Capone)\nI’m feelin' like I’m Osama Bin Laden on the run (Osama Bin Laden)\nI’m feelin' like I might meet my plug out in Hong Kong (out in Hong Kong)\n(Brr brr brrrrr, fuck) Feds done tapped my phone (Fuck 12)\nFeelin' like Al Capone with my Tommy Gun (Woo)\nI’m feelin' like I’m Osama Bin Laden on the run (Osama Bin Laden)\nI’m feelin' like I might meet my plug out in Hong Kong\n(Brr brr brrrrr, fuck) Feds done tapped my phone\n\n[Verse 2: Drum Smith]\nSnitch niggas givin' testimonies\nDru smith and I’m flexin' on ‘em\nWhip the deuce and get extras from it\nI’m a legend homie dat my fleximony\nLouis down to my shoe string\nY’all broke niggas too lame\nY’all nigga like set trippin'\nY’all switchin' colors like a moon ring\nAll the homie da street got em\nChoosin' like they got our problem\nTold my bitch and she take a brick\nShe 'bout to steal them all she gon' die abound\nDru Smith got a lot of goon\nPenthouse with a lot of room\nSnitch nigga, you love singin'\nYo pussy ass need auto tune\nI’m Dru Smith and it’s flex season\nI’m seein' snow on a block in June\nYou ain't neva met dang-dang\nI swear to God your baby momma knew 'em\nI don’t give her my main line\nCall solo, give my apology to him\nFeelin' just like big worm\nMore clean than the laundry room!\nFlex up\n\n[Chorus: Quavo]\nFeelin' like Al Capone with my Tommy Gun (Al Capone)\nI’m feelin' like I’m Osama Bin Laden on the run (Osama Bin Laden)\nI’m feelin' like I might meet my plug out in Hong Kong (out in Hong Kong)\n(Brr brr brrrrr, fuck) Feds done tapped my phone (Fuck 12)\nFeelin' like Al Capone with my Tommy Gun (Woo)\nI’m feelin' like I’m Osama Bin Laden on the run (Osama Bin Laden)\nI’m feelin' like I might meet my plug out in Hong Kong\n(Brr brr brrrrr, fuck) Feds done tapped my phone", "[Intro]\nMigo!\nCinco!\nQC!\n\n[Chorus]\nMigo and Cinco need 'bout 50 PT\nThe way she eat that molly she think it linguine\nAll these cameras on we in the spotlight\nMost of these niggas they'll do anything for the spotlight\nMost of these niggas they'll do anything for the spotlight\nThese niggas would take yo' life for the spotlight\nGotta keep me a pocket rocket with the red light\nMy momma told me they will turn on you for the spotlight\n\n[Verse]\nMy momma told me they will turn on me\nIf I didn't listen it was all on me\nSome of the niggas I didn't, some of the niggas I did\nIf you niggas didn't wanna see you win they ain't yo' friend\nNot at all\nGrowing up had to fight these niggas like Steven Seagal\nYou play with me now and I'mma shoot yo' head off\nCinco gotta make the call\nJust for the spotlight I know niggas would knock you off\nQuit lookin' at my life, get yo' mind right\nVersace my eyesight, I'm living the limelight\nNot you\nIs a nigga mad 'cause the spotlight not on you?\nI'm killin' the game 'cause momma she told me to\n\n[Hook]\nMigo and Cinco need 'bout 50 PT\nThe way she eat that molly she think it linguine\nAll these cameras on we in the spotlight\nMost of these niggas they'll do anything for the spotlight\nMost of these niggas they'll do anything for the spotlight\nThese niggas would take yo' life for the spotlight\nGotta keep me a pocket rocket with the red light\nMy momma told me they will turn on you for the spotlight", "[Intro: Quavo]\nWe been had the streets on lock for a long time man I just want to thank God for blessin' a young nigga for this shit. We in here\nMigo!", "[Intro: Quavo & *Takeoff*]\n*Durel pulled up*\nYeah\nKnow what I'm talking about\nKnow what I mean\n*Durel made the beat I'ma rob with*\nNawfside shit, Nawfside\nBackdoor action, you dig what I'm saying\n\n[Chorus]\nRoll up, I'm smoking on Gary (Gary)\nMy girlfriend acting too petty\nThese diamonds hit different, baguettis\nIn the field I carry machete\nI dress it up make it look sexy\nI fuck it up make it look messy\nI beat it up better not text me\nI pull up better not press me\n\n[Verse 1]\nI'm bopping a boo call her betty\nKeep an eye open no fetty\nDropping the dope on the jetty\nYes sir, we got them, is ready\nThe pot it come with no handles\nThe water is wetter than Panama\nDouble C, Chanel, no channel\nThirty thousand, that's a minimum\nShe can get critical\n[?]\nI took myself out the picture\nAnd niggas look bitter\nThen I pull up off the dribble\nSplash your niggas, I killed them\nI'm tapping into niggas mentals\nDon't get in my way I'ma flip them\n\n[Chorus]\nRoll up, I'm smoking on Gary (Gary)\nMy girlfriend acting too petty\nThese diamonds hit different, baguettis\nIn the field I carry machete\nI dress it up make it look sexy\nI fuck it up make it look messy\nI beat it up better not text me\nI pull up better not press me", "Lyrics from Snippet\n\n[Intro: Takeoff]\n(Durel made the beat, I'ma rock with it)\n\n[Verse: Quavo]\nWhat's your prices (Yeah)\nYou say you [?] once, got excited (Yeah)\nI might drop a rock and make her wifey (Yeah, woo)\nIt's something to remember, like the tightness (Yeah, tight)\nTold her to play with my stick\nOn the dick, she bust the splits (Stick)\nTold her play with my stick, she get lit, on top of [?] (X)\nTold her let's go like, woo hoo, on to the next\nLet's talk about flex, drop-top broke my neck\nDon't make no sense, she don't [?] she don't make her rent\nCount it up in the pent, like a trophy, mind her business\nI like how she get me, she well-spoken and don't say shit (Don't say)\nI'm in the kitchen\nI gave her the spatula and she started whipping (Whipping, yeah)\nI drop my top, ran far from the cops (Yeah)\nDon't open that box, open that box we hot\nYeah, RIP Pop, I'ma [?] all on the block, yeah\nGrippin' the Glock, put a bird if [?] (Yeah)\n\n[Chorus]\nHave you ever seen these wings, I'm too fly with the wings\nHave you ever lived this dream, I'ma live through my dreams\nHave you ever drank it raw, I'm talkin' bout' codiene\nLivin' that gangster law, [?] ever gon' ride with the team (Law)\nHave you ever seen these wings, I'm too fly with the wings\nHave you ever lived this dream, I'ma live through my dreams\nHave you ever drank it raw, I'm talkin' bout' codiene\nLivin' that gangster law, [?] ever gon' ride with the team (Law)", "[Lyrics from Snippet]\n\n[Verse: Rich The Kid, Quavo]\nI was ridin' round Miami with no roof (On my own)\nBad one, pull up facing in a Coupé (Bad one)\nFifty thousand, I'ma flex another [?] (Fifty)\nI'm so bad, Michael Jackson owe me money\nI'm so bad, Ali couldn't touch this (Ali)", "[Outro: Quavo]\nI know y'all just heard the tape. Free my nigga offset that's the next thing you gon' see offset coming home. We in here man\nGone", "[Intro]\n[?] Domingo [?]\nDomingo!\nWhere the gang at... You know where the gang at, nigga\nOkay, ouu, okay, ouu, okay\n\n[Verse 1: Quavo]\nWatch out little bitch\nOr you get hit\nFuck with a stick\nI'm with this shit\nLook at my chips *laughs*\n[?]\nBad bitches going crazy\nYoung nigga drop top\nPulled out the 380\nMake the fucking cap pop", "[Verse 1: Quavo]\nI'm having money on money\nI'm getting money on a Monday\nGoing up on a Tuesday\nCall me Young Quavo Makonnen\nCall the squad and they coming\nNow you can't take nothing from me\nNow you can't take nothing from me", "[Chorus]\nIt's who birthday, yours (Go, go)\nFeels like you driving Rolls Royce (Skkr, skkr)\nCan we keep peace indoors (Peace)\n'Cause I bought the most expensive piece up out the store\nIt's the birthday bae, it's the birthday (It's your birthday)\nWe gon' pop this party off\nAnd you gon' have to ball (Pop it, pop it)\nAnd we gon' chase the stars\n(Chase it, chase it, chase the stars, yeah)\nIt's who birthday, yours (It's the birthday)\nFeels like you driving Rolls Royce (Woo, woo, woo, woo)\nAnd you gon' have to ball\n\n[Verse 1]\nHashtag move, put the flames on the comments\n(Yeah, yeah, yeah, yeah)\nTonight's a vibe and we living rare moments\n(Yeah, yeah, yeah, yeah, yeah)\nDo the Bobby Brown (Do it)\nWatch how we get down (Yeah)\nIce in all my watches (Ice)\nLiving life on yachties (Boat)\nShirt made, Versace ('Sace)\nShe got nice bodies (Body)\nHad to take her shopping, cause I got nice wallets (Yeah)\nLife of the party, (Yeah) price of the party (Yeah)\nTake em' to the future, (Yeah) make em' feel like Marty (Yeah)\nPoppin' champagne bottles, (Yeah) we just got it started (Yeah)\nTreat you like a trophy, that's a Vince Lombardi (Hey)\n\n[Chorus]\nIt's who birthday, yours (Go, go)\nFeels like you driving Rolls Royce (Skkr, skkr)\nCan we keep peace indoors (Peace)\n'Cause I bought the most expensive piece up out the store\nIt's the birthday bae, it's the birthday (It's your birthday)\nWe gon' pop this party off\nAnd you gon' have to ball (Pop it, pop it)\nAnd we gon' chase the stars\n(Chase it, chase it, chase the stars, yeah)\nIt's who birthday, yours\n\n[Open Verse]\n\n[Chorus]\nIt's who birthday, yours\nFeels like you driving Rolls Royce\nCan we keep peace indoors\n'Cause I bought the most expensive piece up out the store\nIt's the birthday bae, it's the birthday\nWe gon' pop this party off\nAnd you gon' have to ball\nAnd we gon' chase the stars\nIt's who birthday, yours", "[Chorus]\nTruck load bag in reverse\nShe gon' get this work\nWe gon' eat dessert\nIced out piece on shirts\nTruck load bag in reverse\nShe gon' get this work\nWe gon' eat dessert\nIced out piece on shirts", "Lyrics from Snippet\n\n[Intro: Quavo]\n(Buddah, bless this beat)\nOh, oh, ah\nYou know what I'm talkin' bout\nI did the keys, I did the keys\nI swear to god, I did the keys\nAwe yeah, ah\n\n[Chorus: Quavo]\nI must stay focused, on these big bankrolls\nI can't, trust these hoes, no, no, no, no\nI must stay focused, on these big bankrolls\nI can't, trust these hoes (No no, no no)\n\n[Verse 1: Quavo]\nI cannot trust these leeches (Leech)\nI cannot trust these streets (Street)\nI cannot trust these bitches, I gotta trust on me\nI cannot tell my business, stretchin' out racks, on fitness\nYeah, I swear we goats (Goats), we need to go down and [?]\nI put the gang on my shoulders and carry on (Gang, gang)\nI put the strap on my shoulder and bring it home (Bang, bang)\nHad to stay low, fans keep singing my songs (Lowkey)\nI swear to God if I see em' in person I'm doin' em' wrong (Rah)\nI gotta stay focused, they pull out that camera, take pics (Flash)\nEvery time I'm closing my eyes, [?]\nShe don't speak or don't talk, she shy, she need [?]\nYou come in, [?]\nYeah, yeah, my soul [?]\nYeah, yeah, I told em' [?] (Yessir)\nYeah, yeah, gotta stay focused\nYeah, yeah, we don't fold bitch\n\n[Chorus: Quavo & Young Thug]\nI must stay focused, (Ahh) on these big bankrolls\nI can't, (Woo) trust these hoes, no, no, no,  no (Trust these hoes)\nI must stay focused, on these big bankrolls\nI can't, trust these hoes (No no, no no)\n\n[Verse 2: Young Thug]\nYeah\n[?] too big, it can't fit in [?]\n[?] on friday\nI been trippin' hard on hoes, this is my [?]\nWe can take the top off the benz, baby, take the top off the benz\nIf I pull up with your friend, baby, you gotta swallow my kids\nIf I'm a dog, I'm a pimp, baby, having fantasy love with a rich lady\nI put a [?] (Uh, uh, uh)\nI stop [?] fuck on you, baby [?]\nAnd I wanna caress you, [?] you, just add you to my [?]\nRose gold [?] gold rose every time\nRose gold [?]\nMake yo pussy slurp, yeah yeah yeah\n[?]", "[Intro]\nMustard on the beat, hoe\n\n[Verse 1: Quavo]\nShe fuck with a baller\nShe gave me her number, She want me to call her\nAnd she know I'm a player\nHop on my plane, We can land it in Wales"]}